{"101487":165245,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson made the worst movie in star wars history hands down. the opening was so promising. But after the Superman flight of Leia (which would of been a good death for her since actress has passed away) the wasted characters they kill off for no reason like Admiral Ackbar\\, Phasma\\, Snoke\\, and the biggest one Luke who died of exhaustion aparently\\, Even though this movie clearly shows Rey and Kylo doing the force Illusion like him with no effort. Then whol Finn and Rose sublpot was both boring and felt like it belonged in another movie like fifth element. i absolutelly hated the weaponizing of Lightspeed they did in this movie. sure its a cool shot. But now there is the question of why we never seen this in any of the other movies. Like in the clone wars the CIS droid army could of won the war. just by sending one ship through lightspeed to take out a whole fleet of clones. This Lightspeed weaponizing makes no sense. why even have a fleet with capital ships when all they have to do to destroy them is send a auto piloted ship through hyperspace at them. if anything is to judge they could send even fighter at star destroyers and kill them in one blow. It is the laziest and Lore destroying scene ever in star wars. i hope that they explain this was some prototype weapon that they had on the cruiser to explain this and that they cant build another cause the data was destroyed with the ship. cause otherwise star wars films in future are gonna not be about space battles at all cause all people are gonna say is why even fight to space battle send astroid through lightspeed at them. Luke dying was just so stupid\\, the most powerful force user in the galaxy and he cant do something his padawan and rey can do. also since when can force powers kill their weilder it makes no sense. JJ please fix this keep phasma and luke alive. you dont even have to explain it well. i will accept it regardless. and find some way to remove this OP Lightspeed weapon from ever being used in a star wars movie like just say they updated the sheilds so now that trick wont work. cause it was dumb. this movie is a 4\/10","true":true}