{"101487":166694,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Seriously\\, what did I watch?  If \\\"The Force Awakens\\\" was a rehash of \\\"A New Hope\\\" then \\\"The Last Jedi\\\" was \\\"The Empire Strikes Back\\\" in reverse.  Oh\\, and it had some elements of \\\"Return of the Jedi\\\" and part of the plot seemed like it was based on the episode \\\"33\\\" of \\\"Battlestar Galactica\\\" where the Cylons are able to track the fleet after every faster than light jump.  While some risks were taken\\, Disney keeps up the track record of rehashing Lucas' original trilogy.\\n\tMuch like ESB the film opens with the rebels being forced from their base by Imperial\\, I mean First Order\\, forces.  After a battle\\, they are able to evade the fleet of star destroyers only to be followed by them after they come out of hyperspace.  The fallout of the battle leaves Leia incapacitated.  Vice Admiral Holdo (Laura Dern) takes command of the remaining fleet.  And much like ESB this separates the core protagonists.  Upon the advice of Maz Kanata\\, who might as well be called Maz Exposition\\, Finn and new character Rose are dispatched to Planet Las Vegas to find a codebreaker while Poe finds himself in a power struggle with Holdo.  Meanwhile Rey is attempting to begin her training in the ways of the force with Luke Skywalker. \\n\\nLuke Skywalker- Mark Hammill is no Alec Guinness or Frank Oz for that matter.  He lacked the presence of the aforementioned actors to convey a sense of wisdom and leadership.  His reluctance to train Rey came off as mean spirited.  Yoda had a much more humorous tone before revealing himself to Luke. \\n\\nRey- Excels at her Jedi training without any hardship.  Unlike Luke who failed multiple times with Yoda.  And while Luke had a vision of Darth Vader\\, Rey has a cheap funhouse mirror gag that really didn't do anything with the plot.  Oh\\, and her parents aren't anybody.\\n\\nKylo Ren- Adam Driver is one of the least talented actors to come along in a generation.  He's an annoying emo kid with limited range.  And Ren's character is all over the place.  If TLJ takes place like a day after TFA he'd still be in pain from that blaster shot from Chewbacca.  And Rey handedly kicked his ass with minimal training.  And now he's able to dispatch several of Snoke's guards with little help from Rey.  Which makes zero sense seeing how the novice force user kicked his ass just a few days prior.\\n\\nSnoke- Andy Serkis is a great motion capture actor.  He did an amazing job as Caesar in the Planet of the Apes movies.  He was able to convey a wide range of emotions\\, with little to no dialogue\\, as the simian leader.  As Snoke he's an overacting fool.  And he's killed with little to no effort by Ren (see above).\\n\\nPoe Dameron- They keep trying to make him the next Han Solo.  He's not.  His forced humor isn't funny.\\n\\nGeneral Hux- This guy is not a military leader.  He's a JROTC cadet on speed who has been given command of an aircraft carrier.  Peter Cushing did a great job as Tarkin\\, he was cold and calculating.  He was believable a senior military officer.  \\n\\n\\nCaptain Phasma- A complete waste of a character.  She's a female villain just to be a female villain.  She has no significance to the plot.  Just thrown in to have Finn get revenge.  If Disney is dead set on having a female villain they should make the leader of the First Order a woman.\\n\\nChewbacca- Finally got a chance to show off his piloting skills with the Millennium Falcon in the film's final battle scene.  Prior to that he was barbequing those Porg creatures while Rey was acing her Jedi training.  Great use of his time.\\n\\nBattle of Hoth 2.0-  Replace the word snow with salt; replace the word snowspeeder with ski-speeder; and you get the picture.\\n\\nDarth Sidious- This might have been the best thing of the entire movie.  Luke actually said \\\"Darth Sidious\\\" and the prequels are finally acknowledged.  \\n\\nYoda- His cameo was forced and kind of pointless.\\n\\nVice Admiral Holdo-  I mean Vice Admiral Gender Studies.  I hate to play the Social Justice Warrior and forced feminist card but it's completely justified.  Much like Captain Phasma is a female villain just to be a female villain\\, Holdo is here to be a female hero just to be a female hero.  She is shoehorned into the movie without much explanation.  She should have been introduced while commanding a ship taking out enemy forces.  That way the audience would see what she was capable of and that we could trust her.  Instead we got a social justice hire.\\n\\nFinn & Rose's Excellent Adventure- After learning of the First Order's ability to track the rebel fleet and upon the advice of Maz Kanata\\, they make their way to Canto Bight to find a master codebreaker\\, who is also a high stakes gambler.  Upon realizing they can't pay him for his services they challenge him to a high stakes card game to win his services\\, using Rose's pendant as collateral.  After they lose nearly all their chips the codebreaker offers them one last shot to win his services.  If they can win the next hand he'll...  None of that happened\\, instead we get a lecture on the evil one percent of the galaxy and their decadent lifestyle.  Wedged between two Loony Tunes style chase scenes evading security (after they get busted parking on the beach\\, yes they got busted for a parking violation) and then escaping lockup we meet Benicio Del Toro's hacker character.  He's a drunken mess with a stutter that seems to come and go at will and he gives Finn a lecture on arms dealing and how no one is as clean as they say they are (which Finn should have taken his advice).  Gambling was used in The Phantom Menace as means to manipulate Watto into betting heavily on the outcome of Anakin's race.  A high stakes card game would have been a welcome addition to the series and a much-needed break from the constant chase scenes.  And Del Toro was criminally underutilized.  He was there just to be there pretty much.  \\n\\nFinal verdict:  I saw this on youtube and it makes perfect sense for this film\\, \\\"You will beg for Lucas before this trilogy is over.\\\"","true":true}