{"101487":128673,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"How do I feel about TLJ? Meh *tosses lightsaber over left shoulder*\\n\\nBefore I watched a TLJ I felt like JJA had me sitting in a pretty nice ride. Familiar but new and excited at what direction the ride may take us for when RJ comes along. Rian Johnson arrives and promptly walks around the car and slowly but casually punctures a hole in three of the tires. As he is doing this he is only just now youtubing a couple of Star Wars videos and says \\\"You know what buddy? F**k it. We're winging it!\\\" And off we go with no real direction in sight. While his foot is slammed on the pedal he says to me\\, \\\"You know\\, you're a real a**hole to have expectations.\\\" Sorry\\, I guess? I don't know what I'm supposed to say? \\\"NOTHING. You are to say nothing and like it. \\\"What was the worst childhood toy you ever had\\, man?\\\" Umm\\, I don't know...a furby? \\\"Perfect. What is your favorite kind of pizza?\\\" Uh\\, pepperoni and ham? \\\"Here\\, have this leftover crust of a corndog. Remember what I told you about expectations?\\\" I mean this is fine man. I'm just here for the ride I guess. \\\"Anyway\\, we're going to your house.\\\" What..why? \\\"Shhhh. Trust me. Do you trust me?\\\" Yeah\\, I think I can still trust you. \\\"Five of my friends are coming over.\\\" Who are th.. \\\"WHAT ARE YOU SUPPOSED TO SAY?!\\\" Nothing...you told me to say nothing and like it. \\\"Yasssss\\, you really like it don't you?\\\" Yes\\, Rian Johnson. I like it. *eats corndog crust and tries to enjoy killing the past*","true":true}