{"101487":165949,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Sadly The Last Jedi fails on so many levels. It doesn't respect the characters\\, it doesn't respect the Saga and doesn't respect the fans. \\n\\nThe humor used in the film doesn't invite us to laugh with the characters but laugh at them. Almost every moment that the director tried to get a laugh was slap stick. The original trilogy the humor was self aware humor and not satire humor like The Last Jedi.\\n\\nAt every turn the film is scolding the fans for loving the originals and even The Force Awakens. It's like the Director made The Last Jedi to sneer at you if you enjoyed any past elements of the past movies including The Force Awakens.\\n\\nThe main argument for those that think this movie is great and jump on hose that don't think it's great is that we had our own idea and expectations on what the movie should be.\\n\\nA great movie should be able to stand on it own and always surpass a fans own ideas and expectations. If it's great the viewer doesn't care if his idea of what should happen wasn't in the movie.\\n\\nThe Last Jedi is a Message driven movie and not a character driven movie preaching to us about morals\\, the rich and war. When Benicio Del Toro character mention the the rich sale to both sides it feels like a real life force moral lesson that goes in one ear out the other. It doesn't affect the character or story what's the narrative point other than to preach to the audience. \\n\\nRian Johnson seems like a good guy but being a director and writer in the Star Wars universe isn't for him.","true":true}