{"101487":198649,"Last Jedi":"Last Jedi","2017-12-15":"2019-02-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars movie ever. You destroyed Luke after we waited since 1983 for his return. Everything he faught for you pissed on. Thanks Disney. All the while just because I donï¿ 1\/2(TM)t like this movie Disney accuses me of being sexist!? How does that make sense. You killed Han in the last movie and now Luke goes out like a chump all the while poor Carrie passed away in real life RIP Carrie. So two movies that cover about 1-2 weeks of story time you bring our heroes back just to kill em...thanks Disney. Rey was a cool character btw. Rian Johnson killed that. Rose is played by a great and likable actress and ao is Holdo. Rian Johnson made them incredibly unlikable. Not because they are women. Because of bad writing and directing. Carrie did the best she could with this crap script. Admiral Ackbar is back!? Nope\\, Rian killed him and never mentioned it. Bye bye heroes. Kylo started getting interesting by killing his master and wanting to change things and not repeat the past?? Awesome! Oh...nope. I blinked and he was a stock bad guy again. Thanks Rian Johnson! JJ...you have a lot of work ahead of you. Good luck redeeming this horse crap Rian set you up with. Rey is cool...please make her somewhat relatable. Please stop accusing people of being sexist because this movie sucks. Look at Alita. Look at those scores and let the sexist arguement die. Men and women alike love strong female characters. Just give us some decent writing and character development and we will eat that up all day. Own up to your mistakes and make things better.","true":true}