{"101487":157607,"Last Jedi":"Last Jedi","2017-12-15":"2019-06-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not in my 40 years would I have ever dreamed of giving any Star Wars movie a failing grade\\, but this one I feel whole heartedly deserves it. I gave Ray the benefit of the doubt in the Force Awakens and her relatively powerful force abilities with no training\\, but they never drove her in any direction that faced adversity or really put her in ANY circumstance where she was anything other than a veteran of the Force and really space travel in general. Coming from a desert planet to being instantly put in a position of life or death peril involving space flight or hand to hand combat\\, she continues on a path where apparently she inherently has the life skills to become the next great Jedi Master. There are too many plot holes and several literal unexplained characters and plot twists that serve so little point to the main story to list off. This movie should have been the rough draft of which writers could sit down and critique and build the script off of to actually create a story with characters you could build an emotional bond with. I think that's the biggest part of these new Star Wars movies that's missing\\, there's no bond between the characters on screen and the fans watching. It just feel very grey\\, dull and color by numbers. Not to mention the complete crapping on any\/all original characters from the REAL Star Wars movies. Even the droids get the cold shoulder\\, including BB-8! What purpose does he even serve any more? The final installment of this Star Wars series is going to be trash\\, and I'll still watch it with just a glimmer of hope. It's not like they can kill any more of my childhood\\, it's already dead. ","true":true}