{"101487":132321,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-27","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If there is something that critics simply will never understand about Star Wars is that it is a fantasy series that never had the ambition to receive critical acclaim. Rian Johnson's lack of continuity and complete diversion of the central themes left the majority of us lifelong fans somewhat crestfallen. Luke was written to be something closer to a stranger than the beloved hero we all anticipated to see. This attempt at breaking the \\\"mold\\\" (even though it is a saga based on a myth-like theme of self fulfilling prophecy and fighting identity you are born with versus who you chose to be) was confusing\\, not justifiable in retrospect considering SW fans return for familiarity. Rian only stands out to me because he destroyed an opportunity to enchant us. The word hubris is said so much in the film I can only associate it to everyone who allowed this story to take such a pitfall after such a strong start with episode 7. I didn't appreciate that Finn became an insignificant side character\\, nor that Poe was all of a sudden an explosion crazed\\, hot-headed pilot as opposed to the person he was in episode 7. There was an amazing cast of female leads yet they single handedly destroyed their own rebellion star fleet\\, that seems a bit patronizing\\, doesn't it? And not to mention every side quest involving new character served no purpose\\, not even character building. I may be a fan\\, but I can be critical\\, and this movie doesn't live up to it's score on the critic's end of things. It is by far the worst of all the Star Wars films. The 2.5 stars are for Adam Driver and every other superb actor casted in this film who managed to hold their own even with terrible direction reminiscent of George Lucas's in the prequels.","true":true}