{"101487":199553,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow your thinking One Star is clearly a mistake but no I really meant to put it there my finger did NOT slip\\, There are sooooooo many reason this film deserves that 1 star but without going into too much detail I'll just give you the main reasons I hate this film\\, Yes I am a fan of the 6 films prequel and original\\, that being said I do understand the hate for the prequels due to some of the stupidness of jar jar binks and focusing too much on some of the politics\\, BUT what those films did do which is why I like them soo much is the built on the story of the originals and brought them full circle you know what had to happen but still it was a good story getting there\\, meeting the characters that would shape the man who became the greatest Movie villain of all time\\, it wasn't perfect but they didn't that Job\\, Bit these New Films have taken all the good parts from the 6 past films and just decided nah I don't want that to continue they have changed the very nature of \\\"certain characters\\\" making them do something \\\"a certain character\\\" spent the whole of two films trying his very best not to do! They make out the Skywalkers have the closest connection to the force with even anakin being made from the Force yet they Make a girl who has no training no special Lineage  and make her as strong if not STRONGER than the main bad guy who has been training since he was a kid and who is known to be very strong in the force! It doesn't make any sense at all not only that major character such as Snoke who is the mystery character has NO BACK STORY IN THE FILM and they don't even tell you who he is how he got to where he is now and what connection he has to anyone else.","true":true}