{"101487":176989,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie suffers from bad\\, lazy writing\\, as if no one thought through the plot holes in the film. Why not send the TIE fighters to destroy the remaining ships? 4 TIE fighters managed to destroy the hangar bay and bridge and theres literally 1000 other TIE fighters waiting in the First Order ships. Instead we get this silly space chase scene where fuel is limited but shields are infinite. How convenient. Why didn't the female admiral just tell Poe her plan\\, hes still is an Officer. There wasnt a First Order mole subplot so theres absolutely no reason for her to keep it a secret. There's only 400 resistance fighters left but Poe doesnt know what the vice admiral looks like? Leia was always portrayed as being force sensitive but all of a sudden she has god like force powers? How convenient. Vader was the more evil villain and Luke still was willing to sacrifice his life in hopes if turning Vader back to the light side. But he sees evil tendencies in his nephew and wants to kill him? What? Rian fundamentally doesn't understand Lukes character. The humor was so out of place and terrible. Rose falling in love\\, what? Hyperdrive now weaponized\\, look how easy it is to destroy massive ships now\\, how convenient. Phasma\\, wasted character. Snoke\\, wasted villain. Reys parents\\, wasted mystery. JJ left such a strong foundation to work with and Rian just said fuck it all\\, I'm going to have an emo kid run the first order and rey is a nobody.","true":true}