{"101487":97012,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"2 stars because of the quality of visuals\\, sound\\, acting\\, etc. However the story and the script are a big dumpster fire zero.\\n\\nBad humor. Phasma\\, Poe\\, Rose\\, DJ\\, Fin all useless and expendable. Luke behaves completely contrary to character. Snoke shown as ultimate bad ass rendered useless and tossed to garbage in a cinch at the first opportunity. Bunch of cliffhangers and interesting questions from previous movie thrown to garbage without a thought. NOT original: we're back to bad guys vs good guys and same mechanistic dichotomy. Characters behaving completely stupidly and failing basic communication.\\n\\nNothing wrong changing the arc of characters but there has to be a bit of coherence between films. You can't have one setup a bunch of things\\, the following one scrapping it all. You can't have a movie massively banking on nostalgia\\, bringing all the old characters and then have everything killed off in the second movie.\\n\\nThis shows there was no long term planning in the movies and they make it as they go. We can accept dramatic plot twists but we cannot accept self-incoherence. Can Disney at least try to keep some kind of an arc between two movies? This is like reading a Harry Potter full of plot twists and open ends and getting a Twilight story in the second book.\\n\\nGotta wonder what they'll do in the next movie\\, all the interesting characters are dead and cool new possibilities (Ren+Rae partnership?) are out. We're back with Empire\/Dark side vs Resistance\/Light side exactly like we started with A New Hope.\\n\\nBoring\\, clunky. Sad.","true":true}