{"101487":141708,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It is the worse movie I have watched in 2017. I will factually say why is it bad. I have watched it twice\\, I was very disappointed when I watched the first time. I thought it was just me. Because the critic review has rated very highly and raved about this movie. I cringed while I watched the second time. It was much much worst then I remembered. To start off if... Star Wars happens in a galaxy far far away then most of the physics and chemistry should be very similar in this part of the universe\\, right? I think its okie to get some of the physics wrong\\, I can look past it\\, but every act and sub act has god defying moments. That's just very lazy on the director and story writer part. Nobody bother to check through. Act 1 if bombing bay open in SPACE\\, shouldn't the crew get sucked out of space? PHYSICS FAIL. Also\\, If Leia gets blown into SPACE\\, and she SUPERMAN her way back to the ship and opens the door\\, shouldn't Leia and the crew get suck\/blown into space? Act 2\\, Kaylo and Rey communicated with each other thru the vastness of space using the force\\, how is it that while they were communicating\\, Rey got wet because the raining and wet climate on the island but Kaylo got wet too (just because Rey got wet due to the island's weather\\, it does not mean Kaylo should get wet too\\, just because they communicated thru the force\\, they now can physically transport matter thru space and time instantaneously??? Doesn't make sense)\\, even thou Kaylo was in Space? The story line was so so messy\\, and many parts of the story don't make sense. In the RETURN OF THE JEDI\\, the rebels won.  so how is it that in this episode we are only left with 400 rebels. YES! IN THE ENTIRE GALAXY\\, WE HAVE LESS THAN 400 REBELS? WTF happened in between the 40 years? After Leia was blown into space and after she SUPERMAN her way back to the ship and conveniently opened a door in space to let herself in\\, she was too hurt to lead. This purple hair lady took over command. She had a plan to save the remaining rebels but refuse to share the plans with the Star Fighter pilot POE even after he asked. It doesn't make sense. In this kind of do or die situation everybody needs to know their job\\, if you are the leader\\, you need to spell out the plan and not sit one corner and scheme. Especially when everybody's lives are at stake. Bad character with bad character decision that serves no purpose in the movie at all. I want to talk about ROSE FINN and CODE BREAKER GUY. Why the CODE BREAKER GUY ONLY ESCAPE from jail after ROSE and FINN goes into the same cell.... BEATS ME. This part is so so bad... I don't want to go into details. Else I will go on forever. LET'S GO INTO THE MEAT OF THIS REVIEW. THIS IS A STAR WARS MOVIE. TO BE A JEDI. YOU NEED TO FIRST HAVE THE APTITUDE then you train until you lost an arm a leg or a master. even then\\, you are still at best half filled. You need to walk the same journey as all LIGHT SIDE FORCE PRACTITIONER. you need to be defeated\\, humbled but never give up and still grow and continue to serve the mission. THIS IS STAR WARS. HOW THE HELL\\, THIS REY GODDESS BE MORE POWERFUL THAN LUKE IN A FORCE FIGHT AND A WEAPON FIGHT? HOW? HOW IS IT SHE CAN PILOT THE MILLENIUM FALCON BETTER THAN HAN AND CHEWIE.... ON HER FIRST TRY???????? HOW CAN SHE BEAT KAYLO IN A FIGHT when she first used a lightsabre?? HOW CAN?? SHE HAVE NEVER TRAINED UNDER A MASTER FOR ANY PERIOD OF TIME\\, SHE IS THE BEST PILOT IN ANY FIGHTER SHE SITS\\, SHE BEST LUKE KAYLO IN A LIGHT SABRE DUEL. SHE CAN DO JEDI MInD TRICK WITHOUT SEEING IT FROM ANYBODY? LUKE DOEST KNOW WHERE SHE COMES FROM. SHE IS JUST POWERFUL. FOR THE SAKE OF BEING POWERFUL. THATs NOT STORY TELLING. THAT SOME INCOHERENT STORY written by an 8 year old. The jokes are BAD. THeY ARE REALLY REALLY BAD. NO TWO LIGHT SABRE EVER TOUCHED EACH OTHER IN THE ENTIRE LONGEST STAR WARS MOVIE. CHARACTERS POP IN AND OUT FOR NO GOOD REASONs OTHER THAN TO SELL MORE MERCHANDISE. THE DARK SIDE ARE SO OVERWHELMINGLY POWERFUL but still lost. THEY LOST not because of CUNNING TACTICS by the rebels. they lost because of some really really stupid reasons. Things materialize in and out of the movie. I AM TALKING TO YOU\\, LUCKY DICE. THIS MOVIE\\, IS POORLY REWRITTEN\\, POORLY EXECUTED\\, it's like watching 4 different mini clips but was sold under the pretence that it was a complete movie. ALSO\\, HOW CAN THE CRITIC GIVE 92 POINTS\\, UNLESS DISNEY HAS THREATENED YOU OR HINT OF ECONOMIC INCENTIVE OR LACK THERE-OFF ELSE THIS IS A HIGHLY INCOHERENT MOVIE at best DESERVES 50 for its VISUALS. BUT MOVIES IS ABOUT ITS STORY... THE STORY IS TOTALLY INCOHERENT AS A STAND ALONE OR AS A CONTINUATION. THE CHARACTERS DONT BEHAVE LIKE HEROES OR VILLIANS. THEY BEHAVE LIKE SOME IMMATURE JUVENILLES. THE CRITICS ARE NOT HONEST. DISNEY IS CORRUPT. I want to give it a negative score\\, but  1\/2 is as low as I can give. RIAN is just dumb. A universe that has established physics and character and all the more mundane and difficult part all done for you. All you need to do now is just tell a story. Even that you messed it up. YOU SUCK. TALENTLESS.","true":true}