{"101487":105411,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a star wars fan\\, I feel the need to do my due diligence and voice my opinion after watching it twice. The force awakens was a much anticipated movie and while it did a decent job with the homage to the previous trilogy and introducing mystery around a lot of the new and old characters\\, it lost a lot in an all too familiar story (New Hope) with plenty of gaps in the plot. I saw past that as it was the only way to satisfy original star wars fans and a new generation of followers. I mention that because the last Jedi was the make it or break it film. Well\\, it fell very\\, very short and there is not a star wars fan I know that wasn't disappointed\\, frustrated\\, and angry leaving the theater. In fact\\, everything that was built up in the force awakens was so cheaply torn down. I've watched Ep. 4-6 about 100 times and Ep. 1-3 close to 20. I grew up loving the plots. Seeing each character develop\\, the mystery surrounding the force\\, the betrayals\\, the intrigue and politics hidden inside the star wars universe. That seems to be long gone and replaced with repetitive story lines\\, cheap thrills and misplaced humor. This will contain spoilers so do not read any further if you care.\\n\tA movie is only as good as its plot. The force awakens was essentially a new hope. The last jedi is the empire strikes back but nowhere near as good. The empire is hunting the rebels\\, they attack their base on a white planet that is snow\\, I mean salt...Still not convinced? Does DJ (Benicio) remind you of someone? How about Lando in an all too familiar rebel betrayal for promise of power\/money. \\n\tLuke Skywalker had the most unsatisfying ending I could ever imagine. The biggest mystery from the force awakens was Luke's tale after a 30yr hiatus. What happened to the story of the one who brought balance to the force? What drove him into exile? We needed a glimpse of Luke's true Jedi power (like we saw Vader's in Rogue one). He needed to have an epic battle just like every Jedi before him. We all knew that Luke had to die to make way for the new cast. Luke knew that. After 30yrs\\, we got Luke's redemption story as a holographic image\/distraction and that was his last breath in the Star Wars Universe. With his last words being see you around...I guess not. Hardly a way to say farewell to a legend. We were hoping for a real story behind the 30yrs of Luke Skywalker. How he studied the force\\, how he taught\\, what was in the ancient Jedi texts? We got 2 mins worth of an explanation about a jedi temple and some apprentices dying. Huge cop out on a poor script. Essentially\\, a cheap one dimensional explanation and a whinny old man was the entire mystery of Luke Skywalker?\\n\tForce powers never seen before and conveniently placed.  Kylo and Rey can all of a sudden telepathically\/force project with each other at random but strategic times. Oh wait\\, Luke can do the same with Leia as well as others and droids apparently since he winks at C3PO. Also\\, if Snoke let Kylo and Rey interact and he dies\\, why can they still do that? Side note\\, way too much telepathic sight-seeing. Vader and other Sith\/Jedi could sense each other but they were all stronger than Kylo and Ren. However\\, somehow they can see and touch each other breaking barriers of time and space? I don't buy it. \\n\tMisplaced humor. The star wars trilogies always had some well-placed humor. Thinking of you Han. The humor in this movie was hardly fitting. I thought I was watching Marvel. Porgs making faces 6x times is atrocious. Luke teasing Rey with a leaf about the force? Childish. Humor was cheap\\, forced and misplaced. \\n\tWho the heck is Snoke??? A mysterious\\, powerful sith lord who got built up from the force awakens and all of a sudden he's dead\\, in an amazingly obvious and predictable fashion without ever providing an ounce of his background.\\n\tHow did Yoda create lightning and burn down a tree? We all know that when a Jedi passes\\, they can become ghosts as seen with Obi wan\\, Anakin and Yoda. They were never more than guiding voices and occasionally apparitions. Now they have powers in the physical world like burning trees\\, hitting Luke on the head with a cane. Shameful. \\n\tRey's parents are nobodies because a Jedi can be anyone not just specific bloodlines? This is the whole premise of this new trilogy??? That's already been covered in Phantom Menace...Anakin Skywalker was the strongest force being to ever live and he had normal parents! \\n\tThe almighty star destroyers can't take out some medium-small spaceships? They also can't detect escape aircrafts? What exactly can they do??? One of the most ridiculous parts of the plot. We have this entire fleet but we can't actually do anything with it so we'll just chase them around until they run out of fuel. \\n\tWhat purpose did Finn\\, Poe and Rose serve? Their elaborate scheme fell short twice (tracker mission fail\\, door cannon thing fail).\\n\tThe Kylo\/Rey banter is repetitive and tiresome. The join the dark side\\, join the light side\\, join the dark side back and forth becomes tiresome. They try to paint a grayer picture of the force sides but essentially revert back to dark\/light side anyway.\\n\tI was thoroughly offended by Luke drinking blue milk from the teets of sea lion like creature. It was supposed to be a throwback to Luke drinking green milk with his uncle but that was done in the worst way possible. I almost walked out of the theater at that moment.\\n\\nIn the end I was left with a poorly made film that had resemblances to the Star Wars saga but lacked every bit of what makes a Star Wars movie great. I was saddened that by far the best moment of the film are the last 30 seconds with the slave kids telling of the Jedi tales only to find out that one of them has those same powers and hope within him. I don't anticipate that Episode 9 is going to be redeeming in any way and will conclude that star wars ended years ago. I got more than I bargained for this weekend as I was hoping to say farewell to Luke Skywalker but it seems that I'm saying farewell to the entire star wars universe forever.","true":true}