{"101487":147438,"Last Jedi":"Last Jedi","2017-12-15":"2018-10-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I will admit this movie is visually stunning\\, the colors and the CGI effects are for the most part beautifully done.  That does not however make a movie.  The plot\\, if there actually is one\\, was either not well written or not edited correctly.  Important character moments are missing between Rey and Luke and Rose and Finn.  Characters are disrespected most noticeably Luke and Finn.  Rian Johnson managed to take the original hero who wouldn't give up on his father and turn him into a loser who was going to kill his nephew because he was starting to lean toward the Darkside rather than attempt to turn him back to the light.  Don't even get me started on the treatment Finn faced in this movie\\, his plot was the one I found the most compelling in the Force Awakens\\, lets face it Rey is just blah and too perfect.  Finn actually went through trials and tribulations and evolved from a character that was basically a coward just trying to get away into a man willing to pick up a lightsaber and fight Kylo to defend Rey.  Then in this movie they turn him back into a bumbling idiot whose moment of self sacrifice is ruined by Rose and if they were supposed to have chemistry then it didn't show on screen.  \\n\\nThe Plot holes in this movie are big enough to move a planet through and the lack of respect paid to the Force Awakens which was the first movie in what is supposed to be a trilogy was so annoying that I could barely sit through the movie in the theater.  A trilogy needs a beginning\\, a middle and an end.  The movies can stand alone and have their own self contained plots but there needs to be some sort of overarching theme that connects all of them.  There should be set ups and pay offs that are used throughout all three movies which is something most writers learn in school.  If you aren't going to use the shotgun don't put it on the table.  With these films there is nothing\\, except for the settings\\, that connects any of the potential plots of the Force Awakens to the Last Jedi.  The ending of this movie feels like the ending of a series and didn't leave me at all interested to see what happens next.  There are no questions or plot threads remaining that I feel can be properly paid off in Episode 9 that won't feel rushed because of the mistakes made in this movie.\\n\\nI could write a paper with all the reasons why I don't like this movie but I understand that some people did enjoy it and more power to them.  We all have our opinions and thoughts and as I said at the start I will agree that the visuals are stunning.  It's a shame the story can't measure up to them.\\n\\nAlso a book attached to a series of movies should not NEED to be Read to allow someone watching the movie to UNDERSTAND what is happening.  A book\\, especially in Star Wars\\, can add to the universe but I shouldn't have to buy 12 books to fill in all the plot holes in one movie.  If the writer of a film has to direct the audience to a book to fill in the gaps then they failed to do their job properly.","true":true}