{"101487":132375,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If this was just a normal start up sci-fi film and didn't have \\\"Star Wars\\\" attached to it it'd still objectively be a rotten mess of a movie only watchable due to its \\\"cool effects man\\\" and its \\\"awesome fight scenes\\\". But that's the problem\\, it ISN'T just a failed attempt at a new franchise\\, it's Star Wars and its primary focus isn't to tell a deep story or even to entertain you\\, it's here to jam political and social ideas down your throat and wipe the universe clean of the history of the originals and even The Force Awakens just to make a cheap \\\"splash\\\" for attention. At the same time it strangles its own potentially strong characters with horribly written dialogue and the overall plot is a mess of contradictions. By the end of it all you will walk out confused and bewildered and ask yourself\\, \\\"Did I just like that movie? I mean it's Star Wars...I HAVE to like it right? I think I liked it. Yeah I did like it. Wait\\, let me ask some questions...\\\" and once that line of questioning comes the façade of hundred-million dollar movie effects and flashy light saber fights evaporates and the writing of the movie is left bare\\, insecure and frail.\\nPlus who here hasn't dreamed of Princess Leia becoming Mary Poppins while Rey continues on her path of becoming the biggest Mary Sue in movie history? Who here hasn't dreamed of potentially strong characters like Captain Phasma portrayed by a strong actress being written off as a nothing? Who here wants to cringe at one of the worst kissing scenes in recent memory? Who here hasn't wished for a Star Wars that opens with a silly \\\"phone tag\\\" comedy skit that sets the stage for the antagonists to become a bunch of sniveling\\, incompetent pushovers from the top down? And finally\\, who came here to see one of the most well-known characters in the history of cinema be turned inside out and contradict everything they were and milk an alien cow because as this movie's main antagonist dictates: \\\"Let the past die. Kill it if you have to!\\\"","true":true}