{"101487":133877,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have not been to a cinema since I saw this farce of a movie. historically I would see a film at least once a month but this \\\"movie\\\" has caused me to lose faith in the \\\"products\\\" Hollywood is churning out. As a fan of star wars since 1977 i have to say that this film served as a death knell for the saga and derailed my enjoyment of the movie going experience. What's the point if this film is considered to be \\\"good\\\" by critics and film producers? What's the point if You are going to be attacked for disliking a film for being untrue to it's roots and established conventions? \\n\\nThe trailers for Last Jedi showed promise but deceived as this is a disappointing and pointless movie overall. Mark Hamill did a good job with what he was given to work with here and he is a highlight of the movie but any pain you see in Luke Skywalkers eyes in any given scene was probably mark Hamills real pain at having to follow this script. overall the classic characters are wasted to prop up newer\\, less interesting ones and there are so many logic flaws that the viewer can't suspend disbelief long enough to be drawn into the world of the \\\"story\\\". \\n\\n This is not so much the \\\"risk taking movie\\\" it is touted to be as a series of loosely connected scenes seeking to pander to current Hollywood expectations while working in marketing opportunities for toys based on cute animals and droids. If Han Solo had come back as a cyborg it would have been an exciting \\\"risk\\\"; while the \\\"risks\\\" in this movie are lazy and largely involve completely changing established traits and portrayals of classic characters or killing characters (almost randomly). \\n\\nNothing about this movie filled me with awe or made me want to see it a second time. It has a contrived feeling throughout with most of the \\\"better\\\" scenes being very inferior copies of scenes from the original trilogy. Too many illogical scenes and character actions\/ decisions wear down the viewer. Also\\, Many characters seem to be rushing to their deaths as a first resort rather than bothering to come up with reasonable\\, thought-out plans. In addition\\, The dialog is of inconsistent quality. Incongruous humor derails the movie at times and a number of scenes are slap-stick humor or overly cute and defuse any slight excitement which might have been building. The new trilogy characters are especially weak\\, seeming like they wandered in from a Disney set and were dressed up in Star Wars type clothing. The Heroes lack Gravitas and None of the villains are threatening. It is very cloying.\\n\\nThe Last Jedi lacks soul and a sense of urgency since you don't care what happens to most of the characters as the movie unwinds. None of the questions the viewer might have had from the Force Awakens are answered here in a satisfactory way\\, if at all. there is no respect for logic\\, the laws of physics or the established properties of \\\"the force\\\" to be found in this film. This is terrible Star Wars and very weak science fiction. \\n\\n I am especially disturbed by the backlash against fans who don't like this movie for what seem to be valid reasons. Believe me\\, we are not too stupid or too sexist to enjoy this film; it's just bad and this will be born out over time.\\n\\nI had to see the Last Jedi once as a Star Wars fan but I don't recommend it and didn't re-watch it in theaters\\, which is a first for me. Star Wars is on full life support in the bacta tank for me now and I don't think J.J. Abrams can save it with his \\\"mystery box\\\" technique of posing questions he doesn't plan to answer in Episode IX. Hopefully he will surprise me with a cyborg Han Solo. Sadly\\, this is not the star wars you are looking for; move along...move along...","true":true}