{"101487":196410,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While graphically tremendously impressive\\, this movies' curt dismissal of of the traditional values of enticing character arcs in favor of pseudo intellectual nihilistic blandness feels out of place. Completely erasing the original trilogy by doing a galactic reset makes every action in this film\\, and previous films\\, feel unimportant. Johnsons callous disregard for his source material is blatantly obvious. Consciously making fun of the Star Wars saga isn't meta or intellectual\\, it's just lazy. While the movie does try to convey a message of hope and potential in every living person\\, making rey so enormously overpowered counteracts this. When Rey defeats Kylo Ren in episode IX that will be the third time int three films she'll have bested him. Her arc builds up to nothing. TLJ fails to deliver on many points TFA set up\\, and not in a clever way. They are not subtly playing with audience expectation and subsequently surprising  them with a fresh and unexpected twist. Where you interested in Rey's heritage? Fuck you she's nobody. Where you intrigued by the allpowerful snoke? Well fuck you fans\\, he's just a thinly veiled James Bond villain rip-off thrown away for yet another \\\"join me and we can rule the galaxy\\\" rehash. Because fuck you\\, buy more porgs. The canto bight scene was hilarious\\, wrecking an insured casino and resort with horsedogs so the childslaves can clean it up later. But at least BB-8 got to shoot some coins. At points this movie is downright insulting to the intellect of it's viewers. Spaceships running out of fuel and literally stalling in space. IN SPACE. This being the biggest nerd franchise in the world you'd think the writers would know about Newtons third law. No cruise control so we can have a dramatic sacrifice is pointless. Everyone in the first order is bewilderingly inept. Holdo being a renowned admiral and Dameron being the \\\"best pilot in the resistance\\\" don't know each other out of a crew of 200 people\\, give or take. Yet these two heroes of the resistance decide to distrust and turn on each other in the darkest hour. Just so we can have some forced drama. There are numerous ridiculous plot contrivancies layered throughout this flick\\, and the feeling that remains is Disney and Kennedy whispering in your ear \\\"we don't care about star wars and neither should you\\\". Thank you multibillion entertainment-empire\\, which is very closely approaching an monopoly\\, for telling me capitalism is bad. Thank you for relinquishing the very essence of Luke Skywalker in a forced \\\"i'm gonna kill my nephew because i totally don't talk people out of being evil\\\" so you can sell toys of a Darth Vader look-alike with a crossguard on his lightsaber. All in all everything has been fantastic since Disney took over\\, can't wait for the han solo film nobody wants.","true":true}