{"94533":"94496","UD":"UD","2015-09-30":"2015-08-30","8":10.0,"História espetacular\\, ótimos gráficos\\, porém a movimentação dos personagens não é boa e o jogo é totalmente linear. Apesar dos problemas é um grande jogo.":"The surprise hit of 2015 Until dawn has arrived and I was left gasping for more after my first sitting.\rThe story follows a small group of (some more stereotypical then others ) teens attending a reunion on the mountain two friends mysteriously disappeared from the following year.\rThe game has stunning visuals among the best ever seen in a video game and I was surprised of exactly  howThe surprise hit of 2015 Until dawn has arrived and I was left gasping for more after my first sitting.\rThe story follows a small group of (some more stereotypical then others ) teens attending a reunion on the mountain two friends mysteriously disappeared from the following year.\rThe game has stunning visuals among the best ever seen in a video game and I was surprised of exactly  how much variety the game has in exploration  of some very beautiful areas you end up visiting based on your choices and decisions up to the point  of seeing them.\rThere are multiple routes and options for you to choose from and depending on your decisions entire cutscenes can change from big to small\\, I would like to point out I have steered clear of these point and click type games I never played the Walking deads or the Heavy rains so I went in unsure what to expect and cannot comment on how it compares to those games but my drive to save certain charcters after making mistakes and a furious sitting which I forced myself to stop at near 2:00am not because the game was finished but because I needed to get some sleep only to lay wondering if I did certain things different how it woul play out and if I could save characters clearly shouted to me this game was something special.\rIn terms of the gameplay you may of been put off by E3 Footage in thinking it has very little to offer other then QTEs and talking but I can safely say you would be wrong the gameplay does a phenomenal job of immersing you into the feeling of doom as in it can put you in a situation where you have but a few seconds to make a call or you are dead unlike other games that character is gone for good which really adds to the horror aspect another cool feature it has is having to hold the Dual shock still in order to hide or remain calm the crazy thing about this is the controller will vibrate like crazy causing you to grip and inhale until the scene is played out it really is vital I found when I didn't hold my breath I would be caught and killed I find this really does create so much more tension and give the game a powerful punch.\rThe games also has a pretty damn good story with some interesting plot twists you didn't see coming but if you came across some of the clues in the game just as the protagonist pieces the clues together you find yourself shocked at how well everything had fitted together up till the very end and trust me at the very end you will be left feeling stunned at how you missed the signs and clues.\rThe voice acting is also great off course you have Hayden the big hollywood star but other voice actors are also top notch some more so then others but regardless some very solid work from the team you will be surprised how much you end up liking a few of the characters and hating others which on first look you may of looked at as just another generic Horror stereotype stats can increase or decrease depending on decisions the once caring character may by the end become a heartless selfish scumbag or the character you thought as annoying and spiteful may become a heroic likeable member of the team it is all up to you.\rThe game is VERY polished I have played many games at launch throughout my life ever since the 7th gen game quality has usual been  noticeably bad at launch compared to a week to a month later but this game I came across just the one glitch throughout my two playthroughs and the glitch was only a character going through a piece of wood during a cutscene\\,The game runs steady with no noticeable framerate drops and there wasn't anything that looked out of place in comparison to other pieces in the environment the textures looked amazing throughout the character animations and deaths looked very realistic and the attention to detail was rock solid.\rAt the time of this release we have MGS5\\,Fifa and Madmax all coming in a matter of days but I am advising you if you cannot afford to spend on multiple titles pick up Until Dawn first I have played countless games this year that failed to keep my attention I do believe Quality is sometimes better then quantity and Until Dawns Quality is above the majority's all though the games story is roughly 9-10 hours you WILL be replaying this game you will want to see characters you saw die survive and characters you saw survive die yes you could look it up on youtube but you owe it to yourself to attempt to do so yourself and to see exactly how much impact small decisions you made the first time around shape the story on the second play through.\r10\/10… Expand","true":true}