{"101487":122941,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Giving 2 1\/2 stars seems too generous.  Should take 1\/2 a star away as symbolism for the 30 mins they should've cut from this 2 1\/2 hour slog.\\n\\nWhere to start?  Best place is probably the symbolism of Luke Skywalker immediately chucking the lightsaber over his shoulder - represents much of what this movie will be about when it comes to what they did with previous characters and plot points.\\n\\nWho's this Snoke guy?  Where did he come from?  Meh...who cares.  Get rid of him during the copy\/paste Return of the Jedi ripoff scene.  He was horrid CGI anyways.\\n\\nWho are Rey's parents?  Meh...no one important.  Nothing to see here...move along.\\n\\nLuke is now an old hermit who wants to be left alone to die.  Ok\\, ok get that the teaching of Ben Solo didn't go so well but his character now is a far cry from original trilogy.  Unrecognizable from the eager optimism he exuded then.  Maybe more time spent on his backstory from ROTJ instead of the Finn\/Rose slog would have been better here.\\n\\nSpeaking of...\\n\\nFinn\/Rose - why?  just why?  what was the point?  What a waste of time this was.  Since TFA\\, every plot point he's in starts with him trying to run away but ends up being a hero and snapping off some one-liner.  Should've let him go into the cannon at the end.  Rose...thanks for saving him so that the First Order could go in and possibly take out the rest of the Resistance.  Brilliant.  Oh yeah - how did both of these characters end up as pilots in the final battle given there's no indication they are capable of this.\\n\\nJedis can now Hologram across galaxies and go Star-Lord in space?  When did that come up?  If they could Hologram before now why haven't they?  Leia floating in space was probably the most ridiculous scene in any of these movies - prequel included.\\n\\nBrianna of Tarth The Storm Trooper?  WTF why is she even part of this?  Completely useless.\\n\\nAn armada of First Order Star Destroyers can't catch up to the space equivalent of a Honda minivan that's running out of gas to blast it away?  And this was the main plot line sadly.\\n\\nAnd last but not least.....ACKBAR?!?!?!?!?!  Come on now!  Of all characters who deserved better he's at top of the list.\\n\\nLots of lazy story-telling\\, plot holes\\, plot points and reveals that just went nowhere\\, bad and extraneous characters\\, etc\\, etc\\n\\nThink there was probably a really good 2 hour movie in here somewhere but a lot of plot points\/characters would have to be rewritten or dropped to achieve that.\\n\\nAnd sad to see the PC liberalism influence that is prevalent throughout\\n\\nGood luck with Ep IX JJ given a lot of what you set up in TFA (which was really just ANH rip off) was trashed here.  Maybe rebooting the Star Trek alternate timeline rebooting TFA rebooting ANH might do the trick.\\n\\nSeeing this franchise in Disney's hands and what they're doing with it I can only say one thing - I've got a real bad feeling about this","true":true}