{"101487":175745,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi was a colossal disappointment.  I knew I was in for a long movie when Luke tossed his Lightsaber over his shoulder.  The last scene in The Force Awakens was a dramatic cliffhanger\\, and then just like Luke chucking his Lightsaber\\, Rian Johnson chucked any direction this movie should have gone in.\\n\\nThe humor was forced and campy.  I hated the flying Leia scene and I have to believe Carrie Fisher would have too.  Poor Carrie and Mark Hamill\\, they deserved to reprise their beloved characters in such a better style than this poor script allowed.\\n\\nI liked the direction they were taking Rey.  You can see that she is conflicted and her scenes with Ren were the best in the movie.  I was kind of hoping she would go to the dark side\\, she was obviously flirting with it and I thought it would have made this movie more interesting.\\n\\nThe scene I really didn't care for was the Casino.  This scene and the rest of the movie seemed to make a mockery of Finn's character.  It was as if the director didn't know how to fit him in to this movie so he just wrote a new character (Asian lady) and sent them on a pointless mission to this planet.  They free some kept animals because the Asian lady wants to stick it to rich people.  This whole scene was dumb and full of propaganda.  I really thought it dragged the rest of the movie down.\\n\\nI liked the final scene.  It was remniscent of the battle on Hoth\\, so maybe because it had undertones of an actual Star Wars movie is the reason I liked it.  \\n\\nI would say that diehard fans are not going to like this movie.  It lacks the continuity and \\\"feel\\\" of Star Wars.  If you see it as a casual consumer of Star Wars\\, it is entertaining enough.  Just not up to par with SW legacy.","true":true}