{"101487":182942,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the first Star Wars movie that made me not care what happens in the next movie.  There is an obvious feminist and political agenda by Kathleen Kennedy and Rian Johnson.  The movie ignores or dismisses plot points from the previous movie The Force Awakens.  This is Social Justice Wars.  It is not Star Wars.  Mark Hamill is not Luke Skywalker.  He even said so.  He may regret voicing his concerns because of pressure from Disney\\, but those are his true feelings.  He did not act like the character Luke.  I do not blame him because he was just following the script.  I blame the director Rian Johnson who was chosen by Kathleen Kennedy.  She also made the decision to have the Expanded Universe as non-canon.  Therefore\\, she can now have her team of mostly women write new stories that can be different from the past.  I have been a fan since 1977\\, but from now on\\, I will no longer see Star Wars movies in the theater.  Rey is a Mary Sue character who needed little to no training to become a Jedi.  The female characters in this movie are the heroes.  Finn wanted to sacrifice himself to save everyone\\, but was stopped by the Asian woman Rose.  However\\, Holdo who looked ridiculous with purple hair and a gown when she is supposed to be leading the Resistance\\, decides to not tell her plan to Poe and then sacrifices herself by flying her ship into the First Order's ship.  Some critics are wannabe filmmakers who want to be liked by Disney.  This is the worst Star Wars movie of all time.  There will never be a Star Wars movie better than The Empire Strikes Back.  Critics should stop comparing their garbage Social Justice Wars movies to that.  I have no problem with diversity and female empowerment\\, but not male disempowerment.  If you disagree with Social Justice Warrior movies and the desecration of the Star Wars legacy and male characters from the original trilogy\\, then I highly recommend that you do not pay to see this movie in theaters or any other Star Wars movie produced by Disney.","true":true}