{"101487":183247,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is truely the worst star wars movie ever (after watching this one even episode I seems to be solid work:\\n\\n- The star wars movies had always a serious tone (with a pinch of humour). This one has wrong placed overlong slapstick parts where it is impossible to take the movie seriously anymore.\\n\\n     - General hux is displayed as an idiot (especially in the first scene with poe)\\n     - The Porks are childish and shown too often\\n     - BB-8 shooting with coins and controlling an AT-ST\\n  \\n- serious plot holes (and a few of them kiling the whole canon)\\n\\n       -  how can Poe in the first scene destroy all the defense towers without being attack by thousands of \\n          tie fighter\/bombers (one should remember that there is the whole 1.order fleet assembled with a lot of star \\n          destroyer?\\n       -  how can these unbelivable slow resistance bombers even come close to the dreadnought ship?  \\n          Especially how can the last bomber release the bombs (where it takes like minutes to open the hatch to relase the bombs (a button in the cockpit to \\n          open the hatch was to difficult to implement in the ship??) and all of the fire of the first order should be\\n          concenctrated on that bomber.. \\n       -  the whole logic behind the chase does not make any sense. Why can the first order ships only travel \\n          exactly as fast as the resistance ships? Why not sending some tie fighters\/bombers to destroy \\n          them? Or just let one star destroyer make a hyperspace jump (some argue that it would kill both \\n          ships when it would jump in front of the resistance fleet\\, while crossing it during the jump. That \\n          is nonsense\\, because they could also just make 2 jumps\\, one to the side and then in front of the \\n          fleet.\\n       -  why does holdo not tell poe her plan right from the start (evakuating the raddus in cloaked transport ships to this \\n          lone planet). instead he starts a rebellion and sends finn and rose on a dangerous mission. Why can \\n          DJ help the 1.order to make some kind of anti-cloak-scan (thats really crap)?\\n       -  Why does the hyperspace jump of the raddus kill half of the 1.order fleet. If that is working. Why not \\n          killing both death stars with a remote-controlled big ship and thats it?\\n       -  The worst thing: How is Rey so strong with the force? As we learned from all of the other 6 episodes \\n          it takes years or decades to use the force with a lot of training supported by light saber training\\, \\n          meditation and so on. Even if she would be extremly strong with the force\\, she would have needed a \\n          lot of training to learn things like lightsaber fighting. Especially when she fights against the guards of \\n          snokes (and before in TFA against Kylo Ren) it feels totally wrong. Additionally she fights against \\n          Luke (one of the biggest Jedi masters ever) on Ahch-to and wins\\, without training?!? Beeing a \\n          super strong Jedi without any training kills the canon.\\n       -  Luke showing an illusion of him on crait seems at least be very far fetched for the known Jedi \\n          skills.\\n       -  Of Course Leas Mary moppins \/ Superman appearance does not fit ether to all which have been \\n          seen in terms of the force (the scence itself is ridiculous and not helping the story to any extend)\\n      -   Yoda as a Force ghost can interact with the real world...\\n\\n- Additional thoughts:\\n- The side story of Fin and Rose at the Casino does not lead anywhere and makes the film lenghty (ultimately Holdo destroys half of \\n  the fleet) .\\n- The Dialoges are bad\\n- Admiral Ackbar had deserves a better ending\\n- Snoke had gone to early (He seems to be a big badass in comparison to the ridiculus whiny duo of Kylo Ren and Hux and all the tension around him which was built up in TFA is wasted)\\n- The whole Luke plot is crap (why did he die at the end?)\\n\\nSome people are saying that this story is so new and full of twists\\, but at the end its mainly stolen from TESB and TROJ (Especially the whole crait scence is a (very bad) copy of the battle of hoth)\\nHow can fin with these old machines \/ ships come so close to the battering ham?\\n\\nThere is still a lot more\\, but I am tired of writing.\\n\\n  I thought the biggest mistake of GL was Episode I\\, but that it not true\\, it was giving star wars to Disney. They did not just make a very bad movie\\, they also killed important fundamental laws of the whole Star wars universe.","true":true}