{"101487":117137,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Don't let the visual beauty and spectacular score of this movie fool you. Even if you can ignore the SWJ minefield the plot often makes no sense and the characters actions are meaningless most of the time.  \\n\\nRey is even more of a Mary Sue than she was in TFA\\, which is not surprising coming from Rian Johnson. The entire Fin\/Rose side quest was pointless and actually takes you out of the movie - it felt like they just needed something for those 2 characters to do in the movie - I guess that's what happens when you cast for diversity instead of writing interesting characters. Regarding Rose; she is the new Jar Jar Binks of Star Wars and I truly hope she doesn't come back for Episode 9. As a side-note\\, I live in Japan and let me tell you\\, you have to look pretty freaking hard to find an Asian woman THAT unattractive. I think this choice was deliberate and meant to please the frumpy dumpy feminists whose own bodies can also be loosely described as a bag of water. Of course Luke was ruined too\\, Johnson couldn't resist doing that could he. I could get on board with Luke having given up on life\\, but the way he was written was like a broken old coward that needed Mary Sue's help to get his life back together. And what the hell is up with the farting walrus titty-milk scene... not cool. The movie tries to have a plot about generational shift\\, sweeping away the old and bringing in the new - this could have been an interesting plot\\, but that theme gets lost with all the gender\/race politics stuffed in the movie. \\n\\nDoes Disney want their movies to be re-watchable in the future? This SJW era is a phase... it will pass\\, and when it does we will look back at these movies and roll our eyes\\, because no one is going to care about or watch to watch 2017 politics a decade from now.","true":true}