{"101487":170181,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi is an excellent storytelling movie and character development piece without many big battle scenes but some key scenes moving forward in the Star Wars franchise. With how much I loved The Force Awakens I had high hopes coming into this movie and it delivered for me. I can see why there are so many mixed reviews on this movie and why the impact of this movie might not have actually sunken into peoples brains yet but after a second and third viewing people will understand the beauty of this film. For starters the directing for this film is on point Rian Johnson shoots the film perfectly and puts the right amount of suspense in there and develops the plot wonderfully\\, he also has written an amazing script for this movie. The way the characters developed in this movie is all from the script plus some A grade performances worth mentioning. For starters Mark Hamill and Carrie Fisher reprise their roles phenomenally. At the beginning when I saw the way they were approaching the character of Luke I thought he would annoy me but the way they played him as kind of an asshole and how they show his eyes being opened to helping Rey is greatly done. Daisy Ridley is great once again in this movie being the main character and future of the Star Wars franchise she shines as she should. Oscar Isaac was a great character as Poe Dameron I loved this character and the way Isaac portrayed the risk taking Poe. John Boyega as Finn was excellent once again the only thing is his chemistry with his partner the whole film wasn't there and I found it way too awkward leading to the most awkward cinema kiss I have witnessed. Also the part where they are on that rich planet is boring and pointless they could've easily cut that part for a better movie. Domhnall Gleeson is a very pointless character as General Hux as I feel like if we removed him completely the film wouldn't hurt one bit. The main villain was too hyped up from The Force Awakens as well he let me down in this movie. But overall if you didn't enjoy The Last Jedi the first time I beg you to give it another try and forget the few flaws and really focus on the plot and character development in this movie that just works so well and sets up the last chapter with ease.","true":true}