{"101487":127436,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(HEAVY SPOILERS)\\n\\nI'm very conflicted about this movie. It had aspects that made it stand out from the rest of the series and others that are irredeemable. Overall\\, The Last Jedi was a let down.\\n\\nI hardly know where to begin with the embarrassing cons of this film. If anywhere\\, I would have to start with the blatant plot holes that Disney didn't even attempt to cover up. Who is Snoke? What was his motivation? I've been trying to stay optimistic and choose to view him as a stepping stone for Kylo Ren's character development in becoming the \\\"ultimate villain\\\" but even that falls flat. In fact\\, Snoke's death was the only unpredictable event in the entire movie\\, not even being a good surprise. Huge let down. Kylo Ren's entire character is built on angst and edginess\\, he hardly has any reason to be a villain other than Luke attempting to kill him in his sleep because he \\\"saw darkness inside him.\\\" Speaking of Luke\\, what the hell happened? The Luke Skywalker in the original films was bold and motivated. He had character. The only way the Luke in this movie is similar to the Luke I knew is that they were both played by Mark Hamill. The only person I saw living on that island was a fool that played the role of the strict master Jedi. Rey's parents were REALLY just assholes that abandoned her on Jakku? Pathetic. This plot must have been written by children. None of the characters are likable\\, and the plot is just a poorly executed and unoriginal mashup up episodes 4\\, 5\\, and 6. Don't even get me started on the slapstick humor that the writers attempted to use to redeem the film.\\n\\nEven though there were many outstanding flaws in the film\\, there were parts that I enjoyed. The battle sequences and visuals were spectacular (Which obviously is where the $200 million budget went)\\, and even if it's a lazy technique\\, they did a good job using nostalgia. It was refreshing to see Yoda and Luke again\\, and the soundtrack was very reminiscent of the original films. The Last Jedi was a huge flop\\, but it definitely wasn't as bad as Attack of the Clones.","true":true}