{"101487":170212,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars the last jedi is completely different to all the previous star wars and star wars the force awakens. In one way I think that this is what star wars needed\\, it needed something original and something new and exciting something that fans hadn't seen before. This achieved this goal but it also ignored everything that they had built up from the previous film. Many of the characters are built and developed on but the questions that we had for the characters and the plot were just ignored.\\n\\nHowever\\, despite disappointing many of the viewers with the plot this film does not disappoint with it's imigary. It is a masterpiece to watch there are such beautiful scenes and the way they use it is just amazing. \\n\\nThe imigary was perfect in many aspects but it was ruined then by the messy plot. Some characters had such a good story such as rey and luke \\, then others had what was supposed to be a good story were just brushed over and it felt as if it was just there to add the characters in. A great example of this was finns mission to disable the tracker. They failed and there was no need for this at all it was pointless and just didn't seem to add anything. In some ways I like the plot because it adds to that originality and doesn't copy the originals but still gives hints to the empire strikes back. \\n\\nThe jokes for me didn't add a lot either and I felt that they ruined the overall feal for the film. The trailers showed this darker film one which was built on a serious note and that is what got many of us excited. The forced jokes destroyed this completely it wasn't needed\\, the movie tried to make us feel as though a lot was at stake. The destruction of the rebellion but also the turning of Ben solo. The jokes ruined this for me it added nothing and felt forced\\, I will admit some were good and added that humour to the film but most felt forced. \\n\\nOverall I think that this is definitely something to go watch even though it's not the best star wars but it also is in my opinion the best sequel we could have asked for.","true":true}