{"101487":192667,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Very weak dialogue.  Everyone says exactly what they are thinking.  Characters are used repeatedly to explain things they would already know or that they wouldn't be explaining at this time\/place.  \\n\\nThe plot is a contrived\\, patched together mess.  I guess the plot is the escape?  But a ship can just jump to light speed and they are gone\\, right?  Well\\, if we have a magic dohickey\\, we can follow them.  But they can't just keep jumping\\, right?  Well\\, actually they are going to run out of gas...if you have to patch together a plot with this much mumbo jumbo (and that's not all of it!)\\, maybe you should figure out another plot?\\n\\nCharacters.  Ruined\\, every single one.  Weak writing\\, terrible acting and poor directing weigh down every character to the point where they are simplistic imitations of themselves that a freshman in high school might write on his first attempt.  Even Snoke\\, who really had some heft\\, was easily thrown aside to make room for forced connections between other characters.\\n\\nother rants:\\nThere's gravity in space?  wtf?  You don't have to get 2001 a space odyssey realistic\\, but come on.\\nEvery single person in charge of anything is an idiot.  Why is this? \\\"I run the fleet...like a 9 year old.\\\"  I'm pretty sure people should have said that about 20 times through the course of the movie.\\nSomeone uses the Force to...fly\\, you might say or something like it.  wtf?  \\nI don't mind comedic moments\\, but the whole movie? Get wrecked.\\n\\npro (which has a con)\\nThere is this pretty good fight scene between these cartoon like buffoons in red armor (power rangers wtf?) and two force wielders...who didn't use the force.  Pretty sure if you can take a weapon from another force user WITH THE FORCE\\, you can probably take a weapon from Power Rangers.  Zero use of the force when it actually matters.  The fighting was choreographed reasonably well\\, had they not been force users.  \\n\\nI keep waiting for the good Star Wars movie....*sigh*","true":true}