{"101487":181953,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-29","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is a very polarizing Star Wars film. Easily the most polarizing of all of the Star Wars films to date. I understand why some people may dislike this installment but I actually really liked this movie. That said while I liked the movie overall thats not to say it was perfect or that it didn't have some aspects that really annoyed me.\\n\\nThe Good\\n\\nOne of the problems I saw with the Force Awakens was that it was simply a remake of A New Hope. I wanted to see something different and on that front The Last Jedi delivers spectacularly. For decades we have heard of Sith and dark side followers overthrow their master and take their place\\, but for all the talk (Sidious v Plagueis\\, Vader v. Sidious) we never actually see it unfold on screen...until now. In a brilliant stroke we finally see a dark side apprentice kill his master and take his place. Also Rey grows in this film and develops into a very likable relatable character who is looking for guidance. She finds it and develops into a strong protagonist. Also the reviews saying she is a Mary Sue miss the point by a country mile. A Mary Sue is someone who achieves success in all things simply by trying or by virtue of her own amazingness. Rey never actually achieves anything\\, indeed she fails is literally everything she sets out to do. Moreover all the talk about her learning the Force without a teacher seems to miss that most of her training with Luke happens offscreen (which was probably a poor idea) but read up and you will see that its true. So she did in fact go through the training even if we don't get much of the montage of it like we did with Luke. Also speaking of Luke\\, he was always prone to acting out in anger and has some dark side in him (see his hacking Vader out of anger before he catches himself; see also his force choking guards in Jabbas palace). Luke makes a bad decision and it costs him dearly\\, and we now find him disheveled\\,  depressed\\, and in solitude. That said he comes out of solitude to perform the greatest feat in the history of the Jedi Order in an amazing scene that atones for his mistake. Finally\\, although this is in the bad\\, the critics of Reys story arc decision\\, fail to realize that almost literally every line out of Kylo Rens mouth is a lie...so his whole trope about Rey's parents being nobodies is demonstrably false (we see them flying away in a space ship in The Force Awakens for petes sake\\, so yes he is obviously lying about Reys parents). Also the antagonist is supposed to lie and deceive. Since when do we trust a dark side user?\\n\\nThe Bad\\n\\nThe casino plot that makes up almost a 1\/3 of the movie is completely pointless. Moreover\\, it makes zero sense and utilizes the weakest character seen in the entire saga. The plot here has a gaping hole where Holdo dumbfoundedly refuses to disclose her plans and it causes the destruction of the Resistance that she then tries to pin on Poe. That makes no sense whatsoever. All she had to do is tell someone and the Resistance escapes easily. Also Snoke for being a Dark Side master goes down just a tad easily. Finally\\, and the worst point of all was that the movie harps on feminism and tries too hard to make the movie about females strength by making all men in the movie seem dumb. Thats a terrible way to tell a story and the people mad about that have every right to be mad about it. Its just unnecessary. Greatness isn't forged at the expense of friends and allies rather its is built through their support. Finally the way the movie ends makes it difficult to plan the plot forward. All of that said\\, I will wait to see the final product before I judge on that front.\\n\\nThe Ugly\\nI never though Star Wars could make me dislike a character more than Jar Jar Binks...but congratulations Disney\\, with Rose and Holdo you do just that. Holdo is an abomination of millennial ultrafeminist selfishness and shortsightedness. I found myself hoping the character would die because i couldn't take another minute of her smugness. Then there is Rose\\, who is well intentioned and probably a good person but just comes across as whiny and plastic even in her well intentioned passions - certainly not something to base an entire subplot on. To have 1\/3 of the movie built around her naive crusade was rather annoying and eyerolling.   \\n\\nOverall\\, overlooking the Rose and Holdo plots\\, its a solid installment with some groundbreaking ideas and brilliant moments. While the story arc suffers a bit\\, I will wait to see how they wrap it all up. For a stand alone chapter\\, as long as it is tied up right\\, this is a solid installment with a chance to be great.\\n\\n(All that said\\, no way on earth would I entrust an entire saga to Rian Johnson even if this individual installment is ok)","true":true}