{"101487":187226,"Last Jedi":"Last Jedi","2017-12-15":"2018-09-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was written and directed by one guy and it feels that\\, like the prequels\\, no one else's input was considered. Unlike the prequels however that were overcrafted out of love this one feels like a lazy first draft that was rushed before the deadline. I'll give you an example:\\n\\nThe main action in this movie is that the First Order can track the resistance through hyperspace. Even though we've seen several cannon ways of accomplishing this like homing becons\\, embedded spies\\, or detection by a powerful force users\\, tech wiz Fin and newcomer Rose not only simultaneously deduce that it is a new technology\\, but also which ship it is on where it is located on that ship and how to disable it. That's just bad story telling that could be fixed easily. Have Holdo quarantine Fin in the brig because of the possibility he is a spy sending a signal back to the First Order. While Poe escorts Fin back he recounts a memory that \\\"He thought was only trooper scuttlebutt\\\"\\, that a super technology was being developed that could track through hyperspace. Poe allows Fin and Rose to \\\"overpower\\\" him steal a skiff and go on their crazy adventure.  I just accomplished many things that the movie didn't. I actually created a situation where Poe actually acted impulsively on bad data rather than because its the only logical alternative to dying\\, gave a reason for Holdo doubting Poe and not sharing her plan with him\\, respected Fin's character arc from the last movie\\, gave Holdo's character some depth as a beleaguered commander making tough calls in a desperate situation\\, and closed a glaring plot hole in the film. \\n\\nI'm not saying that my solution is great film story telling and if you thought for a while you could probably think of a better cooler way to fix the story but I hope it shows you how deeply confusing and disjointed the story telling was. There are dozens of examples.\\n\\nWhy did the resistance ships have no fuel? The capital ships weren't deployed in the Force Awakens and their literally just leaving HQ. They should be amply fueled and supplied.\\n \\nHow were the first order able to mount such an overwhelming attack immediately after the route in the first movie?\\n\\nWhy did Fin and Rose park on the Beach?\\n\\nWhy was Holdo unaware of a ship leaving her fleet and jumping to light speed?\\n\\nWhy did Poe abandon the attack on the cannon if it was clear that the resistance would die if the cannon wasn't destroyed?\\n\\nWhy did Luke disappear? How did he know where to send his projection?\\n\\nWhy did the First Order not attack with a swarm of tie fighters once the resistance was down to one crippled capitol ship? \\n\\nWhy did Hux recall Ren because the capital ships couldn't cover him? We didn't see them covering him before.\\n\\nWhy wasn't Snoke aware of the new super tech that was on his personal Flag Ship?\\n\\nHow did Phasma survive? and for that matter why wasn't she executed for high treason?  \\n\\nWhy is Rey so good with a light saber that she can fight off a whole squadron of Praetorian guard?\\n\\nHow did Fin and Rose get back to the base?\\n \\nWhy didn't Hux scramble tie fighters when an X-wing flew towards his ship in ATTACK MODE? \\n\\nIf Rey stole Snoke's personal craft why was she on the Falcon? wouldn't the support of two ships be better than just one?  \\n\\nAll these problems are the result of laziness in story telling and all the fan service in the world won't fix that.","true":true}