{"101487":193148,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Waking up today after seeing the movie last night felt like waking up the morning after your favorite football team loses the Super Bowl. As a long time Star Wars fan\\, I was looking forward to this movie like no other. The Force Awakens really excited me for the potential of the franchise. However\\, the i left the theater very dissapointed. the critis ratings are a sham in my opinion. They must be bought by Disney. After all Disney owns almost all of Hollywood now\\, so who will oppose them?? I can sum up the movie in one sentecne - Kathleen Kennedy\\, Rian Johnson and Lucasfilm took a big sledgehammer and basicaly \\\"decimated\\\" the entire world George Lucas created in the last 40 years. Its basicaly saying \\\"screw you\\\" to the fans and redefining the entire frnachise. Some may like that..but I dont. On the film side\\, I hear that Johnson was a genius\\, and that there are possible Oscar performances. Really? The story was terrible. It lacked any meaningful exposition\\, there were plot holes galore\\, very little character development\\, and the film overall lacked cohesion. There were too many things going on at once. Canto Bight was a waste. DJ was a waste. The acting was sub par. I can understand why Mark Hamill \\\"fundamentally disagreed\\\" with Johnson's interpretation of Luke. And as bad as that was- he was the best actor in the film alongside Andy Serkis. It was the longest and most meaningless Star Wars movie ever. I have no interest in where the story goes next and think that Disney and Lucasfilm are overindulging in their hubris to tell their own version of Star Wars. Just as a side note- I like The Force Awakens much better. I saw it twice in the theater. It was paced much better\\, and felt more like a Star Wars movie. Can't say the same for this one. I never want to see it again. This is Star Wars according to Rian Johnson and Kathleen Kennedy. It may be new but new isn't always better.","true":true}