{"101487":133270,"Last Jedi":"Last Jedi","2017-12-15":"2018-09-07","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I had a blast at this movie! I really liked The Force Awakens\\, it's callbacks an mirroring of A New Hope worked in my opinion. I thought it was a brilliant way to regain the trust of the Star Wars audience and get it's feet before re-starting the franchise. My caveat to that is that I didn't want episode eight to do the same thing. And it didn't! It went in a very different direction\\, save for a couple of small things. I loved Luke's arc. He has the strongest character in the film\\, and Mark Hamill did such a stellar job. The last scene that he's in is wonderfully shot\\, and an excellent tribute to the series\\, while also holding up on it's own. The relationship between Rey and Kylo was fascinating and compelling\\, I can't wait to see where that goes. Other than that\\, the movie had a lot of plot problems. Some SPOILERS here\\, so skip ahead if you need to\\, but why did any of Finn's stuff happen? Like what was accomplished other than a Cloud City reference? He goes to get a guy\\, doesn't get the guy\\, and then he's got a girlfriend when he gets back. Woooooo. Oh boy. Why didn't Laura Dern tell anyone that she had a plan? Seems like some needless conflict that only exists for the audience. Hey\\, what's Chewbacca up to? Porgs I guess. Why didn't you-know-who show up to talk to Luke before Rey left? That woulda been helpful probably. Buuuuut\\, I'm mostly nitpicking here really. While most of these things could have worked better in another draft of the script\\, ultimately they were meant to tie into the film's greater theme of failure. Which is appropriate for the middle entry of a trilogy. Just hope they do more with Poe next time. I god damn love Oscar Issac so much.","true":true}