{"101487":174482,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The first time I watched this movie\\, I went home feeling stale and disappointed. A lot of fans did so as well. The internet has plenty of opinions if you want to see for yourself. I certainly wasn't disappointed in the well-crafted battle scenes\\, the humor\\, or even the porgs. I was worried about the story and where this franchise was heading. It's still a Star Wars movie\\, but not in the way anyone would expect it to be. There is a terrible rift between the ratings of critics and fans (check it out on Rotten Tomatoes) and it's obvious as to why. Fans of the Star Wars franchise didn't get what they wanted (that's what the Force Awakens was for) but The Last Jedi gives fans what they need: change. C'mon now\\, we can't expect to be told the same story in different ways anymore. Critics understand this best. As much as we love the past films\\, it is time to let the past die\\, especially if we expect more Star Wars films. This movie was perhaps the greatest marketing strategy exercised by Star Wars and the bold direction it is taking isn't being received well\\, at least for now. I didn't recognize this movie for what it was at first. Then I watched it a second time. It's almost like accepting the death of a loved one. At first\\, you are in denial and your emotions are unstable. As time passes though\\, and you revisit that same death with a new perspective\\, you become willing to let the past go and you realize that life still goes on. That's exactly what this movie does. Perhaps my favorite aspect of this movie is that each character in this movie shows that they have imperfections and don't always make the right decisions. In reality\\, we try to make the best decisions at times but the outcome isn't what we always anticipate. That's how life goes. Star Wars has now done the same\\, and it's beautiful. The franchise is moving on. It's time what we did so as well.\\n\\nI can't wait to watch it a third time. A time where I don't have to wrestle with it anymore\\, but accept and enjoy it. Which is what Star Wars is all about. Enjoyment.","true":true}