{"101487":178573,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There should be a zero star option because that is what this movie deserves.  There is nothing decent about it.  The many flaws of the movie have been brought out in the many reviews so far\\, so I will try to mention some that aren't so prominently discussed.\\n\\nBut just a preface.  I am not ridiculing this movie because it destroyed the Star Wars of my youth.  I am ridiculing this movie because it is awful\\, pure and simple.  Even if this movie did not have the Star Wars name to it\\, it would be bad.\\n\\nI can deal with major characters dying off\\, with Force projections and surviving in space (both ideas from the EU).  But the execution in this movie was terrible.  So were all the unsurvivable scenes in which characters selectively survived.  Too many big explosions and impossibilities.  Of course\\, there are these type of moments in most movies and you have to just let it slide\\, but this movie made it a continuous conveyor belt of absurdity.  TLJ is just a regular \\\"blockbuster\\\" %$%# of a movie.  The saga has died\\, the story is over.  \\n\\nNo one even tried.  disney has shown its true colors after giving us hope with its first two releases that it wouldn't destroy Star Wars.  Now its done it in one fell sweep.  To put it in Star Wars terms\\, we've just experienced Episode III\\, there is a dark pall over the universe.  Help us George Lucas\\, you're our only hope.\\n\\nThere are just three planets that we see in this movie\\, I believe.  Two are entirely earth-like and don't fit into the Star Wars universe.  The third is some weird salt planet which is not an entirely bad idea\\, but needing to have that cringe-worthy explanation of what it was by having a resistance soldier taste is was absurd.  \\n\\nSimilarly\\, the dialogue.  With the disney movies\\, american language has been creeping in.  In TLJ\\, its completely out of control.  We aren't in the Star Wars universe anymore.\\n\\nForce mopping child?  Playing with Luke Skywalker dolls?  Get lost disney!  Last movie\\, Rey and Finn weren't even sure if Luke Skywalker was real.  How do children who are slaves and cut off from reality know the whole story?  Its only a few days after the events of the first movie.  And now this kid can control the Force without any knowledge of it or training? Darth Vader was supposed to be the baddest guy.  In the end Palpatine was the real man with the plan.  Anakin\\, still though\\, was supposed to be the Chosen One.  Turned out the Chosen One was really his son Luke.  We don't need bigger and badder baddies each movie.  We don't need Rey's that can do anything with no training or even knowledge that she has the Force.  Or kids that can already control it.  We just need the goddamn story.\\n\\nStar Wars was never a science fiction film.  It was a sage set in space.  No character ever cared about the technology or mentioned it. It was just a given\\, normal life.  disney has turned it into a run of the mill zombie fest.  A \\\"bigger car crash\\\" movie.\\n\\nThere are hundreds of other flaws with the movie.  Many of them are listed in these reviews and other audience reviews on other sites.\\n\\nThe scene where Snoke died had potential to be good\\, but in the end was a let down because the tension between Rey and Ren just faded away unsatisfyingly.  \\n\\nThe only bit I liked was when Chewie dropped Rey off at Snoke's ship then jumped away.  So there was about 5 seconds of good in this movie.\\n\\nAnother fault of this movie was that Rey and Chewie had zero chemistry.  She spent was little time he was in the movie just ordered him around like a butler.\\n\\nI could go on\\, but I don't have all night.","true":true}