{"101487":169388,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers Ahead:\\n\\nOk where to start. The movie completely disregards the entire story arc previously set up. The acting from most of the supporting cast was pathetic even Del Toro who is widely considered one of the greatest actors of our time. He reminded me of Daffy Duck pulling a heist. Domhall Gleeson was playing a roll in Monty Python and the Last Jedi. I was embarrassed for his performance. The writer couldn't figure out what to do with most of the characters so they just stayed in the same place the entire movie. Finn is still a Storm Trooper running away\\, Po is still trying to blow stuff up\\, and Rey is trying to find out who she is. Then all of sudden none of that matters because everything we learned was important in the previous movie was set up for nothing. The movie is silly\\, slapstick comedy that reminds me of 1950's animation with wacky characters doing wacky things all over the place and I'm supposed to take certain scenes serious when I just watched a 8 breasted opera singer that looks like something from who framed roger rabbit get run over by a giant horse looking thing while she bellows out. So many plot points are left unresolved\\, and arguably the biggest protagonist in Star Wars history is killed with little to no thought\\, like he never even mattered in the first place. Princess Leia flying through dead space like some kind of wizard was just ridiculous. Luke was a new hope\\, now he's a useless Dope! Everything that Star Wars has always been was undone in this movie. Mark Hamill was more Joker than Luke Skywalker. You can pretend all you want that people are just upset that the Skywalker story is ending\\, that's only a small portion of the complaints. Real movie fans went to see a Star Wars movie and we ended up with something along the lines of Tomorrowland meets Mickey mouse club house! Just look to the closing scene for the answer. Oh and I almost forgot to mention Kermit the Frog..er Yoda...","true":true}