{"101487":194768,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Went into this movie after a star wars movie marathon excited to see it\\, left feeling super disappointed and not sure of the future of the star wars movie universe if Rain Johnson remains at the helm of storytelling. The movie had beautiful cinematography but the story was really lacking depth. I appreciate the humor in the star wars movies but in TLJ but I think more restraint was needed than the every other line we got in this. I really dislike how we are expected to believe Rey knows how to use a lightsaber\\, the force\\, etc all the while not being trained an only receiving 3 short lessons from Luke...I think there are training academies\/apprentices for a reason yet the audience is expected to believe Rey just \\\"knows\\\" how to use the force without training. In addition Rain throws away the whole notion of Reys mysterious background by just giving us the simple answer that her parents are essentially nobodies. Princess Leah superman stunt of flying through space was laughable. I thought the final scene of Luke projecting himself to Krait was cool\\, but don't get why Rain decided to kill him off at the end of the movie. In addition I think that Rain did Luke Skywalker a disservice with his story arc  portraying Luke as a disillusioned on hermit. I give it 1 out of 5 stars for cinematography alone. I hope that JJ  is able to salvage something out of this horrible addition to the star wars franchise for episode 9.","true":true}