{"101487":158802,"Last Jedi":"Last Jedi","2017-12-15":"2018-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Oh dear.  From a story perspective this film was weak...  The only tension was waiting (and waiting) for something epic to happen\\, and this soon turned to epic disappointment when nothing did.  They pulled a lot of surprises in this film - like the untimely death of Snoke - but these weren't enough by themselves to make the film exciting and there really was nothing else.  The SFX fell flat for me too - they tried too hard to be \\\"bigger and better\\\" than previous SW works\\, without any coherent reason for being so.  Some of the battle scenes didn't even make sense\\, like the Resistance bombers that relied on (non existent) gravity to deploy their payload and the unreasonable damage that was done to an entire fleet by what looked like a simple ramming maneuver.  When it came to character interest\\, things got even worse - the writers treated the old characters with utter contempt (Luke and Leia turned into bit players and a joke) and the new characters with complete indifference (Rey just stood around for most of the film or followed Luke on his island like a lost lamb\\, Poe and Finn did the sum total of nothing).  The only memorable character from this film was the annoying asian lady and that was for all the wrong reasons.  She was this movie's Jar Jar for sure.  In fact the entire Poe\/Finn\/Asian Lady subplot should have been thrown in the bin and replaced with more focus on the interplay between Kylo and Rey\\, which was the only interesting part of this story.  I won't cover the politics angle because everything has already been said\\, but suffice it to say\\, turning a film called \\\"Star Wars\\\" into an anti-war film was a pretty dumb thing to do.  Sorry\\, but after watching TLJ I walked out of the cinema thinking that Star Wars is done.  Unless Episode IX gets good audience reviews I won't even bother seeing it.","true":true}