{"101487":172683,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"That giant flushing sound you hear is Rian Johnson sending all previous Star Was movie down the toilet. What a hack job on the Star Wars mythos.  Dropping bombs in space?  It looked cool but is that even possible? Luke goes from a new hope to no hope.  Leia finally uses the force to become The Floating Dead.  (A possible AMC spin off?)  Leia and Holdo show great leadership by retreating\\, retreating\\, retreating?  Holdo condemns Po for reckless behavior in wanting to attack and then attacks all by herself and she's heroic?!? Kylo Ren continues to be a big\\, whiny baby if he doesn't get his way.  Snoke is all powerful and yet he can't sense Kylo is going to kill him?  And don't get me started on the total waste of time story line of Finn and Rose chasing after some codebreaker.  Talk about introducing a new character with no back story and yet expecting everybody to buy into it and love her. Oops\\, I forgot that you can't criticize the Rose character because then you're racist or sexist or both!   And the disrespectful humor.  Wasn't rushed intros to new characters and quippy humor a major complaint about Justice League?  But in Star Wars that's great?  Oh\\, I forgot.  Movie reviewers are in Disney's back pocket.  And the RT Fan Super Reviewers continue to walk that thin fine line between actually being a fan instead of a wannabe movie reviewer.  What's left to be said that hasn't already been stated?  What are we left with? No Han\\, no Luke\\, no Leia.  Why would anyone want to see the next movie? But people will and the movie will make money\\, money\\, money just like the latest one. J.J. is going to have to work some serious magic to fix all the garbage that Rian has dumped into the Star Wars universe.","true":true}