{"101487":147451,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I will give a brief summary of why I don't like this film. (trust me it is brief) This film had more in common with the infamously flawed prequels than Episode 7 or the original trilogy. The main plot was uninteresting\\, crafted with a sole purpose of hitting other seemingly arbitrary plot points. Being a product of the initial story concept of \\\"an essentially stationary chase scene\\\"\\, the second act does nothing but increase the film's duration. The casino planet and everything to do with it felt tacked on and meaningless. \\n  \\n  The excitement I had about this film going away from the light\/dark central theme could have been groundbreaking for the series and more true to life. In the end they chose to go right back into the same territory that has been beat to death. This felt like a move for Disney to continue making movies beyond this new trilogy without doing the real work of taking it in a new direction. Those are my major gripes with this \\\"film\\\". \\n\\n  My takeaways were this is the Crystal Skull to Raiders of the Lost Ark or any of the other Indiana Jones films for that matter. The soul of Star Wars is not present here\\, it is only a thin Star Wars crust on a hallow and generic action movie \/ blockbuster. I feel that Episode 7 retreaded old ground with purpose as J.J. Abrams knew he was introducing a whole new generation to Star Wars while also keeping the old generation interested. He respected the origins but also told a compelling story in a well crafted film. (not flawless by any stretch) Episode 8 is a disingenuous attempt at a Star Wars film full of unimportant characters that have nothing truly at stake and lazy storytelling. I believe the dividing factor for audiences is that some Star Wars fans want the franchise to mature along with them and some want it to be mostly for a new generation (ex.Transformers). I believe this installment threw out the baby with the bathwater and took pride in ignoring it's dedicated fan base who have been with the series for decades. It is wholly an outlier in the cinematic universe in which episode 7\\, Rogue One and the original Trilogy reside.","true":true}