{"101487":146128,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've watched every Star Wars movie and have enjoyed some more than others. Up until The Last Jedi\\, Empire Strikes Back & Rogue One were my favorites. I love this movie for all the reasons people dislike it. Spoilers ahead. I thought what Rian did was awesome. He took similar situations but resolved them in interesting and unexpected ways. It was a breath of fresh air amd kept me on my toes. I kept wondering what was going to happen instead of predicting 3\/4 of the movie ahead of time. I like that Rey's parents aren't some mystical or powerful people. She's nobody\\, like most of us in the real world\\, out to forge her own path. I was excited to see Leia use the force for once and thought it plausible that she could use it in that situation...it's not like she was travelling a huge distance like superman. I thought it great that Finn & Rose's planned failed. Why does every plan in this type of movie need to succeed? It ties in with what happens near the end & the fact that Poe was hot-headed and couldn't trust Holdo. He was acting rogue. Even Leia stunned him to stop his \\\"unintelligent hero\\\" behaviour. Generals in armies don't explain & give every detail to their soldiers\\, they give orders and expect them to be obeyed. Their entire plan actually made things worse for the Resistance trying to flee. Good riddance to Snoke\\, I was annoyed at the Snoke\/Palpatine mirror anyway and believe the next movie will be better if focused on Kylo. I love the fact that Luc actually showed a moment of weakness towards Ben\\, which he feels ashamed of. I also see & understand his new attitude and observations about the Jedi & the Force. I thought the last battle between him & Kylo was great. I get so tired of these big last battles between the \\\"good\\\" & \\\"bad\\\" guys. He accomplished his goal without lifting his sword or using violence. My only gripe was I found the pace slowed a little in the middle. Otherwise\\, this turned out to be one of my favorite Star Wars films. The fighting sequences had a brutal\\, hard edge to them and included a very refreshing twist with the expected \\\"lightsaber\\\" fight. The visuals were stunning. I enjoyed the humour. Many parts I felt were very touching emotionally and I loved the journeys of the characters and how their journey's didn't really go how they expected. I will definitely see this again and highly recommend it to people that are tired of the same old stuff and looking for something refreshing.","true":true}