{"101487":164726,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Reasons I hated it:\\n\\nIt ignores or butchers every pre-existing character except for Kylo Ren (who they did some interesting things with). \\n\\n-Rey? Let's just give her clunky exposition for the whole movie and say exactly what she's feeling at all times. Subtlety? I'm confused\\, what is that? Are you interested in her development as a character? Whoops\\, sorry! You just get to watch her try to turn Kylo cuz he seemed nice in the 3 conversations they had. And she keeps making the island caretakers angry by nearly killing them--shenanigans! Are you interested in her development as a Jedi? Whoops! She doesn't learn anything! Are you interested in her backstory and motivation? Haha\\, don't be so basic.we just want her to kill time long enough to then do the stupidest thing possible so she can wave her lightsaber around again. Also\\, she sees herself in a mirror.\\n\\n-Finn? Let's ignore the chemistry he had with Rey and instead pair him with a girl whose only characteristics are: resistance-hero fangirl\\, sad sister\\, and usedtobepoor. And let's go ahead and send the two of them off on a journey that seems ill-conceived (why not just clear it with Hodo or whatever the purple-haired dead-faced woman was named?)\\, and then turns out to be\\, well\\, ill-conceived. And pointless. And let's not forget--Finn wants nothing to do with the First Order or the Resistance in Force Awakens. He only cares about Rey. But here? Nah. He's all about heroism cuz some random girl calls him one. He apparently only cares about Rey until another pretty girl looks at him.\\n\\n-Poe? While he didn't have a ton of characterization in TFA\\, he at least was a likeable dude. I've never hated a character more than I hated him in this movie. What an idiot. His arc is what exactly? \\\"I learned that sometimes I shouldn't mutiny b\/c leaders tend to know more than I do\\\"? And for some reason\\, after holding her at gunpoint and endangering the lives of everyone on the ship\\, Holdo still \\\"likes him\\\"? WHAT\\n\\n-Luke? More exposition. More of the \\\"master lying to the apprentice\\\" trope. More of the force doing things we didn't know it could do. No sooner had I attempted to get comfortable with the idea that the force can somehow allow someone to withstand that many laser blasts by ATATs than they revealed that he was never there and was doing something that seems even more ludicrous. (While we're on the subject\\, how terrible are Kylo and Leia at the force that they mistake Luke's force presence for his corporeal body? Leia makes a bit more sense\\, b\/c Luke still somehow manages to touch her??? Even though Kylo can't touch him????? And why did he die exactly? Was it that Kylo sliced his spirit in half? Was it the effort of that force exertion? I don't know\\, and frankly I don't care.) And what's going on with that standoff\\, anyway? How do they keep ending up so far apart after they were just within lightsaber reach of one another?\\n\\nThis movie relies so heavily on the characterization done by previous movies that it's absurd. But I don't know how much of the past characterizations are supposed to still be relevant\\, b\/c Johnson just completely discards so many of the previously existing characters\\, plotlines\\, themes. No one is who they were in every movie before this one.\\n\\n-Plot? First\\, the plot from the previous movie is just plain s**t upon. Interested in Snoke b\/c they set him up to be the main villain? You were wrong to\\, he's dead. Interested in Rey's parents b\/c they were set up to be important to the plot and to the main character? You were wrong to\\, they're nobody. Interested in how the ACTUAL main villain\\, Kylo\\, got to be this way? Don't be\\, Luke sort of tried to kill him but also didn't it was a misunderstanding stop asking. What about the Knights of Ren? Nvm\\, they don't exist\\, get lost. Those weren't small plot points\\, those were the entire foundation of this new trilogy. \\n\\nAs for this standalone movie's plot...Jesus wept. As I said before\\, why doesn't Poe just clear this mission with Holdo? Why does Holdo refuse to explain her plan to anyone? If she had\\, she wouldn't have had a mutiny. Also\\, she has no reason NOT to explain it. And the whole subplot of Rose and Finn going off to save some horses from the bad\\, bad rich people is not only pointless in retrospect\\, but also annoying and boring while it's happening. It's so tangential that it's ridiculous. Speaking of tangential\\, remember that kid who helped Finn and Rose save those horses? He's totally a secret jedi. How exactly does the First Order realize that the Resistance is sending out cloaked ships? Benicio del Toro? How did he know that? And what's the story with shields in this new Star Wars? How come the resistance ships have them\\, but the super powerful first order doesn't appear to have any? And how come that cave totally only had one exit\\, then it totally had a second one five minutes later? Finn and Rose get jailed for a parking ticket? And if Luke was just trying to stall\\, why the heck didn't he show everyone his secret exit? Why didn't he clear the rubble in case Rey didn't show up? (Don't forget\\, of course\\, that this is an entrance he didn't actually use\/need\\, b\/c he wasn't ever there in the first place.) Oh\\, and let's have BB8 drive a tank. B\/C why not it's cute. And let's throw in a bunch of teddy bears for no plot\/character reason whatsoever. Say what you will about the ewoks\\, but they at least had an actual purpose in the story. And let's just make Chewy tangential\\, b\/c Luke doesn't care about seeing him (Where's Han\\, you walking carpet). And let's have ghost yoda show up to set fire to a tree\\, b\/c...Luke needs to burn it all down? Or he doesn't? Or he shouldn't burn it down\\, but Yoda should? Or maybe Luke just needs help?--But how does the fire help? And why does Rey not kill an unconscious Kylo Ren? And let's suddenly make ships needing \\\"gas\\\" a thing in the Star Wars universe. And let's slaughter the entire resistance but still talk about being a spark that lights the fire that will burn down the first order? \\\"We have everything we need right here.\\\" No\\, you have 20 dudes and the millenium falcon\\, you idiot. Your incompetence killed every other resistance fighter and ship. I can't imagine why no one thought you were worth rescuing. \\n\\nAnd how many last-minute deus ex machinas can we get in one movie? Everything's lost! Oh wait\\, here's Luke! Here's Rey! Here's a thief who can help us in our very own cell! Here's a thief who can help us in a ship that can get us out of here! Here's an explosion that kills everyone guarding us! Here's BB8 in a tank! Here's Rose to bump Finn out of the way of a laser cannon! Here's Finn still somehow saving her! Here's Holdo turning the ship and doing something that she should've done right when people left that would've saved every single capsule! But she still saved the important capsule with Poe and Leia! AND HERE'S LEIA COMING BACK FROM THE DEAD AND FLOATING BACK INTO THE SHIP! Even though we're going to have to kill her in the next one anyway. What drama. What profundity.\\n\\nAnd if you don't like any of that\\, don't worry! We've got jokes! Porgs chewing on wires! Porgs screaming! Porgs screaming again! Porgs looking sad while Chewy eats them! All right\\, that would've been hilarious. But he didn't eat them\\, so it's still stupid. Poe Dameron makes prank phone calls to First Order Generals!  C3P0 has a look on his face! A shiny-armored storm trooper gets called \\\"Chrome dome!\\\" Luke milks some giant breasts! BB8 takes down a baddie with rapid fire poker chips! Luke brushed dust off his shoulder! C3P0 doesn't like mutinies! Don't forget that BB8 drives a tank! THAT THING YOU THOUGHT WAS A SHIP RESEMBLING AN IRON WAS ACTUALLY JUST AN IRON! OF COURSE THERE ARE IRONS IN THE STAR WARS UNIVERSE\\, YOU IGNORANT FOOLS!\\n\\nDidn't like any of that? Don't worry\\, We've got heartfelt moments! Rey loves a psychopath! The psychopath kills another psychopath for Rey--but also for himself! Luke tells Leia he's sor--no wait\\, she interrupts him! Leia floats! Luke sees two suns and then disappears for some reason! Chewie and Luke have a lovi--no wait\\, Luke doesn't care! Luke makes small talk with R2D2! Yoda shows up and says things that Luke totally learned a long time ago but then forgot b\/c this stupid director decided it! \\n\\nDidn't like any of that? Um\\, we've got themes? Don't mutiny sometimes? Free the animals? Rich people be evil? Be nice to stablehands b\/c they can sometimes move brooms and someday probably murder you in the face? Self-sacrifice totally is worth it but sometimes not? Um. Follow the foxes?\\n\\nAnd there were themes they could've totally tackled: the death of religion\\, moral\/intellectual certainty\\, or even the morality of non-participation. You had religious texts and an old dude who hated them (but it turns out he was just being petulant). You had a moment when Snoke said that Kylo's presence would result in his polar opposite rising to meet him (extreme stances only propogate extreme stances on the other side. But it actually turns out that you should just be more extreme to combat that other extremism). Benicio del Toro wants no part of the war and says they're all equally corrupt (but nvm\\, he's just an opportunist coward--you're either part of the resistance or you're the enemy). None of this would matter if they had made a compelling\\, entertaining story\\, but they didn't. And it doesn't help that the people who like this film seem to be saying that it's \\\"more mature\\\" or something. Nope. It's actually MORE childish than the good\/evil dichotomy of the rest of the Star Wars universe. \\n\\nIf I hear one more person call this \\\"not black and white\\, but grey\\,\\\" I'm going to lose my mind. What's more \\\"good\/bad\\\" than the \\\"come to my side\\\" rhetoric of Rey and Kylo in this movie? The only \\\"grey\\\" character in here is Kylo\\, b\/c he does some good things\\, but is still mostly bad. Being conflicted isn't different from past movies in this series. It's nothing new. If Kylo and Rey had found a way to work together despite differences\\, then THAT would've been grey. But they managed cooperation for all of 3 minutes before turning on each other. Bravo.\\n\\nWhat a toxic\\, nonsensical\\, scattered\\, thin\\, hurried\\, mindless\\, soulless piece of corporate garbage. Its few moments of arresting action sequences are not worth the baggage. Complete trash.","true":true}