{"101487":158667,"Last Jedi":"Last Jedi","2017-12-15":"2019-07-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\nThings I liked about the movie. \\n\\n1. Lightsaber fight in Snokes room was pretty awesome. Good visuals and great choreography by both Ren and Rey. I love Rens more organized fighting style versus Rey's chaotic but controlled tempo.\\n\\nThings I didn't like about the movie\\n\\n1.Rose\/Finn love side plot. This by itself was the most annoying flaw in the movie. Just awful. Took up a good portion of the movie that could have been spent solidifying the main plot.\\n\\n2. You can't drop bombs in space. What made it worse was Johnson afterwards trying to backtrack and make an explanation for that. \\n\\n3. Introducing Laura Derns character only to kill her off immediately. Mainly I'm annoyed that they couldn't let a droid do the suicide mission of have FREAKING AUTOPILOT!!!!!\\n\\n4. Tactical incompetence of the First Order. Getting past the whole \\, \\\" we can't go to warp because the engine is broke so we're just gonna go fast enough to stay out of their tie fighter range\\\" \\, why doesn't the first order just send a bunch of other battle cruisers ahead of the rebel ship and ambush them. Geez was I really the only one who couldn't understand this. The rebel ship would have been the First Orders number 1 priority so you mean to tell me they can't spare some other ships to finish the rebels off. The Nazis were absolutely evil but even they weren't that incompetent.\\n\\nNOW THE ISSUES THAT REALLY ANNOYED ME.\\n\\n5. No back story for Snoke. We deserved a back story on Snoke. All of our fan theories (my personal one was that he was Plageus) could have been wrong but we at least deserved a back story. Dude just doesn't get to be that strong with the force and we don't anything about him. \\n\\n6. Snoke dying so easily. Some emo punk like Kyle Ren\\, WHO ONLY JUST RECENTLY WAS GETTING HIS BUTT WHOOPED BY SNOKE\\, uses the force to turn a lightsaber on and cut Snoke in half. How in this world was Snoke not able to detect this? \\n\\n7. Rey's parentage or at least explanation of her power. Maybe they are waiting for the next movie to explain this but giving us some lame scene with her in an ice cave was just distasteful. \\n\\n8. Leia flying through space after the bridge is attacked. Yes I know that Leia is force sensitive as well but come on. The blast should have killed her (which I would have been fine with and almost preferred as it would have really made Kylo go full dark side) but it doesn't and despite the fact that she doesn't immediately freeze to death in space\\, she force pulls herself back into the ship. Johnson really butchered that. \\n\\n9. Luke being a sissy. Mark Hamill even had a problem with this ad well as most of the script. Luke went from being one of the toughest Jedi ever to being a depressed wimp who couldn't handle the stresses of teaching which is what powerful Jedi are supposed to do. Yeah Kylo turned but you get back at it and try to fix it. Geez he was so whiny in this movie. That's not a grab at Hamills acting but the character writing. \\n\\n10. THIS IS MY FINAL AND BIGGEST ANNOYANCE. It's kinda of a continuation of #9.\\n\\nWe didn't get to see a seasoned Luke absolutely shred some first order bad guys\\, the Knights of Ren (who have still pretty much been a no show)\\, or even Snoke which would have been fitting. No we get to see him force ghost fight Ren in the lamest lightsaber dual of the entire franchise. Luke is the probably one of the strongest Jedis in history and we didn't get to see the full display of his power over the force. They could have killed him off this way by him taking on like a hundred baddies with him taking most of them down or even all of them and just being to spent to go on with life( similar to Obi Wan). But No. We get wimpy Luke and this was real kick in the nads to all of the old fans. \\n\\n Disney has a real chance to build on all the plot devices set up by TFA but they absolutely squashed it here. I hold Johnson and Kathleen Kennedy responsible for this hot garbage. I'm gonna get called a disgruntled fanboy who doesn't like change for my review but here's what I say to those who say that. You probably also thing episode II was a great movie as well or either didn't watch the episode I through VI and have no clue to the backstory of Star Wars and how everything plays out.  This movie only made a billion dollars because it has the Star Wars name on it and they showed it in China. \\n\\nTo JJ Abrams. Please for the love of God fix all this in the Rise of Skywalker. TFA was awesome with you at the helm. Please help us JJ Abrams. Your our only hope. ( People who like this movie probably have no idea what that reference is to)","true":true}