{"101487":162423,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Plz no more Rian Johnson Star Wars films. TLJ was so bad I had to make a RT account to vent on this BS sorry a$$ excuse for a SW film! Whoever wrote this script probably hasn't read up on any Star Wars lore in their life! There was so much squandered potential its embarrassing! This movie made the prequels look epically awesome at this point... So much wrong with this movie where to begin?? 1. Too much comedy! First Order is more like a circus full of clowns running the show. Palpatines gotta be flipping his F'ing grave! 2. Who the fuck is Snoke?! Why troll us?! 3. Reys parents?! Trolled again! 4. Luke was just a whining POS 5. Worst Yoda of the century award goes to TLJ... might as well replaced him with a Muppet 6. Give Leia an umbrella and you can't tell the difference between her and Mary Poppins. Seriously why kill all the plot potential from episode 7. Fuck was the point of an episode 8 then? TLJ was more like one of the side story movies then one that's part of the main saga. All in all thanks for the epic 2 year wait to troll us this hard Disney! Stick to Marvel. I've seen YouTube fan made endings better than this entire movie! Also gotta reiterate that the amount of comedy in this movie was horrific. Paid for Star WARS and got a Adam Sandler type movie... Fail! Good luck JJ Abrams at mopping up this shit fest of a movie. Rian fucked Star Wars on epic proportions like M knight Shyamalan fucked The Last Airbender. GG! RIP star wars! ","true":true}