{"101487":121318,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First of all I must say I admire the director for taking some risks with this film. The director aimed to bring the unexpected and he truelly succeeded.\\n\\nBut honestly the thing I utterly despise about this film which I do deem unforgivable is the absolute poor right and the care for continuity.  First of all this whole trilogy so far is built on the devaluation of the achievements the protagonists in the original trilogy. Bringing balance to the force\\, destroying the empire and eatablishing the empire all of this is destroyed by the sequels with a lack of grace and divinity. The film continues this trend with the First Order (FO) taking over the galaxy and destroying the galaxy in what seems like 5 minutes. Luke the character who saw good in one of the most evil people in the galaxy had his character butchered in this film.\\n\\nThe side story for Fin was poorly wrote and felt completely out of space in this film (pardon the pun). There was a good opportunity to close Fins story arc in an emotional way but this was ruined by riduculous act of \\\"heroism\\\" it was stupid. Smoke the character who restored the Empire and the manipulator of Kylo Ren one of the most powerful force uses is thrown away like an old rug with no given backstory. It is a complete and utter waste of potential\\, but I can see why it was done.\\n\\nThis film also is drawn back by it's humor. Most of it wasn't funny and it took the emotion out of this film. It also made the film too marval like and Disney like. It could work if these films were stand alone but they aren't they are a part of an already established franchise with an established tone. I don't mind a bit of humour but this film should have been darker. It needed to be for the trilogy to advance. \\n\\nFinal points I would like to make is Phasma was severely under used and completely weak. Rey is still a Mary Sue. (If she wasn't over powered I would like her character). For some reason I can't explain Leia turns into Marry Popins instead of having here character killed off in a much needed way. I could go on and on. I will say that Hamille\\, Fisher\\, Riddley and Isaac did some good acting along with Kylo Ren's actor (sorry forgot his name and I'm in a bit of a rush.)\\n\\nI Don't know what the reviewers are talkibg about the film lacks substance and it's writing is rubbish I would rank it on par with the Phantom Menice. As a stand alone film I would rate it 60% as a Star Wars film I rate it 20% (and that's being generous.","true":true}