{"101487":136850,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm one of THOSE people who created an account just to vent about how disappointing this movie was. The zero-sum game mentality in terms of deciding which generation should be served is a disgrace. Here's a hint: you can make good movies for both younger AND older folks AT THE SAME TIME; THAT'S WHAT THE STAR WARS TRILOGY DID. \\n\\nFilmmakers: get over yourselves and do some market research before and while you turn these drafts into films. There are so many minor fixes that are easy and obvious if you'd check your egos and ask beforehand. That's what bothers me the most: you could get a team of filmmakers and fans together and work through leading a consensus good final trilogy plan and scripts instead of owning a divisive and\\, ultimately\\, forgettable one. \\n\\nAs much as I still enjoy Marvel\\, I'm never intentionally giving Disney any of my money ever again. I may be 40\\, but I have a buttload of disposable income and I'm still immature in some ways. I'm not even a superfan and I have a Han Solo frozen in carbonite business card case and shower curtain. I have plenty of other places to spend my would-be Star Wars money for the next 40 years until I'm cold and dead\\, like this franchise.\\n\\nMark and Luke: your legacy hasn't been tarnished. Keep speaking the truth about these movies. For those\\, like me\\, who are from the generations that launched and sustained Star Wars\\, we know how the Force works: they've struck you down\\, but our memories will always be more powerful than they could possibly imagine.","true":true}