{"94533":"94415","UD":"UD","2015-09-30":"2016-04-22","8":5.0,"História espetacular\\, ótimos gráficos\\, porém a movimentação dos personagens não é boa e o jogo é totalmente linear. Apesar dos problemas é um grande jogo.":"¿Película interactiva o Juego casual?\r\rCuando alguien me pregunta que  *#$%\\\"& es Until Dawn es la interrogante de mi título la que se viene a mi cabeza y no me hes fácil de contestar\\, ya sea la persona no entiende los conceptos o porque yo mismo no tengo la claridad de como clasificarlo.\r\\n\r\\nLa historia es el clásico thriller de terror de los 80s-90s que llenaban las salas de los cines\\,¿Película interactiva o Juego casual?\r\rCuando alguien me pregunta que  *#$%\\\"& es Until Dawn es la interrogante de mi título la que se viene a mi cabeza y no me hes fácil de contestar\\, ya sea la persona no entiende los conceptos o porque yo mismo no tengo la claridad de como clasificarlo.\r\rLa historia es el clásico thriller de terror de los 80s-90s que llenaban las salas de los cines\\, donde los protagonistas poco importaban\\, la historia era sólo la base necesaria para introducir a la verdadera estrella \\\"El Villano\\\". Sagas como Pesadilla o Viernes 13 no son recordadas por la joven valiente que sobrevivió al final de la cinta\\, sino por el emblemático villano que será recordado como un icono de la cultura pop.\r\rUntil Dawn tiene todos estos elementos menos el más importante un villano carismático que recordaremos al final del viaje.\r\rNos presenta un buena historia donde nuestra tensión como jugadores es mantener con vida a los personajes típicos del estereotipo estadounidense.\r\rLa jugabilidad es casi nula y mi evaluación es un punto por sobre The Order porque al menos en este título los QTM (Quick Time Event) sí están bien implementados.\r\rUntil Dawn es un titulo prescindible al cual no recomiendo su compra por el precio completo\\, pero si esta la opción de conseguirlo a un muy bajo valor o prestado sería 100% válido como actividad grupal. La verdad es que es una película\\, y por lo tanto puedes disfrutarlo con tu familia o amigos.… Expand","true":true}