{"101487":161323,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Overall I liked the story and did not have a problem with the character development.  Luke's situation seemed appropriate and was a fresh take.  The new characters were good additions and the main story lines were fun and interesting.  \\n\\nHowever for being a 2 1\/2 hour Star Wars movie I was expecting more pertinent information\/development paired with a fast paced adventure similar to TFA (which also had its flaws) but found that there was quite a bit of fat which could still have been trimmed.  \\n\\nThe overall cinematic language of the film felt far too modern and very unlike Star Wars and at times the space battles felt cartoonish.  I found the tone of the movie to be far too silly for my taste\\, so many fans notoriously hated on Jar Jar Binks for his childish character and he was just one character\\, this movie gave almost every character a chance to be Jar Jar\\, and honestly I am not someone who hates Jar Jar.  \\n\\nThe deconstruction of the Star Wars universe and its various tropes is something which could be very interesting if done using the existing cinematic language of the saga however in this case I don't feel like Rian Johnson successfully achieved that.  I appreciate what Johnson was going for\\, I really do.  I look forward to seeing where the story takes us from here\\, I just really hope the visuals\\, editing\\, and story telling of future episodic movies returns to a more familiar style.  \\n\\nI am also interested to see what Rian Johnson does with his trilogy of anthology movies and I believe he will have a stronger showing taking on completely new subjects within this same universe.  May the Force be with you!","true":true}