{"101487":129276,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I already talked about this movie on my YouTube channel at TamBoTC but for rotten tomatoes not until now so here it is simplified as a short review. All the plot points set up mostly amounts to nothing in the end like Rey trying to help kylo turn to the light side but it doesn't happen just ends with the same results it started with allot of that goes on with various plot points. For every potentially good thing I found in movie like spoiler alert fin trying to save the rest of the rebels by sacrificing himself ends with a dumb. Contradictory line from rose because she quotes what fin was exactly doing in that moment.the movie has set pieces and at least kylo Ren was a good character even though his motivations are out the window but that and more can't hold up the entirety of the film. I felt the same with alien covenant with good actors and good cinematography but under development to both characters and story that amounts to various flaws in film. Funny there is a quote about failure in this movie on learning from it but the quote falls apart when you realize no one is actually learning from it in the end. I ironically found that this movie quoted allot of it's own flaws funny enough. This film just won't age well with it's story doesn't come out as a timeless story. You will have fun with the movie but that ain't saying much campared to the same thing I could say for a Michael bay transformers film. I watched this a total of 2 times and I already felt that I was sick of it and wouldn't watch it again. Sorry this did come out longer than thought but I can n take questions over on my channel thanks for reading this if you have the patience.","true":true}