{"94533":"94254","UD":"UD","2015-09-30":"2019-07-01","8":8.0,"História espetacular\\, ótimos gráficos\\, porém a movimentação dos personagens não é boa e o jogo é totalmente linear. Apesar dos problemas é um grande jogo.":"For anyone who may not know this is a decision based interactive game which also has some gameplay which is mostly quick time events and also a little bit of aiming\/firing. I would recommend this as a must play or must buy for anyone with a ps4 for many reasons. The first is the quality of the title. I found the story and design interesting throughout which motivated me to continue. At noFor anyone who may not know this is a decision based interactive game which also has some gameplay which is mostly quick time events and also a little bit of aiming\/firing. I would recommend this as a must play or must buy for anyone with a ps4 for many reasons. The first is the quality of the title. I found the story and design interesting throughout which motivated me to continue. At no point was I bored and I credit this to the breakaway rotation of the characters you play. Essentially play until a mistake or the chapter ends. In the case of a gameplay mistake the game just cuts away to another character and you play that character for a while. I really enjoyed how this not only limited boredom and frustration but also boosted interest in what the consequences of the mistake was going to be. Secondly the gameplay is for anyone. Kids to seniors honestly could play this. It's scary but not too scary\\, gameplay is hard enough without being too hard nor is it too easy to be insulting. A nice mix was achieved and I presume the reaction times for this determination were determined during a tutorial test. Third\\, the game is inexpensive considering its quality and gameplay duration especially since you can replay chapters after the game is over or just start a new game from the beginning. The most important reason though to try this game is that I just can't see many interactive games being developed with such love. In the bonus footage one actor suggests interactive games will be the wave of the future. I strongly disagree. In my opinion only several ideas will make strong decision based games and horror is probably the number one formula for it to succeed in. If true the games have a limited source to tap. Thinking about that the game are cliche\\, will unlikely go blockbuster and from there the industry will likely shy away from making these games with a lot of resources. Luckily I feel this is the game that went all in and crafted a unique game to showcase the genre. In turn I feel this will be the epic peak of this genre as I just can't see many interactive games being better made than this. I just can't see how one can improve upon this game other than directly tying it to a sequel or more. But for what it is this is a very highly rated game for your first experience of this type of game and I give thumbs up for every aspect of its development. Very cheap entertainment imo.… Expand","true":true}