{"101487":97324,"Last Jedi":"Last Jedi","2017-12-15":"2018-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A 2 star rating mostly visuals and music\\, but all the rest like characters\\, side plots a many\\, the horrible treatment of Luke's character. The very slow pace and we'll pretty boring plot were bad. I would only watch out of curiosity if you get the movie for free or a second hand store. Do not buy from official places\\, I would say even pirate this movie. There were things I liked in it like the star wars force stuff but no good Jedi fights snoke getting taken donlwn like a punk. Ugh was horrible\\, they built him up and let me down. Frustrated most at Luke's treatment\\, he's the answer to all the Jedi and bringing balance to the force. Not a crotchety old man that drinks himself dumb. He's never been the anti hero\\, he's the light side of the force. The best of the Jedi. But nope they put it all on Mary Sue Rey to solve all the problems. \\n\\nOh yeah I forgot also how they treated Lea in the movie too. She gets killed and blown out into space and literally force saves herself. Last I remember she never had that kind of training\\, she literally Deus ex machinas herself to the ship. I was like what? Is this really happening? I had to laugh at what I was watching. It's supposed to be dramatic and tense but no it comes off as absolutely ridiculous. \\n\\nOver all I didn't like it didn't hate it but didn't like it either. If your interested pirate it or watch it on a streaming site or get it from the 2 dollar bin at a second hand store.","true":true}