{"101487":138267,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Instead of building on lore\\, characters\\, foreshadowing\\, and plot devices established by prior Star Wars movies -- including the most recent installment: 'The Force Awakens'\\, writer\/director Rian Johnson takes the franchise on an abrupt left turn. Stories and plotlines that fans have long been awaiting to see are literally tossed aside in crass one-liners almost to the point of cruelty. There is a reason this film has outraged and angered long term fans of the franchise... and it is obvious from the resultant first encounter between Rey and Luke... Rian's treatment of the franchise\\, it's stalwart characters and lore\\, is mirrored in what happens in the follow-up to the scene set up by JJ Abrams in 'The Force Awakens'. Through a series of pointless twisting sub-plots and agonizing laugh-lines that punctuate odd moments where tension should be building to give the movie's more serious moments credence\\, we are shown what Rian thinks of franchise fans who take the film too seriously - it's all pointless and available to be burnt down in a moment. In the end that's all this movie gives back to long term fans - a scorched franchise with precious little to cherish\\, remember or care for anymore. A giant middle finger to fans that truly feels like Rian has gone out of his way to troll us\\, the long term fans. There is more to say but without getting into spoilers there is no point... just like this movie.","true":true}