{"101487":136945,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm sad to say I actually created an account JUST to give this movie a bad review. What a pitty\\, I love the franchise. I actually wanted to give this movie more than a 1 star review because I love the franchise to much but  I feel I need to rate the movie based on its merit not based on the amazing quality of the franchise itself. \\n\\n\\nFirst of all\\, i think the writers gave us a big middle finger by not not giving us any true back story for Snoke. There were all kinds of fan theories around\\, high interest\\, wanting to know who he was and what he was all about and we got nothing\\, not the slightest bit of background and an unceremonious over-simplistic death. Super lame... \\n\\nAlso\\, Luke's role in the entire movie was incredibly lame. You built the episode 7 around the quest for Luke\\, then we find him\\, and nothing\\, he's just an old hermit full of doubt and regret and frankly pathetic. His acts as a distraction for Kylo for about 15 minutes so the rebels can get away... And let's not just breeze by the fact that the rebels walked like 15 miles through a cavern to escape... in 15 minutes. How is it no one thought to reality-check that concept? It's hard to suspend disbelief when you just throw garbage like that in our faces. Totally pulls us out of the movie experience. And this wasn't the one offense... Apparently people fan breath in space all of the sudden. (ie the bomber scene where the girl releases the bombs and the bomb-bay doors are wide open below her. No force field\\, nothing. Also.. apparently there is gravity in space too\\, as the bombs drop down as if deployed from an airplane.\\n\\n\\nSo much of this was garbage... So very disappointing. You guys should be fined for ruining an American icon.","true":true}