{"101487":131140,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't recommend this film for Star Wars fans or if you appreciate the essential art of storytelling and character development in films.  The new Hollywood trend of stepping all over the past to make room for younger actors and liberal identity politics does not serve the franchise well.  The film was filled with predictable cliche liberal progressive issues and went out of its way to portray all the male characters as weak\\, clumsy\\, hot-tempered malcontents compared to the cool\\, collected\\, wise female characters (all in leadership positions over men).  The villians were all white and male while the protaganists were female and ethnically diverse.  There are many plot holes and needless sub-plots that don't contribute to the story.  This was disappointing. \\n\\n[SPOILER ALERT]  The writers and director treat Luke Skywalker with derision.  It's clear they had no real understanding of the major characters and their respective backstories.  The film requires a complete suspension of disbelief to make any sense. How was Rey able to take on a legion of elite Sith fighters with no training whatsoever and leave with just a scratch on her arm?  Somehow Rey (millenial extraordinaire) beats Luke Skywalker (Jedi Master) into submission\\, standing over him with a lightsaber as he pleads for mercy?\\n\\nRian Johnson won't be taken seriously again. Kathleen Kennedy has an agenda and should be fired. Don't believe me? Look up the NY Times article\\, \\\"The Women Who Run the 'Star Wars' Universe\\\" and read for yourself. Rian\\, Kathleen and other female-only writers at LucasFilms collaborated in secret to incorporate liberal feminist ideals and values into the script. The writing group prioritized weaving in these references over and above basic storytelling and character development. Rian is a tool. Maybe he had no choice but still.","true":true}