{"101487":121308,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First of all\\, I didn't hate the movie\\, but it was not good.  I went to see it twice just to be sure that it I wasn't the problem. So\\, the movie felt like a long ride with a less that stellar payoff.  Let's start with what I liked about the movie...I like that the story expanded beyond the Skywalker famiy story and I like the development of Kylo Ren into a legitimate bad ass villain. Daisy Ridley's performance was great as well and the new character Rose was strong.  The head fakes in the movie were great if rest of the story line was lacking and was uninteresting. So here is what i saw as the low points of the movie\\,  Luke's life of a hermit story was overly long\\, Leia\\,Poe\\, Finn and the rest of the gang had stories that seemed to just give them something to do to move the story along\\, which felt forced and not a necessary component to the story telling. Too many attempts to be humorous were distracting and fell flat on their face.  The Disco Glitter Leia Force flying through space was just stupid.  I won't even go into the bad use of Maz Kanata.  I went to see it twice to make sure that the problem wasn't me and I wasn't being a fan boy snob.  After the second viewing I heard some folks say they thought the movies sucked\\, so between that and the audience score here on Rotten Tomatoes\\, I see a number of folks are like \\\"meh\\\" about The Last Jedi.  I hope the Han movie and Episode IX are better to make up for this mess.","true":true}