{"101487":137938,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Indisputably the worst (non-animated) Star Wars movie of all time.  This movie fails on virtually every level.  Not only does the plot appear to have been written by a 5-year old\\, but it also makes the audience hate many high-ranking characters for being so stupid.\\nThe story also drags during the scenes with Rey and Skywalker.\\n\\nSpoilers below.\\nA large premise of the movie involves a super long chase scene (a day or two) in sublight speeds with the entire first order armada and The Resistance.  The resistance sends a ship out to get help and then warp back.  This is one of the major plot holes in the movie\\, as why couldn't The First Order just send half their armada ahead and cut them off?\\nThe entire concept of the bombers is bad.\\nThe entire concept of their best fighter pilot being such a loose cannon that he's useless makes you wonder why he still even has a job.\\nThe Admiral refusing to tell literally anyone her plan\\, even though there's no possible harm in telling people and telling people the plan would give them hope and prevent them from making rash decisions was an idiotic story bit that should never have existed.\\nThe idea that hyperdrive engines could be used as a superweapon breaks the entire universe\\, as droid-manned kamikaze ships would absolutely be a thing if that was as easy as this movie makes it.\\nWhen someone is about to sacrifice themselves\\, ID4-style to save the entire Resistance\\, YOU LET THEM DO IT.\\nLuke Skywalker's death was pointless and left me screaming\\, \\\"BUT WHY DID THAT KILL HIM!\\\"","true":true}