{"101487":149269,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"La peor peli de star wars. Aqui estan sus errores:\\nEsta pelicula (ep8) para mi fue una de las peores. Hay muchas razones por las que digo esto. Va mas alla de los personajes\\, la trama misma de la pelicula es malisima y llena de errores. PUNTO 1: Luke. El es un personaje muy querido por los fans\\, por eso la gente en general no le gusto su cambio. Pero lo voy a enfocar desde un punto mas tecnico que sentimental. Desde mi punto de vista el cambio que experimenta Luke es por el intento de asesinato a ben solo. Pero cuanto mas lo pienso menos sentido tiene para mi. Luke en el ep 6 perdona a vader (un lord sith que ya habia asesinado a mucha gente) y hasta se niega a matarlo. Pero aqui intenta matar a SU SOBRINO por algo que no paso. Ese no es el luke que yo conozco. Y aun peor\\, en lugar de intentar remediar su error\\, se va a esconderse sin que le importe nada (osea vamos\\, en el ep5 luke corre a por sus amigos. pero aqui simplemente los abandona y los deja morir. TODA la galaxia estaba en peligro y a el no le importa). PUNTO 2: La trama de la persecusion a la resistencia. Porfavor\\, si un par de cazas destruyeron el puente ¿Por que no enviar mas?. Los destructores normales son MUCHO mas rapidos que la nave gigante de snoke\\, podrian haber alcanzado a la resistencia sin problemas. O la primera orden podria haber enviado destructores desde otro punto de la galaxia para que intercepten a la resistencia (sinceramente no creo que TODA la primera orden estuviera persiguiendo a la resistencia\\, seguro tenian mas naves). PUNTO 3: Los poderes en la fuerza: mire una explicacion de ese poder de clon de luke en otro canal\\, pero me sigue pareciendo fuera de lugar. Mi principal queja es el poder de Snoke de jugar con ray como si de un jugete se tratase. La levanta\\, la manda para alla\\, y luego para aqui y la sube y la baja y pareciera que estuviera moviendo una pluma. Osea\\, si mover a una persona es tan facil ¿Porque sidious no lo uso con luke o vader? Y si snoke es tan poderoso\\, porque murio a los 5 minutos de aparecer. PUNTO 4: Los chistes. Yo creo que se pasaron\\, osea hay demasiados chistes. Unos pocos (como los que hay en rouge one con K2ESO) esta bien. Pero cuando pones tantos ya no molan. Se sienten fuera de la peli (osea los guardianes del templo solo estan para hacer chistes con ray\\, y encima los chistes son del calibre de un niño de 5 años: caidas golpes y ect). Pero esta es solo mi opinion\\, si has llegado aqui te doy las gracias por leer mi discurso. Que sepan que respeto la opinion de todos y les deseeo un buen dia","true":false}