{"101487":100090,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After watching the last Jedi i had to go watch Rogue one to just see how completely awful TLJ really is. It not only is a terrible movie but a disaster of Star wars movie.  The meaningless plot is so bad.  The more meaningless sub plots even worse. I actually had to create an account because this Star wars was stupid. Who allowed this Guy to write and direct this Movie? Poor mark Hamil.  I could write an entire thesis on how awful this was. Luke skywalkers pointless sham of death gone to the wind.  Flying leia?? Mindless ridiculous dribble of a movie that needs $800  million to break even. Disney should have just donated $800 million to help world hunger instead of producing such trash. The movie is a scam a fraud a mega disaster. The characters are worthless!!! Just to try and not be jaded I rewatched Rogue one and thought what an amazing movie. Great plot. wonderful characters you instantly like. Id have rather had every TLJ character die. Rian Johnson should never be allowed to make a movie ever again. Fans should go to his house and just rip it apart.  The movies dialogue is so bad this film would work better as a silent movie.  How could someone with hundreds of million of dollars for a budget make such total garbage??? Its as if the only reason the movie was made was to destroy star wars in every way possible. I actually thought this has to be some sort of terrible publicity stunt and the real Last jedi will come out a little bit later.  This isnt even a good stand alone movie. In comparison Rogue One is beyond fantastic has all the elements Star wars fans would love and appreciate. Im not sure why the money or Time was even wasted making this Film. POE FINN Rose are totally not even likable characters. Luke is a bitter twisted old man loser???  Did Rian purposely sabotage this film?  That is the only explanation i can come up with for such a monumental cinema disaster but Disney Only cares about Money and not Art. This movie needs to go right to online streamed for free on youtube its so bad.  Spaceballs is 100%better.  Ive seen better Stand alone star trek the next gen TV episodes. This movie is devoid of all moral value.. Kill the past is the theme??? kylo Ren would have been better off killing himself.  I read one review where someone said they felt like their \\\"whole child hood was stolen that is an understatement....\\\" Did any even read the script before this was made..What is going on???   The whole world needs to have a Jedi temple Book burning with all the Disney Star wars Crap and show these people the fans displeasure in the absurd insult to any viewers intelligence.","true":true}