{"101487":119066,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Everything Wrong\\n1. Too fucking CHEESY!!!  \\n2. There were too many cut aways during each scene\\, which didn't allow some of the important scenes to properly build up to the climax\\, specifically the one in Snoke's chamber.\\n3. Overall there were not enough scenes with Snoke and they did not give enough backstory to the character in order to show the characters strength. \\n4. Fin's adventure with the new girl and the half drunk seemed to have little importance and a bit all of over the place\\, making it last too long. \\n5. Admiral Holdo was just annoying and made the Poe scenes hard to watch. Also having her not states her original plans to Poe and everyone else dragged out the scenes with the whole resistance group on the ship.\\n6. Those little tiny fur balls.\\n\\nEverything Great\\n1. All the scenes with Rey were amazing. \\n      a. Luke teaching her the ways of the force. \\n      b. Her and Kylo Ren communicating through the force and sympathizing with each other brought a twist to how the story could play out and gives IX a lot of potential. \\n      c. Her shooting shit with the millennium falcon is always fun to watch.  \\n      d. The fight scene with her and Kylo was dope as fuck. \\n2. Luke doing some crazy shit with the force in the \\\"fight\\\" with Kylo to save the resistance survivors was sick and a perfect way to send Luke off.\\n3. Yoda coming back to teach Luke again was a great scene.","true":true}