{"101487":147487,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I will start by saying Star Wars the Last Jedi isn't that bad of a movie to deserve a 5.5 but also it is not a movie deserving of a 9 or higher score.\\n\\nThat been said let me start putting the things that i liked first and then i will put the ones i disliked.\\n\\nLIKES:\\n\\n*The whole interaction between Kylo Ren and Rey via of a Force bond where she was trying to make him see the good while he was trying to make her join him. It really helped in flesh out both characters.\\n\\n*Luke conversation with Yoda was really a nice thing. Interesting enough was the fact that Yoda was able to interact with the world either by making a lighting strike the tree or by hiting Luke in the head with his cane.\\n\\n*The duel between Kylo and Rey against Snoke guards was really good. Amazing coreography.\\n\\n*Luke's display of Force mastery by the end.\\n\\n*The little kid using the Force to pull a broom at the end.\\n\\nDISLIKES\\n\\n*The MAIN PLOT of the movie is pretty much ridiculous: it is a stupid chase at subluminal speed because the Republic flagship can't hit hiperspace more than once for lack of fuel and because they First Order ships found a way to tail them in FLT flight. \\nHowever WHY not even one of the several First Order ship's captains had the simple idea of making a short hiperspace jump to the position where the fleet trying to slowly  run away was?????\\n\\n* Why didn't Vice Admiral Holdo share her plan to go to the Crait planet while using the Republic flagship as bait to allow escape ships to hid in the planet?\\nInstead she acts like a huge @sshole demanding blind obedience. \\nSure chastize Poe for acting out of line but at least share with all the Officers and pilots giving their lives for the fight what your plan was. Had she done then perhaps half of said officers and fighters wouldn't had joined a motim against her.\\n\\n*Luke's death by the end was really stupid\\, why not finish that scene with just him looking at the Sun? Really unnecessary death\\, feels like the director was just trying to make some CHEAP shock value.\\n\\n*Snoke is a joke. All powerfull but can't realize Kylo is actually going to kill him instead of Rey? That feel like a really \\\"screw you\\\" directed at JJ Abrams by Riam.\\n\\n*Really bad explanation to all the foreshadowing Abrams did in SW TFA about Rey's parents. Again \\\"another screw\\\" you moment from Riam to JJ Abrams.\\n\\n\\nAll in all STAR WARS THE LAST JEDI is a movie that has it's really good moments amid a lot of fat in the story and really bad resolutions to mysteries from the previous movie.\\n\\n\\nIt deserves a 7.5. A good movie but it could have been a LOT BETTER.","true":true}