{"101487":180854,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This Film does violence to the Star Wars Franchise.\\n\\nBad storytelling:\\nThe plot is very weak. The devices used to move the plot along were not believable or realistic. Plot devices were conjured up to suit any requirement without skill or creative integration with the story or the world setting. A 'slow car chase' in space where one ship is running out of fuel? All ships have equally matched speed to prolong the chase? The resistance being tracked by the first order and nobody considers a mole or a tracking device? Instead they surmise some heretofore unheard of technology. The resistance fleet doesn't scatter defensively (go in separate directions). Luke left a map to his location and when people arrive he doesn't want to be found. Finn and Rose almost squander the side mission by being thrown in prison on account of a parking violation?! Finn and Rose walk all the way back to the resistance base on the salt planet without explanation.\\n\\nCharacters and direction were poorly executed. Luke Skywalker's character starkly contrasted previous films. The former hero is now a comedy piece and a coward. These changes are not earned. Luke momentary consider's murdering his own nephew after glimpsing part of the dark side in him?!  Rey (without training) beat's luke skywalker in a duel! Rey appears to be a Mary Sue. Her powers with the force are unreasonably advanced and she has many other powerful skills. Po is portrayed as a childish fool by means of very shallow character interactions and exaggerated drama. Holdo and Leia are made to look wise\\, not on their own merrits\\, but by contrasting them to foolish Po. A very shallow depiction of these characters. Leia uses the force in a powerful\\, never before seen way to fly through space unaided... Finn and the new character Rose have no chemistry and their actions do nothing to further the plot although they seem to be made out as important characters and have some kind of weird love story going on.\\n\\nBad for Star Wars\\nThe use of comedy (which seems to have been borrowed from the Marvel films) is very out of touch with Star Wars and detracts from the franchise.\\nLuke Skywalker's character treatment is so pathetic that it's sad to watch.\\nThe style of movie featured mostly passive protagonists (the plot developed independently of character actions). Star wars tends to feature heroes\\, hero's journey arcs\\, adventure etc. These themes tend to use active protagonists where the character's actions lead to meaningful plot developments.\\nOveruse of subversion. Rather than selectively using subversion for more impact\\, subversion was used constantly in this film until it became a complete mess.\\n\\nConclusion\\nThis film was bad as an episode in the series because of the total lack of consistency or consideration of previous story\\, plot and character elements.\\n\\nThis film was bad as a Star Wars film for it's damage to Star Wars icons such as Luke Skywalker\\, it's misuse of lore such as all the weird new force powers coming out of nowhere and the lack of training for Rey. It was also a bad Star Wars film for departing from the genre of hero's journey and adventure storytelling by having passive protagonists and a new style of comedy which demeans character's and the seriousness of the drama.\\n\\nThis film is a bad film - just as a film. Bad storytelling\\, bad plot\\, bad characters\/direction and a mediocre script.","true":true}