{"101487":174936,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi...A tale of two screenings\\n\\nThe Last Jedi is divisive...even my opinions across two viewings are divided!\\n\\nViewing 1>Release week: I walked out of Last Jedi and I didn't know who to think. I literally didn't know if I liked it or disliked it. I thought it looked good but something about the story left me seriously disoriented. As I continued to think on the movie...the more I disliked it...I mean really disliked it. There wasn't a scene\\, piece of dialog\\, anything that I didn't have a problem with. Last Jedi was just \\\"all wrong\\\". I hated Luke's story the most\\, the hero of the Rebellion was a complete farce who gave up. Ugh\\, the whole thing was a mess.\\n\\nSo I waited a month and I decided to see Last Jedi again...after all I had seen Phantom Menace a few times in the theatre and Phantom Menace is pretty disappointing.\\n\\nSo I sat down and watched last Jedi again. I was about half way through the movie when I realized I was actually enjoying myself. Everything seemed to \\\"snap\\\" into place. Walked out the second time and I said to myself \\\"I get it\\\". \\n\\nUntil I started to think about it again. I think the biggest issue with the movie is the \\\"directly after\\\" timeframe. The viewer has moved on\\, things have happened in lives\\, we have grown and changed but you sit down with Last Jedi and you get whipped back in time and it doesn't give you any way to reconcile that. Rey is the same\\, Kylo is the same etc. etc. its a disconnect or at least it was for me. When Last Jedi comes out I will watch it again but this time watch it right after watching Force Awakens\\, which I think is the way it should be viewed...much in the same way you could watch Rogue One and then watch New Hope.","true":true}