{"101487":169559,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS!! This movie is laughably bad. Forced comedy (if you can call it that)\\, pointless plot lines that accomplish nothing both in the movie and to further the plot\\, throw away characters and weak leading men and women (and whatever snoke is). This is sci-fi right? Not just fi? Why in Yoda's name are the shots in space ARCING?!  If a ship can suicide with hyperdrive and take out huge swaths of the enemy\\, why is this the first time we've seen it? Since when\\, IN SPACE\\, does a \\\"lighter\\\" ship get to outrun a larger one? Engine size matters\\, as we saw clearly and correctly in A New Hope. Then there's the ridiculous bombers in the opening sequence. Forget the pointlessness of a bomber in SPACE relying on a gravity fed bomb chamber; if you can slowly fly your nearly defenseless bomber all the way to the weak point of the super huge bad guy ship\\, just shoot a freakin missile from far away and be done with it. How about Ren's squad taking out part of the Resistance ship with one shot while STAR DESTROYERS bombarding it have seemingly no effect. This is the whole movie. Terribly thought out everything.  Luke and a brief R2 sighting are the only halfway decent parts and they are about 10 minutes of it. It's sad really because it could have been great. Forget the dazzle of the ship battles and chase scenes and other nonsense. Most of this movie should have been dedicated to Rey coming of age as a Jedi either alongside or in spite of Luke. She also should have turned a little dark. She should have been the one to kill Snoke and then tried to but failed to kill Ren. At least there would be something to her character then. Finn\\, Poe\\, Lea\\, Hux\\, and Snoke should have been bit parts bookending the real plot.","true":true}