{"101487":152935,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Many are \\\"NOT\\\" spoiling Star Wars but many are saying they are disappointed on many ways\\, and that itself its a spoiler but my friend Cody did a great job describing this film\\, which I LOVED and thought it was incredible and fantastic in many ways!! it has its flaws but I think its a great film in the NEW Star Wars trilogy. \\\"Alright\\, now that I'm more or less awake-- here's my spoiler-free review\/thoughts on the new Star Wars: It's everything that Disney needed to make sure that the franchise will continue for a very long time to go. In my personal opinion\\, it's easily the best entry into the saga. There are high points and low points\\, and I'm not ashamed to say that I both shed a few tears and laughed hysterically. Is it the Original Trilogy? Nope. Nor should it be. Nor do I think it was ever trying to be. No\\, this is about passing a torch and putting the old guard to bed in a respectful way\\, giving the fans closure on their stories\\, so that we can follow the new cast into the future of the franchise. Don't wait to see it. Don't put it off. The things that happen in it are too big to keep from being spoiled on it. We're talking Darth Vader's \\\"I am your father\\\" level reveals\\, and people WILL ruin it for you. As for those who are nay-saying the film\\, that's fine. Everyone's entitled to their own (incorrect) opinion.  :) Some people will be contrarian just to be contrarian. Some people will put it down just to be edgy and different. Regardless\\, go and see it and appreciate it\\, if for no other reason than the fact that it is Carrie Fisher's last film\\\"","true":true}