{"101487":129366,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a life long Star Wars fan\\, and I hated this movie. I want to care about the next generation of Star Wars characters but they are not interesting and are poorly developed. \\n\\nThe Disney political correctness and social commentary on Kantu Bight sicken me. The plot overall was incoherent. The kinetic Star Wars energy is sorely lacking. Instead of high speed trench runs we got a freighter crawling through space trying to not run out of fuel. \\n\\nNot only did the creative team ax Star Wars tradition and lore but they axed the intriguing story lines from The Force Awakens.  They also took an ax to the character of Luke Skywalker and to Star Wars fans themselves.  \\n\\nLet the past die. Kill it. What a terrible theme for a movie with such a respected past. \\n\\nThis had the most boring chase scene in all of history.\\n\\nThe feminism was overt and over the top.  Disgusting.\\n\\nThis movie really had Star Wars ships running out of fuel.\\n\\nThis movie had Chewie guilted out of eating meat.\\n\\nThis movie had a black man tasered over a parking tickets and then him breaking out of jail and running over cops apparently killing them and then the black man burning down a town in essence and celebrating it because the inhabitants were rich.  Way to go Disney\\, Rian Johnson\\, Kathleen Kennedy:  using a Star Wars movie to stoke racial and class tensions in a Star Wars movie.  Makes me want to vomit.  \\n\\nI've never hated a movie until now.  I hate this movie and can't stop thinking about how much I hate it.  \\n\\nAlong with this negative review I will use my dollar votes to protest this abomination.   I will spend no more money on Star Wars after this wretched movie.  No more movie tickets\\, disks\\, greeting cards\\, toys\\, posters\\, memorabilia\\, nothing.  Not one red cent.  \\n\\nWhere does the next movie go?  Looks like French Revolution.   Rise up against male oppressors\\, against white oppressors\\, and against the rich oppressors.  \\n\\nYou sicken me Disney\\, Kathleen Kennedy\\, and Rian Johnson.","true":true}