{"101487":174683,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Good:\\nThe only reason I am giving this movie more than 1\/2 star is because it is visually one of the best movies that I have seen. Sadly\\, that is the only positive I have to say about this movie. \\nThe Bad:\\nThe plot to this movie is sloppy and unorganized. Before one problem was solved\\, they would already be on to the next scene. \\nFinn and Rose had one of the most pointless story arcs that I have ever seen in a movie\\, it accomplished nothing at all. \\nRose had very little backstory and was incredibly unimportant. \\nThe only reason that Finn and Rose got in trouble was because they parked their ship somewhere they weren't supposed to park it\\, why not just give them a ticket?\\nWAY too much imposed humor\\, it's a Sci-Fi Action movie\\, yet it was starting to feel like a partial comedy.\\nThe characters did not accomplish or move forward in their journey's. \\nRey ended up basically in the same point where she started. \\nKylo Ren is also in the same place that he started.\\nCarrie Fisher (R.I.P.) should have had an ending scene\\, and one that did her and Leia justice.\\nLaura Dern was the reason for her own mutany. \\nLuke Skywalker was not at all who he is supposed to be. Luke has always been a kind\\, caring and charismatic  character. In this movie he was selfish\\, loathsome and shockingly\\, a jerk. He was a hermit on his own island while the Galaxy was falling apart. He lied to Rey for no apparent reason\\, he also gave no reason to train her. He slipped to the dark side for a few seconds and that changed the fate of Kylo. Slipping into the dark is not like the kind Jedi Master. He had one scene where he redeemed himself only to be killed off in such a terrible way. \\nThe Confusing:\\nWhy did Snoke get killed before we learned anything about him? He was supposed to be one of the strongest force wielders in the Star Wars saga. \\nWhy were the caretakers of the island that Luke was on only show up in two scenes?\\nWhy did they NEED to bring the porgs into this movie?\\nWhy did the Millennium Falcon have a square radio dish instead of the round one?\\nWhy did only Yoda show up to Luke? Would it not have been more wise for him to take advice from his father and Obi-Wan as well?\\nWhy do we still not know for certain who Rey's parents are?\\nWill Kylo actually turn good again?\\nWhat happened to the Knights of Ren?\\nWhy was there an awkward love between Finn and Rose? Very unnecessary. \\nWhy was there no reason given for all of the new force abilities? Yoda's force ghost could redirect lightning\\, Snoke was able to link the minds of other people\\, a child was able to use the force to get a broom(something that took many years for other force users to master) \\n\\nI know not all of this was Rian Johnson's fault\\, but anyone who was not taking advice from George Lucas should not be making a movie that he originated. It changes the view of the story too much and it did not even feel remotely close to what Star Wars movie is... Was.","true":true}