{"101487":127495,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Here is the good: One epic fight scene and cool visuals. That's about it. \\n\\nOn to the bad. Such a waste of potential due to lazy writing and poor directing. Poorly timed jokes seem more like they should be in a Star Wars spoof (Space Balls anyone?) No buildup to big moments. Unlimited side plots buffet. Weird\\, boring pace. \\n\\nI like to call one of the main problems \\\"plot-twist schizophrenia\\\" - Examples (and SPOILERS) below. Just how many there are should be evidence enough that there is WAY too much going on in this film and it distracts from any real feeling of direction. \\n \\nLuke: I'll NEVER help you. K I'll help. I'm done helping after one lesson cause you're too powerful! Okay I'll help again - I'll show up for the battle. Psyche! I'm not REALLY there!\\n \\nKylo: I'm a bad dude. JK I'm good cause Luke tried to kill me. JK I'm bad and taking Ray to Snoke. JK I'm good again lets fight these fools! JK I'm bad again!\\n \\nLuke & Kylo Backstory: Kylo attacked. JK Luke attacked. JK it's somewhere in the middle and we need to rewind it three friggin times! \\n\\nRose: Hey Finn you're a hero! *2 seconds later* I'm going to taze the crap out of you\\, traitor! *2 seconds later* Hey\\, we both know tech\\, lets go on a mission together and be best friends! Hey I'm in love with you out of nowhere! \\n\\nHacker guy (not important enough to name): Hey I'm bad. JK I'll help. JK I'll betray you and disappear.","true":true}