{"101487":129379,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a lifelong Star Wars fan. Seen every single SW movie back to '77. Thank you Disney for destroying my childhood and turning the most recognizable film series in history to a PC left wing political message. The Last Jedi is so horrid\\, that to me it does not exist. So\\, if this pile of Bantha Poodoo does not exist\\, then by default The Force Awakens does not exist either. If you notice\\, all the rotten scores this shit-on-celluloid is receiving are low scores from TRUE FANS. Right when George Lucas sold Lucasfilm to Disney I thought\\, \\\"I gotta bad feeling about this.\\\" And boy was I right. I can partly understand why Luke died at the end. I wanted to die too sitting through that pile of Bantha Poodoo. I too just wanted to fade away and be one with the Force. According to the movie info on Rotten Tomatoes\\, \\\"In Lucasfilm's Star Wars: The Last Jedi\\, the Skywalker saga continues as the heroes of The Force Awakens join the galactic legends in an epic adventure that unlocks age-old mysteries of the Force and shocking revelations of the past.\\\" LOL...that's so laughable.\\\"The Skywalker saga continues\\\" well\\, not anymore. Luke is dead and Carrie Fisher is gone. Disney\\, on their mission to destroy the Skywalker saga: \\\"The circle is now complete.\\\"\\n1. Luke's death is meaningless and he dies a coward. That is not the Luke Skywalker of SW lore. He would have fought tooth and nail to either bring Ben Solo back to the good side\\, or he would have fought hard to end him. All of us TRUE fanboys have been waiting since 1983 to watch Luke wield a lightsaber and use it devastatingly. Alas\\, all we get is.....\\n2...Luke milking a space alien. WTF??\\n3. Leia \\\"Mary Poppins\\\" Organa. You do realize Mr. Johnson\\, space is a vacuum and no one can survive in it. It will suck the oxygen out of your lungs and you will FREEZE to death. And don't say \\\"force bubble\\\"\\, we as an audience and readers of the books have never even heard of ANYTHING called a \\\"force bubble\\\"\\n4. Spaceships running out of fuel?? Eight SW movies and no mention\\, NOT ONE TIME\\, of any starship running out of fuel. Give...me...a...break.\\n5. Way too much Guardians of the Galaxy humor. This felt more like a Spaceballs type movie rather than a serious Star Wars movie. \\n6. Snoke who? This was one of the burning questions left after The Force Awakens. Who is Snoke? How did he rise to power? How did he create the First Order out of the ashes of the Empire? How was he capable of seducing Ben Solo to the dark side? How did he get Sith training in the first place? I guess we'll never know since Mr. Johnson decided to kill him off halfway in the movie. \\n7. Knights of Ren? Who are they? Yes\\, the faction of dark siders who were loyal to Kylo Ren and we saw a glimpse of them in The Force Awakens....\\\"these aren't the knights you were looking for.\\\"\\n8. Rey's full name; Rey \\\"Mary Sue\\\" Nobody. This was the other burning question at the end of Force Awakens. Who are Rey's parents? Is it Han and Leia? Is she Kylo's sister? IS she a Skywalker? Is she a Kenobi? Nope\\, she's just some nobody whose parents dumped her off and sold her into slavery for drug\/alcohol money. They totally glorified Rey as they do students in school by giving her a participation trophy of Jedi Skills without earning anything.\\n9. Shirtless Kylo. Only one other time has someone gone shirtless in SW and that was in Episode III. It is not needed.\\n10. Who needs Jedi anymore? We have SJW (Space Justice Warriors) The sappy...ultra-left wing vomit is dripping hard in this movie. Men are made to look weak\\, while the women are portrayed as strong. With the death of Han and now Luke...\\\"The circle is now complete\\\"\\, there are no more white men on the side of the rebellion (good side). All the white men are on the side of the First Order (evil side). Hooray for diversity! Rey is now all of a sudden a Jedi because what\\, she meditated on a rock for about 2 minutes? That is all of the training she needs to become a Jedi? Luke was on Dagobah for months and he was still not ready to face Vader and escaped by the skin of his teeth. She is the biggest Mary Sue in the history of cinema. \\n11. Grrrl power! It started with the Force Awakens (Rey is the savior of the Galaxy\\, Leia is strong and in charge\\, and Han is portrayed as cowardly weakling who ran away)....continued with Rogue One (It was a girl who led the team to get the Death Star plans)....onto the Last Jedi (Luke\\, like Han\\, is a coward who ran away\\, Rey portrayed as a 'mary sue'\\, Admiral Holdo looks like a left wing feminist with her purple dyed hair and hatred of Poe).\\n13. Casino scene is a political jab at the 2%ers\\, yet Disney is part of the 2%ers.\\n14. First trilogy; people thought that being a Jedi was inherent to the Skywalker bloodline. Second trilogy; if you had enough midichlorians in your blood\\, you can be trained in the ways of the force. This trilogy; everyone has the potential to use the force. In other words\\, everyone gets a trophy!!\\n15. There is EXCELLENT source material in the Star Wars EU books. You should have used those.","true":true}