{"101487":151147,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Loved it. 9.5\/10. A lot to digest but here are my quick snippets (spoilers):\\n\\n-Hands-down Mark Hamill's best performance as Luke Skywalker. His complexity grows appropriately from Hope to Empire to Jedi to now this. It's not all peaches & sunshine. Shouldn't be. \\n\\n-I admire Rian Johnson for his bold approach. One thing I love is that it is sure to ruffle some longtime fans. That is good. Star Wars has been around 40 years and needs new blood. \\n\\n-Bold storytelling is what made EMPIRE great. Go back to 1980 & imagine the risk involved in taking the most successful movie in American film history and betting it all on a 3-foot puppet. It was a giant risk. I don't think that's appreciated enough today. But Frank Oz\\, Lawrence Kasdan\\, Irvin Kershner and George Lucas made a bold decision. I admire Rian Johnson & Kathleen Kennedy for keeping with that tradition.\\n\\n- I love that Rey came from nowhere. Such real truism in life. Steve Jobs was adopted\\, started in a basement and created the iPhone. The next Steve Jobs isn't Steve Jobs' daughter. It's some other hungry kid in a garage somewhere.\\n\\n-Luke's curmudgeonly ways made me uncomfortable. But where they pushed the character in his mishandling of Ben Solo's training was so great. His heroic stand is arguably the best scene of the entire series. \\n\\n-A certain cameo in this movie had me beaming with joy. Laughter. Emotion. Sheer exuberance. It was so wonderful yet completely necessary to the story. Not cheap like the prequels. And it actually rang true with life advice on so many levels. Brilliant. \\n\\n-Adam Driver arguably carries the movie. He is doing a subtle but admirable job portraying Kylo Ren in a way that is complex. I can't overstate how much I'm on board. I neither love nor hate his character. I like him even as I root against him. \\n\\n-Daisy Ridley is yet again fantastic. She pulls of the heroine role and her youthful exuberance\\, combined with the loveabke nudging or a Star Wars legend\\, is what bring Luke back to his former glory. Perfect teacher-student dynamic. \\n\\n-Thought John Boyega portrayed Finn in a much more subdued and realistic manner. He has been understandably seasoned by recent events and his reluctant hero Finn moves forward from the small issues I had in TFA. \\n\\n- Loved that Poe was a much more central figure and am excited to see him lead the Resistance going forward. The female heroine angle is a great example of how he turns the traditional hero archetype on its head. It's was beautiful on so many levels and while it felt timely and relevant\\, it didn't feel forced. Which is hard to do. \\n\\n- Overall\\, I had some small nitpicks. A couple pacing things\\, a knee jerk qualm with a 'magical' scene involving Leia that upon reflection I admire in that she gets her hero turn. She is Luke's sister and she should have powers. \\n\\n- Absolutely loved the humble-hero angle and the tone of inspiration of the down trodden. It is such a real-life truism and is beautifully captured in both major and minor characters. \\n\\n-One of the truly masterful things Rian Johnson has done here is constantly flip the story. As soon as you expect one thing\\, or get settled into something\\, he flips it on its head. It keeps you exhilarated\\, especially during the movie's climactic and thrilling second half. \\n\\n- This isn't EMPIRE\\, which is a flawless film in my view\\, but it is next-level STAR WARS. And as good as it gets to pushing the story somewhere new 40 years in. \\n\\n- Fanboys need to get a grip. I don't care where Snoke came from\\, I don't care what Rey-theory YouTube thought about it. Those people are waaaaay too into the weeds on Star Wars. They are movies. Not some nerd purge of fan theories. First and foremost is the storytelling. \\n\\nThe EU fanboys bashed 'Force Awakens' because it was too similar. Now they're bashing 'Last Jedi' because it's too different. (eyeroll) \\n\\nGirlfriends. All of you. Now.","true":true}