{"101487":187042,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was such a steaming pile of garbage that I made an account just to give it a bad rating.  Not only did it manage to spit in the face of everything that fans loved about the original Trilogy\\, it completely ignored and undermined everything that happened in The Force Awakens.\\n\\nThis movie should have been titled Star Wars:  SJW's Strike Back.  The entire dilemma of this near 3 hour long film is that Leia and crew might run out of fuel.  You might think they would just jump to hyperspace to escape danger as they always have in the films\\, but guess again.  We can thank Rian Johnson for inventing one awful plot device after another to prevent anything meaningful or exciting happening.\\n\\nEvery cliff hanger that was given to us in Force Awakens was addressed in this farce of a film.  Every unanswered question was answered in the most unsatisfying way possible.  Rey hands Luke his original lightsaber\\, his father's lightsaber that was given to him by Obi Wan\\, and Luke takes it and throws it over his shoulder like trash.  This is just the first offense of many in this film to anyone hoping to uncover the mysteries that were set up in the Force Awakens.  To me It was symbolic of Rian Johnson giving JJ Abrams and all Star Wars fans the middle finger.\\n\\nYou wanted to know who Rey's parents were?  Too bad\\, they're nobody.  THEN WHY CREATE MYSTERY AROUND HER LINEAGE IN THE FIRST PLACE.  Who is Snoke\\, why is he so strong with the Force and where did he come from?  WE'LL PROBABLY NEVER KNOW CUZ HE DIED IN THE DUMBEST WAY POSSIBLE.  Why did anybody even let this obviously super evil guy Snoke near Ben Solo in the first place?  NEVER ADDRESSED EVEN THOUGH IT'S REPEATEDLY MENTIONED OVER AND OVER.  At the end of Force Awakens Snoke tells Kylo he's going to complete his training.  PROCEEDS TO JUST TELL KYLO HE'S CRAP THE WHOLE MOVIE AND NEVER TRAINS HIM.  Kylo Ren destroys his helmet cuz Snoke tells him it's dumb.  WE ARE FORCED TO LOOK AT ADAM DRIVER SHIRTLESS AND LISTEN TO HIS OVERLY WHINY AND EMO TIRADES FOR HALF THE FILM.\\n\\nI could go on but I need to just make peace with the fact that Star Wars is dead and Rian Johnson and Kathleen Kennedy murdered this beloved franchise.  I don't know how this keeps happening with franchises like this where it seems completely idiot proof... and yet SOMEHOW THEY STILL FIND A WAY TO RUIN IT.","true":true}