{"101487":146660,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was hugely disappointed in this movie (Warning: contains spoilers)\\n\\nThere were so many failed attempts at jokes. Literally nobody in the movie theatre laughed. Pretty much everyone in this packed IMAX theatre just stayed completely silent. And that should just tell you enough about how much this movie sucked.\\n\\nIt's like they never knew what tone to go for. During most scenes I just felt bored or really confused\\, because the scenes that were supposed to be dramatic suddenly turned into a cringy joke. Like that scene where Rey hands Luke the lightsaber and he just throws it over his shoulder. It just left me so confused\\, thinking; Wait\\, were we supposed to laugh here?\\n\\nThere were just so many weird and confusing moments in this movie\\, like when Leia survived that huge explosion and then flew like Superman through space\\, or how the all-powerful Snoke didn't even sense a lightsaber moving right next to him.\\n\\nI also thought it was so disappointing that Luke is so much out of character in this movie and is just this grumpy old man who never leaves that goddamn island. And the other characters aren't really well written either and it all just resulted in me not really caring that much about them at all\\, even though I wanted to. \\n\\nAnd the porgs were not even cute\\, just super annoying.\\n\\nI do not recommend seeing this movie\\, as I now feel that Star Wars has died. R.I.P. Star Wars.","true":true}