{"101487":121423,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First - this movie is absolutely not a 1 or 2 star movie. There are some major flaws that prevent it from being a 5 star movie\\, but nothing that ruins the film in its entirety.\\n\\nThe Pros: \\n- Rey is becoming a badass and she might be my favorite character in this new trilogy.\\n- Every scene with Luke is awesome. Mark Hamill's performance is spectacular and I totally buy that Luke wants nothing to with the Jedi or the Force in general. He reluctantly trains Rey\\, and even then his heart isn't fully invested. His conversation with Yoda was one of the best scenes.\\n- The space battles were fantastic and looked amazing.\\n- The throne room scene where Rey and Kylo team up against the Praetorian guards might be the best scene overall. I was really thinking that Kylo had turned to the light side\\, so the twist worked for me. I was shocked when he revealed his ulterior motives and became more twisted as the film went on.\\n\\nThe Cons:\\n- Killing off Snoke without knowing a single thing about him. Why was he adept with the dark side of the force? How did he have so much knowledge about Luke Skywalker and Darth Vader? Why did the Emperor's theme song play when he was torturing Rey? It really felt like this was a studio decision to kill him off to make room for Kylo Ren to be the main villain instead. It was very jarring since he had already proven to be more powerful than Rey or Kylo.\\n- The Casino scenes on Canto Bight. The whole aesthetic of the casino threw me off. It just didn't look like it existed within the Star Wars universe. It looked like it belonged in The 5th Element or the Star Trek reboots.\\n- The Finn and Rose subplot just didn't work. The idea of needing a \\\"code breaker\\\" seemed like just an excuse for them to not be stuck on the main ship with Poe. Again this seemed like Disney checking off a box to cram more scenes into the movie.\\n- Benecio Del Toro's character sucked. I hated his speech impediment bit (it seemed non-genuine and like he was clearly being a \\\"character\\\"). He was completely unnecessary to the story and only served to ruin Finn and Rose's plans.\\n- Laura Dern's character also sucked. Her acting was fine\\, but her character was pointless. Why not just keep Leia in charge and give Carrie Fisher more screen time? Why give command to a character we've never seen before only to kill her off? Also her purple hair and matching purple dress seemed completely out of place on a Rebellion ship.","true":true}