{"101487":177626,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The only good thing I can say about this is that it is better than the prequels. But the prequels are some of the worst movies ever made.  \\n\\nThe plot is a tangled mess. Some mysteries posed in the Force Awakens are answered\\, and the answers suck.  Rey is nobody\\, her parents were no one interesting. She just has the Force accidentally\\, and she has powers of a Jedi master without training  or trying.  Snoke is not explained\\, just killed off in ridiculously easy fashion like Darth Maul was. Luke is petualnt and truculent refusing to help the Rebellion until he converts without explanation and.. dies?  It's not clear really\\, like much of the rest of the film.  Kylo Ren is as entertaining and interesting hormonal teenager  throwing a tantrum\\, which is what I suppose he is.  The special effects are all cgi\\, and are not at all interesting.  The \\\"humor\\\" is all camp.  \\n\\nBasically what this movie boils down to is San Francisco in space being attacked by galactic Nazis. The Rebellion is like the student body of Oberlin\\, a multi ethnic pan sexual matriarchy at war with entirely white and mostly male fascists. The Rebellion also wins one of its battles by an act of suicide\\, which I thought pretty repulsive.  Most of the characters - Rebellion and First Order - are portrayed by painfully ugly actors.  There are space penguins that are stupider than Ewoks\\, that are meant to be funny.  The little round ball droid that replaces R2 D2 Is saccharine cute and equally stupid.  \\n\\nOver all verdict: this movie is condescending\\, lazy and stupid. It is \\\"star warsy\\\" rather than Star Wars - it has the trappings\\, not the essence.  Disney has mutilated Star Wars\\, killed and left it dead in a ditch.","true":true}