{"101487":101322,"Last Jedi":"Last Jedi","2017-12-15":"2019-02-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Almost definitely the worst Star wars film ever made in my opinion. First of all possibly the worst thing about this film was the way the character of Luke Skywalker was destroyed. One of the most upbeat and optimistic characters in the franchise was deprived of all enthusiasm. It was disheartening to see such a legendary and revered character be ruined in this way. Secondly\\, the character of Rey was not developed at all and again .similar to the last film\\, experienced no hardship or difficulties to overcome. This makes her such a boring character as there is no room for her to grow as a person as she seems to be able to do everything already. Finn and Po were two of the more interesting characters of the force awakens but seem to be emasculated in this film. I feel like there were such potential for these characters however they were not done justice in this film. I don't even want to discuss the character of rose\\, the only thing I will say is that she is possibly worse than jar jar binks. Also I've never watched a Star wars film that has made the universe feel so minuscule\\, there are countless world's to explore but for some reason we are stuck in a never-ending chase which seems to be happening in slow motion. It felt like watching a tortoise and a slug have a race. On the rare occasion that our attention could be pulled away from the invigorating chase across space\\, we were then lectured on capitalism in possibly the most forced scene ever to exist. I actually had to check to make sure I had'nt walked in to a Marxist convention instead of the cinema. Kylo ren is just an extremely strange villain\\, he's not intimidating he doesn't even seem that evil I really don't understand what's happening with that character. In addition the whole idea of Luke destroying the ancient Jedi texts just seemed a bit drastic\\, a bit like setting yourself on fire because you were slightly cold. Finally\\, The whole idea of hyperspace ramming just seems to be a massive plot hole.\\nNow for some questions. Why does Princess Leia turn into space Mary Poppins and why does the admiral with pink hair not inform her crew of the masterplan which is going to save them all\\, why does she just keep it to herself? These two elements of the film are not explained to the audience and appear to make little sense. \\n\\nOverall\\, this is quite a poor film as seen by the audience backlash.","true":true}