{"101487":158288,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not the film the trailers painted it out to be\\, Disney and Lucasfilm clearly knew that what they had created was not what the fans wanted otherwise they would have shown a completely different trailer.  \\n\\nLuke is not Luke\\, even Mark Hamill said as much\\, his first moment on screen is a huge wtf moment followed by many more. I'm actually disgusted at the sheer contempt shown to him in this film. \\n\\nThe plot is threadbare at best\\, Rey is magically able to do everything without the slightest bit of training. If she were a character in any other film they would pick on that instantly. \\n\\nThey once again waste Gwendoline Christie\\, Phasma should be a terrifying presence but is reduced to two minutes of chunky dialogue and a short and wasted fight scene.\\n\\nAdmiral Holdo is reduced to looking sternly at Poe and then killed off. I would have loved to see more of Phasma and Holdo and learned more about them\\, but I guess having them in a film for five minutes and then killed off because reasons ticks the 'strong female characters' box you want the critics to look for.  \\n\\nDon't even get me started on the pointless Finn and Rose plot line which could have all been avoided if Holdo had just told Poe the plan in the first place. What a waste of Benicio Del Toro!\\n\\nMary Poppins Leia? Really? \\n\\nLazy writing\\, lazy plot\\, terrible treatment of the franchise.\\n\\nTotally heartbroken at the treatment of a franchise I have followed and loved since childhood. Yet I guess that makes me a sexist racist too right? Because apparently that's what you are if you don't like this film.","true":true}