{"101487":146159,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-13","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I waited a while to post this review so that I wouldn't be caught up in the emotion and hype of the movie. Take away everything that has to do with Star Wars\\, and this movie still isn't very good. The attempt to force humor in the strangest places often felt cringey and just plain awful. Half of the plot could have (and should have) been eliminated by the leader uttering 1 sentence. 3 of the characters go off on an hour long quest to find some random guy to do some convoluted escape strategy\\, and nothing ever comes of it. The hyped up \\\"big bad\\\" in Snoke is basically a throw away who does nothing with no explanation of where he came from or how he came to be so strong. The movie jumps from place to place so fast it makes you wonder how long the original cut must have been. \\n\\nAs for the Star Wars parts\\, there were some good and some bad. The fight scene with Rey and Kylo was probably the best part of the film\\, and one of the better scenes in the franchise. I didn't care for the way the writers treated Luke\\, but I understand that it is a plausible result of his actions. One of the things that bothered me so much about TFA was the absolute waste of a cool character in Captain Phasma. It seems Disney saved her at the end of the last film just to bring he back and waste her in a second movie. Total disappointment there. I think my biggest problem with The Last Jedi is it fails to make the whole plot feel important. The movie is basically 4 or 5 ships chasing 3 ships. It doesn't feel like there is any threat to the rest of the galaxy or any reason anyone else should care what is transpiring. \\n\\nAll in all I left the theater not feeling great about this one.","true":true}