{"101487":131912,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I felt so angry after watching Last Jedi at the flicks over Xmas I signed up to Rotten Tomatoes to post my comic book store guy take on the Last Jedi. As a late-30ish Star Wars fan who can remember the Original trilogy I felt very angry at the way this movie came across. It was basically a middle finger F U and felt like they had only gotten the original cast back to trick me into seeing it. I had no issue with the original cast being written out of the movies to make way for the new generation. It was in the manner it was done. Han' s death in Force Awakens meant that at no point could the original cast meet each other (outside of being dead force ghosts) and felt like a terribly missed opportunity. This leads to the central issue of this movie; Luke. Who is not a Luke I understand or recognise. He is an embittered old blue milk drinking wierdo who has lost his way and never redeems himself before dying whilst he plays a magic trick on Kylo Ren. Mark Hammil was clearly not happy with his lot in this movie either from the various press junkets he attended and the stuff he has said. I have issues with many things in this movie\\, too much stuff to cover here. And other reviewers have objectively  listed these far better than I could. Save to say  that ultimately all of the issues and disappointment boil down to a poor turn from Luke for me. He is the spirit and core of the whole franchise and they wasted him to try and do some clever Luke is damaged routine. I feel sure that JJ Abrams would have had Luke studying the Jedi texts for last 10 years to become an amazing all powerful Jedi to come back and help his sister in her moment of need. Who by the way he completely abandons even to the point of her nearly dying in the vacuum of space. And a movie it's a poor disjointed mess. If the purpose was to get rid of all older Star Wars fans\\, Disney have succeed by killing in the past literally. Finally\\, to add I am not a bigot\\, racist\\, or sexist. I don't care about the ethnic and female empowering stuff I just want good Star Wars.","true":true}