{"101487":186577,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was good but fell short of the last in my opinion. I don't believe that it deserves all of the hate that I am reading on other reviews. This is spoiler filled but I am sure you already know that. \\n\\nMy biggest issue with the movie was Fin's story line. It fell short because I don't believe it mattered in the end. They just ended up failing and as for Rose I didn't really find myself liking her character. \\n\\nThis movie does what the prequels did when considering the view of the Jedi. It expanded upon the lore and mythos of the world of Star Wars and what the Force actually means. I am not arguing the prequel movies were good but I am saying that you cannot evolve a franchise without change and expansion of the material that you already have. Rian Johnson decided to take the Force in a whole new direction and expand upon what it means to the person capable of using it and what it means to the world (or Galaxy) in general. The force is not just something that you can move shit with...it is an energy that shapes the world around the mythos of this universe and guides its characters. Choosing new and innovative ways to explore that power is just what this franchise needed. The audience will not be pleased and by other reviews that are on this site you will see that there is absolutely no pleasing everyone. Further than that it is getting more hate for giving that audience exactly what it wanted a change. The force awakens was apparently too similar to A New Hope. And this movie is \\\"bad\\\" because it is too different. You can't ask for something then be upset when you are given what you wanted in the first place. \\n\\nLet's look at the problems that most people have with this movie:\\n\\nThe star cruiser going light speed into the enemy star destroyer. The main criticism that I have see is why haven't they just done this before. Well why would you waste a perfectly good star cruiser blasting it into the enemy. The rebels never had the funds to just throw large crafts at the enemy. If you think \\\"well what don't they just make ships for that purpose?\\\" That wouldn't make a really good story would it; \\\"Let's just throw ships at each other and call it a story\\, yay!\\\".\\n\\nThe use of the force in ways that we have never seen. Well for this one we have always known that the force is the energy that binds things together. In past movies we have seen Jedi masters disappear and reappear as spirits\\, so why is it so far off that a Jedi master could project an image of himself worlds away? Especially one as strong as Luke must have become. \\n\\nLuke's change of personality that lead to the creation of Kylo Ren. There is always (or I guess I should say there should always be) an equal amount of light and dark in the universe. The Jedi are not immune from the temptations of the dark side and this is proven by the fall of Anakin and Count Dooku and many other Sith lords. Is it so far out of the realm of possibility that the Dark is always present and can be calling to even Jedi masters? Personally I think not. And in addition to this Luke's voluntary exile was because he failed himself and Ben. This was penance for his almost crime and the push the cause Ben to become Kylo. \\n\\nThis movie went in directions that I could not predict. This has been unlike any Star Wars movie I have seen. I want to know other things that people were upset with because I know you are overreacting and nitpicking WAY too much.","true":true}