{"101487":145984,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never reviewed a movie before on Rotton Tomatoes but after reading the explanation from one post talking about why the audience score is so different than the critic score I had to say something. It similar the news disparity on a lot of other things these days. No it's not caused by trolls. The reviews are real and genuine. What you did to our beloved stories is a complete travesty. Instead of thinking of your audience as thinking people we are expected to not think at all during this movie. The characters we know and that traits we loved are no longer true. My husband and are both gre up with the Star Wars franchise and absolutely love it. Until we saw this movie.... at the end of the movie we were both so depressed.  The feeling has lingered hours and hours after we saw it. It is such a anomaly to the Star Wars that you know it manages an almost impossible feat by sucking all the joy you derived from the Star Wars saga by watching just this one movie. The training you learned about in the other movies means nothing\\, the character traits you learned about by knowing the characters quirks  - meaningless- they aren't those people any longer. My husband said it was all about the money grab for the merchandising rights so they wouldn't have to pay anymore for the old characters\\, they would force feed the new ones which are tied to George. I don't know... one thing is for certain\\, they chewed up and poisoned everything you loved and are force feeding you the koolaid and telling you it's great. Yeah\\, for thinking me\\, it's like the protests on steroids. One thing is for certain you won't feel better after watching the film\\, most likely you will feel much much worse.","true":true}