{"101487":120799,"Last Jedi":"Last Jedi","2017-12-15":"2019-09-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Felt like the director was more interested in making his own movie than continuing a franchise. If you want to start something new wait until you close the chapter on Skywalker. THEN start something new with the new characters you created and have established AROUND the beloved legacy characters. When you do this then it makes us who grew up with the legacy's feel more emotionally attached to the new ones and more apt to move on. But Johnson didn't care and ruined Luke and his entire character. The Luke we left in ROJ was no where near the one we got here. In ROJ he defeated the emperor by turning the most evil sith in the galaxy to the light. He was a hero\\, hopeful\\, a leader\\, and a warrior. But in TLJ we got mopey\\, woe is me\\, get off my lawn\\, I came to this island to die\\, Luke. Subverting expectations is not how you make a good Star Wars movie. Maybe an independent movie who's own world\\, logic\\, and science isn't already established. Character of Luke was just the tip of the iceberg. It's impossible to introduce new characters in the 2nd part of a trilogy and to expect the audience to accept them. If the character arc of Poe is a great hero fighter pilot who helped lead the destruction of Death Star 3\\, why is he now only the minimum wage employee who only gets told things on a need to know basis? Also if Rey and Finn are best friends in TFA why are they separated in TLJ? Did we need Mary Leia Poppins scene? And I'm pretty sure the whole killing Snoke and making Rey a \\\"nobody\\\" were again just attempts to subvert expectations and making a Star Wars movie that no one has seen before but for me I never wanted to watch again. ","true":true}