{"101487":198896,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst SW movie since episode 1.  So much slap stick comedy that you might wonder if you're watching a Spaceballs sequel.  After the 5th or 6th joke\\, if the theater laughed\\, it was an audible nervous laugh as we were all slowly realizing that the movie that we'd had high hopes for was being mocked.  Poe is more pilot than than any Jedi has ever been.  A literal one man space army.   Bombs that barely explode when armed and in their bombers yet create ultimate destruction when on target. Unconscious force space suits.. really!  A rendition of Luke that trys to pull of a similar relationship with Rey as Empires relationship between Luke and Yoda.  They fail miserably.  Focusing more on trying to introduce as many visual characters as possible to hopefully sell them a figurines.  Our humble Luke who saw good in Darth Vader (let that sink in for a little bit) is now living as a hermit because he failed his student when he sensed a little dark and tried to go full Ani on him. What a disgrace to the character.  Ghost Jedi's can now\\, apparently\\, manipulate reality.  If that doesn't open up a can of worms for you on it's own then you're not paying attention.  Also\\, Vulcan mind melds make an appearance.  yay!\\nWe are introduced to possibly one of the greatest villains to see the Star Wars screen.  Who is he? Who cares says Rian. Even George RR Martin wouldn't have gone there. What a waste. \\nPlot holes welcome. No one will notice anyway right?  Pew Pew. \\nA few speeder minutes at full speed aren't as fast as having to drag a body back on foot.  If they'd only known that to begin with. \\nUnfortunately i could go on...    \\nRian dropped the ball on this one and\\, IMO\\, i don't see how they'll save the franchise from this disaster.","true":true}