{"101487":176556,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie has some entertaining moments\\, but falls flat on it's face.  If you are not really that much of a Star Wars fan\\, then yea I can see you enjoying this movie.  Unfortunately for me\\, I grew up idolizing the characters in this movie and to see how Luke acted in this movie made me feel somewhat angry.  This is a character who believed that there was good in his father who had done very horrible things and had a body count behind him to prove it... Remember that scene in the end of Rogue One where Vadar slaughters a bunch of rebel soldiers?  Well Luke was able to redeem that man.  Then in this movie it is revealed that Luke turned Kylo bad because the padawan caught him hoovering over his bed with a lightsaber.   \\n\\nCall it bad writing or bad direction but apparently there is no lore master or the people who helmed the direction of this film didn't study the source material so well.  Then of course the Mary Poppins Leia scene was just completely dumb.  I mean they are killing off all the old characters to make way for the new\\, why is Leia more special then the other characters.  And then of course Luke dies on the planet where he was doing his force projections from.  This is dumb too... why not have him fall in battle?  Perhaps this was the directors shitty way of making Mark Hamil think his character hadn't died in the movie.  Remember the premiere footage of him standing next to the director?  He looked betrayed and like he wanted to kill that man. \\n\\nThen of course Holdo who wouldn't tell her soldiers of her plans?  I mean if she would have told them\\, she would have helped their worries and prevented the 30 minute casino scene which felt dumb and would have prevented Finn and that ridicules Rose character of trusting someone who causes the death of most of the resistance.  Then of course Holdo's long dramatic delay in doing something.  I mean I had no respect for this character what-so-ever... and hell\\, why didn't they try that warp stunt earlier on the chasing fleet... and why the hell didn't the chasing fleet not either swarm the small rag tag fleet with fighters?  Why not warp a few ships ahead or call in a few reinforcements?\\n\\nAnd then of course\\, why is the republic completely gone?  I mean only the capital was destroyed and I severely doubt they had their whole fleet protecting the capital world and how the hell is First Order in charge of the whole galaxy?  I thought they were on the ropes because of the lost of their base.  I mean come on\\, a majority of their resources had gone into Starkiller base.  I mean if someone took out Washington D.C. there would be chaos\\, but there would still be military assets and other command structures to take over.  I know in the books there is a demilitarization going on after the war\\, but planets would have defenses to protect themselves against pirates and other space scum still lurking out there.  \\n\\nThen of course they throw things from the last movie as well.  Snoke is killed off\\, who apparently can't hear or sense a light saber slowly turning next to him.  Who has extreme force powers as he flaunts himself to Rey.  And even says he's the reason why they can communicate to one another at a distance.  You would think he could have detected Kylo's betrayal\\, but in the end he's killed.   Also\\, Rey is still a Mary Sue... Then again this a problem that started in the first movie\\, but still she receives little training and yet  acts like a fully capable Jedi... Unlike Luke who developed himself in the original Trilogy.  I mean he gets his ass kicked by Tuscan Raiders\\, some hooligans at the bar\\, has some tentacle fun time in a trash compactor and has to be saved by wedge in the battle on the death star...  But Rey\\, she can kick anyone's ass\\, save for Snoke who shakes her around like a rag doll\\, but everyone else sucks when compared to her.  Oh and she can move tons of rocks\\, when luke himself had a hard time moving a lightsaber on Hoth.\\n\\nAnd before anyone says I'm sexist... well remember the prequels?  Remember how a little kid blows up the control ship in the Phantom Menance?  I don't know\\, apparently Disney didn't learn from the prequel faws... Then again the prequels and even the force awakens was better then this drivel.  What Disney and even George Lucas himself failed to realize is that what made the first movies of the trilogy so great was the balance of character they brought on screen.  That the main hero struggled and gradually improved themselves to become the person that they are.  Though maybe it's some feminist propaganda shit as well.  I mean all the men in the movie seem to be idiots\/children and need the guidance of the strong female characters to show them they are being stupid.  You can argue the first order has females as well\\, but they are not in the forefront and the one major female villain Phasma gets little screen time and is discarded rather quickly down a fiery chasm.  While that character looks awesome and could have made up for their sad display in the first movie... they seem to fall short here.\\n\\nAs for the new character Rose\\, I couldn't really care much for her... and her scenes were as cringey as the love between padme and anakin in the prequels.  Her only purpose was to save Finn from sacrificing himself for the resistance and perhaps giving him a little backbone... which he should have grown by the end of the Force Awakens\\, but apparently his risking his life to take down the Starkiller base didn't strengthen his character for this movie.  After all he was going to skip town in a escape pod like a coward again.  \\n\\nIn the end\\, while there are some entertaining elements the movie falls short to a crap ton of flaws.  While I liked the Force Awakens and Rogue One\\, this movie falls very short of my expectations.  I had some hope they would have addressed some of the issues plaguing the first movies\\, but apparently after the first two releases the people who are now in charge of Star Wars have their heads so far up their asses that they can't see the downward spiral they are taking the series now.  Hopefully ticket sales will convince them that maybe they shouldn't be so big headed while making these movies and look back upon what made the originals so great that they captivated audiences.","true":true}