{"40636":"36766","TLOU2":"TLOU2","2020-08-05":"2020-06-30","10":2.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"Im an old gamer. im playing games for 20 years now. I dont care for good graphics. When i was a kid i whould imagine the graphics to be good not bad. So that was not a problem. I play games for stories of them. I found last of us and the game was great so i bought the ps3 (i had a old pc). It was brand new with last of us. The game was great really good story good graphics. So i got hypedIm an old gamer. im playing games for 20 years now. I dont care for good graphics. When i was a kid i whould imagine the graphics to be good not bad. So that was not a problem. I play games for stories of them. I found last of us and the game was great so i bought the ps3 (i had a old pc). It was brand new with last of us. The game was great really good story good graphics. So i got hyped when the trailer for last of us 2 came out. i was amazed. i thought that the game whoud be great! But it wasnt the case. When the game was released i selled my ps 3 in hopes to buy ps 4 so i can play last of us 2 but before that in my recomended on youtube there was a video named Joels death scene. My favorite character was joel so i thought they were joking so i wathced the video and realised that the game had realistic graphics but as i said it is not soo important  to ave nice graphics it is all about the story. so i didnt want to buy the game or install it even if it was free. The story is really fu*ked up and it is so weird to play as a main villian that killed the main character of the first game. i wathced a gameplay and saw that it is not good. these two points are just for the graphics the story is really bad. I wish they ended the sequal at the first game and just leave the Last of us and the last of us left behind. Those games are truly epic and the last of us part 2 just ruins it. It just ruins story adding a she-hulk kill joel in the most stupid way possible. it whould be ok if they make joels death a little bit better. They made him look stupid in the second. It is just cruel to make a beloved caracther just to be killed later on it is just stupid. And the end is just weird. I really wish that the sequal ended on last os us 1 . It ruins the fact that the last of us was my favorite game and i loved joel as a character. Sorry for my bad english im not from England or Us so im sorry… Expand","true":true}