{"101487":153867,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"[MILD SPOILERS]\\n\\n\\nThis movie is well-acted\\, well-told\\, funny\\, and visually compelling film. John Williams' music shines\\, especially with Rose's theme and the musical tribute to Carrie Fisher in the credits. Visual effects by ILM are excellent as always. All the cast members give good performances. It is a treat to see Mark Hamill as Luke again. Adam Driver gives an emotional performance as Kylo Ren\\, digging deeper into his character. He's no Darth Vader\\, but he's much more interesting and human. I am eager to see where his character arc ends in Episode IX. The best thing about the story was the fact that it was continually surprising. I greatly enjoyed The Force Awakens\\, but it was rather predictable. Not so here; I had no idea where the plot was going. The movie has great action and some great jokes. Not every joke hits home\\, but the best ones had me giggling for quite a while.\\n\\nFor all the good\\, there is some bad. Most reviewers mention a certain extended sequence with Rose and Finn as a negative. I agree. The sequence itself isn't bad\\, per se\\, but it feels tonally inconsistent with the rest of the movie and shoves in a sloppy message about animal cruelty. The biggest weakness of this sequence is that it has very little effect on the plot given all the time invested. It feels sort of wasted. Benicio del Toro's character also feels wasted. He's a good character\\, but has little effect on the plot for the amount of screen time he has. This time would have been better invested developing the relationship between Luke and Rey. Speaking of\\, there is a strange sequence where Rey goes into a hole where it is implied the Dark Side is strong. Not only does basically nothing happen down here\\, there are no consequences at all. It feels like another useless sequence. Rose and Finn have surprisingly inert chemistry\\, with a crappy payoff at the end. Rose isn't a bad character\\, but she doesn't play against Finn as well as Rey did in TFA.\\n\\nBeyond that\\, I really have only a few nitpicks. There is a scene tacked on to the end which feels out of place. I think it would have fitted in better as an end credits scene. \\n\\nOverall\\, I'd solidly recommend this movie. I liked it better than The Force Awakens and the strong characters make it quite a bit better than Rogue One. I will say\\, go in with an open mind. Many of these half-star reviews seem to be by people who whose expectations were shattered. This movie does not do what is expected\\, and takes some risks\\, but I think they largely pay off. They do some new things with the mythology of The Force\\, but they work well as storytelling devices. Just because they are different doesn't mean they are bad. I would wager that many of the people complaining about the new things also complained about how TFA was the same movie as A New Hope. If you don't like it\\, that's entirely fair. But don't write it off because it is different. You'll be missing out on a darn good movie.","true":true}