{"101487":169579,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoiler Warning. Do not read if you do not want details.\\n\\nPro's:  Not many.  Overall the story was good in the arena of setting up the Franchise for a wave of new and younger audiences. I quite imagine coming out of this movie as a child vs. an adult you're going to have very different take aways.  I liked what they did with Kilo's character as it seems he's finally become a true bad guy with what seems to be a sense of direction and dedication to the Dark Side that was missing in the previous film where I thought he came across as basically a wet noodle.  I also liked the much needed character development on Ray.  Although already the strongest character in the first movie. It was good to see her clearly define her role and make a solid move toward being \\\"The Last Jedi\\\"  That's it for the good.\\n\\nCon's: Where to start?  I could not shake the feeling throughout the entire movie so many things were done\\, not to add to the overall Star Wars story\\, but rather just to make a point that Disney could keep certain things \\\"secret\\\" from the fan theory crowd.  So many things just felt forced and badly out of place.  \\nLuke:  Instead of a wise\\, hopeful Jedi Master who saved Darth Vader from the Dark side and thereby destroyed Emperor Palpatine we were presented with a Brooding\\, miserable old man with seemingly no hope. It just came across as so out of character for Luke you could tell even Mark Hamill didn't enjoy acting this part. So what if his Nephew turned to the Dark? It's not like Luke could really control that and more than Obi-Wan could have controlled Anakin's slide to the Dark.  Both were being pulled and manipulated to the Dark side by Dark Lord's much more powerful than they were even aware of.  Which Brings me to another very annoying point how is it all the great Jedi Masters (Yoda\\, Mace Windu\\, Obi-Wan\\, Luke\\, etc) can never seem to sense an evil as powerful as Palpatine or Snoke?  It just seems to be a recurring plot hole just to allow the Sith\/Dark force users to continually stay one step ahead of the Jedi.  So that's Luke. Hated his Character development.\\n\\nCGI: Way\\, way\\, way too much CGI.  I honestly felt like I was playing a video game many times during the movie. There was nothing real feeling about any of the scenes save Luke's little island which while I liked\\, after 10-20 shots of showing Rocky hill going up\\, rocky hill going down\\, I was thinking it's no damn wonder Luke is in such a foul mood. I would be too if I had to walk around that every day and drink milk from the boob of some fat sea\/land creature.  And...what the hell was showing us that scene about anyway!?\\n\\nFIN \/ Rose Phasma - Just a big ole' mess of thrown together story arc.  The entire Fin story arc in the movie was so weak it will never be remembered as anything other than that; weak.  Even the final dual scene with Fin and Phasma was lackluster and just left me saying\\, \\\"ok\\, so what\\\". They should have incorporated this in to the first movie and have been done with Phasma. \\n\\nHux:  Can someone please explain to me how this idiot could possibly have survived to become Fleet commander?  He's bungled every attack\\, every evil opportunity he's been given. And while we're on Hux let's look at one of the most moronic space \\\"chase\\\" scenes ever. Are we really supposed to believe that with all the resources of the First Order (Pretty damn near unlimited if you can believe the number of ships and death stars they seem to magically produce) they have to resort to chasing three\\, piece of crap rebel ships through space for hours? Really!?  Could they not\\, in 6 hours' time\\, have had other ships Hyperspace jump in to intercept the rebel ships?  This was almost as stupid as my my number one pick for stupid in this movie: Space Leia.\\n\\nLeia: Perhaps the dumbest scene I'v ever run across in a SciFi movie. Leia\\, blown into outer space and then summing the force to \\\"fly\\\" back into the ship. Both I and the guy sitting beside both said the same thing sitting there watching this\\, \\\"Bulls#!T\\\".  I'm sorry but really Disney? Really?  This was just dumb.\\n\\nSalt\/Red Planet.  Ok! We know there's red under the white salt.  I'm not sure exactly how many times they made a point to visually show us this but after two or three time it got old quick.  I can just see the script: * soldier drags his foot\\,  \\\"Look! Wow! Red dust under the white!\\\"  Then 30 seconds later...* Soldier does foot swipe\\, camera focus\\, \\\"Look! Wow!  Red dust under the white!\\\".  Ok\\, Ok\\, we've got it the whole planet is red covered with white salt. Good Job!\\n\\nChewbacca eating Children's plastic Chick prop. (aka Porg). Bad\\, bad\\, bad prop.  Totally looked so fake! \\n\\nPorgs:  What happened to BB-8 being the lead comic relief?  Everyone loved him in the first movie and yet they felt the need to pretty much sideline his role in favor of more cute\\, fluffy creatures called the Porg.  Really Disney \/ Star Wars? Did the Ewoks and Jar-Jar not teach you anything? This is a \\\"War\\\" stop with the cute and cuddly.\\n\\nOverall\\, I still love Star Wars because it's \\\"Star Wars\\\" but the Disney money making overtones got in the way of just making a serious movie for the Star Wars legacy. Kids will love the movie but I found more annoying issues with it than I care to think about.","true":true}