{"101487":97283,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"92% tomatometer\\, typical for critics to only go with a popular opinion nowadays. Shameful to call yourselves critics when you only pan to what's popular as opposed to good story telling and consistency. This film has unrinated on the true Star Wars then turned arounds and squatted over our faces. This one is definitely not worth the ticket\\, giving too much details may contain spoilers so I will leave  specific details out. All I saw was extreme liberties being taken with an already established lore in a fairly understood universe being blown wy out of proportion. Real character development was also placed in the back seat while the agenda of virtue signaling a \\\"New\\\" and progressive Star Wars was clear as fucking day. While I see nothing wrong with being progressive I see something very\\, very wrong with forcing it through virtue signaling and costing us(the strue Star Wars fans) a good\\, fun and creative story. Star Wars fans love the films partly because it's an epic fantasy of sorts and it provides a very fun experience of escapism. People watch movies like this to get away from reality a bit and have some fun.  I have never experienced so many let-downs in a film nearly three hours long\\, from a film franchise that means so much to a group of amazing fans. Disney\\, I love your work with Marvel\\, but I guess it's only been successful because it has Kevin Feige\\, who is a real Marvel fan\\, and is in the driver's seat. Coming from a true fan of the comics he knows what true fans want to see. You should learn form that example and put a real fan of Star Wars in the driver's seat. Unfortunately\\,I think it's already too late and the damage has already been done. R.I.P Star Wars...","true":true}