{"101487":176904,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie perfectly executes everything it needed to do to make the most money in the shortest amount of time.\\nThe franchise got completely destroyed from a story perspective but that does not matter at all in Hollywood.\\n\\nThey made damn sure to cut off all bridges to the original star wars\\, while including absolutely no new or interesting storylines or characters.\\n\\nThe story is also unfortunately ideologically motivated\\, championed by the absolut forced relationship between a black guy and an asian chick. \\nThe also go to a casino planet that is used to not-so-subtly criticize rich people in general (haha\\, disney).\\nIt should be clear this is riding the current zeitgeist of diversitiy ideology and all that comes with it.\\n\\nAnd do yourself a favour and detach from everything Star Wars for the future.\\nIt was good while it lasted and lets move on and not give those destructive people money.\\n\\n\\nThe movie perfectly executes everything it needed to do to make the most money in the shortest amount of time.\\nThe franchise got completely destroyed from a story perspective but that does not matter at all in Hollywood.\\n\\nThey made damn sure to cut off all bridges to the original star wars\\, while including absolutely no new or interesting storylines or characters.\\n\\nThe story is also unfortunately ideologically motivated\\, championed by the absolut forced relationship between a black guy and an asian chick. \\nThe also go to a casino planet that is used to not-so-subtly criticize rich people in general (haha\\, disney).\\nIt should be clear this is riding the current zeitgeist of diversitiy ideology and all that comes with it.\\n\\nAnd do yourself a favour and detach from everything Star Wars for the future.\\nIt was good while it lasted and lets move on and not give those destructive people money.","true":true}