{"101487":174868,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The irony of most of the negative fan reviews is that they have completely missed the commentary the film was making on the franchise in this moment. The original trilogy is literally the stuff of legend at this point. The demand to recapture the mythical—even mystical—quality of an American cultural phenomenon like the original Star Wars trilogy puts the filmmakers in a position where they’re torn between two options: Burn it all to the ground (or\\, to quote Kylo Ren\\, “Let the past die; kill it) or try and inevitably fail to recapture that cultural moment (as Poe fails in his attempts at heroics.) The film\\, however denies both possibilities and it does so brilliantly through Rey who realizes that she has no history—no place in the legacy that came before her—but unlike Ren\\, is unwilling to simply try and kill the past. Rather\\, she becomes something else out of the ashes of the Jedi past—literally out of the ashes of the temple. Luke realizes this is the only way after first desiring the exact same path Ren does: to destroy the past and bury it completely. But Yoda shows him there’s another possibility that lies beyond either killing it all or pining for some nostalgic past. Ultimately\\, I think this was the only way the franchise could go: to let the past die but not kill it—let it be renewed as something else. Rian Johnson has laid the groundwork here for many more Star Wars films that don’t have to be tied down by the immense weight of the original myth. It’s brilliant.","true":true}