{"101487":134500,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left TFA in a nostalgic trance that allowed me to forgive it's obvious holes and shameless copying. Yes TFA played it safe and many dismiss the film for it but it did so to avoid what TLJ has arguably now done- soil a cherished franchise. \\nI left TLJ melancholy. It tosses compelling new plots so subtly introduced by Abrams and replaces them with either nothing or something far more convoluted. It alienated itself from the rest of the franchise nearly as much as Rogue One did (the difference being Rogue One was meant to). \\nIn regards to cinematography\\, the film visually delivers. Despite the frustrating nature of the casino subplot in its entirety\\, it was one of few instances of homage to original fanatical settings. \\nUnfortunately my main quibble is what this film represents for the franchise as a whole. It's the Disney-fication of Star Wars. Such cutesy\\, infuriating humour. Shameless plugs for young viewers (think the owl\/puffin things). The franchise faces a serious identity crisis.. can you simultaneously have a supposedly darker film with lightcore gore and deeper moral considerations while still diluting itself with the cheek and cuteness?\\nIs it brave to deliver not just what fans want and expect? Sure\\, but I think it still fell flat. Abrams has some serious damage control to do for the finale to the new trilogy. \\nIn summary- a decent standalone film on its merits\\, albeit with serious plot holes and dialogue flaws. The kiddos will like it in a classic sci-fi cinematography sense.\\n As a Star Wars film\\, I think many generational faithful will feel cheated\\, as I do.","true":true}