{"101487":142888,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's hard to talk about this film without coming to terms with the very real fact that Star Wars is over. Out of nine films\\, over forty years\\, a couple of TV Ewok movies\\, a terrible Holiday special\\, A Clone Wars cartoon they did TWICE for some reason\\, and a Rebels cartoon--Only TWO of these have really been great. Two more\\, have been really good\\, and the rest have been decent to mediocre.\\n\\nI see Disney attempting to shed the older fans. Those who have been with the series since the very first film. After all\\, we don't spend money the way the 18-34 demo does. We're done buying the toys and pajamas. Disney can't squeeze much money from us at this point.\\n\\nThey show us how little they want us on board by trashing the Original Trilogy. By making the characters we loved into failures\\, and cowards and their accomplishments come to nothing. Disney didn't want to have to create a new and original obstacle for their new characters\\, instead\\, they just pit them against the same old Empire chasing the same rag-tag fugitive band of rebels the series started with. No growth. No change. No progress.\\n\\nBut how can Disney effectively make the Empire the villains when they ARE the Empire? How can they approach the moral questions of Star Wars when they are Nihilists. When good and evil are irrelevant in the pursuit of profit? Disney must necessarily be careful not to critique themselves too much\\, lest the audience think. Better to simply train a new\\, young audience to accept the branding and merchandise without considering too closely the underlying emptiness.\\n\\nDrown the old movies. Bury them. Hide them under a mountain of avarice and cheap plastic tat. Accept that war is inevitable and continuous. Peace is barely even a mirage on the distant horizon. There is no goal except to grudgingly stumble forward. To exist within the product. Have dangled before you the shiny carrot of \\\"Hope\\\" but to never see the end. Star Wars has become the Forever War. Sisyphean and endless--because an end means an end to profit.\\n\\nWe already know where these movies are going. Disney has announced there will be a new Star Wars film every year until the end of time. That tells you all you need to know about how much \\\"Hope\\\" there actually is. How much these characters will ever accomplish. Disney can't afford for them to.\\n\\nBetter for this old Star Wars fan to be content with my Original Trilogy. I'll even accept Rogue One into my personal head canon. To stop going to the theater for these new films and envision the end of the story my own way.\\n\\nWith Leia\\, the founder of a New Republic. Han the wise and boisterous commander of her reconstruction efforts. Luke the teacher of a new school of Jedi. A galaxy of fragile peace\\, precarious\\, but ultimately focused on the potential of a better future. That's the old age I want for my Original Trilogy characters to live in. Plenty of room for adventure and danger and difficulty but always working toward a better tomorrow.\\n\\nYou younglings can have the Forever War. I'm done.","true":true}