{"101487":198251,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars ever. I waited most of my childhood and all of my adult life to see Luke Skywalker return with his green lightsaber and teach a new generation to carry on. What we got was a Luke that doesn't make any sense with who he was\\, and a movie with plot holes in the triple digits\\, that then wasted everything that came before.\\n\\nThis movie literally took everything that the last one setup and established\\, and threw it out. Why? Cause subversion for the sake of subversion\\, which is what people do when they want to be smart and edgy but aren't intelligent enough to be smart and edgy. \\nThen in its place it didn't build anything new! It didn't develop new lore or anything. They killed off under-developed characters\\, they shut down any development of mysterious from the last movie and didn't create any new mysteries or lore. Literally tore everything down and built nothing in it's place.\\n\\nAlso was rather sexist. They established that Rey is so powerful (without training) because it is the way the Force balances itself. In other words\\, she is powerful thanks to Kylo's years (maybe even decades) of training. Put in a way that points out it's sexist: the first female jedi on screen is only powerful because of the hard work of a man. Why couldn't they have her train up and develop her strength for herself??\\n\\nShe also continues to wield Force powers that task trained Jedi\\, with no training. Sorry\\, correction; she had one \\\"training\\\" session with Luke where she meditated and had her hand tickled. \\n\\nI love the actors\\, I want to love the characters; but the writing was piss poor. This is worse than the prequels except in aesthetic look and dialogue writing. \\n\\nI'm a life long Star Wars fan and I think I'm done with the series. At least I doubt I'll be watching the next ones. That is kind of a side effect of subverting EVERYTHING of development; you subvert the fan's desire to see more.","true":true}