{"101487":178709,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There was so much story and content in this movie and I loved it!! It brought the original and prequel trilogies together and took it to the next level. Depth of Luke still learning and rectifying his broken character. Ben might be my favorite evil character and he was written very well in this. He is a cry baby boy in the beginning however his logic is so twisted it is brilliant in the Snoke scene. Everyone is so focused on the small things like Leia \\\"flying\\\" and the jokes and missed the ball on the story of Ben\\, Ray and Luke.\\n\\nNot everyone will enjoy it because they have attachments to characters or they don't like change. Not many liked the prequel because it was a new set of characters so immediately when we bring back the original just to lose all of them not many will like it. But it was meant for nostalgia and and a bridge. The reviews are complaining about a weak Snoke not knowing Ben was turning.. how about the emporer not knowing vader would turn? This movie has so much resemblance to the prior movies and I can sit here and explain each complaint and where I can find the same issue in the originals.\\nMight I also add that we had to work on the crap that JJ left off on? Please don't bring JJ back for 9 as the Force Awakens was garbage and just a reboot. #JJNotMyStarWars  Everyone who doesn't like this movie just wants the original trilogy back. So sad... afraid of change. \\\"Let the past die\\\"\\nWhat I didn't like was that Ray isn't part of the Skywalker or Kenobi bloodline (I am still hoping Ben was just lying). Phasma was pointless in both movies (sorry as I love the actress but it didn't fit to build her up and let her fail in both). Way too many female leads (Disney trying to please the crowd and making it PC). There isn't much point to Rose and potentially even Fin... too many story lines to follow and theirs wasn't value added.","true":true}