{"101487":133690,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have been thinking about this for a long time.   I am a life long nerd and star wars fan and I can acknowledge that there is genius in this movie.   Here is why I think it falls flat. \\n\\n1.  The force awakens was a brilliant reintroduction to why we love star wars\\,  but it setset up it's sequel to fail.   The force awakens was a virtual retelling of a new hope and I don't think even old school fans like me wanted a copy of the first trilogy.   The Last Jedi's response to that was to brush off a lot of what the first movie had done.  While I applaud this in principal\\,  ignoring the mystery of who Snoke was\\, and turning Luke into a curmudgeon was maybe not the best approach. \\n\\n2.  We\\,  the fans\\,  love our icons.   We want Luke and Ackbar to be legends.   That's who they were.   I was ok with the direction they took Luke but Ackbar's ignoble and forgettable death was unforgivable.   If you're gong to remake a classic\\,  throw fans a bone.  Don't just clear out all the old legends to start over. \\n\\n3.  Have a purpose to your scenes.   Don't set you a flirtation between Rey and the dark side and then brush it off.  What was the point in Rey going into the pit.  There was no Jedi trial there.   She didn't learn anything.   When she met Snoke he knew immediately that she couldn't be turned.   Why\\,  then\\,  set her up as potentially succumbing to the dark side?\\n\\n\\nI get it.  This movie clears out the old to make room for the new.   That's why critics loved it.   That's also why they should have known fans would hate it.   This movie was a great disturbance in the force.   To borrow a phrase from the great sith lord of our time\\,  let's hope they have a plan and can make Star Wars great again.","true":true}