{"101487":150824,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Look I know they want to introduce a new generation to a new set of character but they way they wrote Luke Skywalker\\, the greatest Jedi ever\\, was a slap in the face. He was reduced to a whining grumpy coward who wanted nothing to do with saving the galaxy. What. The. Hell??? No wonder Mark Hamill was disappointed with the script. The Luke everyone grew up with would take on the Empire all by himself(and at one point of the movie it looked like he was going to take on the First Order alone\\, but thay screwed up that scene as well!) He loses Ben and now all of a sudden his scared\\, hides himself away\\, and thinks the Jedi should be no more? Huh? \\n\\nAnd just like how A Force Awakens was similar to A New Hope\\, The Last Jedi has similarities to The Empire Strikes Back. In Empire Luke travels to an isolated Yoda on Dagobah to train\\, Rey travels to an isolated Luke on Ach-To to train. On Dagobah Luke ventures to an area strong with the dark dise and battles Vader only to reveal Lukes face behind the Vader mask possibly hinting that Vader and Luke are\\, in a way\\, the same(Skywalkers\\, father & son). Rey also goes to an area strong with the dark side but just sees a bunch of her own reflections\\, asks a mirroe to see who her parents are and is only shown her reflection. Empire\\, Vader reveals he is Lukes fater and wants to rule with Luke and bring order to the galaxy. LJ\\, Kylo wants Rey to rule with him to bring order to the galaxy. \\n\\nAs for Snoke? Lol who the hell cares he died like a 3rd rate character to be immediately forgotten. Don't even bother trying to give him an origin story. How lame. \\n\\nThen you got Finn and Rose....who had a little adventure of their own which turned out to be an entire waste of screen time. They did nothing to help the rebellion whatsoever. ABSOLUTELY nothing. \\n\\nCaptain Phasma was just as lame as she was the last movie. Hopefully her character is really dead. She shows how useless stormtroopers are even when they hold some kind of rank in the First Order. \\n\\nOh and there's this incredibly lame space scene where the First Order is chasing the rebels and for some reason the FO ships can catch up with the rebel cruiser lol....what?! Ever heard of calling back up to cut them off??? Man the writing of the movie was so incredibly lame and lazy.\\n\\nAh man....such a huge missed opportunity again. Sure there were some really great scenes and this movie will make a ton of money but that's only because of the name of the movie. These stories will not live on like the original trilogy. Except for Rogue One which was pretty cool.","true":true}