{"101487":170510,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Steals everything from the original trilogy. The Force Awakens (2015) was a brilliant revival to the series and set up the last Jedi amazingly with questions like who were Reys parents? and who was the supreme leader snoke?\\nIn the last Jedi we find out Reys parents are junkers and snoke just dies. We also find that General Leia can LITERALLY SURVIVE IN SPACE. There are so many plotholes and dumb mistakes in this film that it is honestly not funny. HOW THE DUCK IS THERE GRAVITY IN SPACE RIAN JOHNSON YOU TRUCKING IDIOT. \\nAnother irritating thing about what Rian Johnson has done with this film is ignore ALL THE CHARACTER DEVELOPMENT in the original trilogy. Luke who spent episodes 4\\, 5 and 6 trying to REDEEM Darth Vader who literally killed countless innocent people would not simply try to KILL Kylo Ren just because he saw \\\"the future\\\" of his own student. Another thing which really annoys me about how Disney have handled the character of Luke is how they eventually killed him off. I'm not disappointed in the decision to kill Luke off (I even called that it should be done in Last Jedi) but the downright stupidity of the way they did it. Right before Luke stopped his Aberration against Kylo on the planet Crait\\, he says \\\"see you around kid\\\" then LITERALLY IN THE NEXT SHOT HE KEELS OVER AND DIES ON THE ISLAND FOR NO REASON AT ALL.\\n\\nThose are just some of the things that are in the film which will have you begging for Jar Jar to return. Oh and I almost forgot\\, if you thought Rey never being trained in the Force before but nevertheless beating luke in a duel before was bonkers the ending scene of The Last Jedi shows a 4 year old slave boy SUMMONING A BROOM WITH THE FORCE. Yep there you have it\\, anyone can now be as powerful as Darth trucking Vader. Thanks Disney you absolute money whores.","true":true}