{"101487":185998,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was absolute trash. The first scene of the movie is a 2-minute long joke. What previous Star Wars movie has started by making jokes? Not only did this scene make me feel like the movie would be underwhelming\\, but it took away from that classic Star Wars energy. Also\\, why did they hint that Leia would die in trailers then all of a sudden give her force powers so she can fly through space? The Finn and Asian lady side story was unnecessary and made no progression in the story. They didn't end up needing the lightspeed tracker because the SJW purple haired lady made every decision and patronized Poe at every moment. Luke was a complete tool with his bad jokes and unrealistic cockiness\/stubbornness. Luke would never try to kill one of his students who might be taken by the dark side. He never lost faith in his father who had been the main sith lord throughout the original trilogy. But\\, being the \\\"legend\\\" that he is\\, he screwed up and tried to kill his student. The Luke from the original trilogy would not have been so nearsighted. Also\\, why was Snoke even in the movie? He showed a couple of times how he was superior to Kylo\\, but then Kylo somehow kills this overpowered Sith Lord. Then I don't know if they are lying about Rey's parents\\, but why would they put that question into TFA if they were just going to have the biggest 10-second letdown ever. Oh yeah\\, your parents are nobodies. We made it such a big deal in the previous movie\\, but screw it right we don't have time to make a real origin story for Rey. Again I want to reiterate how often they used bad jokes and overall ruined the mood of the movie. The last scene with Luke was bad and corny. Rey went from hating Kylo to going to meet him within like 2-3 days. The movie was predictable and had no surprises. \\n\\nSorry if this is not chronologically correct. Just wanted to get everything I didn't like about the movie out.","true":true}