{"101487":178718,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There was too much wrong with this movie to list it all\\, but the funniest 4 bits to me? \\n\\n1. The whole movie takes place with the rebel juuuust out of reach because... they are smaller and faster? lol. Just cause all the Empire ships are big they are slow? Then how do they keep up that perfect 'just out of reach'  pace? Hell\\, how bout a tiny jump like they proved the Falcon did? Or those big guns that destroyed an entire planet section? Not using em or did that ship the size of 500 only have tiny guns? \\n\\n2. How about 1\/2 of the plot that went no where? I mean that whole casino bit and the 2 of them being star-struck by the 'beauty'... uhhh all your friends about to die at any moment? Maybe focus a little? And that bit about money being evil because rich = gun runners and war profiteering? Was this written by SJWs? Really. But hey why not\\, it was all for nothing and they just came back anyway.\\n\\n3. Supreme Leader Snoke. I remember there was so much interest and mystery behind him and his origins after the last movie. How he would tie into it all... Nah just a random bag guy with no past or further development. What a waste.\\n\\n4. So Luke played the whole strike me down bit\\, but ahHA he wasn't really there so he couldn't die. Oh wait. Random death because he taxed himself too hard? \\n\\nRotten Tomatoes users = 53% While the (paid) critics give a 93% Talk about being out of touch. The shilling is expected rather than suspected.","true":true}