{"101487":145968,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never left a review\\, I've always found that reviews should be ignored and that you should give all movies a chance. HOWEVER\\, this film comes under the star wars banner and to put it simply is not a star wars film. It tries to be an action comedy\\, jokes are thrown at you all the time and I personally found myself not laughing at one. I was sitting there as the film not only contradicts itself (E. G. Failures are the biggest lesson followed by giving up on life and joining the force) but every other star wars film. What can't the force and hyper space solve? I can't think of anything. The space chase an makes zero sense as the first order has ships that it can send ahead at light speed but chooses not to because... Instead of looking for faster ships to evacuate the fleeing resistance ship\\, the plan was to hack into the tracker of snokes destroyer? No wonder there's only 400 surviving in the resistance at that point. The characters are dull and everyone has a cringey moment cracking wise. There's literally no consequences for any of the characters decisions. Ray goes in to the dark side cave and faces no backlash. The kids openly free the animals in front of there masters and face no punishment. The character that takes over Leia for some reason keeps her flying straight plan a secret (the worst tactic ever btw) a mutiny ensues and nobody strips any one of these weapons and they just hold them there in the middle of a busy hanger for no reason apart from so they can escape easily. For some reason it was a genius move to completely pave over what happened in the force awakens and openly mock dedicated star wars fans by telling the audience how stupid it is. I have no idea how this got through the board room. Probably because they are trying to net the biggest audience possible from the already biggest movie franchise ever. I hope it fails. I won't see another Disney movie. Marvel\\, Pixar\\, starwars it all lines the pockets of people who don't care about movies. It's all about money and selling the merchandise. One quick note Rose that character who literally dies and is brought back magically is my least favorite part of the last Jedi. Mary Poppins Leia was stupid but they could of made it work if the rest didn't sell itself out soo much. Also forget using any imagination\\, it's all spoon fed to you as the movie treats you like an idiot. Hence it has a seen were ray narrates herself and a overlay of the description Luke gives of the force. Starwars #MeTooAvoid the movie! It will ruin your love of star wars","true":true}