{"101487":195764,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What is the point of the Lucasfilm Story group?  Their job is to help a director tell a Star Wars story while maintaining continuity\\, canon\\, and world building rules.  They failed.  They failed everyone who has watched Star Wars for either 1 or 40 years\\, bought merchandise or showed it to the next generation.  There are enough reviews on here to see how they failed but a few thoughts:  One X-wing and one bomber take out a dreadnaught?  Cruisers can't catch a capital ship? Why didn't they launch Tie F\/O fighters and bombers?  One person can pilot a capital ship? You can hyperspace through other ships - I guess that is how to destroy things now.  Luke was stupid to fire torpedoes at the Death Star - he should have hyper-spaced through it with his X-wing.  BB-8 kills people now?  There is a lot more but we'll stop there. The characters are terrible - Wow J.J. is good at this and Rian is not.  Rian's new characters stunk and he ruined everything we liked about the others.  Finn is a coward again and fails his mission badly and is just dumb.  Poe is insubordinane and reckless like Kirk in the new Star Trek.  Luke is broken and never really recovers.  His death is an insult.  The \\\"twists\\\" were poorly done because it subverted the audience's expectations but not the characters in the film.  Rey only cares about the identity of her parents in this movie because the audience cared.  It made no difference to the story.  Showing Luke's X-wing (super cool) and then not using it was a way to 'play' with the audience.  It made no sense for Luke to never leave the island.  Rian is just too 'clever' and too 'cute' to actually give the audience anything they might have wanted from a story.  Screw us.  We don't know what we want until he gives it to us I guess.   What an jerk.  He is a steward of Star Wars - not the owner and so is the story group.  They all failed us.  :-(","true":true}