{"101487":183836,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie feels less like the logical second step in a new trilogy and more like a rebuttal in a rap battle between two directors.  So much is wiped from the events of the Force Awakens that you will wonder why you even watched that film.  \\n\\nI will try not to spoil anything from the movie.  But beware\\, there may be spoilers here. It only takes a couple seconds for the jokes to start flying and the subplots to go nowhere. The logic used by certain characters will leave you wondering what they were thinking... and not in a good way.  Characters are unceremoniously removed from existence for no reason at all. Two key characters\\, in particular\\, from The Force Awakens are criminally underused. And more than a few scenes risk removing you from the movie altogether.  Snoke is a purely two dimensional villain on par with a Justice League movie villain.  And don't get me started on how little Phasma has to do in this movie. If you are looking for redemption for Phasma in this movie you will be sorely disappointed. The trailer showed about as much of Phasma as you are going to see in this movie.  Her part may have even been longer in the trailer.\\n\\nThe saving grace of this movie is that it is a great send off for Carrie Fisher and Mark Hammil's acting has never been better. Adam Driver has turned his performance as Kylo Ren up a notch and feels like he could be a real threat.  Too bad that by the end of the film\\, you will feel like there isn't much left to threaten.\\n\\nThe second movie in a trilogy should leave the good guys in a place that's a little dark\\, but still leaves hope for a final film with a happy ending.  This attempts to do so\\, but fails.  I don't see how this trilogy recovers from this misstep. Now we wait and hope that JJ Abrams and Disney can bring us a new hope for a salvageable final installment.","true":true}