{"101487":126931,"Last Jedi":"Last Jedi","2017-12-15":"2018-09-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"half a star for the exceptional cinematography and half a star for the solid performances of the cast who did an amazing job considering the contrived story line and poor script they had to work with.. The rest of the movie 0 stars and was very disappointing. \\nI am someone who even liked Jar Jar Binks from the Phantom Menace (Sorry Hard Core Fans) and easily pleased by anything Star Wars\\, so this is very disappointing to give a Star Wars Movie 1 star. \\nLaura Dern is one of my favourite actors\\, so I was really pleased to see her in a Star Wars Movie. So disappointed when she had to play a terribly poorly written character that obviously feels threatened by a male character for no reason and so resorts to condescending him while showing a great deal of incompetence as a leader of people. So frustratingly\\, she is the very opposite of a strong female character Lucasfilm have been promising. \\n\\nThe characters which were set up well in the Force Awakens become 2-dimensional. \\nFinn is relegated to comedy relief (shame because John Boyega is a quality actor and should be given something more to do)\\, \\nRey's character isn't developed further and even becomes unrelatable due to her OP being unnearned. \\nPoe has nothing to do apart from stand up to the office bully (Holdo).\\n Luke's character was needlessly and Fully disrespected by the writer. Worse than that this new trilogy now feels like some sort of morbid death row for the most beloved characters of the franchise. Killing Solo off in the last movie was bold\\, killing one original character off per movie is nothing more than depressing. \\nCaptain Phasma had so much unused potential\\, especially as she is played by the great Gwendoline Christie\\, who took out the Hound in GoT in such a fantastically choreographed and brutal fight scene. Phasma could and should have been more threatening and intimidating\\, especially as she is played by the perfect actor for this. But she's relegated to bit part nothingness. WHY? \\nThe First Order come accross as baffoons and so any real threat to the resistance is dimished to the point where there is hardly any tension or sense of peril in the movie at any point.\\nThe movie is full of contradictions to the rest of the Star Wars universe and indeed to it's own story. \\nI don't understand how the critics gave this movie such a great recommendation. \\nThe second movie in a trillogy needs to subvert expectations and take the story in a new direction. This failed at this badly. It tried to subvert expectations by dodging answering many questions set up by the first movie. No subversions here\\, just dodges. The writer couldn't think of anything interesting to answer these questions so he gave us literally nothing. \\nMy expectation for a good Star Wars Movie was the only thing subverted. \\nI really\\, really wish I could say I like this movie. I have really tried to. \\nThe Force Awakens (even though its a copy of A New Hope) left me excited to see the next instalment. This one has left me feeling worried about the next one.","true":true}