{"101487":136438,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm a very forgiving Star Wars fan\\, but this movie didn't work at all. After two viewings and a lot of reflection I'm struggling to find positives:\\n\\nGOOD\\n* Kylo and Rey Scenes\\n* Luke and Kylo flashbacks\\n* Visuals\\, especially final battle\\n\\nBAD\\n* Rey being a nobody takes her Mary Sue status to a whole new level. Having some heritage would have at least explained away some of her magical abilities. It wasn't in her DNA. She didn't learn how to do anything. So she's just amazing at everything because it's convenient to the plot. Terrible writing.\\n* Leia's Superman moment. WTF? The only time we get to see her use the force and it's ridiculous. No one should be able to survive in outer space. Not even a Jedi master.\\n* Social commentary out of place. Surely the Empire builds their weapons in-house?\\n* Del Toro completely wasted\\n* Finn subplot goes nowhere\\n* Some ropey SFX where characters shown in close-up riding animals\/in vehicles\\n* The whole Casino planet scene was awful\\n* Zero back story on Snoke. What was the point of him?\\n* No character development for any of the supporting characters\\n* Humor out of place in critical moments when the tone needed to be serious. Felt like the movie had to meet a joke quota no matter what.\\n* Phasma wasted again. \\n* A hopeless Luke is not Luke. He didn't have a single redeeming moment before his pointless vanishing act.\\n* I could go on and on but I'll stop now because I'm sad......\\n\\nReminded me a lot of Johnson's Looper in some ways. Some inspired moments wrapped in a mess of a film. Glad for those who enjoyed it. But the sooner this trilogy ends the better. Let's see what Johnson can do when starting from a blank slate\\, but I think it will be more of the same. The Star Wars franchise needs some very talented writer directors to come in and tell new stories. It has yet to find them.","true":true}