{"101487":173810,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The critic score concerns me. This might the be the worst movie going experience I've ever had. A complete disregard for the intellectual property\\, as well as a terribly written stand alone story makes this a film that may be able to do what even the prequels could not\\, kill the Star Wars franchise.\\n\\nThe critic rating is completely mind-boggling to me as this doesn't only offend me as a Star Wars fan but as movie fan who understands the concept of plot\\, structure\\, pacing\\, and character arcs. It also offends me as someone who understands that this is supposed to be a sequel to The Force Awakens. It turns out that nothing presented in the first movie is of value. It is all undermined\\, undercut\\, or flat out disregarded. I can only perceive the writing of this movie as some sort of strange villainous scheme to offend any longtime fan of the series. Is there really anyone so incompetent to have written a story this bad by accident? lol. \\nAll kidding aside as someone with half a brain who grew up watching the original trilogy\\, this was the worst possible fate I could've imagined for my childhood heroes. But there is apparently no room left for heroes in Hollywood. No good versus evil. Only a grey grizzly reminder that even your fantasies are now bound to political ideologies and the harsh realities of this world. Even a long time ago\\, far far away\\, you can not take a break from life to enjoy an uplifting tale.","true":true}