{"101487":149787,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Let's review the Star Wars Last Jedi. First of all let's understand who are the professional movie critics. These are individuals who are considered as professional moviegoers and their critic matter to the movie. \\n\\nBut that doesn't mean they are always right. \\n\\nFor the given reasons below I don't think Star Wars Last Jedi is a great or good movie. \\n\\nI am going to tell you why Disney went on this route towards the end of this review. Let's begin! \\n\\nLuke Skywalker is marked as a washed of Jedi who has lost his way in the movie. He is merely there to be killed off and make way for other characters there is no significance with Luke Skywalker. Great Skywalker was sidelined and demoralized throughout the whole movie. only to be back towards the end of the movie to bie. \\n\\nThere was no significant training from Luke Skywalker to Rey on Jedi training it was merely a Passover. \\n\\nLook how hard it was for Luke Skywalker to lift the X-Wing Fighter from the swamp but in this movie for Rey to lift huge rocks was a no brainier. \\n\\nThat was no great Luke Skywalker moment for us to Remember by to show how powerful is Luke Skywalker. \\n\\nThere is no emotional attachment to Rey to her parents and the discovery of who they are. After all that was the main quest on her side on the first movie. She gave it up. That would have been a much greater story. \\n\\nThere was no great lightsaber battle in the end of the movie that we can speak off. That is a signature of the franchise.\\n\\nThey have a lot of plot lines left unanswered and blank. Knights of the first order\\, exploring General Snoke's abilities and Rey's parents. \\n\\nNow anybody can be a Jedi\\, coming from nowhere you will be the greatest Jedi ever!.. I think this is a cultural effect where you can come from nowhere and you can be anyone in America. This is not necessarily A Bad Thing it doesn't fit with the overall arch of the Jedi Order. But in the context of Star wars it is better to have little mystery around it\\, on where and how the Jedi's become. \\n\\nBeing feminist is good it is not a bad thing but when you're pushing for it you can almost see it through the movie. Female characters over the male characters again this is not a bad thing it is just when you are trying too hard to do it the movie fails. \\n\\nWhy Disney sent on this route ? Movie is all about\\, out with the old and let's make a New trilogy. I am not talking about this trilogy\\, I'm talking about Disney's next trilogy after this. I will not be surprised if they kill off Rey on the third movie and bring the kid from the end of the second movie to the next trilogy that is all about continuity and make more money and make more movies in the franchise. I am sad to say\\, this is going to be just like transformers. \\n\\nGood special effect tho! Transformers any one ?","true":true}