{"101487":140274,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I tend to be a pretty harsh critic of movies\\, and I made the decision to go into this movie with an open mind. I didn't want to miss out on an enjoyable movie going experience because I was too caught up in nitpicking everything that happened on screen. For the most part\\, I was able to ignore some (but not all) of the problems that this movie had. Still\\, walking out of the theater the best thing I could say about it was \\\"Well\\, I guess it wasn't terrible....\\\"\\n\\nSince walking out of the theater I've allowed myself to revisit some of the problems with the movie. And there are several. They killed off Ackbar like it was nothing. Leia Force floating back into the cruiser was ridiculous. Poe\\, who I liked a lot from TFA\\, acted like a child for the entirety of this movie. Poor storytelling throughout. I could go on. \\n\\nSince walking out of the theater I've allowed myself to revisit some of the problems with the movie. And there are several. They killed off Ackbar like it was nothing. Leia Force floating back into the cruiser was ridiculous. Poe\\, who I liked a lot from TFA\\, acted like a child for the entirety of this movie. Poor storytelling throughout. I could go on. \\n\\nBut I think the most disappointing thing about this movie is that it has made me finally realize that Star Wars will never be as good as the first two movies again. TLJ wasn't good enough to get the franchise back on track. But it wasn't bad enough to force major changes from Disney. They're still making hundreds of millions at the box office and they're going to continue to make the same mistakes in episode 9.","true":true}