{"101487":182333,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is not a perfect film. Honestly not many movies are but the biggest thing wrong with the Last Jedi are your own EXPECTATIONS. I too went into my first viewing with all these expectations in mind. Who is Snoke? Who are Rey's Parents?Who and Where are the Knights of Ren? How strong of a Jedi will Luke be? I too left the theater angry and disappointed when these questions weren't answered in the way I wanted them to be. But as fate would have it I had already bought tickets to a second viewing. Thank God! Cause upon my 2nd viewing I turly fell in love with the film. \\\"Why the 180\\\"? I asked myself. My expectations! The 2nd time I went into the theater I wasn't carring all that baggage of preconceived notions and selfish premeditated assumptions on how the movie should go. I was relaxed and allowed the story to flow as intended and many intricacies were discovered. This is a beautifully made film with much thought behind it! If Rian Johnson accomplished anything it was that he created the foundation for Star Wars to venture into the future! He rescued it from the hands of the ever increasing Fandom that was sure to strangle the franchise with their own personal assumptions and theories. Go into this movie with an open mind..\\\" You must unlearn what you have learned.\\\" I think Luke said it best: \\\"This will not go the way you think!\\\"   Don't allow the preconceived views of yourself and others to keep you from enjoying the next great chapter in this wonderful saga called Star Wars!","true":true}