{"101487":172814,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The 8th entry into the Star Wars universe comes off the heels of the great Rogue One and Force Awakens that left us with so many questions. Star Wars 7 was criticized of being too similar to the prequels but does The Last Jedi become more separate than that and continue this already successful trilogy. \\n\\nThe film picks up exactly from where we left off in Episode 7 as Rey arrives on the planet to find Luke and give him his lightsabre back and the Resistance have just destroyed Star Killer base. Like Empire Strikes Back\\, the resistance is on the backfoot\\, in fact they've never been weaker as they are pursued by the First Order with only 3 ships in what is the longest chase sequences in cinematic history. Meanwhile\\, Rey tries to persuade a reluctant and hermit like Luke to train her and eventually he gives in but not for long as she leaves to try and turn Kylo Ren back to the light. An unnecessary subplot to drag out the film involves Finn teaming up with new comer Rose to get a master coder from a casino and has very little point to the story I felt and all the effort is brushed aside very quickly. Other than this\\, the plot is executed well and does a good job of keeping the tension and interest level in each of these three plot lines. \\n\\nThe acting is exemplar\\, particularly Mark Hamill as Luke and Adam Driver and Kylo Ren who both capture the emotions that are conflicting inside them. Carrie Fisher has an excellent send off in her final performance and the new(ish) cast also shine in their respective roles. Some inclusion of characters is a little pointless such as DJ in the casino sub-plot and a small cameo from Maz Kanata in case you forgot her\\, but more development is given to new one such as Poe's dedication to the Resistance and the caring side of Finn. And don't get me started on the most unbelievable and forced love story between Finn and Rose. Now what about Snoke. Oh dear\\, oh dear. I don't know if I love what they did by killing him off or hated it. A character that was essentially built up as the new 'Emperor' was killed off in an instant. I mean it was bound to happened but not three quarters of the way through the second film. The death of Luke Skywalker's death was something I didn't want to happened but ultimately it made sense he did and Mark Hamill really does Justice for his characters final outing\\, \\n\\nHowever\\, the action is non-stop\\, and the set pieces are brilliant with several moments making me scream \\\"Yeah!\\\" out loud in the cinema-Kylo\/Rey team up\\, looking at you! The final fight on Crait is particularly nice with the red salt trails as is the cinematography throughout which cannot be flawed. The constant suspense leaves you on the edge of your seat and the vast amount of twists and turns make this film the most unpredictable one yet and had me clutching my gaping mouth at some of them. \\n\\nThe film does an excellent job-and is strangely being criticized-for being different. It still holds the darker tone that there is to Star Wars but the twists and turns and inclusion of new force powers and machines matched with call-backs to the ones before it such as force ghost Yoda (LOVED IT!) make it a Star Wars film that pushes in the right direction. Change is good and that's what will keep people interested in Star Wars. New WTF moments were also brilliantly such as Leia's force flying\\, Snoke's death and Luke and Ren's battle and kept me with a open mouth constantly. \\n\\nThe questions spiked off from The Force Awakens still haven't been answered and it infuriates me. Who is Snoke? Who is Rey? (Ren's answer is completely invalid) Where are the Knights of Ren? If these questions do eventually get answered in episode 9\\, I have no problem with it\\, but I was hoping for some answers\\, not more questions.\\n\\nOverall\\, the Last Jedi is a very solid movie with a great cast\\, action sequences\\, CGI\\, successful inclusion of humour and keeps you gawping and on the edge of your seat the whole time. But an unnecessary sub plot and an indecision of emotions from me about decisions made marks this film down a bit but certainly doesn't make it anymore less a Star Wars film and is immensely entertaining.","true":true}