{"101487":113846,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Confirmation we are on the track to 1984\\nLet me preface by saying i did not see this movie in theaters.  After TFA i refused to support the new trilogy.  I thought TFA was the worst it could get.  After seeing TLJ\\, i see TFA in a new light.  \\n\\nI watched this Movie on DVD with my Brother\\, mother and my Girlfriend.  My girlfriend passed out 10 minutes into the movie.  My mother asked if this movie is supposed to be a joke. And my Brother\\, who had seen the movie twice in theaters\\, came to the final realization that Star Wars is dead.  \\nI was skeptical of the movie because i thought they were going to flood us with SJW propaganda.  They did but that wasn't what bothered me.  What bothered me was the thoughtless\\, cut and paste script.  At no point during the movie was i surprised.  When something \\\"exciting\\\" happened\\, i had no feeling or reaction.  It just happened. The characters invoked no empathy and i have developed no emotional ties to the characters.  therefore\\, any attempt at creating an emotional scene failed on all fronts.  \\nI dont know if the bad acting is a result of a talent-less cast or the result of horrific writing.  I cant say and i dont really care.  Rey may be the least developed protagonist of all time with a sub par backstory.  Her parents are nobody's and so is she.  Kylo is a weak villian who is able to overpower his master.  Luke is not Luke.  The other characters are not anyone worth putting thought into.    \\nWIth the cheap humor\\, poor character development\\, dull plot\\, this movie is a slap in the face to not only Star Wars Fans\\, but to the film industry.  And to all those critics out there giving this movie a high rating\\, and then accusing those who gave this movie a very low rating\\, of being closed minded Star Wars fans\\, shame on you. Everyone is entitled to an opinion and giving a low opinion is a hell of a lot better than giving a bought opinion.","true":true}