{"101487":189113,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To begin\\, this movie is not deserving of all the backlash it has received. It's a beautiful movie in both visuals and sound. The actors have given it their all their performances are commendable\\, especially Mark Hamill's. Rian Johnson chose to take many risks with this movie and for the most part they pay off.  Fans have been asking for the unexpected for years now and here it is. Luke Skywalker is given a new flavor that no one saw coming. While this has been criticized by fans\\, if given enough thought\\, it does makes a bit of sense and makes the character much more fompelling than if Rian Johnson just made him a perfect and wise mentor. Kylo Ren is perhaps one of the best villains in Star Wars since Darth Sidious and this movie captures his inner struggles perfectly. While fans are angry about there being too many unanswered questions\\, most of them have to do with Snoke. While his purpose in this new trilogy is kind of ambiguous\\, one must remember that before the prequels\\, the Emperor's backstory was almost nonexistent. It'll most likely be explored in upcoming comic books. As for th character of Rey\\, many fans have accused her of being an infallible Mary Sue that is almost invincible. But upon closer look at her actions throughout the story\\, her failures are pretty frequent and must be solved by other characters. The greatest flaw in this movie is simply the pacing particularly with one sequence that could've been handled a lot better. In comparison with the other films I'm the franchise\\, The Last Jedi is a black sheep amongst the rest but that does not keep it from being a fantastic entry in the franchise.","true":true}