{"101487":120074,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Fans didn't want a repeat of Force Awakens where the storyline seemed to repeat episode four. Rian delivered on this. I am quite frankly stunned by some of the negative reactions. If every fans needs or desires related to the movie were met\\, then the movie would have been six hours long. Plus fans should not dictate the storyline. We should be surprised and stunned by it. \\nSPOILERS NOW:\\nEveryone seems upset about not knowing about Snoke and more about Rey. I don't see why that was needed. Yes we wanted it\\, but if we don't get it do we all sulk like babies and score the movie low? Some did not like the pursuit storyline. So be it\\, I thought it was fine and it allowed us to see the challenge of a ragtag rebellion and keeping differing \\\"rebellious\\\" personalities in line. Much like Mon Mothma could not order the attack on scariff because of the rag tag natur of the group and ultimately rebellious people did it anyway. It was similar here. Loved it in Rogue One. Loved it here too. Some people complained battle scenes were too short. The movie was the longest yet so why? Curious lot the Star Wars fans. Their fanaticism and need for answers\\, answers\\, answers is a great reason why George Lucas did the prequels the way he did the. And why in the end he wanted out. Can't blame him.\\n\\nI loved it. I\\,loved the fact the the plot was not what i expected. I like it that we saw both sides of Luke\\, the hero and the powerful Jedi Master juxtaposed against the man who could not handle th overwhelming guilt from his failures. The scene where he discusses how he let down his own sister and lost her son to the dark side was very powerful. Made me very emotional. It showed why he was where he was. His questioning of the Jedi order lines up with modern day themes where all of us question the once unquestionable institutions of our time and the arrogance of many of them. Very current.\\nKylo Ren's issues with father figures and authority and how that is crippling him and controlling him was brilliantly played out to the final scene where despit general victory\\, he ultimately lost the opportunity to eliminate them all due to his issues. \\nPoe's journey from being reckless to perhaps becoming a leader. They need him to lead\\, not be a hero. We saw him begin to get there. \\nFinally Rey's journey was well played out. Ironically I felt that Luke and Kylo overshadowed her storyline\\, but still saw her grow to be on the verge of becoming Force powerful. \\nThere were a few plot holes. The eighteen hour escape paralleled with what seemed like a months long journey on island with Luke seemed a little off. But this got lost overall in the journey.\\nTrue it was not what fans expected and yes\\, there will be disappointments\\, but I believe ultimately this is one of the best if not the best Star Wars movie to date\\, well done.","true":true}