{"101487":190396,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Two and a half stars.\\nI don't think this movie deserves the heavy negative criticism.  In the history of trilogies\\, the second movie is never great without the perspective of the other two.  We haven't seen the third movie yet\\, so we don't have an idea of what scenes in the last Jedi had to be there to set up the next film.\\n\\nAs a stand alone movie it had some strong parts and some parts that were pretty weak or absurd but that's not unusual for a star wars series in which arguably the majority of the movies are actually pretty bad.\\n\\nThe Last Jedi in my opinion is slightly better than the force awakens and sort of similar to Rogue One.  The music and filming are on par with the originals with regard to scale and scope of such a large universe.\\n\\nUnlike other reviewers I think it's the characters that are making the new movies weak.  Kylo is arguably the worst villain since the young Anakin days.  I'd say Kylo has better acting but the writing around the character is just so absurdly weak (this is a character that has trained his whole life but was injured by an ex-storm trooper who had never handled a light saber before and was beat down by a girl who just became aware of the force in movie 1).  Here we are at the end of movie 2 and he has yet to win anything.  Still duped by his female counterpart\\, easily fooled (ending)\\, and highly emotional.  Kylo is pitiful and laughable.  Snoke put it best\\, he is a boy wearing a mask and even after everything that's all he remains to be.  Rey on the other hand is a great lead.  Remains to be ridiculously over powered and we still know little to nothing about her.  I suspect there is a reason for this and the mirror scene and all of that (Could Rey not have parents at all\\, clone or Anakin style birth.....interesting possibilities).  We'll see in the final movie but it will take some creative genius to make us think that Rey will struggle in any way to defeat Kylo and his comic relief empire leadership.  Finn could be removed and replaced with Chewie and nobody would know differently or probably care.  He has no purpose whatsoever.  New side kick cast members are mostly just wasted space in the new movie.  We were introduced to some real weak acting and even weaker thought out characters.  This is the real junk of the new movies.  All movies are judged by the overwhelming power of the villain and how the lead hero overcomes that power.  At this rate the villain never truly develops and so the hero doesn't really overcome anything leaving us with a poor story and no feeling of earned victory.\\n\\nThe absurd parts:\\nKylo in general is just an ongoing spectacle but there are parts as other reviewers have noted that simply aren't needed unless they are required for key character development.  The gambling scene and entire planet could have been deleted unless we have to have a reason for a master codebreaker in the final movie.  This was a chunk of wasted time that only amounted to problems caused (not sure why we would expect otherwise).  \\nLuke and Rey:  I still feel there are deleted scenes that show some missed training.  When yoda says Luke needs to keep Rey\\, Luke does nothing and for no reason.  Why is yoda in there at all other than fans like to see yoda.\\n\\nThe Rest:\\nOutside of the absurd parts.  There were magical moments that I loved.  Light Speed attack was beautifully done.  \\nI liked the grooming of the pilot to take on more of a leadership role (though honestly one movie left....why?).  Though silly\\, I liked the few battles in space\\, on planetside\\, or amongst snokes guards all well done.  \\nLuke's final fight scene was great.\\n\\nIt's a pretty mess and I think some characters and scenes are shoe horned in because of the final movie.  \\n\\nI still liked the movie and had fun.  I didn't want to walk out like I did with the young and teenage Anakin movies.","true":true}