{"101487":121414,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First the positives: I loved the way The Last Jedi looked visually and the acting for most part was good\\, in particular Driver as Kylo Ren stood out. Mark Hamill (Luke) gave a wonderful performance and seeing him onscreen again was fantastic\\, his scenes with Carrie Fisher (Leia) were bittersweet as she has passed away. While the plot in terms of content is abysmal\\, I enjoyed pacing for the majority of the film and felt like the build up to the climatic scenes was generally good. \\nUnfortunately the good does not make up for the bad\\, hence the low score. When it comes to well-known franchises and iconic characters the writer and director understanding the characters and content is essential and that is lacking in The Last Jedi\\, with characters and lore sacrificed to instead provide gratuitous twists and 'character development' which would more accurately described as character assassination. Sadly this is NOT a film which honors the 'rich legacy' of Star Wars. \\nAside from the character issues the plot is staggeringly stupid at parts\\, with a major plot point occurring because of a very basic communication failure. Admiral Holdo for no logical reason withholds information from those under her resulting in a disastrous chain of events.\\nMuch of this film's plot is based on character stupidity and failure and the great pity is I don't think Yoda's comment of failure being the best teacher will be heeded as they surely need this stupidity to continue as the writers don't seem capable of coming up with an intelligent story with genuine twists.  \\nMoments in the film which have potential are instead handled in a clumsy\\, heavy handed way - for example the film tries to show discuss war and the part finances and greed pay but rather than intelligently showing us and allowing us to be impacted by visually clues we are treated to some blunt\\, badly written dialogue between Finn and Rose which let us known how evil these scum bags are. \\nInept moments of writing like this will probably be lost on many who instead focus on the pretty visual nature of this film and the cheap excitement of space magic.","true":true}