{"101487":147562,"Last Jedi":"Last Jedi","2017-12-15":"2019-09-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wish the second movie in the third Star Wars trilogy was a better movie.  IMO because of this movie there is no third trilogy.  They're practically just three different movies.  First off\\, there is no anticipation for the third movie because of the ineptitude of this movie.  Furthermore\\, there was no cliffhanger or any motivation to see the third movie.  For example\\, because of the ending of The Empire Strikes Back\\, fans could not wait for The Return of the Jedi because of the carbonization of Solo\\, among other things\\, and how would Luke and Leia save him.  Or Avengers Infinity War has that ending which I won't say\\, and how will the Avengers save the universe in Avengers End Game.  There was none of this in The Last Jedi.\\n\\nThere were so many things that didn't make sense.  Why would Rose Tico assault Finn for leaving?  They are part of a rebellion not part of a military.  How can Finn go AWOL in a rebellion?  It's freaking idiotic.  Why wasn't Solo treated the same in the first trilogy or even Luke?  They left at times.  It's just idiotic.  Then you have Leia who gets blown out in space with no spacesuit or any protection.  And people assumed perhaps she was dead.  Then suddenly out of nowhere she uses the force to bring herself back onto the ship.  Now we all know she can probably use the force given her lineage.  But it was never shown in the first trilogy and not during the second trilogy until this happened.  Why not say a little something that Leia is feeing more of her force powers come forward instead of it just popping out of the blue.  It just seems so convenient and not shock of happiness for this to happen.  It was just bad writing or bad directing which would not be a surprise.  Then Leia\\, Poe\\, and the other lady had their little argument.  Poe said they needed to do something and was forming a coup (similar to what's happened in our country) while Leia said there was a plan.  Essentially\\, there didn't appear to be a plan\\, at least a good one.  Perhaps Leia should have listened to options because they lost a lot of people due to the lack of a real plan.  At the same time\\, they made Poe look like an idiot as well.  Because Finn did not get the job done either which Poe was a part of that plan.  Also the whole Casino part of the movie was unnecessary and extremely long.  If they were going to spend 45 minutes or however long it was in this casino\\, why wasn't it a fruitful endeavor.  They should have shortened this part of the movie if it was meaningless.\\n\\nAlso Snopes seemed like a big deal in the Firce Awakens and perhaps he could have been a big deal in this trilogy.  However\\, they killed him off pretty easily.  IMO Rey is not very charismatic and we don't know much about her.  She is not very endearing because the movie has focused very little time on her and her plight.  She has a lot of face time in the movie but nothing in regards of her or at least very little.  Also Kylo Ren is just weird.  He talks to himself and hears voices in his head.  The way it plays out in the two movies is he should be in a psychiatric ward.  It doesn't play out like these two people are elite warriors.  But they dispatched of Snokes and his guards pretty easily.  Bad writing or directing here also.  And now we're supposed to be anticipating a fight between these two \\\"powerhouses\\\" in the Rise of Skywalker.  Oh please they should have shown they were powerhouses in the movie.  They should have shown that Rey received some meaningful training or she read the books extensively to become this elite Jedi or Sith.\\n\\nThis movie has many more weaknesses and if you're a fan of the first trilogy then you probably hate The Last Jedi or it's near the bottom of you Star Wars movies list.  This is the only Star Wars movie I've seen once.  Every other Star Wars movie i've Watched at least more than 10 times.  I probably watched Star Wars A New Hope the most.","true":true}