{"101487":189176,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To hybrid quote a friend\\, “This is the boldest Star Wars since Empire Strikes Back.” He said Return of the Jedi. My argument is that Return of the Jedi wasn’t bold because it played everything safe. This film and Empire are the only two films in the Skywalker Saga that do not play things safe. If you’re not a drooling theorist\\, who literally wanted Rey to be related to everyone in the galaxy\\, then you’re probably like me and actually enjoyed this film. It’s not a perfect movie but it does a lot of things well. All Easter Eggs aside the film does a great job of picking up right where the last one left off. It has some beautiful scenery and the best acting in the entire saga. The cinematography is fun and pays homage to some classic films specifically on Canto Bight. The sets were gorgeous as well\\, Snoke’s chambers have to be the coolest looking set in a movie I’ve seen in a while. I could on and on at well the film was crafted but that’s to be expected with a multimillion dollar budget. I think the best thing about this movie are the themes that have been implemented. Without spoiling too much\\, Disney is saying\\, “Anyone can be special\\, in a galaxy far\\, far away.” Like it or not\\, how are they supposed to continue making these movies based on actors who are in their 60’s and 70’s? I’ll admit my first go around I was very surprised where this movie went because I didn’t expect the film to go that way at all. Isn’t that why we spend $15 on a movie ticket though? Even some of the things most of the internet has a problem with... at first I was right there with the internet but after thinking about the events\\, in the context of the film\\, most of them make sense. Which brings me to my next point\\, saying this movie is bad because it didn’t go the way you wanted it to go isn’t a fair assessment of anything. That’s called being entitled not being a true fan. A true fan doesn’t say the movie shouldn’t be canon because they didn’t like the installment. A true fan watches\\, walks out of the theater\\, and into the next showing to better understand the film. A true fan doesn’t say that Disney ruined Star Wars because a true fan remembers seeing the Prequel Trilogy\\, over and over again\\, from 1999 through 2005 when Star Wars newbies said the same thing. This is a good film and a welcome installment to the Star Wars Franchise in my book. If for some reason you haven’t seen it yet go see it because it’s a lot of fun and it’s a good one to see in the theater. If you’ve been reluctant because you’ve heard bad things from fans remember the internet is a domino effect. Meaning that most people don’t think for themselves. They hear from someone in their newsfeed that Star Wars was bad and then they feed into it. The reason the film is sitting at 52% from fans on Rotten Tomatoes is because a fan with a following asked his followers to review bomb the movie until it was removed from the Star Wars canon. On that note I’ll leave you with this. I read an article the other day that published about a week after Empire Strikes Back came out. The article talked about how a lot of fans were disappointed or in denial to find out the Darth Vader was Luke Skywalker’s Dad. Sound familiar?","true":true}