{"101487":149869,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Lifelong Star Wars fan. Star Wars is dead. This is a poorly constructed movie. It pays lip service to the Force as being more than just the ability to move objects around...and then spends the entire time ignoring the spiritual and treating force users like X-Men. It’s not the powers that make the Jedi\\, it’s the spirituality\/psychology. The movie thrashes the Jedi teachings\\, and even uses Yoda to promote that effort...and replaces it with absolutely nothing. Rian Johnson’s characters both literally and figuratively burn whatever was left of the heart and soul of Star Wars. To add insult to injury\\, every intriguing setup of The Force Awakens is dowsed in water like a flame held in contempt. Wondering about Snoke? That thread is gone. Wondering about Rey? That thread is gone. Wondering what it means for the Force to “awaken”? Turns out it was just a meaningless phrase designed to make you feel intrigue\\, but the story tellers have absolutly nothing to say. Kylo and Rey have no character arcs - they’re literally in the exact same place psychologically at the beginning and the end of the film. The characters experience emotions not as an organic result of the situations\\, but because the plot requires them to. The plot itself crushes every possible plot thread\\, and by the end you’re left with nothing to anticipate. At the end of Empire we wanted to know what happened to Han\\, and what Luke would do with the information about his father. Not a single character is in pursuit of any goal at the end of the movie. There is no greater pursuit\\, no unresolved mystery\\, no tantalizing facet of the Force. It is awful writing that is so destructive in its consequences it seems as though the writer deliberately set out to destroy the franchise. I don’t mean this emotionally. I mean this as an objective observation of the narrative. The story is now DEAD. Whatever they do with Episode 9 will literally be a self contained story\\, as there is nothing to build off of from 8. I’m a forty year old fan. When the movie ended I just sat there not knowing what to think. I have seen every Star Wars movie at least twice in the theater except for Rogue One. You couldn’t pay me to watch this again. It’s boring\\, directionless\\, nihilistic\\, and swallows itself. I literally have no interest in seeing another one. The characters have been destroyed. There is no longer any threat. The First Order is a joke headed by raging\\, campy bafoons. This isn’t a rage quit. I’m not even mad. The problem is that Rian Johnson has done such a disservice to the characters and to the franchise that I’ve literally lost interest in in. I never thought I’d say that about anything Star Wars. As I walked out to my car I realized Star Wars is dead. It is now a paint by numbers corporate production helmed by directors who don’t get Star Wars and who think the franchise simply a random assortment of space opera and super powers. It’s over. Star Wars is dead.","true":true}