{"101487":182195,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is literally one of the worst films ever made.\\n\\nThe most visible problems are threefold:\\n- Writing\\n- Directing\\n- Acting\\n\\nWriting has\\, in fact\\, quite a few types of problems:\\n- Absolute hatred for the original lore of the universe itself. Old rules are broken\\, mysteries remain unexplained and become even more puzzling while the new additions are confusing\\, arbitrary and short-sighted.\\n- Absolute hatred for the original story. Old characters are turned upside down. Killed outright for no reason\\, made dumb and impotent for no reason. Or made divine when they weren't. Why is Ackbar an irrelevant character in the background next to a Vice-Admiral? And killed without even having a close-up shot?\\n- Insulting and condescending demagogy made to obfuscate the aforementioned. Yoda says the Force is... whatever. It doesn't matter. Luke is here to show that - whatever. The original saga and the prequels were crap. Said by the most beloved and most crucial character of the entire saga.\\n- The lowest form of sucking up to the boss of the production: Kathleen Kennedy. A super-officer aristocrat lady is there to serve as Kennedy's ego trip\\, and a First Order officer is even called Kennedy. Since when do Star Wars characters have Earth names? Since now. Because \\\"sucking up to the boss\\\" day.\\n- Complete disregard for the norms of writing Star Wars. Star Wars characters do not mention the concept of \\\"soul\\\"\\, nor do they say \\\"Godspeed\\\". This changes things. It changes the philosophy of it.\\n- The humor is criminally bad. Star Wars epic isn't an episode of \\\"College Humor\\\".\\n- There's a persistent string of completely ridiculous decisions and behavior on all sides. This is like watching the \\\"Incompetent wars\\\". It's even worse than \\\"Battlestar Gallactica\\\" that started its trend.\\n- NONE of the mysteries of the story are answered. They're not even cleared up a bit. There's a point at witch teasing becomes mocking. This is it.\\n\\n\\nAs for acting.... this is more of a director's mistake than that of actors themselves.\\nBut really - it's just as bad as TFA. Even worse\\, at times.\\nHell - the First Order officers at least looked like military officers in TFA. Now they're caricatures of some weird misbegotten creatures in uniforms.\\n\\nI expected disaster from the start.\\nThis is even worse than I expected.","true":true}