{"101487":132592,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If you grew up watching the original trilogy like I did and loved the original characters get ready to have your favorite childhood hero's completely destroyed. Pretty sure Rian Johnson has never actually watched a Star Wars movie. Even if this movie did not have anything to do with the Star Wars universe (which most of the time it doesn't feel like it does) it would still be a terrible movie. So many plot holes! The Last Jedi completely throws everything out the window that The Force Awakens started. I was not a huge fan of The Force Awakens (it had its issues for sure) but it was enjoyable\\, it felt like a Star Wars movie\\, and setup the characters pretty well. The Last Jedi completely destroys Luke\\, his character is anything but likable and is not the same Luke we grew up with. I now understand why Mark Hamill came out openly criticizing the movie and the way Rian Johnson wanted to portray Luke. This movie was a slap in the face on so many levels. Nothing was consistent and half of the plot lines were totally unnecessary. Do you like character development? Well there wasn't any in this movie but if you have always wondered what it would be like to see Leia fly through space like superman or wanted to see Luke milk a seacow you are in luck! I have never left a movie review before but I could easily write an essay examining all of the problems this movie has. The Last Jedi makes the prequels look like masterpieces. At the end of the day The Last Jedi will not leave you wanting to watch another Star Wars movie nor will you care about what happens to any of the few remaining characters.","true":true}