{"101487":193257,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Warning: Spoilers!!!\\n\\nThe last Jedi is lazy story-telling and completely disrespects the legacy characters and mythology which made Star Wars great and timeless. \\n\\nLucasfilm you completely dropped the ball with episode 8 with many blazing plot holes and new characters that showed poor development. \\n\\nCanto Bight is pointless as is the entire narrative arc for Finn. He also rapidly heals from his severe injuries way too easily. Rose is in love with Finn despite there being no chemistry between them. \\n\\nSnoke and Phasma\\, who both had plenty of potential\\, ended up being pointless characters with no backstory. Also\\, how was Snoke completely cut in half when the lightsaber only went through the front half of his torso?\\n\\nKylo Ren is not menacing he is just overly emotional.\\n\\nThe basic narrative of the First Order chasing the Resistance until they ran out of fuel was just dumb and now that hyperdrives have been weaponised nearly anything can be destroyed with ease.\\n\\nCan someone please explain to me how you can drop bombs in space without gravity? \\n\\nThe Leia scene where she flies through the vacuum of space like Mary Poppins at a temperature of -270C was ridiculous. Moreover\\, everyone else would have been sucked out of the ship when they opened the door to let Leia back onboard. \\n\\nRey is now confirmed as a Mary Sue - she can do everything with essentially no training and her origin story was an unimaginative cop out.\\n\\nThe way Luke Skywalker was handled is nothing short of a disaster. I have no idea how this script was green lit. Luke\\, who is arguably the most iconic hero in the history of cinema\\, was so badly written and misunderstood that the character portrayed was nothing like Luke (this is no reflection on Mark Hamill's acting which was excellent). Milking a sea monster - really!?!? Rey beating Jedi Master Luke Skywalker in a fight - ridiculous! Luke's final scene was a massive let down and his death made no sense.\\n\\nThe surprises in this film were disappointing! This was a film that shocked but not in a good way. The questions that were deliberately setup in The Force Awakens are now rendered pointless. There is basically no connective tissue between these two movies. Also\\, did anyone else notice that when Rey offers Luke the lightsaber in each of the two movies\\, she is standing in a different position? Luke's response to receiving the lightsaber destroys all the emotional weight of this moment created in TFW.\\n\\n\\\"Let the past die\\, kill it if you have to\\\" - mission accomplished Lucasfilm.\\n\\nLesson: Impressive special effects and cinematography does not equal a good movie.","true":true}