{"101487":136192,"Last Jedi":"Last Jedi","2017-12-15":"2017-03-12","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm a big time hard Star Wars fan. have been since the very beginning when I first saw a New Hope at age 5. I'm one of the rare ones that will stand behind and defend The Phantom Menace. and I thoroughly enjoyed the force awakens despite everyone critical New Hope part 2 but what did the force awakens accomplish it accomplished excitement of Star Wars once again. then we come to the Last Jedi yes it's different and is a die-hard fan not one of my favorite Star Wars films. not one of my favorites but I can accept it as part of the storyline plus the very end of the movie gives you the new direction that Star Wars is going to go and if you think about it it's kind of exciting. I do wish pause\\, couple spoilers ahead so if you don't want to read don't read I'm upset there's no backstory on snoke. and I wasn't really a fan of the Rich Casino place and I wasn't a fan of the Finn and Rose story line. maybe I shouldn't have raided this for stars but it is a Star Wars movie and it is what it is and it takes Star Wars in a different direction that Star Wars is never gone before. us Old-Timers Day to Remember what we felt at Star Wars this young New Generation like Star Wars for the way it is now let them have their Star Wars we had ours\\, and realize that it's a story we don't have to like part of the story but accepted as part of the Star Wars universe. my advice to anyone who has not seen it yet go into it with an open mind realizing that it's not going to be a usual Star Wars that you're used to\\, go into it knowing that Star Wars is now going to be a different direction and then just enjoy the fact that you're watching a good movie.","true":true}