{"101487":189157,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Today I signed up to Rotten tomatoes just for the purpose of posting my review for The Last Jedi. \\n\\nI guess you can put me in the category of a lifelong Star Wars Fan for 40 years since the night my parents put me in a stroller as an infant\\, waited with me on line for an hour with their friends and family and spent that evening in the theatre absorbing the sounds of the original star wars movie with it being my first movie that I ever went to. I'm proud of that\\, since now days folks like me are given the purist tag and it's made to be believed that we can't be made happy. As you can read this is my pre-rant intro!\\n\\nI will start off by saying that there were moments that were phenomenal. The first thoughts that came to my mind as I was leaving the movie in disbelief is what have they done to Luke and more importantly the Force. We've had 6 movies prior to the recent  SW movies which have given full and explicit explanation to what the force is and how it connects with everything\\, right down to the midichlorian!  Well they've managed to completely turn lucas's force inside and out and cheapened. Then what did they do to Luke????? I saw the interviews where Hamill expressed his disagreement with the direction for Skywalker and he was absolutely right! They turned \\\"The New Hope\\\"\\, the one that \\\"brought balance to the force\\\" into this completely different person\\, and the story line reasoning behind this decision doesn't cut it. The new Star Wars writers are guilty of getting too cute with the story and for their ego's and selfish reason for separating themselves from the Lucas master story\\, they tossed the baby out with the bath water.\\nSome more negatives \\n- Force skyping is the all new radical thing to do now days *sarcasm off*\\n- 21st century style humor and sayings DO NOT belong in the star wars universe. Let's not try too hard to impress the millennials now. \\n- Kylo Ren skyping with shirt off...........  This is shameless. More cheap Pandering.\\n- Force induced heart attack. I'll just leave it at that as to not spoil this master piece! *rolls eyes*\\nIf it not for the spoiler factor\\, I'd writing for the next half hour","true":true}