{"101487":152910,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Man\\, the writers and director of Episode 9 are all going to have a bad time making a closure to the Skywalker Saga.\\n\\nBasically my take away from this film is that Rian Johnson screwed over the past (Ep.7) and the future (Ep. 9). In context\\, the Force Awakens had set up a lot of opportunities for episode 8 & 9. They had a lot of characters to work with and many other things couldve been done but all of it were wasted because all the important supporting characters are now dead and im not convinced that the remaining characters are good enough to carry the final movie.\\n\\n*SPOILER ALERT!!*\\n\\nI have very little problems with the plot of the story\\, motivations of the characters\\, battle\/fight sequences and pacing but theyre inferior to the Marvel films. \\n\\nMy main issue with the film is the what is left for episode 9. A lot of people dont realize (and i hate the fact that the film is getting a very high score in RT) that after this film there's very little left for the director of the next film to work with. No more Snoke\\, Resistance\\, Leia (technically)\\, Chewbacca and most of important of all\\, no more Luke!!\\n\\nIm very disappointed with what they did to Snoke\\, definitely the most impressive performance IMO. Hes the most compelling antagonist from the roster and you can feel the impending threat looming in the later parts of the movie but then he gets killed in the most disappointing fashion and all of it was gone. The character had so many opportunities\\, i mean he couldve been killed at least on the early parts of Ep. 9 so we can learn more about the character and his motivation during Ep. 8. The guy literally uses advanced Force abilities and i wanted to see more of that.\\n\\nKylo Ren didnt really improve as a character here. When i watched Rogue One for the first time i was like: Kylo Ren had nothing on Vader. And I could still say the same after TLJ.\\n\\nRay's revelation doesnt really make sense in both TFA and TLJ. The lass is good at sword fights and shown to be even better than Kylo. But guess what? she's just a nobody Great work Rian!! (Claps Slowly)\\n\\nThe things that Poe did at the ship and Finn & rose done at Kanto Bight are very important to push the plot but you can really strip it out of film easily because its very forgettable.\\n\\nOne of the nonsensical moments of the film is the one with Leia. I think it was supposed to mislead or misdirect the audience. But it didnt really give me the sad emotion that i wanted to feel during the scene and im more of like disappointed if that was the way she would go. But then it happened\\, she opens her eyes and uses the force to maneuver her way back to the ship instead of imploding due to vacuum and zero pressure in space. I was like\\, WTF?! Are you guys seeing this?! That was really dumb. I didnt see any real purpose of that scene other than Leia being the McGuffin. And damn Leia and Chewbacca were severely under utilized. Chewbacca went from this very valuable and reliable ally from TFA to becoming just the comedic relief of TLJ.\\n\\nOne of the greatest thing that the movie shown was this Chuck Norris moment for Luke where he was blasted with a shit ton of laser beams and walked past through it and just staved off dusts from his shoulder like it was nothing. I was expecting a different thing to happen\\, something close to what Kylo Ren did in TFA where he force held the beam and that wouldve been better.\\n\\nI dont really understand why Kylo had to duel Luke but it did turn out to be a good thing because the greatest nerd moment happened and it was the reveal with Luke using the force to project his presence from another planet. Definitely the biggest reaction from me and the audience. After giving such a huge fan service to the crowd\\, Rian Johnson had to disappoint me yet again by killing off Luke Skywalker. Because his force equivalent died (Snoke) and had to balance it out. I wonder how that works out for Ray and Ben. \\n\\nThe movie was well crafted and is definitely a masterpiece\\, but it isn't quite on the level of Rogue One. There are a lot of plot holes and missteps that would really hurt the next episode. Really makes me wanna lean on the spin offs....","true":true}