{"101487":152783,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Major problems with the movie:\\n\\n- Casino sideplot: pointless and cheesy.\\n- Slo-mo chase sideplot: the whole thing is mess full of plot-holes.\\n- New characters are non-characters.\\n- SuperLeia.\\n- Nihilist Luke: unforgivable character assassination.\\n- Force hologram pulled off the screenwriter's ass for the sole purpose of robbing Luke of a real\\, heroic death-\\n\\nLore and suspension of disbelief breaking stuff and retarded stuff in general:\\n\\n- Dropping bombs... in space.\\n- An X-wing can solo a dreadnought now.\\n- Lo-fuel in spaceships.\\n- Slo-mo chase (why don't use hyperspace to move destructors a little ahead; why don't send fighters).\\n- Snoke reads minds but cannot sense the lightsaber moving or Kylo's intentions.\\n- A whole sideplot reserved for an anti-mansplaining lesson.\\n- Hyperspace-ramming suicide ships are a thing now.\\n- Kylo doesn't recognize Luke\/Anakin\/his' blue saber in Luke's force hologram (he destroyed it 5 minutes before).\\n- Rey masters the lightsaber in 5 minutes.\\n- Rey moving rocks (the CGI in this part was as appalling as the screenwriting).\\n- Finn's suicide run+Rose's love \\\"arc\\\".\\n- Movie ends with a literal toy commercial.\\n\\nThe \\\"humor\\\":\\n\\n- I can hear you can you hear me?\\n- Yo momma joke\\n- Finn \\\"naked & leaking\\\"\\n- *throws lightsaber\\n- Luke's milking scene\\n- \\\"yeah Jakku's pretty much nowhere\\\"\\n- \\\"Reach out\\\" -> literally reaches out with her hand\\n- Ship is an iron visual gag: we spaceballs now!\\n- Drunk alien puts coins in BB8\\n- Opera singer alien\\n- Porg puppy eyes\\n- Porgs chew Millenium Falcon\\n- Porg falls against a window\\n- Rock falls on wheelbarrow\\n\\nDropped\/destroyed plots from TFA's shit \\\"Mystery box\\\":\\n\\n- Luke went to the island to die but left a map that was the main McGuffin of TFA \\n- Finn as a stormtrooper\\n- Rey's parents \\n- Snoke \\n\\nSemi-decent things:\\n\\n-Kylo\/Rey force connection scenes. \\n-Sound design. \\n-That's it.\\n\\nAll in all\\, a very disappointing movie. It's as it intentionally makes a point of destroying all that made this universe compelling\\, all that fans loved about Star Wars.","true":true}