{"101487":145004,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It was no Empire\\, but to be fair what movies are. But what this movie could be used as a lesson in the importance of theme. There was the overall theme of \\\"let the past go\\\" which is a bit heavy handed and cringey at times\\, but that's Star Wars. There was also the meta theme. You can't forget that the original trilogy was a science fantasy take on cowboy and samurai movies. This was a science fantasy take on kung fu and gangster movies which are arguably the matching genres of the star wars original theologies source material in our time. \\n\\nMost important though was how it preserved the moral themes that have pervaded the entire franchise. The themes of failure\\, acceptance\\, and redemption. The failure of Luke calls back the failure of Yoda and Obi Wan in Revenge of the Sith. Luke learns to accept his failure in much the same way that Obi Wan accepts his failure in New Hope and Yoda\\, in my opinion\\, in Empire. And Luke redeems himself similarly to how Vader redeems himself in Jedi. \\n\\nNow I won't sugar coat it. A lot of the movie is Luke being a crotchety old man (Mark Hamill milks the shit out of it too. I found it funny) and Rey being the annoying wannabe protege. They also have the Rey-us ex Machina moments like The Force Awakens\\, but Kylo Ren doesn't have the excuse of shot by Chewbacca's bolt blaster and using the force to hold his insides in\\, but Rey has learned to tune more into the force so its a wash. And Kylo is still a crazy emo person. \\n\\nBut\\, the action is awesome. They pull some stuff out of their asses that you always wondered about but they never showed on screen (until now) and it's glorious. And the best part is that the payoffs in this movie are very unexpected. Losing is winning\\, helping is hurting\\, and you're always kept on your back foot. It also has probably the most interesting Storm Troop scene in the franchise and it is particularly thought provoking.\\n\\nMy advice: see it. Judge it on it's own merits. Not \\\"as a Star Wars movie\\\" because it is very different. But at the same time it is also very much a Star Wars movie and the most honest tribute they could do.","true":true}