{"101487":133304,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I had a similar issues with The Last Jedi as most people after I saw it the first time\\, such as the pacing and seemingly un-starwars like design choices however after watching it a second time\\, I realized I was just going into the movie with he wrong state of mind and I am now convinced this could be one of the best Starwars films of the IP for many reasons I cannot discuss here due to spoilers. But as a long term Starwars fan\\, I went into the movie expecting a reskin or a stylistically similar movie to the previous Starwars films\\, but under the surface which most people notice the first time they will see it (as I did) the movie is SO much more. \\nI went in with the wrong state of mind expecting a starters film like all the other Starwars films that will hold your hands and satisfy all the fan's questions and speculations in each film installment and I would have been fine with that because that's what we got from Force awakens and thats what I expected from this latest film. \\n\\nBut this movie throws away old conventions that date back to the 1970s and that I have ALWAYS considered dated but was always OK with it because\\, well\\, Starwars. But The Last Jedi Treats it's audience like adults. it is not afraid to disappoint speculations and isn't afraid to suggest mind-blowing twists that honestly after watching this movie twice didn't fully notice or appreciate. \\n\\nI could go on into detail why I feel all the hate this movie is unwarranted and unnecessary and that this movie will become remembered years down the road as one of the greatest Starters movies and spoil everything but I won't.\\ninstead ill just leave some advice for those who haven't seen the movie yet. Go into this movie with NO expectations. Go into The Last Jedi with an open mind and keep any bias's at the door. Watch the movie for what it is and try to understand what the movies goals are from a narrative standpoint. and lastly WATCH THIS MOVIE TWICE I cannot stress this enough. this IS one of those movies that you have to watch twice only because of the massive amount of layers that are impossible to notice with just 1 pass. Then decide if you liked the movie or not.  \\n\\nfor me. I didn't originally like it but now that I have seen it twice and started really thinking about it\\, I am a die hard fan. 100%","true":true}