{"101487":162185,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Please beware I've tried my best not to spoil anything but I may have\\n\\nI do not agree with the harsh reviews from the audience. I strongly believe The Last Jedi delivered something that has been lost in previous films of the series. I believe it's something we as humans have a hard time of dealing with in real life. That thing is \\\"letting go\\\". \\n\\nIn the film the theme of \\\"letting go\\\" is reintroduced over and over again. When The Force Awakens intially released most viewers were upset saying it rehased episode 4. This made viewers place certain assumptions about what direction the plot was going. Viewers felt they had it all figured out in terms of what future conflicts may arise and the future for our characters (Reys orgin for example). We were all massively trolled.... and it was perfect. I feel viewers thought they knew star wars based solely on storyline and placed expectations on the new cast to fit the familiar storyline. Poe I feel is supposed to be the new Han\\, he is rash and often off the rails. However\\,  Poe's actions result in something we've never saw from Han's actions (dont want to spoil too much). Finn's arc began with his desire to reunite with Rey. We expected as much since the last film. However let me remind you the theme is to let go. I saw that this part of the film left viewers confused. It was  random but considering the situation he is placed in it is very likely. Rey's story arc i feel hurts viewers the most. This is where it is very hard for viewers to let go and accept. We're are so sold on the highlander idea of \\\"there can be only one!\\\" based on the story so far that anything other than this upsets viewers. I loved the reveal (wink). I feel it revitalizes the series rather then killing it. This is further shown from the final scene of the film. Even Luke had to realize he must let go of his prejudgements\\, and previous outlook on the force. He is reminded of this towards the end of the film (major spoiler dont want to say nothing)\\n\\nThose saddened by the light humor\/cheese have to remember that these films are intended for children if it had an R rating they know they would've had to cater to us older fans of the series and many of those scenes may have been omitted. \\n\\nOverall I feel the story was a lot deeper then what is seen at first glance and doesn't deserve this amount of hate. I can understand where people thought this film was going to take them\\, but\\, hey you were rick rolled. It was still a good flick.  In terms of special effects (space battles\\, lightsabers\\, force powers\\, droids\\, Luke Badass Skywalker) all that stuff was AMAZING can't deny it. I cant wait for the next one (im thinking its bout to be clone wars\/ return of the jedi)","true":true}