{"101487":176145,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The more I think about this film. The less I like it. I will try to keep from going to in depth or from giving too much away in terms of spoilers.\\n\\nI think there are a couple main points that truly kept me from enjoying this film.\\n\\nLuke's Characterization. Which in my opinion was deeply flawed and betrays the character we spent 3 films prior watching him become. \\n\\nThe \\\"Resistance\\\" which seems to me to be the remnants of most of the republic is basically 1 capital ship. It seems just hopeless. but most of all they say \\\"resistance\\\" so many times... it takes you out of the film and you can taste the disney branding.\\n\\nKylo Ren just still doesn't have a motive. His motive was to prove hes dark in the first film and loyal to snoke. In this film... He does something to prove that is not his goal. So really what is his goal? How at all is what Luke does what gets him from not being dark to being dark? and if snoke was poisoning Kylos mind then why didn't luke confront snoke? Instead of trying to kill his sisters son?\\n\\nThe amount of dumb luck that is encountered is also frustrating. I do not understand how the \\\"hacker\\\" charachter that was thrown into the film in jail. He comes out of nowhere. Helps the group and later betrays them.\\n\\nThe plot holes... the complete throwing away of plot points from the first film... Leia Levitating through space....\\n\\nIt was all just to much. I wanted something more original than episode 7. Not something incoherent\\, that just throws away everything from the prior film. Getting Luke to go back to teaching jedi... something... anything. He essentially didn't redeem his charachter at all in the film. \\n\\nHe almost did something horrible. but decided not to. and then did nothing to redeem himself. he just gave up. That just doesn't sound like Luke to me. \\n\\nIf you enjoyed this film. Power to you. But I think you lowered your standard to get there. The cheese employed in this film was too much for me. \\n\\nIf you are going to kill off a charachter like Leia. just do it. dont have her force levitate through space. It completely ruins the weight of the attack. Its so cheesey.... It completely takes you out of the film.","true":true}