{"101487":169557,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS. This movie has many problems. Not just as a Star Wars movie but as a film (and sequel) in general. First of all: Snoke. We still know nothing about this character and probably never will. His demise was unsatisfying and un-impactful because the audience never got to know anything about him. Second: The Poe\/Finn\/Rose storyline. For some reason I actually enjoyed this storyline but in the end it had no consequence and could have been skipped entirely. Why didn't the purple-haired general tell Poe about her plan and how the First order wouldn't be able to track them? The perfect time to do that would have been when he barged in angry at her\\, making her look like the bad guy. There was no reason for that character to hold that information from Poe. Also\\, the codebreaker that Finn and Rose find somehow knew about the purple-haired general's plan and told the First Order about it...but there was no possible way he could have known that. Poe hadn't told Finn or Rose about it and the codebreaker had never met or been in contact with anyone else in the resistance. That is a MAJOR plot issue. Instead of this pointless Poe\/Finn\/Rose storyline we could have\\, for example\\, learned more about Snoke from Luke and then Snoke's death might have actually been impactful. Remember how Yoda in Episode VI warns Luke about the Emperor? If Snoke is so powerful then why doesn't Luke talk to Rey about Snoke? He only mentions Snoke while saying that Kylo Ren's mind was poisoned by Snake but we already knew that from TFA. Another Problem: We still have no explanation for why Rey is so randomly strong in the force. Sure\\, this may come in Episode 9\\, but as of right now there are still more questions than answers. For example\\, if she had been Han & Leia's child that would explain why Anakin's lightsaber called out to her in TFA and would be a decent explanation of why she is so strong in the force with no training at all. This would also make Kylo and Rey's rivalry much more interesting and dramatic since they would be brother and sister. I also see that Disney is trying to make Rey\\, Finn and Poe into a trio like Luke\\, Han and Leia but so far that isn't working out. It seems forced and honestly I wanted Finn to actually sacrifice himself during that final scene because that would have been a hugely impactful moment that would have added so much to the character. Imagine a former First Order stormtrooper sacrificing himself for the resistance! That's something special. Instead they teased us with this act of bravery and then take it away as if it meant nothing...all because Rose suddenly has a romantic attraction to Finn? One last thing and I'll stop: There was no need to kill off Luke. At all. I wouldn't have minded Luke being written off in that way at the end of this trilogy. It seemed like he was finally coming around to the idea that he needed to help the resistance and finish what he started all those years ago. The remaining members of the resistance could have easily gone to pick up Luke and take him with them\\, especially since Leia was with them and could have persuaded Luke to come. I have other issues but those are the main ones. There were some good Star Wars moments in this film but overall I think Rian Johnson and Disney could have done much better.","true":true}