{"101487":180087,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The worst Star Wars production ever; worse than Phantom Menace \\, worse than The Star Wars Christmas special.  The iconic ending from The Force Awakens was destroyed by the way the shocking  way Luke tosses the lightsaber over his shoulder.  This movie actually lowered my feelings towards its predecessor. The Gender war in this movie was sexist and racist. Men are idiots and cowards an women are smart and brave is the message being sent here to children.  This was a feminist reaction to Trump. The plot\\, as it were\\, was simplistic with meaningless and pointless side trips. There was zero character development.  Luke is a washed up depressed loser. Poe is a hapless incompetent replacement for Han Solo. Rey turns out to be a nobody. Kylo Ren is a sap. Snoke turns out to be useless.  Leia flies through space like superman. A purple haired lesbian saves the day\\, sort of. Yoda shows up for a minute\\, Chewbacca becomes a vegetarian. There was no moment where this movie didn't disappoint except one:The purple haired one flies into an imperial supercruiser at hyper speed.  That provided great special effects. But it  raised a different question about the plot; if she had done that 15 minutes sooner\\, thousands of rebels would have been saved. One scene which seemed on the brink of being amazing was when Finn was about to sacrifice himself for the cause and stopped by an annoying woman with a crush on him.  After she stops him\\, she proceeds to sexually assault him as if she was Harvey Weinstein. But in this parallel universe\\, women sexually assaulting men is considered OK.  The last Jedi ruined Star Wars permanently.  Disney must be proud.","true":true}