{"101487":164894,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Returned to update my review and mainly just to make some points I don't see many people making too much on here yet:  The Force Awakens made > 2 billion in the Box Office. The Last Jedi is at 1.3 billion. Even if it goes up a little more that's still a ~35% difference (greater than half a billion dollars!!). The audience score for Force Awakens: 88%. For Last Jedi: 48% = 40% difference. \\n\\nThe bottom line is that a 30-40% drop in box office revenue and 30-40% drop in audience score is simply not a coincidence. And no\\, that doesn't make it \\\"the most divisive\\\"....it makes it THE WORST. When your product is intended to please your audience and 30-40% who loved the previous product now hate it....that's BAD. Objectively: >$500 million worth of bad!\\n\\nKathleen Kennedy & Rian Johnson are not only responsible for destroying the canon and ruining the Star Wars universe for millions of longtime fans\\, but they've lost Disney >$500 million in the process. That's to say nothing of all the future revenue lost for longtime fans that will not go into future movies even the first time\\, because of how clear it's become that they are no longer Star Wars\\, and are not being made by people who actually love or even understand Star Wars.\\n\\nI am envisioning a throne room scene where a Mickey Mouse version of Snoke is using the force to rag-doll Rian Johnson (Hux) and Kathleen Kennedy (Holdo) for their incompetence. It would be the only scene that makes any sense at this point.","true":true}