{"101487":139628,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw this film the day after it's wide release on December 18th. I've been thinking hard about this film. I want to get some common misconceptions about criticising  this movie.\\n\\nFirst\\, I'm not mad that women had a prominent role in this film. I am mad because ultimately there for show and to sell toys to little girls. Rey was useless. Seriously wasted. There was so much you could do with her character. Aside from the infamous Leia Poppins moment\\, our strong and confident\\, take charge Queen was barely in the movie. Laura Dern was a Hillary Clinton type character that ultimately was useless too. I could go on but this was released in 2017. Come on\\, the girls can kick ass and take charge too. If you're in doubt check out \\\"Battle of Stevastropol.\\\"\\nSecond\\, why is Finn useless in this movie? Seriously. His one mission was pointless and the one chance to be useful in sacrificing himself....Rose (Don't get me started on her. Total fan girl. Not much else)  thwarts it because she's suddenly in love.\\nThird\\, Luke Skywalker was totally misused. One minute he's the Star Wars equivalent of Clint Eastwood telling people to get off his intergalactic lawn. If he isn't bumbling\\, crotchety or milking things (talk about a degrading scene) then he's suddenly a teacher of the force without trademarked items. Then he fights a pointless astral projected battle and finally keeps over only to vanish.\\nFinally\\, why did the make the resistance so inept? It seems like every 2 minutes someone has to make a pointless sacrifice to save the resistance from itself. \\n\\nIt took me a long time of asking why would Rian Johnson do this. How did I really feel about it? Initially I was just disappointed. First Star Wars I ever heckled and I've seen all in theater including the prequels. I think now that Star Wars Last Jedi is the worst of the franchise.\\n\\nI was shoveling snow and realized that this movie is a screw you to Star Wars. That line \\\"This doesn't end how you think it will\\\" I think speaks to the director's disillusionment with finally getting to direct one. Think about it. \\nAll things we hated we hated about the prequels: flat delivery\\, focus on aliens-robots-alien planets that don't add anything\\, endlessly pointless collection of subplots that don't go anywhere and cute toy characters  (porgs=new jar jar binks. Everything we liked about Force Awakens was gone. Snoke. Poof. Rey being a driving force. Poof. Luke Skywalker. Literal poor. Poe-mance. Poof.\\nI realized that Rian Johnson now was acting like he was forced into a kids movie so screw you you'll get one. Oh you'll get one. Mindless. Got it. Soulless. Got it. Goofy moments that don't work or fit.\\nHere's your Princess Leia. Leia Poppins. Hate alien worlds and creators. Casino planet! Hate how Rey and Finn don't influence anything? They do even less.\\nLuke Skywalker....literally poof plus I made him a grumpy old man who milks things while mugging on camera. Oh the lightsaber and the Jedi...saber into the sea and we burn the sacred texts.\\nThis movie could have been written by any Star Wars Hater online and probably was. Save your money. Good luck to JJ Abrams on Episode IX if there is one.","true":true}