{"101487":179227,"Last Jedi":"Last Jedi","2017-12-15":"2017-04-08","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The story picks up where the force awakens ended which is new for the star wars movies and it's refreshing.\\n\\nThe force is used in new ways just like in the force awakens I really like seeing how powerful the force actually is.\\n\\nLuke Skywalker is a really different character and it works he feels responsible for what happened to all his students and his mistake with Ben solo\\n\\nWe learn more about Rey how powerful she is and about her parents I really liked seeing Rey and Luke together they're chemistry was really good \\n\\nPoe is in the movie more than force awakens we get more charater development find out how much of a hot head Poe is made me love the character even more.\\n\\nI really liked snoke he's intimidating but unfortunately he doesn't get any character development.\\n\\nFinn is great once again and he's with a new character rose I liked them both together and I liked rose.\\n\\nLeia has a much bigger role and I loved every minute of her on screen.\\n\\nR2-d2 porgs chewy c3-po and bb-8 were all awesome.\\n\\nKyloÂ  ren is scarier I enjoyed seeing him every minute he was on screen he gets more development he's one of the best villains ever.\\n\\nCaptain phasma still doesn't get any development she's in the movie less than the force awakens but I did really enjoy the scene she was in it was a little emotional.\\n\\nThe action was very fun the music was great and the movie looked great.","true":true}