{"101487":149339,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-22","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Last Jedi is a fantastic film -- and one of the absolute best Star Wars entries!  Don't listen to everyone who picks on it.. they are wrong!  :)\\n\\nI'm a lifelong Star Wars fan.. I saw the first film at age 9 more than five times in theaters... then waited hours for Empire and ROTJ when they came out.  And the fans who rail on Last Jedi are overfocused on complex canon and insider stories-- they miss what's great about Last Jedi and why it's a superb part of the series.   \\n\\nin particular:\\n1) Luke and Rey's character development is PERFECT.  Luke's humanity and flaws make him a more believable\\, compelling character. He's no deity -- he needs to OVERCOME his fear and challenge.. and in LJ he does.   And Rey's parentage (spoiler: \\\"your parents were nobodies\\\") emphasizes that it's her spirit and heart that distinguish her.. not her BIRTH.\\n\\n2) The film is the MOST CLEVER and well-constructed of the Star Wars films... (\\\"the force isn't about floating rocks\\\" !! .. \\\"everything you just said is wrong\\\") ... it's funny\\, cute\\, and filled with amazing suspenseful moments that explode with excitement.\\n\\n3) Visually -- it's a masterpiece.  White salt on red stone ... this is gorgeous\\, metaphorically appropriate (the appearance of blood) -- and even better plays a key function in the storytelling device.  Footprints?\\n\\nThere's even more that makes this movie great ... Porgs\\, the music accents\\, etc.\\n\\nRun\\, don't walk\\, to watch and enjoy this one!","true":true}