{"101487":115653,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Did Rian Johnson misread the memo and think he was writing the next movie in the Spaceballs trilogy?  I swear I was waiting for Rick Morantis to come on screen and give the order to prepare for the jump to ludicrous speed.  Was there really an opening scene of a lone x-wing pilot prank calling the commander of the imperial fleet?  Apparently the greatest Jedi in the galaxy has been reduced to a hermit nerf herder who looks more at home in an episode of Steptoe and Son.  Did we really need to see Luke Skywalker milk the rubber boobies of an alien cow?  \\n\\nThe post Return of the Jedi storyline has stepped off the reservation.  Disney would be wiser to get back onto firmer ground\\, aka Rogue One\\, with credible back story\\, plot lines and villains that; a) have a purpose and b) actual villainous screen presence.  How about stories around the period between creation of the Empire and New Hope?  Take us to the period of Palpatine and Vader completing their conquest and Jedi purge.  What is the story of Obi Wan's escape to Tantoine and spark that gave rise the the Rebel Alliance?  If branch stories are need\\, write back in Cassian Andor\\, K-2SO\\, Saw Gerrera and Jyn Erso and their pre-Rogue One adventures as part of a bigger 'creation of the Rebel Alliance' episode.  Disney seem to handle new storylines better than trying to live up to expectations and deliver on previous established character sets.  After the treatment Luke Skywalker just got served\\, I dread to think of what the young Han Solo movie is going to add to that characters story.","true":true}