{"101487":156658,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(No spoilers.) Yeek. This didn't feel like the originals at all. I wonder if any delight anyone felt by this could be a lasting one. I saw so many mess ups. It looked like the original Star Wars\\, but that's not why I go. I couldn't feel anything... though I know which way I was supposed to at the exact moment from all of the heavy jerking. \\n\\nDoes it have any deep meaning? Can you talk about it at length from all the thought put into the scenes\\, or were those scenes just all for show? I don't stick with people I don't trust\\, and a lot of the supposed heroes seemed to try to show well\\, but carry a hatred or hidden menace to them that makes them seem rotten at the core. I was wrong to trust the good guys at first\\, because they seem to have let me down. \\n\\nNot that the bad guys are any better though. Their motivations don't even make sense. They're just in the way of things ever going right\\, and it's so shallow and annoying. Political messages are forced throughout\\, but no love for engineering science\\, like the other films. Gender equality and political correctness is most important\\, but don't try to apply battlefield strategy and military tactics to this war. It felt more like a social message war\\, fought by people who know or care nothing about science or space\\, in a forum generated by really accurate designers. If that sounds yuck\\, congratulations. You just showed the disingenuine automators what a real emotion is! Now prepare for the strength of their hatred. I was wondering why all of the initial high praise seemed so lackluster. When they all said 'I'm going to see it again\\,' it seemed like frustrating work\\, as a look of consternation would grow on each critic's face. Something seemed off to me the moment all of the marketing started looking like diet toothpaste. I'm glad I waited until $5 movie day for this film\\, which Disney demanded an unprecedented percentage of the cut from theatres for. Shameful. Honestly\\, I'm saddened by this film. I loved growing up on Star Wars\\, and I feel awful seeing it turn into a film like this.","true":true}