{"101487":196365,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While an enjoyable enough movie the script generates \\\"surprise\\\" by sacrificing story telling. It felt as though the author of the script had no idea how to answer the questions and characters of Force Awakens and so instead fell back on simply dismissing them. It was a slap in the face to the fans who have spent two years wondering about the \\\"big reveal\\\" this move was going to hold in regard to Rey's identity\\, Snoke's background and power\\, Luke's time between Jedi and Awakens by dismissing it all in an extremely casual manner that didn't serve to advance the story at all. Further the director seemed bent on taking a stab even at the continuing unhappiness from the harder core fans surrounding the thirty years of back story being tossed out by Disney by having Yoda himself destroy the \\\"history of the Jedi\\\" with a laugh. It was essentially a vehicle for making fun of the die hard Star Wars fan and letting them know in no uncertain terms how stupid they are. It's also a somewhat bland and typical action adventure film that keeps you watching and waiting through two hours\\, leaving the theater with a sense of exhilaration and then being hit with an overwhelming sense of regret at having watched it almost before you reach your car in the parking lot. Is it the worst Star Wars film... there's always Phantom Menace for that spot so no but it may well be the most insulting to the core fan base. In the end will it share the top spot with Empire as a disliked Star Wars film on release that stood the test of time. I doubt it and I don't plan on seeing it again in the theater- maybe on download... maybe not. I'd wait for download though if you have not seen it yet.","true":true}