{"101487":146160,"Last Jedi":"Last Jedi","2017-12-15":"2018-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I waited a year after watching this film before reviewing it. I let it sink in as a piece of art\\, as a piece of entertainment\\, and as a cultural milestone before writing this review. I wanted to make sure my point of view wasn't influenced by the real poison of the alt-right-ish reviews or the fan-boy\/girl\/persons gushing over it. Also\\, I wanted to not let my own \\\"nostalgia\\\" for the original trilogy get in the way\\, because it was getting in the way something serious up until now. So\\, here goes.\\n\\nThis film has no character development and no clear climax. Stuff just happens\\, in space\\, with space wizards doing space wizard stuff. Also\\, some animals were freed from captivity while slave children were left in slavery. Wow. How this film ever got made... I'll never know.\\n\\nI took my daughter to see this film because I thought she'll be able to see women in central roles: Rey\\, Leia\\, maybe even Rose... but I was wrong. So very wrong. Rey did little to nothing save one fight with Kylo (which didn't need to happen). Leia was comatose most of the film and then REWARDED THE PERSON WHO LED A MUTINY AGAINST HER CHAIN OF COMMAND (wth!?). And Rose was like\\, hey I'm Rose! There was nothing for her to identify with in this film. She was seven and didn't know if she liked the film or not. She never asked for a SW toy or wanted to play make-believe within the context of the SW world. That's pretty bad if you ask me.\\n\\nThe rest of the film was either forgettable or so bad it hurts your head to figure out. TLF is a super terrible film. One star\\, and I'm sticking by it.","true":true}