{"101487":118163,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Enough has been written about why this film sucks. \\nSo instead of complaining about the film\\, I want to complain about this website! Specifically\\, the way Last Jedi's audience score is being manipulated!  \\n\\nI've CUT & PASTED these RT user reviews below to make moderators aware of whats going on:\\n\\n**************************************************\\nTodd B:\\n\\\"Also the audience reviews are no way as high as 49%. This whole website is crooked.\\\"\\n\\n\\nAiden J:\\n\\\"I love how the user score says 49% when anyone with a brain-cell can see its far lower. Rotten Tomatoes is FAKE!\\\"\\n\\n\\nZhaoBin L\\n\\\"They CAN pay off Rotten Tomatoes to freeze the audience score at 49% (even though its clearly far lower).\\\"\\n\\n\\nMicah D:\\n\\\"Scroll down these reviews and you will see four out of five are either neutral or negative\\, you tell me how the rating as of now is sitting at 49%. Disney has so much money they can buy off anyone they want\\,\\\"\\n\\n\\nDavid T:\\n\\\"THE 49% audience score as of this writing is way too high\\, I am utterly gobsmacked it is this high.\\\"\\n\\n\\nScowly X\\n\\\"Edit: Notice that 49% audience rating not going down even though there are noticeably more negative reviews than positive ones? Gee... I wonder what that's about.\\\"\\n\\n\\nAva M:\\n\\\"We already know the critics 90% score was bought. \\nBut now they want us to believe the public gave this pile of poo-doo 49%!\\nIf the last 50 pages RT allows us to view is anything to go by\\, 49% is mathematically impossible! 10% is more like it!\\\"\\n\\n\\nDave J:\\n\\\"Something is also strange with these reviews.. most are negative yet it still has a 49% audience score.\\\" \\n\\n\\nWayne G\\n\\\"49% I think Rotten Tomatoes have given up counting as it surely should be lower than this\\\"\\n\\n\\nSaul L:\\n\\\"And there's no way the audience score is as high as 49%  Just look through the reviews here. Its impossible.\\\"\\nThink I'll stick to Metacritic for an HONEST score!\\n\\n\\nMiguel G\\\"\\n\\\"I see Rotten Tomatoes is on the Disney payroll.\\n49% audience score? LOL! More like 15%\\\" \\n\\n\\nClaire K.\\n\\\"Btw. how is the audience rating stuck at 49% when vast majority of REAL reviews (as opposed to most of the 5 star reviews which have non-existent accounts) give it only 1 or half a star?\\\"\\n\\n\\nMarlon W:\\n\\\"Oh and there ain't no way the audience score is 49% for real. Its much lower. RT can't count.\\\"\\n\\n\\nMuhammad L: \\n\\\"I don't understand how RotTom can collate it to 49%. Thats far too high.\\\"\\n\\n\\nJae L:\\n\\\"I heard it was bad but DAAAAAMMMMNN..... This.... was.... BAAAAD!\\nSeems most feel the same way. In fact how is the audience score 49%?\\\" \\n\\n\\nViking P:\\nAnd whats with the audience score being frozen at 49%? That doesn't seem right. Is the House of Mouse being 'generous'?\\n\\n\\nRobert P:\\nMaybe I'm wrong on that but I have a hard time buying the current 49% audience score.\\n\\n\\nJoe B:\\n\\\"Oh and the score should be way lower than 49%!\\\"\\n\\n\\nThomas R:\\n\\\"Second I need to say the score on here ( currently 49%) seems high. I have been reading as many reviews as possible and the numbers do not seem to be in line.\\n\\n\\nDan H:\\n\\\"Why is RT keep deleting it?! Because I said the audience score is lower than 49%? Am I not allowed to make a blatant mathematical statement now?!\\\"\\n\\n\\nEstaban G:\\n\\\"RT appears to have FROZEN the Audience Score.  I'm guessing Disney paid RT not to allow it to go below 49%.\\n\\n\\nJ .Scott P:\\n\\\"It seems that Rotten Tomatoes won't let this film fall below 49%.:\\n\\n\\nJames J:\\n\\\"Proof that Rotten Tomatoes is rigged.\\\"","true":true}