{"101487":146397,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I want to see the movie that the critics' watched\\, because it must have been completely different than what was shown in the theater I was at.\\n\\nWhile I am not opposed to humor\\, the humor in this movie just seemed forced to the point they actually added pregnant pauses after each beat to allow audience laughter. It was really easy to notice because the entire audience was silent during these save the occasional groan.  \\n\\nThe pacing was terrible. Here is 2 minutes of action and plot progression\\, now enjoy 35 minutes of filler that adds nothing to the story or character development. \\n\\nPlot holes on plot holes to be found here. Not even getting into the \\\"rules\\\" of the Star Wars universe there are 3 major easily avoidable conflicts presented in this movie if any of the characters had even a minimal sense of self-awareness.\\n\\nThen they took all the goodwill they had established in The Force Awakens and destroy it\\, but for good measure also destroy everything established in the original movies.  Spoilers ahead. \\n\\n- Jedi and Sith no longer need training\\, they can just be the strongest and have all possible skills because the force deems it so and they need balance. \\n\\n- Force ghosts can now manipulate weather\\, so you know on Hoth when Luke is freezing to death Obi-Wan could have easily brought in a warm front. When the rebels are losing their ass with the Ewoks in Return of the Jedi they could have struck the Imperials down with lightening. \\n\\n- Jumping a large ship into hyperspace near another large ship disables the enemies shields and causes catastrophic damage. Yet nobody thought of this when dealing with Death Star #1\\, Death Star #2\\, Starkiller Base or the shield on Skariff. It literally solves almost every plot in Star Wars in 5 minutes or less. \\n\\n- Luke Skywalker gives up training after 1 lesson. \\n\\n- Nothing in the Force Awakens matters. \\n\\n- Snoke assembled the First Order and is the strongest force sensitive being in the galaxy\\, but can't sense\\, let alone hear a metal lightsaber sitting right next to him. \\n\\nThe New Republic apparently disbanded after the destruction of Corouscant and made no attempt to counter-attack the First Order. Apparently all their ships we also destroyed. \\n\\n- You can fall in love with someone within 12 hours of meeting them\\, while also mourning the loss of your sister who you were close with.\\n\\n- There are even more issues","true":true}