{"101487":167899,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So I have been seeing several reviews on Facebook about The Last Jedi\\, so I have decided that I can now give mine. This is a NON SPOILER REVIEW\\, so it will be vague in places\\, (pm me if you want the detailed review). I’m going to start with positive points. The movie looks great including the CGI\\, (with one or two hiccups along the way). The action sequences were everything you want out of a Star Wars film. They are exciting and definitely took your breath away in some places. NOW... for the negatives. I’ll start with the acting because there were some noteworthy performances from Mark Hamill and Adam Driver. They demanded your attention and their performances were seamless. With that being said there were performances such as Daisy Ridley’s that were good but I had a hard time fully believing. A lot of the dialogue that was given to Daisy did not fit her character. You could tell it was a movie and someone had written dialogue\\, but it never resonated with me\\, it felt out of place. There were a lot of other character’s performances that were fine\\, but they were more of the same from The Force Awakens. Other performances were just downright awful\\, in particular anyone that was not a main or supporting character that had to deliver lines. Those lines were not delivered well\\, and I found myself often cringing after hearing them speak. The music for the second time in this series disappointed me. It’s not that it was bad\\, but there were a ton of reprises and not many new themes that gripped me like in past films\\, (I haven’t felt like that since Attack of the Clones). I found myself straining to find new themes\\, and I suspect that John Williams felt uninspired by the material he had to work with\\, (maybe it was just me who felt uninspired). I can go into a lot of detail\\, but for the sake of this post I will just say that there were A LOT of missed opportunities\\, such as character development. Several characters were either pushed to the side or done away with completely for the sake of the plot which leads me to the main problem... THE STORY. The story was lazy and the subplots were terrible\\, and were pointless by the end of the film. I found myself asking why a lot in this film. In conclusion this movie was a disaster and was not a good movie. It was disappointing to say the least and did not deliver on what had been built up in the previous film and did not honor the films before that. This movie was a disgrace to Star Wars and has left me sad and wanting for the franchise itself. I give The Last Jedi a 2 out of 5. I can’t give it any better than that. To me it was an utter failure and was not worth the wait.","true":true}