{"101487":161035,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Others have written excellent\\, well thought out summaries of this atrocious abomination of a film.  Especially those that talk about the concept of heroes journey.  Kudos.  A few things that seem to have slipped through the cracks are the special reflective armour of phasma...  Like the hyperspace bomb\\, you don't think someone in First Order procurement might have said\\, wow\\, this shiny stuff reflects blasters\\, put in an order for 100\\,000 of them.  Actually\\, having ALL the storm troopers in silver would have been a sight to behold.\\n\\nAlso\\, what happened to the other jedi that Kylo didn't kill?  Did they become the knights of Ren?  Did they just retire and go home?  Have force heart attacks like Luke?  Who knows???\\n\\nYou'd think that Disney of all companies would know that Star Wars is at its root a fairytale.  Good guys\\, bad guys\\, bad stuff followed by triumph and happily ever after.  The character arcs of all the characters (and Luke in particular) is what made Star Wars the greatest example of pop culture in cinema.  It's the same reason why the Harry Potter and LOTR books resonate with so many people.  You'd think Disney knows this.  So give Luke a satisfying story.  With poor Carrie dying\\, reuse the footage and have her actually die (move that part to the end)\\, omit the spacewalk and reshoot a handful of scenes.  Hell\\, it would have ripped our guts out but at least added some menace to the absurd wimpy emo caricature that is Kylo Ren.\\n\\nWith respect\\, I could have written a better story that what Rian Johnson served up.  Anyone involved in the decision making process that saw this travesty given the green light should be sacked.  No two ways about it.\\n\\nHere's the thing I don't get.  When you are writer you get to be god.  So why the need to kill Luke?  Why the need to kill Admiral Akbar?  Is it to just paint the rebellion in a really dark place by the end of the story?  And if so\\,is that the best you can come up with??  Why the need to do the space casino at all?  Just to give us some way too obvious moralising?  Hell\\, people argued that the rebels were supposed to be a parable of the Vietcong in 1977 (I don't agree) but if that was the intention\\, at least it was subtle.\\n\\nIf Rian had half a clue he would have had Luke slump over at the end and leave us guessing.  People would accept this\\, and it would leave the door open for episode 9.\\n\\nIn Rian's favour\\, I will admit that he was left with a poor platform to work with.  An emo does not an evil villain make.  Han should never have been killed off (I suspect it was part of Ford agreeing to do the film though).  The whole origin of the first order should have been established (with a prologue if necessary). The 'do I speak first?' skit in TFA was not funny the first time round but they evidently doubled down.\\n\\nI feel that Disney lost sight of what makes a good story at the expense of their 'vision' to be an all inclusive touchy feely 'equal opportunity' company.  Now that's all well and good but it's a movie for god's sake\\, not a manifesto.\\n\\nI prefer to think of this movie as non canon and to behonest they'll still make squillions off us all if they re shoot it and pretend this joke of a film never happened.","true":true}