{"101487":125565,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Great movie if you are looking to see the Avengers.. Or perhaps Guardians of the Galaxy. Full of cheap laughs that involve characters being grown against walls like a rag doll (remind you of the hulk and Thor in Thor Ragnarok anyone?) for laughs. That may work great for the movies mentioned above. Yet it just felt forced for the movie that it is. I loved the force awakens\\, even though it seemed like a remake of a new hope. It had some flaws\\, but what movie doesn't? It had amazing character development. Left some big questions\\, and really pulled us back into the universe. Yet this movie took everything that was set up in the first film\\, and threw it in the rubbish bin... Ruined some amazing characters. Mark Hamill was right when he quoted: I fundemtially disagree with everything that you have done with my character... Don't even get me started about Snoke\\, and the entire buildup for his character. The questions surrounding him\\, and the formation of the entire First Order during a period of peace in the galaxy... Forget building the story. Let's just sweep it under the rug why don't we. No one will notice. Here is more CGI action for you to behold instead!  \\n\\nThen again\\, maybe I'm the odd one out... I care about character development\\, emotional ties\\, and a solid plot more than action and slap stick laughs. Yet there have been very few movies in the last few years that have anything more than that. Perhaps thats just what's important to the masses these days. Or alternatively\\, maybe thats why fewer people are going to movies in Cinema. Not because they don't want to pay to see a movie\\, but because the movies have just been garbage... \\n\\nEither way\\, I'll let you be the judge!","true":true}