{"101487":170448,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars TLJ is painfully average. In another series with less intriguing IP it may just be average\\, but for a main-series Star Wars film it's painfully average. \\n\\nI enjoyed the visuals and the fight choreography was a treat. The movie was visually stunning with good CGI and it didn't rely on exposition. Instead\\, we were treated to many action sequences.\\n\\nThe plot\\, however\\, was full of holes and completely... boring. Ignoring that it destroys Star Wars canon\\, what makes this movie \\\"painfully\\\" average\\, the entire plot is built around a slow space chase that is not interesting and is full of plot holes when considering how many options the First Order had beyond just following them and firing at them. This is the entire meat of the story. The rebels start the movie on the run and end on the run.\\n\\n- Other gripes aside from Star Wars canon:\\n\\nBelow an elementary understanding of how gravity and space work.\\n\\nContinuity in the Finn\/Rose scene after the light speed crash.\\n\\nNot using the other ships that ran out of fuel to ram the First Order.\\n\\nPlugging in BB8 as a plot-hole filling magician.\\n\\nRey getting back to the Millennium Falcon. How?\\n\\nFinn and Rose getting to a ship and being the one lone ship to skip under the wall. Convenient.\\n\\nCheesy kiss when there was no chemistry.\\n\\nFinn dragging Rose across the entire battlefield without being fired upon.\\n\\nThe entire boring sub-plot of the casino world could have been avoided had the admiral with purple hair just been transparent with the plan. Something she had no reason to hide. \\n\\n- Star Wars Canon:\\n\\nThe man who almost sacrificed himself because he saw the good in the second-most evil person in the universe was going to strike down a sleeping teenager because he saw evil in him?\\n\\nRey bests a master Jedi within days of being familiarized with the force.\\n\\nPrincess Leia Mary Poppins act and not dying. This level of force power yet she also couldn't move the rocks at the end?\\n\\nJedi Skype.\\n\\nLuke doesn't die but he dies. \\n\\nIt's a winter popcorn movie with good action\\, but plot holes galore and character depth that would make you think this was not part of a larger... universe.","true":true}