{"101487":139429,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I remember leaving the theatre with my friends and all of us just looked at each other with no smiles on anyone's faces.  The most \\\"beautiful\\\" scene in the movie completely screws over any form of logic to space battles in the past and now going into the future. RJ threw out many of the interesting plot points that JJ had developed in TFA which was very disappointing.  He took the one character that never gave up on anyone and changed him into an angry old hermit who was about to kill someone because he saw some darkness in them...  I mean come on this guy confronted Darth Vader and the Emperor and didn't give in then.  There was little to no character development\\, in fact\\, I'd argue that characters like Finn and Rey regressed.  Kaylo had a little bit of development but then fell right back down into angry teenager.  The movie also made so many jokes of very influential characters that it really lost any sense of seriousness about their situation which was dire.  The subplot with Fin and Tico was pointless and could have been removed from the movie without any damage to the story at all... That's horrible to do to the first Asian and Black characters for this new trilogy.  However\\, I do wish they would have done that to give us more focused development on Luke\\, Kaylo and Rey who kind of seem to be the only interesting characters that matter in this movie.  My only compliments to this movie was the beauty of the CG and the little owl bird things on their cutness.  The rest of it is a mess with many wasted oppurtunites","true":true}