{"101487":184171,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie intentionally ignores and subverts every plot point\\, question\\, and expectation raised in TFA. It changes characters entirely from who they were in previous films and canon material. It undercuts the emotion of TFA and the significance of all events in that film.\\n\\nThis film showed that Lucas Film has no respect for the various novels\\, comics\\, and tv shows they put out to fill the huge gaping holes the script leaves in their films. \\n\\nHan's death caused no change in Kylo inner conflict. Kylo was not progressed at all. He was the same character in TLJ as he was in TFA. \\n\\nHux had a completely different person than he was in TFA. \\n\\nPhasma was a huge let down and a completely different character than she was in her novel. \\n\\nSnoke and his significance was a major let down and salt in the eye for everyone who followed the hype created about him and teased in the many various new canon novels and comics. How he treated Hux and Kylo in this film was bizzare and not at all fitting of a Star Wars movie or someone of his supposed importance and intelligence. \\n\\nRey's lineage\\, one of the major focal points and questions raised by every major character in TFA is undercut with the most unsatisfying answer ever. The explanation for how she had such amazing force abilities in the TFA contradicts canon. She was the same character in TLJ as she was in TFA. \\n\\nFinn and Poe had no significant or interesting story. They were both the same characters that they were in TLJ as they were in TFA. What they do in this film is of little consequence to the trilogy. \\n\\nWhat Leia does in this film contradicts established canon established in all the previous Star Wars films and specifically Leia's own words in new canon novels. \\n\\nOther questions raised in TFA or in other canon in general are not answered at all. This film is not a sequel to TFA because it has nothing to do with it. It doesn't address TFA or progress the narrative or develop the characters. \\n\\nSo for anyone stupid enough to care about canon or the OT\\, you won't enjoy this film. The things that happen in this film destroy the characters and legacy of all the OT characters that are in it. \\n\\nThe cameo in this film by a certain PT\/OT character (and what that character does) has the potential of ruining any story that could be told and really puts plot holes in every Star Wars story that has ever been told. I'm not joking. \\n\\nIt's hard to take what this film does as anything other than a personal \\\"f*** you\\\" by Rian Johnson and Lucas Film to JJ\\, Lucas\\, the fans\\, all previous creators of anything Star Wars\\, and the Star Wars property in general. I'm not being hyperbolic. I truly mean that. The stupidity of this film is that insulting.\\n\\nIf you are a causal fan or new or new to Star Wars you might like this film. It has entertaining action and Marvel-styled humor. Although\\, it is way too long and is badly paced.\\n\\nDon't expect this to be a sequel to TFA because it is not.","true":true}