{"101487":170423,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi won't be the last Jedi. Mark Hamill's Luke Skywalker emphatically thinks the warrior heroes are a breed that ought to die off. The sooner the better. Since I was pretty bored through most of the movie it's hard not to agree with him. \\n\\nThis is a franchise that's lost its way. \\n\\nFirst the story. It picks up where 2015's The Force Awakens ended. Daisy Ridley's Rey finds Luke Skywalker and tries to enlist him in the fight against the First Order. She also does a nifty mind-connection with Adam Driver's Kylo Ren and while the three of them do a dramatic dance the rebels - or what's left of them - try to escape a First Order trap.\\n\\nIt's a bit more complicated and deeper than that - and maybe that's the film's problem - but you get the picture.  \\n\\nWriter\/director Rian Johnson's movie is underwhelming. Like all Star Wars flicks it has great effects and excellent performances. Where it falters is a story that borrows heavily from others in the franchise like The Empire Strikes Back. That I can live with but I can't live with unnecessary length. This is an overdone 2 1\/2 hour movie that would have been a terrific 90-minute extravaganza. \\n\\nThe first hour drags. The predictable second hour is just as tedious in more spots than not before Johnson (Looper) finally moves you to the even more predictable slam bang action of the last half-hour. \\n\\nHere's where Star Wars lost its way. The franchise died with Harrison Ford's Hans Solo. He provided the fulcrum for the humor in the original films and through The Force Awakens. Ridley picked up the sword - or should I say light saber - for the rest of the movie. Johnson's The Last Jedi script forces her to abandon a wonderful sense of humor. \\n\\nToo bad. Solo's death - and the non-use of Ridley's terrific tongue-in-cheek acting skills - sucked all the life out of the new series. Gone is the cowboys in space fun that made this franchise one of the - if not THE - most popular and richest in history. \\n\\nI will - however - be in the minority on this one. Other critics are going to rave about the movie. I suspect - like with Dunkirk which I also didn't like - many feel this is something they have to like or they'll be viewed as not too cool. You may feel the same way. Some of you may want to send me hate mail or have me fired. \\n\\nYou can try. The Force is with me. I stand undeterred. While I am barely giving this a positive rating\\, other than the effects and some wonderful interplay between Ridley and Driver\\, Star Wars: The Last Jedi is average and underwhelming. It should be - but won't be - the last Jedi.","true":true}