{"101487":187182,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was utter trash  it spent far too long on some pointless casino scene  in factfinna nd roses journey could have been completely avoided had we known Holdos terrible plan from the get go.  not to mention her plan hinged on the imperial ships not being able to spot transport vessels....which we know they can spot escape vessels from A new Hope.  ya know what there is jsut too much for me to blast in this piece of trash.    Lets see Rey's ability to digitlay erase weapons that will kill her ...yes it is there clearly in the finished product look at the guards weapons as he draws back once he arm locks her.   poor storytelling I mean yes do not get me wrong there are bad films but this one is incredibly overrated.     to suggest one is to critical of this film because its aimed at children...no   it was a terible film chock full of garbage.  it wasn't aimed at children because children would have grown bored too during it.   But it made a lot of money ?  yes and most of the people who gave it multiple viewings admit they didnt like it the first viewing in fact it took mutliple viewings to like it.    ....thats called people trying to rationalize either a no star wars vs bad star wars. or b \\, i spent  upwards of 40 dollars to see this crap i better like it.  As for critic scores....ya know alot of the you tube critics  who gave negative reviews about this crap  got copy right strikes against them....hmmm i wonder why.","true":true}