{"101487":175065,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi had so much potential. Brilliant scores by the iconic John Williams\\, a franchise with arguably the most devoted fans in the universe\\, and unparalleled pockets for dishing out unparalleled SFX.\\n\\nSadly\\, the most substantive qualities for cinema are lackluster or absent entirely. The dialogue is forced and exists primarily as exposition. Rather than shaping a character\\, or giving added depth\\, the dialogue simply acts to push the scene along like a shopping cart with that one reluctant wheel dragging lazily behind in the form of gag worthy exposition. \\n\\nThere are two moments in the film that gave me a much needed sense of release and are so well placed that they feel as though they are the work of anyone but the director. One scene contains no dialogue\\, no sound and no actors. It's simply a moment of CGI brilliance that punctuates a scene as intended: To bring gravity to a character's decision.\\n\\nThe other scene is 3 seconds of an extra. He says one word\\, makes one action and brings the audience in deep and to ground with characters in play. \\n\\nBoth of these scenes are quickly abandoned to romp along in the forced drama playing as if it were a sci-fi action film. The director seemed to have an insatiable hunger to punctuate every scene with forced gags and \\\"witty\\\" comments in an effort to get the audience to laugh. They add no value to the story\\, detract from the previously established personas of the characters and feel more like a tug of war between Abrams and Johnson.\\n\\nIf you liked Rogue One\\, then be prepared for a ride where everything you embraced and loved about that film is left on the cutting floor of Disney's studio as the maniacal high-pitched laughter of a possessed mouse rings out.","true":true}