{"101487":116475,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disney might as well have let the makers of Highlander 2 make this film.  It was an epic fail on almost every level.  After waiting thirty plus years to see Luke Skywalker utter dialogue on the big screen we are treated to such a drastic rewrite of the character that he is hardly recognizable.   Gone is the Luke who would risk everything for those he cared about.  In his place\\, someone who cares about nothing.  Galaxy burning\\, Han dead\\, Leia begging for help\\, none seem to matter.  Worse the audience is given almost nothing to explain why Luke ended up this way.  All we get is an all too quick monologue flashback from Mark Hamil telling us what we mostly already knew from TFA\\, with the small addition of Ben Solo was so bad Luke thought about taking him out.  Hardly\\, the decision any Jedi would make no less Luke Skywalker who saw the good in Darth Vader.  Instead of exploring the dymamic between Kylo and Luke further we are given scenes like Luke milking some hideous creature.  \\nAlmost all of what TFA sets up is abandoned.  Foreshadowed events are flippantly discarded and it's done in such a way the TLJ seems to almost intentionally insult TFA. One such scene\\, characterises Kylo's mask as \\\"ridiculous\\\" another takes the carefully crafted importance of Anakin's lightsaber and literally tosses it like refuse.  \\nThen there is the race to run out of gas.  Luke feeling that the most powerful force wielder in a generation will be good in \\\"three lessons\\\" and awful attempts at humor.  Imagine a scene where Han Solo prank calls Grand Moff Tarkin.  I think Peter cushing might have walked off the set.  \\nThere is a new let down in every scene from Rey's parents to Snoke's backstory\\, there isn't a single nod to fans.  In the end Benicio Del Toro's character sums the movie up best\\, when he says today the first order blows you up\\, tommorow you blow them up.  Who really cares?  You won't because you won't have attachment to any character's in TLJ.\\nJJ should start Episode IX with the events of TLJ in their entirety being a dream sequence.  From the space Mary Poppins Leia to Snoke in a bathrobe like he couldn't be bothered to get dressed for the movie\\,  the film was garbage.  I think many of us just refuse to hate a Star Wars movie containing the iconic characters we grew up with but the time has come to rebel!","true":true}