{"101487":195561,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What can I say about this film that hasn't already been said? It's just a dreadful Star Wars story. I honestly didn't know it was possible to make so many poor writing choices. Obviously I have the same complaints that everyone else has (ruined Luke\\, pointless casino subplot\\, etc) but here are a few other issues I have:\\n\\n1. I wanted to see more of Chewbacca. When Han died in TFA we had no time to see Chewy mourn. I really feel like that was something they should have explored. \\n2. Every showdown has to be huge. This is a problem with Marvel films as well. The final battle in Empire Strikes Back is Darth Vader vs. Luke. This film did not give us that emotional one on one fight between Luke and Kylo and it would have been much better with it. \\n3. Instead of having the Resistance on the run the First Order should have been on the run. This would keep it fresh and much more distinct from The Empire Strikes Back. It would also allow us to see Kylo grow as a leader and pull off a stunning victory for the FIrst Order at the end of the film that would propel the story into episode IX. \\n\\nOkay\\, I could honestly keep going all day but I'll stop there. Ohhhh...last one. A big issue I have with the last 2 SW films is with how they treat the force. Remember how you felt the first time Luke used the force to pull his lightsaber out of the snow in Ep. 5? That small moment of magic...it was special. That's what I wanted. Small magical moments that allow us to see how difficult it is to be a great Jedi. Rey\\, without any training\\, is literally moving mountains...no just no.","true":true}