{"101487":163287,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Primero que todo\\, la película no es mala. Me parece una estupidez que la gente la esté haciendo pebre en Rotten Tomatoes y Metacritic. Incluso hasta leí la imbecilidad de una petición para que la saquen del canon. Esto no es una religión (la cuales en todo caso están llenas de falencias\\, jaja) y star wars tampoco les pertenece. Talibanes.\\n\\n¿Que pasó entonces? Bueno\\, sin entrar en spoilear diría que \\\"Last Jedi\\\" se debate entre entrar a las profundidades de la trama más dura de Star Wars (donde se la juega) o ser un producto Disney. Por eso me parece una película de momentos\\, que de repente por eso no cuaja del todo por intentar abarcar demasiado. Por momentos tiene éxito\\, a veces flaquea\\, y en ocasiones puntuales guatea feo. \\n\\nAl final aplaudo la valentía de \\\"Last Jedi\\\" y su capacidad de aunar algo de visión de autor con cine corporativo. Se la juega en su visión de La Fuerza. Tiene momentos muy buenos... y también una de la escenas más malas que he visto en todo star wars\\, jaja. Está bien\\, pa fracasar hay que intentar. Positivo: muy feminista la película\\, muy acorde a los tiempos modernos. Negativo (para mi gusto): Mucho chiste\\, y un par de momentos mágicos Disney en que quise tirarle un escupitajo a la pantalla\\, jaja. \\n\\nQuedémonos con lo bueno: una película valiente que tiene éxito en no ser un remake de \\\"El Imperio contraataca\\\". Mejor que esa película cobarde pero con fibra que es \\\"La Fuerza Despierta\\\"\\, cuasi remake de star wars original. \\n\\nNo\\, no es mala. Tampoco es extraordinaria. 3.5 de 5.","true":false}