{"101487":122253,"Last Jedi":"Last Jedi","2017-12-15":"2019-01-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Full of plot holes and military mistakes that do not make sense. \\n1. (Plot hole) How did DJ know about the cloaked ships? Yes\\, he overhears Poe telling Fin and Rose that the resistance is planning to abandon ship and loading the crew in the shuttle (singular not plural\\, this is what is actually said) so how does he know they are cloaked or have multiple ships? He has no way to know when the resistance is executing this plan nor does he have any way of knowing they are cloaked because it is never mentioned in his presence.\\n2. (Military mistake) why doesn't general Hux order his ships to immediately attack Poe? Why bother negotiating if it's already been established that they are attempting to eliminate the resistance. The first order had no problem destroying multiple planets in the last film so why now are they are willing to negotiate and spare a small fleet?\\n3. (Military mistake) General Hux doesn't order the star destroyers to assist and protect the dreadnought from the bombers. \\n4. (Plot hole) when Fin\\, Rose\\, and Poe leave to go on their mission they go into light speed and the first order doesn't notice this. If smaller ships can go into light speed unnoticed and you have cloaking technology why not just send the crew onto the smaller ships and leave while the first order is distracted by the larger ships? Even if the first order is able to track the smaller ships (which if so why didn't they notice when Poe Rose and Fin left?) Why not get on the smaller ships\\, split up and jump to light speed in different locations\\, they couldn't follow all of them effectively. \\n5.(Military mistake) why doesn't the first order open fire on the resistance immediately after tracking them through hyperspace? Or why not send out huge amounts of tie fighters? What they do instead is send 3 tie fighters to initiate the engagement\\, why? Remember the old star wars films where dozens if not hundreds of dogfights occurred in the majority of space battles? Where are they in this film? \\n6. (Military mistake) Rose saves Fin. Rose decides to save Fin in his suicide run on the ground cannon\\, she defends this decision with the notion that you win by saving loved ones not killing those you hate (or something like that) but they lose anyway. She does this which then leads to more resistance fighters dying in what is clearly just a selfish move to save Fin because she likes him. On top of all this Rose had no way of knowing that crashing into Fin wouldn't kill him\\, making his death pointless. \\n7. (Plot hole) Fin and Rose somehow get from the ground right in front of the cannon to back inside the bunker on the salt planet. How were they not spotted or fired upon? Fin literally just teleports to Poe's location the next time you see them with no explanation as to how he got there. Remember that the last time you see them Rose passes out from her injuries\\, the next scence she appears in she is still unconscious\\, so wouldn't Fin have to carry her?   \\n8. (Plot hole) if light speed can be weaponized why hasn't anyone else ever done this? I'm supposed to believe that this is the first time anyone ever thought of ramming a ship at light speed? Even if it's a suicidal action\/kamikaze attack it seems like someone should have used this action before. \\n9. (Plot hole) this is more of an issue of questionable morality but still presents the plot with Issues. Fin and Rose decide to rescue some animals while away on their mission to find the hacker. This is an issue in the story. They seemingly don't have time to park their ship in a legal (or at least less conspicuous) location but have time for a side mission? They rescue the animals knowing or risking more resistance fighters being killed off while they do this. They rescue animals instead of the slave children (what the hell) and from the looks of it these animals just ran off to a nearby field\\, which (unless the owners of these animals are incompetent) can be easily tracked and recaptured. So really the point of the side mission is to spite the animal's owners and wreck the city. Doesn't Rose save Fin using the notion that you win by saving people not attacking what you hate? So why the spiteful side mission?\\n10. (military mistake) Why doesn't Holdo tell Poe about her plan? Poe has been established as one of the remaining captains among the resistance. Yes\\, he was previously demoted but still remains in a high ranking position and deserves to know the plan as much as anyone else. Is Holdo not telling Poe because she doesn't like him? This is a ridiculous explanation\\, withholding information for personal reasons is not something you do as a  vice admiral. Holdo also knows that Poe is rash and likely to formulate courageous plans so why not tell him to avoid such measures?","true":true}