{"101487":198580,"Last Jedi":"Last Jedi","2017-12-15":"2017-05-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars movie ever made - the phantom menace was better. Absolutely nothing made sense - its like someone whos ONLY source of star wars was gleened by hearing their 8 year old kids playing with some old star wars toys given to them from some distant uncle by mail with little context abd this childishly randomly by the cuff  PLAY TIME FUN WAS PLAGIARIZED INTO THIS $200+ million BUDGET PILE OF CRAP I JUST SAW!  Did this person evan SEE THE OTHER MOVIES?  Every single use of Jedi powers in this movie was BRAND NEW\\, never existed in the universe and\\, but for one time\\, was an omnipotent display of logic bending - universe changing - rewriting of canon.  That and what quite literally took every single Jedi character(8 films to date\\, countless books\\, even multiple well written cartoon series) years to learn\\, years to pass down and teach\\, is now being used by the 2nd  most powerful mind Luke has ever known...WITH NO TRAINING LET ALONE KNOWLEDGE.... WTF? \\n\\nIts like a hospital based drama on tv and the receptionist in this show all of the suddenly pushes the doctors aside and says \\\"im doing this heart transplant surgery... by my self... with no college... trust me.\\\" - AND SUCCEEDS! You wouldn't need to argue if that broke the mold of doctor drama television - it's so far out of left field ot shattered the mold!\\n\\nOk\\, ok\\, you may be thinking \\\"this person is just an over reacting fan\\\".  Fine. Put aside logic needed to discuss how this was  not the same Star Wars universe JJ Abrams said be wanted to respect. \\n\\nWhat about the dynamics of character? ANY CHARACTER! There are no heros (less 1 bomber pilot in the beginning) who accomplished anything! Literally nothing is different at the end of this film in regards to a single character from the end of the last one. Nothing. So much was set up in Force Awakens to entice us to learn more about these new characters and salivate over more back story of where amd what the old characters had been doing. There was so much awe and dramatic meaning in seeing Luke presented with his old lightsaber - as a  cliffhanger to Force Awakens - that one must assume we will have fruition to decades old questions answered mixed with light shed on new mysteries.... Its not a spoiler when I tell you THEY ANSWER NOTHING!! \\n\\nThe very first scene with Luke is the presentation of the lightsaber... and he just throws it away over hus shoulder! This light saber that called to Rei is thrown away.... Iam not lying when I tell you this sums up the movie in context to its source material! Just like every single thing that was set up in previous movies. As if what came before is trash.  \\\"ha ha\\, I know you came to see star wars\\, but I don't like star wars so I'm creating something different.\\\"... But what about the CHARACTERS WE LOVE? LET ALONE ALL THE NEW ONES? Who is Snoke? Wjo is Phantazm? Where are the other Jedi Luke trained? Who are Reis parents? What has the rebellion been doing since they won the war and the universe celebrated(George Lucas made sure that's what happened with the updated version of episode 6)? Better yet why is the universe not im turmoil after a dozen MAJOR WORLDS BLEW UP? They take a trip to Star Wars Vegas and no one even notices - they tried to say its because they were rich\\, well those dozen planets had rich people on them and they're DEAD but it's s like no one i the universe cares about anything so WHY IS THERE STILL A REBELLION!?! \\n\\nAnd the WORST character travisty\\, played by Benicio del Toro\\, somehow takes credit for what Snokes planned\\, the biggest switch of the movie: omnisciently knowing the plan of using STAR TREK CLOAKING DEVISE(though used in cartoons never ina film\\, still lazy writing)!! Point being\\, how the heck did he know?? Why the HECK did the first order pay him IF SNOKES ALREADY PLANNED AND KNEW THIS!? \\n.. WTF? These characters are like monopoly board pieces - they have no purpose other than the sake of knowing what time stamp we are in the films progression! \\n\\nNot a single  character had any depth let alone logic to why or what they were supposed to do in this film. I didn't care if any died or not - except Luke. \\n\\nNothing happened in tjis movie to pull the stories forward. We're nearly at the same point we were half way through Force Awakens. This movie ia just one chase scene tagged to the end of that film. \\n\\nIm done. \\n\\nDone venting. \\n\\nDone caring for the characters I grew up loving. \\n\\nDone ever giving another dime to this Hollywood crap product line. Period.","true":true}