{"101487":160913,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"On par with Pirates of the Caribbean sequels.\\n\\nI guess hand dismemberment motif has been replaced with self sacrifice suicide. I guess a CGI Carrie Fisher is cheaper than a living Mark Hamill. I guess Rey can use the force to float back onto the Millennium Falcon through the vacuum of space. I guess there are only about a dozen people making up the rebellion and also they are called the rebellion again. I guess if you have a good enough agent you can get a cameo in a star war and if you have an even better agent you can get a few lines and become as much of a plot mechanic as a robot or autopilot. I guess if you can use time travel and space wizards for suspension of disbelief you can do whatever you want and nothing ever has to matter or have any consequence. I guess Luke's storyline symbolizes the nihilism of fans and coming to peace with death is the only resolution to anyone's story arc. I guess child slavery is still a thing in Star Wars but the good guys are too busy merely existing to do anything about it. I guess at this rate the Star War is a war of attrition. I guess they can't engineer a hyperdrive missile and need to have bombers that drop cartoon cannonballs in zero gravity. I guess its a space tactic to wait 6 hours for your enemy to run out of fuel to destroy them instead of just sending out faster ships. I guess 'your mom' jokes are funny. I guess blue milk comes from space manatees. I guess if you make a movie 2 and a half hours long it is better than a movie that could have edited out useless tangents and be a really concise progression to a story. I guess the prequels are good because the 6 year olds that saw them when they came out have jobs and can spend money now. I guess the first order doesn't have security cameras to make sure nobody kills their leader and lies about how it happened to seize power. I guess I can look forward for the satisfying pizza-roll quality of a new Plinkett review.\\n\\nI have to guess all of those things because none of them are explained. Which is fine\\, I like Harry Potter and Game of Thrones\\, I understand that heroes die and women can be  vital developed characters with complex non-stereotype strengths and flaws. But I also know that the only reason Darth Vader knew that the Millennium flacon went to cloud city is because Boba Fett had enough experience to realize Han Solo might try to sneak away by hiding in the trash. Thats not a plot hole\\, thats a simple gesture to explain what happens next\\, and to give importance and depth to an otherwise minor character. That sounds nerdy but its pretty basic example of why I left this movie feeling hopeless: the opposite of that happened almost constantly for the 2h30m duration.\\n\\nI didn't want or expect a self gratifying inside joke victory lap for the fans. I did however expect a Christopher Nolan level conflict of characters internally and externally because if you have a blank check figuratively and literally to make a good movie\\, it is possible (Rogue One). But thats not what happened. I saw the people in the theater around me that liked this movie. They laughed when they were supposed to laugh and got to see things blow up and some people ride horses with big ears that smash through walls. This movie has no responsibility other than to ensure that the next litter of movies becomes possible. Essentially reproducing by budding instead of survival of the fittest. I'm shocked that this Star War doesn't rise above a blockbuster golden goose\\, but I'm not surprised.\\n\\nPS: I liked that Rey's parents are inconsequential and that Kylo killed his boss because arrogance is a weakness and never underestimate an entitled white guy's capacity to snap under extreme stress and ridicule. And I liked Luke kind of being a failure that couldn't even follow through on committing arson but ghost Yoda picked up the slack. Luke was never a fully resolved and established superhero\\, he always had good intentions but really only got lucky that Darth Vader decided to kill his boss because he felt bad for his estranged son\\, otherwise his bet would have NOT paid off. But\\, I wish he could have showed up in person to go full Obi Wan\\, instead of force-skype a 10 year younger version of himself to say bye to his sister. And i'm ok with Oscar Issac threading the needle and disabling that big dumb space ship\\, it goes back to the weakness of pride thing\\, its a nice dose of subtlety in an otherwise ham fisted button smashing storyline.","true":true}