{"101487":138848,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really enjoyed it. My mother and I are huge Star Wars fans. She grew up watching the originals in theaters.  I have read most of the books and comics that are no longer cannon. I have spent hours reading them on my free time. I was not expecting a full story that was so detailed. If I wanted that I would go and complain about Disney making a show Series. The most detailed movies are the prequels. If you are not older you will not understand them like the originals. The fans wanted a new movie that was not the prequels\\, but something like the orginals. Well they did that and everyone complained about it. The fam demanded that they make a new movie that's nothing like the originals. They make a movie that isn't like the new ones. Now everyone is pissed. I think that they are a bunch of cry babies. I'm glad Luke went out like Obi-wan and Yoda. He was able to master the force ghost. He didn't die of  exhaustion. He died because he knew his destiny was at its end. Just like Kenobi on the Death Star. That's why he looked at Luke. Because he knew it was his time to pass the torch. People also didn't like the Casino scence. I like it because you think Everyone at the casino are filthy pigs who build just for the First Order. Well we find out that they also supply the rebels. It's not just about Jedi and Sith. The galaxy is filled with people who don't care about the safety of the universe. They care about wealth and social status. I really enjoyed the movie but I didn't like how Laura Dern's performance felt she was another mom in every movie she plays. Her death was amazing but I am unhappy that Admrial Ackbar wasn't in her place\\, ripping through the First Orders fleet. Over all this was an amazing Star Wars movie!","true":true}