{"101487":175371,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi\\, is exactly the movie that needed to be made. It is a very good character driven story of hope in adversity\\, it does not rely on amazing fight scenes and explosions to keep me enthralled. It is the interaction of all the characters on the screen and how there lives are tangled together.  The fact that past heroes are not 100% infallible. Whilst I did find a flaws with the movie\\, especially the abundance of humor in the opening scene\\, this did tone down as the movie went on also there are still a lot of unanswered questions for the new trilogy. These should wet the appetite not sour it\\, get the fan boys in overdrive with new theories\\, not calling for the movie to be scrapped from the main cannon.\\n\\nWhat I loved about this movie is the fact that it does not rely on past glories (like the force awakens and to some extreme Rogue one) to drag through a new age. the story felt like it was on new territory\\, untold something that has not been done. This is a star wars movie to help bring in a new generation of fans into the fold\\, for me it succeeded in doing this. While some people may say the new movie ruins there childhood\\, I can honestly say I do not understand where that feeling comes from. \\n\\nWhy is everyone crying about Luke's character being destroyed? What was so wrong? In this movie Luke Skywalker was ashamed about his part in the rise of the first order! He went into exile and shut himself off from the force. Does this not mirror both his mentors? Obi and Yoda both went into exile\\, shut themselves off from the force because off the part they played in the end of the Jedi order (the training of anakin Skywalker and order 66\\, being able to be manipulated by the sith). Luke drinks breast milk why? To try and make Rey think she has made a mistake as clearly he believes he is not the legend she and everyone else thinks he is. He refuses to train her! Did Yoda not do exactly the same thing in empire? Was he not the same annoying character who with the convincing of obi changed his mind and trained Luke. Did Luke not change his mind and save what was left of the resistance? So after a little self doubt\\, Luke saved the day and the new Jedi order by self sacrifice as did obi wan\\, he used the remaining force he had?? Luke should be allowed this self doubt he was too old before his training began so his emotions were not wiped\\, like younger Jedi before him. \\n\\nFor me Rian Johnson\\, produced a very good movie with brilliant aspects and some that could have not been included. However when was the last time anyone saw a perfect movie that ticked every box for everyone.","true":true}