{"101487":175417,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is not just a bad Star Wars movie\\, it is a bad movie. It is wrought with forced\\, poorly timed humor. The character development we were all hoping for (to make up for the lack of development in The Force Awakens) is nowhere to be found. In fact by the end of The Last Jedi there is still no reason to believe that the three main protagonists (Rey\\, Finn\\, and Poe) have spent more than 4 waking days in the same room. By the time the credits roll approximately 3 weeks have passed since Rey left Jakku. I'll trust you to be able to work out why this short time-span is a major issue with understanding why any of the characters care about each other\\, and why Rey can perform feats with the force that even a full strength Master Yoda had to put forth great effort to achieve. A more clever viewer might also realize that an entire subplot involving a casino and a codebreaker could be completely removed from the movie without changing the outcome. We are talking about close to 45 minutes of film that accomplishes nothing for the overall plot. I am sorry to say that about the only part of The Last Jedi worth praising is the casting. I think they actors and actresses involved did the best they could with a bad script and do not deserve any of the blame for the failure that is currently rotting its way through the box office. The writers for this film and The Force Awakens are in a for a reality check once the new trilogy ends and they can't rely on the Star Wars name to ensure that their movies bring in the crowds regardless of whether the film is actually good.","true":true}