{"101487":182503,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is NOT the Star Wars movie you are looking for!\\n\\nBy far the worst Star Wars movie in the franchise. Thanks a lot Rian Johnson aka Jar Jar Binks. There is so much wrong with this movie so I won't go into great detail and just list the issues this film. \\n1. They destroyed the Luke Skywalker character - For those who love Luke you won't be happy with his storyline. Luke is in hiding because he a coward and he contemplated murdering a young Kylo Ren? This is not Luke and the director has no idea of who Luke is obviously.\\n2. The Story revolves around the New Order chasing the Resistance remaining ships through space until their fuel runs out which makes no sense when the new order could of just sent a few of there star destroyers ahead through hyperspace and turned around then destroyed the resistance or just sent the thousands of tie fighters they had to destroy the remaining ships the story made no sense.\\n3. Prince Leia Mary Poppins moment was stupid - She apparently gets killed when a couple tie fighters blow up the bridge of her ship and she gets sucked into space. But no she awakens in space uses the force (when she never has before IN CANON) to pull her self back to the ship where she opens the door and no one gets sucked into space after the door opens. Furthermore\\, you would think after getting sucked into space she would be a solid block since she is in absolute zero or that she would be killed by the concussion of the blast but the director just ignored this.\\n4. The movie length was too long - Going into this I was excited to see a longer Star Wars movie but that would have been awesome if if the story wasn't too stretched out and uneven and became boring at points.\\n5. Captain Phasma - Was hoping to see more of her but nope she in the movie about five minutes and then she apparently dies. You would think they would have given her a larger role since fans were loved her in the Force Awakens.\\n6. Everything JJ Abrahams created in TFA was basically ruined or left unanswered still (Rey's parentage\\, Snoke backstory\\, etc...).\\n7. Force Powers - apparently force users have god like powers now they can project them selves across the galaxy\\, communicate across the galaxy\\, and force ghost can summon lighting. What made the Jedi and Sith interesting is that they were not all powerful and had limitations but the director just doesn't get and didn't study the Star Wars lore. \\n8. Intentional Money Grab with all the cute marketable creatures (Porgs\\, Crystal Foxes).\\n9. First 1\/3 of the movie was more like a comedy than a Sci-Fi Fantasy.\\n10. Storylines that made no sense - Vice Admiral Holdo won't tell Poe her plan this was created intentionally so the two characters would argue which a was a waste of time. Finn and Rose side story was a complete waste of time which believe to show these children whicjh could possibly have to do with Rain Johnson's up coming trilogy.\\n11. The Yoda force ghost was a complete joke - He didn't resemble any of the previous force ghost\\, he didn't act like the character\\, his design looked horrible and giving Luke horrible advice). \\n12. Opening scene - made no sense the Bombers dropping bombs on the Dreadnaught apparently there is gravity  in space. I know there are Tie Bombers in previous movie but those are energy projectiles not metal bombs. \\nI could go on with more issues with this movie but will leave it at this. Rian Johnson did a horrible job and ruined what JJ had set up with TFA and I would take Phantom Menace over this film anyday alteast we got cool new characters like Darth Maul and a bad ass lightsaber duel.","true":true}