{"101487":184903,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie...is not good. Its just ok. It’s not a Star Wars movie. That being said there were some things I liked about it. The cinematography was wonderful. This guy makes beautiful shots. So many of the visuals of this movie were really amazing. Rey was quite good in this one. Not so Mary Sue\\, and is the only one who really had any character development. It makes me like her a whole lot more. She keeps the fresh-faced\\, hope filled thing from TFA and runs with that. And everyone else was just...bad. Just like you expect from the trailers Luke is a moron in this movie. I don’t know why the writer\/director hates the character so much\\, but he made him a total idiot. Snoke was also kind of interesting in a two dimensional way. Didn’t see nearly enough of him in this movie. It was also a disjointed mess. You can tell there were different visions at the helm from TFA to this. It took a completely right angle turn. There was a section of the movie that could have been cut completely and took like twenty or thirty minutes of screen time. For the first time a Star Wars movie FELT TOO LONG. There were a few shining moments. The end was pretty good. And there was one fight scene that I loved. I can’t decide if this is at the bottom of the list\\, worse than Phantom Menace\\, about the same\\, or slightly better. Hard to say. I’ll have to think on it. The plot holes you could drive a Death Star through...and the stupidity of these characters really hurt me. Oh\\, and the guy has awful comedic rhythm. Nearly every single “joke” was as bad as C3P0’s head being stuck on a battle droid body. Ugh.","true":true}