{"101487":130478,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I did not love the film\\, nor did I hate it. It was definitely a let down in the way that all of the original characters\\, don't really seem to be those same characters. Even so much as to do a 180. Leah being able to fly in space and Luke turning into Anikan trying to kill padwans. Episode 7 had nothing to do with the story line except to introduce a few new characters. It seems that the intent of Episode 8 was to not be anything that resembled the original spirit of Lucas' successes. The film also contradicted itself by saying self sacrifice to save others should not be accepted. Only moments later to do what is says not to do. In a scene that would have given Finn a reason to have been in the film to be something other than Jar Jar Binks\\, attempting to be an alternative Han Solo\\, was not allowed to be sacrificed. Overall\\, the movie dissects and criticizes all that was great about the original films. A chance to put politics down and instead see evil incarnate. The film loses its morale authority through using too many US based political lines that don't really need to be there. It was almost as bad as Revenge of the Sith and Anakin stating George W. Bush nearly word for word. In essence\\, the good was the cinematography. It tried hard to maintain a high quality space opera in visuals\\, to only fall flat in story. Overall\\, there are possible avenues that the film have set into motion that could create great future storylines. Unfortunately\\, it will take more than a high voltage machine to fix the let downs of Episode 8. In my opinion\\, this was a story taken too far and tried to be overly complicated with way too much politics. It only felt like Star Wars in visuals only. Since 7 and 8 fell flat to me\\, it is a good chance 9 will not be on my horizon.","true":true}