{"101487":155493,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My official Review Of Star Wars Ep. 8 The Last Jedi. Spoilers if you care. Honestly Come on people. Star wars The force awakens was not a bad movie. I like many people went through the Star wars Gloss effect the first time seeing it. I gave it a 10. After repeated viewings final grade is permanently an 8 out of 10. I watched the force awakens before the last jedi and when I heard about the low user reviews i had a Star Trek Discovery nervous moment. Where the critics praised Trek and the users did not approve of it as a part of star trek. On a different note Seth Macfarlane's Orion is getting very low critic reviews and its user rating is very high. Something fishy with that. I went into Star wars ep.. 8 with lower expectations. I'm glad i did. The movie is nothing to do with the rest of Star Wars Skywalker series. The story was very badly written. The acting was ok but the lines are what killed it. The humor was very forced. The whole movie felt very uneven. The suspension of disbelief was very high. Come on bombs don't drop in zero gravity. Leia Poppins was too Disney. Throwing in a casino\/pod race\/prison breakout.....NO. BP was probley on the other side of the galaxy cleaning up an oil spill which is why they couldn't help the new order nor the resistance with they're gas problem. Hence the CEO apologized by saying: WERE SORRY\\, SORRY\\, SO DEEPLY SORRY.......SORRY. FACT: When your coming from space you can land anywhere. Why such a long distance from the resistance's base? Why not just land on top of them or in front of them. I'm now afraid that all women know how to use a light saber or sword and will kick my tail. Was it me or did Yoda look like a Muppet. The Mad bomber Muppet probley gave Yoda some ideas. Chewies Hungry Let him eat Porg. I'm sure Luke did. Gotta survive. Remember when Austin Powers ran over the guard at Dr. Evils layer? That took awhile. Very funny. Okay. Same here. The last Jedi chase dragged for almost two hours. If Obi wan and Yoda would have known what Luke has become after mastering the force and saving his father\\, I don't know. But that's not the same character of Luke we know and love. I'd believe that Luke was imprisoned by Porgs before that sad excuse of an explanation. Luke is not a wussy. He grew out of that. And the force wouldn't guide him this direction. Yoda was over 900 years old before he died. How old was Luke before he died? The projection method was cool but Luke should have been the only one to be able to do it. He was powerful enough. Unless AT & T has a Force dept hidden in the back of their infrastructure. I wonder if Kylo Ren had a phone book? I bet Rey was willing to accept the call at no additional charge. Go to prison for a parking ticket you just made. Trust your prison buddy. He or she in prison with you happens to know a lot about what you seek. This movie makes me want to cry and hold a Porg. I guess thankfully Rian Johnson didn't direct Harry Potter and the Deathly Hallows. He would have throwed out the book\\, killed the lead characters\\, and let Voldemort win. Thats what happened with Star wars here. A better Idea would be Avengers Infinity war turns out to be a MUSICAL! YAYY! 5 out 0f 10 Porgs\\, visuals and glossy critters were good. Leia\\, Luke\\, Chewie\\, Rey\\, and Ren are great well thought out characters just the dialog and the writing of these characters in this movie was bad. Everything else\\, Just bad.","true":true}