{"101487":149968,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Like every other Star Wars movie before it\\, I was excited to see where the saga would take us next. I did not anticipate we would be going on a slow speed chase\\, bogged down by cheesy humor\\, plot holes and uninteresting characters. I walked out feeling confused at what I just saw. Something was not right in my mind. I really wanted to Love this movie\\, I mean It's Star Wars.  I thought to myself\\, I must be tired I need to see it again.  Maybe it was the flying Leia scene I thought\\, Star Wars has had plenty of silly scenes that made me roll my eyes in past episodes. But this was different\\, this movie was filled with those types of scenes. So I went the next morning and again walked out feeling like something was amiss. How could this be? This is Star Wars! Where are the Jedi?  Where are the light saber duels? Why is Luke a coward who refuses to fight? How does he get bested by someone who has never even had Jedi\/force training?  I mean\\, did Rian Johnson even see the script from The Force Awakens before he started on TLJ?  Either Johnson is trolling us or he is a lousy story teller.  I now firmly believe it's the latter. I will admit the visuals were phenomenal and there were moments I was enjoying myself (the Yoda scene was one)\\, but they were completely over showed by weak storytelling and dull characters. It seems as though Johnson was more interested in \\\"subverting expectations\\\" than giving us a good Star Wars movie.  Well Congratulations Rian! You succeeded in subverting any expectations of this being a good film!","true":true}