{"101487":172740,"Last Jedi":"Last Jedi","2017-12-15":"2020-08-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"That's right\\, I'm one of those people who didn't hate The Last Jedi so much that I sent a death threat to Rian Johnson saying that he \\\"destroyed my childhood\\\" and \\\"ruined Star Wars\\\". In fact\\, I kinda loved it. Of course it's not a perfect movie. So I'll state its flaws first. 1. The pacing is inconsistent at times but that doesn't completely destroy the movie's pacing overall. 2. The humor doesn't always work. Half of the time it does and half of the time it doesn't. But even though it sometimes doesn't work\\, Rian Johnson really just wants you to have a good time. This movie was made and written to not only be enjoyed by Star Wars fans\\, but also non-Star Wars fans. And I think he does a good job at this. Now let me get into the good things and the great things about this movie. \\\\1. The music has always been great in Star Wars movies\\, but this probably has my favorite score out of all the Star Wars movies\\, especially when Luke appears at the Rebel's old base at the end. 2. Finally the cinematography in a Star Wars movie is actually really beautiful and isn't boring to look at. The music and cinematography in fact compliment each other very well in this movie and I don't think this movie would be the same without it. 3. I thought that the action in this movie was actually really cool and SIMPLE. Like The Force Awakens\\, we don't have or even need any over-complicated lightsaber fights that drag on forever. People criticize the Red Guards fight scene a lot\\, but I think that it's actually really cool to watch. 4. This movie had the most INTENSE moment of any Star Wars movie hand down. If you don't know what the heck I'm talking about\\, it's when Admiral Holdo sacrifices herself by going straight through The FIrst Order's ships by going into hyperspeed. That was just... insane. I don't know how else to describe it. 5. Ben Solo's arc and Rey's arc are great in this movie. Ben Solo overcoming Snoke's dark side control is so awesome and original. Then Rey realizing that her parents were nobodies and still continuing to be a loyal and heartfelt person is awesome as well. 6. Luke's arc is probably the best character arc in the entire Skywalker saga. He went from hiding in shame on an island in the middle of nowhere to saving the Resistance by finally facing his nephew. The one person who he's been afraid to face for years. Also\\, after Luke shows up to finally face him\\, nobody else dies for the rest of the movie (except for Luke). He also doesn't hurt or harm Ben in any way\\, he's a simple distraction until the Resistance escapes. This is how a jedi should go down. Not in violence or vain\\, but in peace and acceptance (like Obi-Wan in A New Hope). 7. This is the first Star Wars movie in a while to actually take risks and make it work. The idea that a person can be a jedi and still come from \\\"nobody\\\" is a great and original idea. A sith lord who is being pulled to the light side of the force instead of the dark side is something that we haven't seen before. The fact that the force can make two people physically touch is something that's kinda new. There's so many new things in this movie that they actually turn into risks. But most of those risks are executed very well unlike the prequels. But for some reason Star Wars \\\"fans\\\" hates that Disney is trying something new with this trilogy and can't accept the fact that they are actually making these movies good and are instead expecting them to be horrible. 8. Usually whenever I watch a Star Wars movie\\, there is always a part in the movie whenever I get really bored and tired. But with The Last Jedi\\, I was never bored and every scene in this movie was either a.) really interesting to watch or b.) fun to watch. I was hooked on this movie all the way until the end. 9. I've never felt this much emotion in a Star Wars movie since Return of the Jedi. For the first time in a long time I was actually emotionally connected with the characters. It was so refreshing to care about Star Wars characters again. \/\/ Again\\, this movie does have flaws and it's not a perfect movie. However\\, this movie is a great Star Wars movie and it has a lot of strengths that people blindly overlook because of their pure hatred for this movie.","true":true}