{"101487":131334,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-25","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't write many reviews\\, but as an avid Star Wars fan since childhood I just had to express my utter disappointment with this sequel. I never thought I would write this about a Star Wars movie. The Force Awakens was tolerable as a complete rip off from the great work of George Lucas's A New Hope (Rey = Luke; First Order = Empire; Resistance = Rebels; Snoke = Emperor Palpatine; etc.) since it was based on a great story. The Last Jedi unlike TFA is a complete disaster beyond visual effects with a poor written story that badly damages the franchise. I would have given it one star\\, but that is unfair to those responsible for the visual effects and photography which is outstanding (honestly they should receive awards; it's that good). Unfortunately\\, visual effects and photography can't save this train wreck no matter how good they are. You have to be able to tell a good story and this doesn't. Not only does this movie dismantle everything set up by TFA\\, but it is a slap in the face to long term fans. This movie dies by a thousand cuts with plot holes and poor writing and editing everywhere you look. There is no development of the characters we were introduced to in TFA and long time characters we grew up loving are either ignored or mistreated badly. I won't put in any spoilers\\, but what they did to Luke's character is unforgivable. This is not the same Luke I grew up with. Comedy is poorly inserted and timed throughout what should be a serious story. There are multiple issues throughout this movie that make no sense in the established franchise. Overall this movie was disappointing on multiple fronts and badly hurts the franchise I grew up loving. So sad.","true":true}