{"101487":148611,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just so many problems with the plot and the complete rebuilding of characters we already knew. This has got to be some alternate universe. \\n\\nSpoilers ahead! \\nFirst off\\, loved the milking scene. \\n\\nAdmiral Holdo withholding imformation from Po causes him to mutiny as he was told of no options when Holdo was hiding a very very bad plan. They could have sent their transport to go get help\\, instead it leaves to find a code breaker. \\n\\nThey could have evacuated the ships\\, rammed the main ship into snokes and went for the planet\\, which apparently became the plan because Holdo had no plan\\, or was waiting to run out of fuel. Just bad bad writing and lots and lots of plot holes. \\nLeia sent out a distress call and no one in the galaxy answered? \\nLando had better be dead!\\n\\nImperial fleet that just can't catch up to one rebel ship? Snoke doesn't know that he has the ability to track rebels through hyper space? Luke\\, the guy that knew he could turn Darth Vader\\, wants to murder his nephew and the son of his best friend and sister? Horse racing is wrong? It takes a fleet of bombers to do the job that one bomber did? Bombers have to fly in at suicide range to accomplish their task? Rey can already do the things it took Luke training to do. Rey can take down several of the First Orders most highly trained warriors in hand to hand and weaponed combat with no training? Rey who was showcased as having skills as a pilot ends up in the gun seat of the Falcon while Chewie takes the stick? Luke dies after astral projecting himself\\, no heroes death? Luke is a hermit living in hiding? All of our heroes from 3\\,5\\,6\\, seam to be dying in vain or just living lives without families or friendship... sad sad endings for friends we cheered for but now apparently have no claim to fame or recognition. Again\\, Lando had better be if hes not answering Leia's call for help. Color me disappointing in the writers not knowing their characters and how they would behave\\, after we established Luke as a savior that would not kill but for defending himself. Yoda having Force powers far beyond what we've ever seen from him in the past\\, and having them from beyond the grave? Phasma dying without even being acknowledged in any scenes with Kylo or Hux? Where are all the other leaders in this First Order movement? Where are the meetings to decide or talk about this war or its strategy? I'm supremely disappointing in all of the lack of making such a story that could be simple\\, into something so complicated with so many stroy telling issues. \\n\\nThe long long chase to wait for one ship to run out of fuel when you have a mega fleet that has no ships fast enough at sub light to catch up is the entire big picture in this episode and it just makes no sense... We have ships that can go light speed and the resistance\\, that should be the leading body in the galaxy while the First Order should be the rebels... the resistance is whittled down to about 20 people that the galaxy is supposed to rally behind? This is just a tragic way to tell a story and kill off the original cast like they have wasted their lives.","true":true}