{"101487":138457,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Interesting that the majority of positive reviews are full on 5 stars and comprised of a couple of sentences. Whereas the negative reviews are mostly longer and lay out good reasons for their views. That indicates planted positive reviews to me. \\n\\nThe idea that people don't like this movie because it is \\\"different\\\" is nonsense. If anything\\, it is more a tired\\, formulaic retread of past movies\\, but done by someone who doesn't understand these characters or this universe. That's why people don't like it. It feel like it was written by committee and forced into the Marvel mold. It has a cheesy Guardians of the Galaxy feel\\, not Star Wars. That is not being \\\"different\\\"\\, it is forcing the uniqueness of Star Wars into a dull\\, formulatic superhero movie mold.\\n\\nThere's nothing original about this movie. It didn't go in a new or remotely interesting direction. Everything is played safe and boring. The classic characters are not portrayed correctly or are wasted in stupid scenes. The Yoda cameo was terrible. Luke wasn't Luke. \\n\\nWhile prequels had many faults\\, they were original and followed a singular\\, if flawed\\, vision. These new movies are fomulatic cash grabs. \\n\\nThis new trilogy is supposed to be the continuation of episodes 1-6\\, not a brand new story or tone. That's what the stand alone movies and upcoming new trilogies are for. These movies are supposed to be modern mythology. And this fails so badly it's not likely to be fixable in episode 9. There is no mythology left\\, it was destroyed in this movie. All we have left now is pissed off pouty boy Kylo Ren.\\n\\nDisney has ruined Star Wars\\, as we knew they would. They will run it into the ground for as long as they can make money from it. Which should be many years of generic\\, unoriginal movies.","true":true}