{"101487":183702,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie destroys it's source material\\, destroys it's own plot and narratively is just a disaster. It blatantly disrespects the audience and treats you as if you have no mind if your own and no intelligence of any kind. Yes\\, it may be a pretty looking and a some what entertaining film but as a whole it is an abomination. They took everything that The Force Awakens built up and just threw it all out of the window. It's as if the writers haven't even watched a star wars film before writing this monster of a plot hole. It ultimately does nothing to add to the narrative and is filled with deus ex machinas and just straight up plot holes. For example Luke Skywalker's character is just completely wrong in this film. It seriously pains me to think of how Mark Hamil had to play his most iconic role as a shell of its former self. It seriously seems to me that the writers had never watched the original films. Just the miss use and utter destruction of Luke's character is a reason to hate this film. Not to even mention the terrible and unforgivable writing of Kylo Ren and Rey. It's as if the writer decided to change their mind on how the characters should be multiple times while writing. It has no cohesion and makes no fricken sense in any way. Oh gosh\\, don't even get me started on the supporting roles\\, almost all of the characters introduced in this film serve no function and could literally be taken out of the movie as a whole and it would not change anything\\, no it might even make the film better. Ughhh\\, even the biggest baddy Snoke is utilized in the most awful way. His character had a truly minimal role and had barely any screen time. They didn't even mention his backstory like they were supposed to. Nope\\, it was just disgustingly bad. I can keep going on criticising this film but it is really just making me more and more angry as I go on so I think I'm going to end it here. As a summary\\, it's a very pretty and visually stunning film but that just can't redeem the horrendous plot and terrible writing of this disastrous piece of narrative.","true":true}