{"101487":175050,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi gives me no reason to get excited or want to see the next Episode of this Star Wars saga. The movie takes the history of Star Wars that was started in 1977 and takes a giant dump on it. The Force Awakens Gabe is three questions:\\n\\n1. Who is Snoke?\\n2. Who are Rey's parents?\\n3. What up with Luke Skywalker?\\n\\nThe answers and resolutions to these questions is very unsatisfactory. Luke Skywalker was wasted in this film. Kylo Ren is still a moody brat but now without the semi-cool helmet. Btw\\, can somebody tell me what his motivations are now that a certain character isn'trelevantanymore?\\n\\nWho are Rey's parents? They gave us an answer that probably was hogwash but at this point I really don't care. This was the film to explain her lineage\\, not the next episode. This is defined without a doubt my least favorite Star Wars movie.\\n\\nI haven't even touched on the entire subplot regarding a Casino\/fuse which was a shameless excuse to include extremely young characters. Finn had no purpose in this film\\, Captain Phasma also serves no purpose other than to make Finn look badass. The space cruiser chase was really poorly thought out. All physics from previous SW films thrown out the window. Remember Star Destroyers chases down and caught the Rebel Blockade Runner in A New Hope. So why are they slow AF now?! \\n\\nAs the credits rolled I felt disappointed\\, I had high hopes for this film and Rian Johnson let me and legions of fans down.","true":true}