{"101487":105558,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As expected\\, The Last Jedi has been receiving mostly positive reviews. The same thing happened when The Force Awakens was released 2 years ago. I was one of those people who really liked that movie no matter how derivative it was. After repeat viewings though\\, I did see its flaws. it's fun to watch but it's far from being perfect. I'm starting to think that out of habit\\, we just throw praises at every new Star Wars movie. We keep giving these movies a pass simply because each one is part of the Star Wars Saga. \\n\\nTo cut to the chase\\, I wasn't too fond of this movie. Some parts were really fun to watch\\, particularly the action sequences. But the entire pointless plot bogs everything down. There are also subplots that are as pointless as the main plot. As a result\\, a lot of scenes were dragging. There are so many loop holes too. Major characters are abruptly introduced out of nowhere\\, and all of a sudden our protagonists are given new abilities that were never foreshadowed in the previous movies. It's one thing to tinker with Star Wars canon. It's another thing to completely reshape it this late in the game. But hey\\, at least the tone is quite different enough from the other Star Wars movies. And adding humor was a welcome change\\, too bad a lot of the jokes fell flat. And you can't say this movie was derivative\\, something that the previous installment was incredibly guilty of. It's far from being a horrible movie. It's just not the masterpiece that a lot of critics are proclaiming it to be.","true":true}