{"101487":139416,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I regretfully have to say that this Episode 8 really let me down as a huge fan. Rian Johnson has managed to slip away from the whole canon of Star Wars\\, and making the stories not mesh at all besides the force that is holding them together.  If you know how Luke handles the dark side head on in Return of the Jedi it is completely opposite of his character in TLJ. Luke shows he would rather die than kill his evil father\\, who had a tiny little bit of light left in him. In this film he is ready to obliterate the darkness in \\\"fear\\\" the second that he sensed or had a premonition of darkness in Kylo. This addition to the saga feels so sloppily put on\\, you can obviously tell that Lucasfilm\/Disney had no idea what the whole story on this new trilogy was\\, and each director is flying off the seat of their pants.  \\n\\nRian has managed to take us all on a Star Wars trip to a Galaxy that doesn't quite hit the dream anymore.The slap stick comedy spread throughout the film feels misplaced and interrupts serious\\, intense and emotional moments. Made me love porgs in the beginning\\, and just be out right annoyed by them by the end of the film. There were so many scenes that took away from the whole feeling that I was in the Star Wars galaxy and made me feel like I was watching a movie of Sci-Fi casino on Earth when they were on Canto Bight. There seems to be little effort on actually making us grow closer to the new generation of characters in this one. \\n \\nI really hope that they can resurrect themselves on IX as I still love this universe and hope for something better of it.","true":true}