{"101487":122040,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"From a lifelong Start Wars fan.\\n\\nWow. Really? What happened?  SPOILERS!!\\n\\nThe Bad:\\n\\nThey threw away all the wonderful momentum and build up from The Force Awakens. The scene of Leia flying back into the ship was unintentionally hilarious in a rifftrax like way. \\n\\nAbsolutely hated the entire casino royalty third of the film\\, which was a huge water of time. A really Disney injection there. \\n\\nBut the pile of garbage that is the biggest offender is all the the forced attempts at humor. It really got old. This is a serious tonal problem when you take a serious scene and throw slapstick into it\\, the entire time. The movie has multiple personality disorder and doesn't have any direction. \\n\\nAnd the plot holes\\, OMG!! So angry about how nothing makes any sense. Why did Rose stop Fynn? His sacrifice would have at least meant something. If you can hyperspace and take out the entire First Order fleet\\, why didn't they just do that before they lost their entire fleet? \\n\\nAnd the Rey scene from under the Jedi Temple? I know they were trying to have a similar scene to Empire with Luke in the cave. But it wasn't. It was so cheesy. Snap snap a snap..... \\n\\nSnoke just dies like nothing? And much more I can't even type it all.\\n\\nThe good: \\n\\nMark Hamill gave a wonderful performance. Kylo Ren is an interesting character with some depth. The fact that Luke was instrumental in creating Kylo Ren and the darkness in him was amazing. It is in the Star Wars universe\\, altough the universe has been damaged by this film. Really liked the Chewie roasting the pawg scene. That was hilarious!!\\n\\nConclusion:\\n\\nI certainly hope they find a way to fix most of these problems in episode 9. Fill in all of these gapping plot holes and make this streaming pile of garbage make some sense. And possibly a bit more palatable. I would love to erase most of my bad opinions of this movie. I have loved Star Wars since I was a little boy\\, and A New Hope was the first movie I ever saw in the theatre. So I'm holding on to a thin glimmer of hope they can fix all of this. It will take a miracle\\, but I hope.","true":true}