{"101487":129751,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-10","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I avoided commercials and everything so I could watch this movie with no expectations. To be fair\\, I didn't like The Force Awakens. Sure it had its strong moments and I'll watch it anytime I watch the entire saga. Rogue One gave me hope again but that hope was quickly snuffed out when I watched The Last Jedi.\\n\\nSo\\, I'm hopeful that this movie is not an indication that audiences are just plain stupid because there is so much wrong with this movie in general terms of \\\"that's just not how that works\\\". It's called Physics. I would think people would learn something from watch The Big Bang Theory or something. Anyway\\, point is\\, lasers are not affected by gravity in space (artillery from Snoke's ship). Or\\, bombs don't get \\\"dropped\\\" on enemy ships. The B-Wing? The TIE Bomber? Even XWings - they all use torpedoes for as long as we can remember. But for some reason we had to utilize WW2-style combat in the first scene and WW2 artillery in the chase scene.\\n\\nWhich leads me to another gripe - a chase scene... in space... where everyone has hyperspace. General strategy would say\\, continue to chase with Snoke's ship and have all of the star destroyers hyperspace away and then come back in front of the rebel fleet to slow them down so Snoke's ship could catch up. This is a tactic that has been used in sci-fi like this since forever. It's not rocket science.\\n\\nThe scene with Leia using the force... Ok\\, I appreciate her using the force and I think it's great. That geeked me out. But the whole scene was very... odd. Further\\, you can't open a door in space without being sucked out. How did the rebels retrieve her? Alright - probably just a movie choice because it would have taken more effort to do it right. But why be lazy?\\n\\nI was ok with knocking Poe down a notch in the first scene. That made it real to me. But\\, knocking him down the 2nd time with Leia stunning him. Seemed forced.\\n\\nI didn't read or follow up on fan theories or anything between TFA and TLJ. But I will say that I was confused with the whole 'your parents are insignificant' remark. I mean it seemed forced and out of the blue. Like at that point in the movie\\, who cares? \\nKylo says\\, \\\"Hey - all this stuff's going on but I just wanted to let you know that your parents are insignficant.\\\"\\nRey says\\, \\\"Yeah\\, well I know why you wear a mask.\\\"\\n\\nNow\\, I will say this that I took a different spin on that theory - I kind of got the impression that Rey was Han and Leia's kid. In fact\\, in one scene in either TFA or TLJ - I could have swore I heard Kylo tell a younger Rey\\, \\\"be quiet girl\\\". And Kylo obviously thinks little of his parents... But I digress.\\n\\nThe force projection from Luke was interesting but also somewhat flawed. I could look past some of it but it was distracting.\\n\\nAlso\\, this movie seems to swing things too far in the opposite direction. I don't usually notice when a movie is progressive until after I think about it. But this was a bit ridiculous. So\\, everyone that makes mistakes and is wrong is a white guy... everyone that is good is black\\, asian\\, or female... Ok. There was one shot on the bridge of the cruiser and everyone was female. I'm like - what's going on here? Did all the men die or something or are all men stormtroopers? I dunno. But let's not linger on that too long.\\n\\nThe humor in the movie seemed... forced. You know\\, that's what I can say a lot about this movie. It was just.... forced. Like the wanna be in the school yard who acts like everyone but just does it all wrong. \\n\\nThese are the thoughts I have in 5-10 minutes on a movie that I can only imagine will be considered the worst of the franchise (yes\\, even surpassing The Phantom Menace).","true":true}