{"101487":193255,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"WARNING - SPOILERS!\\n.\\n.\\n.\\n.\\n.\\n.\\nAbysmal failure. A sucker punch to the gut for Star Wars fans everywhere.\\n\\n1. Luke. Our greatest Hollywood hero just dies (vanishes) for no reason. We'll never see the jedi master in action. No lightsaber fight either. There was a bit of hope when he showed up on the mine planet.... Finally we'll see Luke's full power as he takes on the whole army! Nope. Luke isn't even there. And milking an alien? No\\, just no.\\n\\n2. The pointless middle of the movie. As it turns out\\, the entire casino planet plot + DJ were useless to the story and served only to eat time.\\n\\n3. Rey's parents. It feels like Disney has been handed such a great legacy\\, but the decision was just to throw it in the trash. No Rey Solo. No Rey Skywalker. No Rey Kenobi. Nothing. No interesting familial connection whatsoever. This was billed as the new trilogy's super climactic moment\\, but\\, well... It ended up being the biggest let down. Just like Luke throwing his lightsaber over the cliff.\\n\\n4. Force texting. Rey and Kylo's Force connection was interesting\\, but ended up getting massively overused and ridiculous. A shirtless Kylo? Really?\\n\\n5. Leia flying with the Force after getting blown up and frozen in the cold vacuum of space.\\n\\n6. Rey's non-existent jedi training. Luke's disillusionment was an interesting part of the story--for the first 30 minutes. Then it started to destroy all we knew and loved about our hero. By the time he comes around to training Rey it's too late. She gets one or two minutes of illumination from the master and then is off to face Ren.\\n\\n7. Snoke. No backstory. An anti-climactic death. He could read all of Kylo's thoughts\\, but perhaps missed that Kylo was about to cut him in half.\\n\\n8. Unlimited transport ships. At the rate the First Order was blowing them up\\, the Resistance should have been left with about -20 ships.\\n\\n9. Constant plot holes and things that contradicted the SW universe. Using the Force halfway across the Galaxy. The tracking device that doesn't need a tracking beacon. The main First Order ship gets blown up along with its hangar bay\\, yet the First Order then manages to land its whole army in prep for the final battle.\\n\\nWe're used to bashing the prequels for their bad acting and wonky CGI\\, but one thing they did have going was an interesting plot (for the most part) and decent consistency.\\n\\nThe Last Jedi has some decent acting and good special effects. And that's it. It takes what was an incredible Star Wars legacy and\\, like Luke's lightsaber\\, just throws it in the trash. It was such a painfully bad movie that we're all left wondering if the trilogy can possibly be redeemed in Episode IX.","true":true}