{"40636":"33619","TLOU2":"TLOU2","2020-08-05":"2020-06-23","10":4.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"As a huge fan of the first TLOU\\, I had very high expectations for the sequel that took 6\/7 years to finish. I love the games that Naughty Dog puts out. I saw all the reviews that the game was getting and was impressed. June 19th came and I started playing at midnight on my digital pre-order copy. And boy was I disappointed. This game is by no means a 0\/10. But it is also far from a perfectAs a huge fan of the first TLOU\\, I had very high expectations for the sequel that took 6\/7 years to finish. I love the games that Naughty Dog puts out. I saw all the reviews that the game was getting and was impressed. June 19th came and I started playing at midnight on my digital pre-order copy. And boy was I disappointed. This game is by no means a 0\/10. But it is also far from a perfect game. These game journalists should be ashamed of themselves. Seriously! I’ll start with the pros:- The graphics are beautiful. Some of the best this console generation has to offer.- The gameplay is good\\, not great\\, but good. - The gore and kills were very cool and very brutal. - Joel. Yes\\, Joel. The very little time he has on screen were great. The opening of the game and the flash backs of him were the best parts of the game in my opinion.- Sound and atmosphere were on point. No complaints there.Now the cons:- Very\\, very boring game. I was bored within the first 4 hours. Looking for materials and supplements and ammo and collectibles were like 70% of the game. I know the first game was like this but the level design is so big now it became very tedious and annoying. - The characters were terrible. Even Ellie was annoying me. Abby was a pain to play with. It was a cringe fest. Supporting characters were very average at best. Jessie was ok\\, Tommy too. Everyone else\\, terrible. - Characters appearing from thin air. I couldn’t believe how some characters just meet up with me out of nowhere. Like\\, where did you come from and how did you find me. Happens on like 3 occasions. Impossible. - The end. What a terrible ending. Has to be the worse revenge story ever. I just don’t understand how they thought people would like the end result. I would of rather Ellie die over how it turned out. Trash. Garbage!Like I said. This isn’t a 0\/10. Its decent\\, but has a lot of flaws. The hype over this game and fake reviews it got from journalists is what really hurts it. It is nowhere near a 10\/10 or 5\/5 or 100% score. It really isn’t. 4\/10 from me. I was going to give it a 3 but the graphics and sound and atmosphere picked up most of the slack. Don’t buy this game brand new. If you really want to play it\\, buy a used copy. You’ll probably still feel like you wasted your money 25 hours later. I’ve deleted it from my PS4 and it will never be back.… Expand","true":true}