{"101487":147697,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wouldnt give a star if I could but appears half stars don't count.  This site seems to have sign a contract with Disney for damage limitations. Why is this garbage still sitting at 48%.  That's been weeks now of countless negative reviews trashing it.  Its truly embarrassing.  Its not star wars its nonsense.  Disney bought the rights in 2012 and during this time this is the best they can come up with?  Since return of the jedi I wanted to see what had happened to the characters and universe and I get this garbage.  What idiots write this stuff or more importantly who green lights it.  Lets let the viewers know its salt instead of snow.  Chronic. Woman storm trooper haha.  Lets have her disappear 100 yards then bring her back. Great.  Lets have our lady hero fly like a pro\\, beat everyone around and speak 100 different languages.  Lets have someone blown out into space but better than that we'll have people standing by the window expecting her to fly back in.  That close up face from the Asian one ramming the other useless character really infuriates me.  Hes buying us time ? eh great logic.  the ending garbage.  The ending You'll be wishing the first order kills everyone its that bad but even they cant promote them properly as the come off as bumbling idiots.  More imagination came in the rancor attack than this whole movie and that well tells you something.  I hope mark Hamill boycotts the next one.  Please people don't pay to watch this coz even more scarier is that hes doing the next trilogy.  The solo one well looks like another marvel terminator salvation hybrid here.  Utter nonsense.","true":true}