{"101487":113319,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Cinematically\\, the picture is simply stunning.  Both in the island setting as well as the space battles.  The Rey and Kylo fighting Snokes Elite Praetorian Guards was something you don't want to blink through as it's quite the epic fight scene.  Other than those points\\, Episode 8 was a major let down to even the average Star Wars fan.  So many plot holes and so many unanswered questions from Episode 7 that are either never answered or completely glossed over as though Episode 7 meant nothing to this movie\\, the next chapter in the saga.  It actually felt as though this movie had absolutely nothing to do with the previous one\\, AT ALL.  Like they took the script from Episode 7 and Rian Johnson just tossed it in the trash can and started an entirely new movie.\\n\\nThe biggest disappointment is what they did with Luke.  Luke fricken Skywalker...the most powerful Jedi next to Yoda.  We never see him wield his emerald lightsaber\\, (something fans were longing for)\\, we never get to see him in a lightsaber battle with Kylo or the Knights of Ren.  There's a small moment towards the end where you think to yourself\\,. \\\"Oooh boy! Luke is gonna kick some butt now!!  Here we go!  It's gonna go down now!\\\".....NOPE. \\n\\nIt was one failed moment after another.  We get to find out who Rey's parents are?  NOPE.  We get to find out more about Snoke?  NOPE.  A subplot story gets created that will elevate the film?  NOPE.\\n\\nIf it turns out that Episode 9 reveals the heavy questions that were seriously hinted at in Episode 7\\, I'll come back and change this review.  But for now\\, this movie is a complete let down to the Star Wars saga.\\n\\nOne last thing\\, Laura Dern's character (Admiral Holdo)...was a waste of a character.  If she had simply told Poe her plan to escape to the planet they were slowly moving towards....the subplot where Finn and Rose go the planet Las Vegas would have NEVER happened.  Seriously\\, why NOT tell Poe the plan?!  He's a high ranking officer and your best pilot\\, you know his loyalty is to the rebellion!  Why wouldn't you tell him?!  Oh yea\\, then you wouldn't have this Las Vegas planet subplot for Finn and Rose.\\n\\nIt was just a poorly written and directed movie.  It's like they haven\/t laid out the outline and storyboards for all three movies yet.  Which I hope to God isn't the case.","true":true}