{"101487":169220,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*** Spoiler ALERT  **  If you want to see this movie\\, then don't read this review because it has many spoilers.\\n\\n*** Seriously\\, it is all spoilers  **\\n\\n\\nWhy did they squander so much potential on such a terrible plot\/story\/nonsense.  You had so many great characters with potential\\, but can't figure out how to right a decent story around them?  \\n\\nSo Luke returns as a hermit.  I get it.  est pupil turns dark and destroys his jedi dojo.  But Luke is so frightened of his nephew that he decides on a whim to kill him in his sleep?  The son of his sister and best friend?  That's not only not \\\"Luke\\\"\\, that is just lazy stupid writing.  \\n\\nSnoke!!! He has to be the worst Sith ever.  Hmm\\, let me just set this light saber beside me.  Can't imagine my Sith apprentice would notice it as an opportunity to .....\\n\\nRey is obviously a Mary Sue character.  But couldn't you make her story arc somewhere in the realm of believably?  Training a couple of days to become a god like Jedi is pretty lame.  Time-lapse her progress or something at least if you aren't going to tell the story of her journey.\\n\\nLeah.  I can't even begin to start.  But blasting her out into open  space only to have her \\\"force\\\" her way back was awful.   The \\\"we are killing an iconic character\\, oh wait she has god like powers so she lived\\\" story arc is something that might be written by a kid in grade school.  \\n\\nThen there is poor Kylo Ren.  The whiniest emo \\\"villian\\\" I have ever seen in a story of any kind.  He could be a completely interesting character.  Adam Driver the actor portraying him is completely capable of any kind of nuanced complicated villainy.  But the story\\, the writing\\, the everything you handed to him makes him not terribly \\\"evil\\\" or dark at all.  \\n\\nI had high hopes.  After Rogue One\\, with the return of Luke\\, with all the great possibilities\\, surely this will be on par with Empire Strikes back.  But no.  It is hands down the worst episode in the franchise.  Not only am I not interested in seeing what happens next\\, I am finished watching any more Star Wars sagas.  I would like to get my  money and time wasted back on this one.","true":true}