{"101487":135084,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'll start by saying I was one of those people who liked The Force Awakens. Mostly because I hadn't seen this movie yet. Now I see what people were talking about. The Last Jedi threw all my hopes with this trilogy out the window. Terrible plot (slowest chase in the history of Science fiction movies). Terrible dialogue. Terrible characters. The only thing I believe saves this movie is the visuals. Well\\, also the actors and actresses did a good job in their roles (even with the cringy jokes). It makes me more excited to see them in roles that aren't this one.\\n\\nI'll do my best to summarize the plot so SPOILERS for those who give two shits.\\n\\nThere are 3 (4?) \\\"side plots\\\" in this movie. First\\, Poe\/Leia. The \\\"Resistance\\\" (I was waiting the whole movie for someone to slip and call them \\\"rebellion\\\") are fighting the First Order. Poe ignores orders from Leia and helps the bombers (that apparently have Earth gravity 20 miles surrounding them?) Also\\, sacrifice is the devil in this movie since Leia demoted Poe for risking lives. Yet she risked countless lives (Han Solo??) trying to save Kylo Ren in the last movie??How does she expect to win? Anyway\\, that \\\"message\\\" only gets worse later.\\n\\nSo they jump to hyperspeed but oh no! They can track them through hyperspeed. I can forgive that happening. It's not like it's the whole movie of them trying to escape. It'll be like the asteroid field or something. Right?\\n\\nThe. Whole. Movie. \\n\\nThey have that chase the whole movie. Not only that\\, they destroy all but the main ship and have their fighters hang back.....why? Snook cares about storm troopers? More character development for him if he actually did. But I guess that's the reason.\\n\\nAnd also we have a freak out moment with Leia. I swear I was sitting in the theater beginning to mourn for her when she LIFTS HER HAND. I thought \\\"aw she's giving one last goodbye.\\\" Nope. She flies like Harry freaking Potter to safety. The plot armor thickens. \\n\\nSo after that abomination\\, the resistance story is cut in half. Poe\/purple hair girl (PHG) and Finn\/Rose. Finn wants to run. Poe wants to fight to death. It was an interesting premise\\, yet somehow both stories were screwed. Logically\\, if Poe is too rash he should learn restraint? If Finn is cowardly he should learn sacrifice (like a certain rogue)? Right?\\n\\nFirst\\, Poe. PHG resumes command after Leia is almost killed. Poe resents that of course\\, so he talks to PHG and asks if they have a plan. They don't give him an answer so...what do they expect him to do? Sit like a good boy? No\\, this is a Star Wars movie after all!\\nSo\\, he and Finn (with Rose) concoct a plan to get a hacker from Gambling Planet A. Cause that's all that planet is good for I guess. That's where his plot stalls.\\n\\nNow\\, Finn. He meets Rose crying her eyes out after her sis died. He tries to escape. You would think\\, Rose being a human being\\, this would make her resent Finn for abandoning them and making her sister's sacrifice mean nothing. Nope she loves Finn omg he's so cool <3. Oh what was he doing in the escape pods? Checking them! I mean\\, this character is so unbelievable. What does this say about women? Teehee lets forgive all the guy's mistakes cause he's a HERO. \\n\\nAnyway\\, Finn and Rose go on a pointless adventure to Gambling Planet A. They don't get the Codebreaker but a shady guy that's good enough(?) because they were locked up for bad parking. How convenient.\\n\\nOkay. First\\, why the hell weren't they more careful with their escape vehicle? They parked it on a freaking beach. Second\\, they give up on the Codebreaker? So....why did they need to bother? \\n\\nAlso\\, HORSE RACES = BAD\\, RICH PEOPLE SUCK\\, and PEACE GUYS KAY. did you get that message? Then Rose did her job!\\n\\nThey escape with Not-Codebreaker-Guy (NCG) and attempt to break into First Order ship. Which fails cause...pointless? Why did Finn and Rose need to happen? The plot wouldn't make a difference if they stayed with Poe. Oh but then Finn wouldn't fight Brianne-I mean first order lady A. Already forgot her name. \\n\\nI guess he learned courage? Except he ran most of the time....hmm. \\n\\nBack to Poe. He learns that PHG had a plan...to escape. Hearing the \\\"E\\\" word Poe goes apeshit and takes over. Doesn't ask any more questions for some reason?\\n\\nOne point. Even though the characters say he's \\\"rash\\\" um... what do they expect him to do? Not ask questions? Answer to authority? Um....they are a rebellion right? Oops I mean resistance. They are in a survival situation. Yes\\, it makes sense for PHG to not give out the war plans...yet they're trying to escape not fight. They need everyone on board. What is the point in hiding the plan?? Added tension? It's like the writers wrote themselves into a wall and instead of revising made up this escape plan instead. So they escape to old Rebel planet B. Everything else doesn't matter so...I won't bother either.\\n\\nCut to Rey. In the last movie\\, I expected her to be training (heck even the trailers for this movie misled me to this!) with Luke. Nope. Luke apparently doesn't want to save his twin sister or take responsibility for anything. At least Obi-Wan could see his hand in turning Darth Vader. Heck\\, he almost killed him like Luke did to Kylo! I understand\\, Luke wasn't a good teacher yaddayadda. But he was never a coward. I could excuse the \\\"he's a relative\\\" thing yet Luke faced his own father!!! What reason does he have to hide? None!\\n\\nWhich is why The Force Awakens is now ruined. They were trying to find him based on the map left behind on r2 (who is a mcguffin now and not a character I guess). Why would he leave any trace of him if he wanted to never be found? Like idk keeping R2 with him?\\n\\nSorry\\, rambling over. Anyway Rey spends her time not training (cause girls apparently putting in the effort in that is no good!) and instead talks to Kylo in weird day visions (only interesting thing) and attempting to convince Luke to train her. We learn she is strong (duh?) and that Kylo had reasons for killing the Jedi. Cause Luke tried to kill him for being too dark(?) I mean\\, didn't Luke learn in Episode 6 that anyone can be saved??? Now that movie is ruined too I guess. Darth Vader saving Luke meant nothing I guess.\\n\\nSo\\, Rey tries to go to Kylo to save him (cause she knows better than Luke I guess?). They have a final stand off\\, btw Snook dies. Weird face sith guy? Dead. Pay no mind. Also\\, Rey's parents? Not important. It would've been fine if they did it well (Blade Runner 2049 is a good example of this trope being reverted) but it was a very brief revelation that seemed to not change Rey at all. So\\, why bother (that's the theme I guess)?\\n\\nAfter this\\, I expected Rey to join Kylo. Nope that would be too interesting. Instead\\, there is a final battle (with WW1 type warfare??) and the good guys escape. Oh and Finn almost had character development but Rose ruined his character. The end.\\n\\nOverall verdict? I'm not going to pretend Star Wars is my favorite series any more. It's over for me. Apparently it's too hard to make a fairy tale in space. I'm watching the next movie cheap if at all. Funny how all these critics give it 10\/10 where half of us plebs give it terrible reviews. Says a lot to me.","true":true}