{"101487":169013,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So\\, The Last Jedi. I don't think I'd be wrong in saying that this is probably the most divisive installment in the Star Wars franchise. However for me\\, as someone who likes Star Wars but doesn't have a special affinity for it\\, I really LIKE this film. Let me explain:\\n\\nLet's start with the elephant in the room: Luke Skywalker's arc.\\nI've seen a lot of people complaining about this and honestly\\, I don't get it. This is actually my favorite character arc in the film. Instead of making Luke an overpowered badass (which I would've been OK with)\\, he is made into a complex character by having real struggles and complexities. His POV is really well explored through the excellent use of flashbacks and and his teachings to Rey. For me\\, this was a really interesting place to take the character and really kept me intrigued.\\n\\nSecond: the filmmaking.\\nThis is by far the best looking Star Wars movie to date (closely followed by Rogue One). A lot of attention has been given to the shot structure and framing as well as the lighting and use of color. I thought that the force-bridge sequences in particular\\, were a real highlight.\\n\\nThird: the themes.\\nI have been let down by a lot of recent Star Wars films because of a lack of meaningful themes\\, which disconnected me from them. So I was pleasantly surprised to discover some very well explored and relatable themes in this film. Especially the themes about failure and moving on from the past\\, struck a cord with me.\\n\\nThere's a lot more things I liked\\, but I don't feel like discussing them all so let me sum them up instead:\\n\\n- The reveal of Rey's parents being nobody's\\n\\n- Poe Dameron's character arc\\n\\n- Production design\\n\\n- Kylo Ren (Adam Driver steals the freaking show!)\\n\\n- Yoda and Luke's student-teacher conversation\\n\\n- The Force is mystical again\\n\\n- Luke and Leia's reunion scene\\n\\n- Luke vs. Kylo Ren\\n\\n- Luke's ''death''\\n\\nThe only real criticism I have is that the Canto Bight sub-plot isn't always as engaging as it could be\\, but besides that I think it's a really great and well-made film. Not without its flaws but a very rewarding viewing experience for those looking for one.","true":true}