{"101487":128490,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Horrible.  Wretched.  An abomination. I walked out of the theater not really sure of what I had just witnessed.  The following morning I woke up with this dirty feeling just clinging to me.  It's kind of like that feeling you have after a one-night stand that you know shouldn't have gone through with.  I was excited about it at the time\\, but I'm regretting it now in the aftermath.  There were (very few) moments of pure brilliance that were somehow meshed into an otherwise contrived and unfocused plot.  The humor felt entirely out of place a number throughout most of the film.  Forced humor is the worst kind\\, you know\\, sitcom-level kind and I was almost expecting to hear a laugh track.  Might not have been a bad idea either because during my screening\\, very few laughs were heard.  My intent here is not to go into a deep dissection\\, but just to make a few points.  The movie is a disjointed mess.  The flow felt totally off.  There are absolute lapses in logic.  Characters that should have stayed alive are killed without fanfare and characters that should have died are miraculously still alive.  The First Order is portrayed as if they're bumbling novices that haven't even completed their military training and yet somehow they're meant to be seen as a legitimate threat.  The good guys are almost always portrayed as being \\\"better fighters\\\" in Star Wars\\, but it felt absolutely lopsided here.  There was an unnecessary side plot that was added in for padding.  And yet\\, I still saw traces of what was probably at one time a solid film that would have echoed the greatness of its forebears.  I've actually loved Disney's handling of Star Wars since they took it over.  I saw Force Awakens and Rogue One in theaters multiple times\\, so I'm not some Disney hater; quite the opposite.  I don't know if it was studio meddling or a poor director at the helm\\, but this one completely missed the mark.  That said\\, there were some great performances.  Ridley\\, Hammill and Driver were great on-screen and their scenes and character development (for the most part) were what kept me engaged.  Is it the worst film of all time?  Quite possibly.  I was horribly disappointed by it and I'm now concerned as to the direction my favorite franchise of all time is heading in.","true":true}