{"101487":149814,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"Let the past die. Kill it if you have to.\\\" -Kylo Ren\\n\\nThat sums up pretty much the whole Star Wars story-line at this point but I'm afraid it's a little worse than that.\\n\\nIt's difficult to decide where to start because it was all just so bad. Plotholes. Acting. Pointless side-arcs. The special effects are really the only things that stood out but that alone isn't enough to carry the movie.\\n\\nAfter leaving the theater I gave it a 6.5 until I went online to try to figure out how it could all have gone so very\\, very wrong. After I did that I had to drop it to a 3. It's fallen prey to the SJW cancer that destroyed Marvel comics(but strangely\\, is not present in the Marvel movies).\\n\\n'The Last Jedi is the first properly feminist Star Wars'- \\\"Warning: spoilers and deconstruction of the patriarchy ahead.\\\" -www.newstatesman.com\\n\\nThere were others but that one says everything you need to know. The men in the movie are either violent man-children\\, incompetent or just simps. The women are powerful\\, patient and ever mindful of the feelings of others but never willing to share any amount of control. Except for Phasma who seems to die quickly and easily\\, possibly as a message for what happens to women that choose to support 'the Patriarchy'. Luke has been reduced to a bitter old man that isn't up to the challenge anymore and betrayed himself by considering the thought of killing a child. Because\\, no matter how good or noble\\, all men are susceptible of turning into a monster. Rey is a 'Mary Sue'\\, amazing at everything for no good reason. We can't even attribute it to some deep connection to her parents as it seems they were drunk nobody's that sold her off for beer money. Anakin was at least supposedly created by Darth Plagueis through midi-chlorian manipulation resulting in him being far\\, far more powerful than other force users which allowed him to see and do things a child wouldn't have been capable of. Rey? magic vajay-jay I guess. Capitalism is even attacked by showing the decadent lifestyles of gamblers that made their money from selling weapons with child slaves depicting 'the little guy' in society that can never get a leg up because someone else is holding him down. From start to finish it feels like it was just one long propaganda commercial. \\n\\nOne of the things I found that puts it all into better perspective than I ever could was some guy called Sargon of Akkad on Youtube with a post called \\\"Gender Wars The Last Snowflake\\\". If you have a few spare minutes it might be worth checking out.\\n\\nWith all that said\\, I won't be paying to see the next one. Fool me once\\, shame on you. Fool me twice\\, shame on me. This was like waking up and being promised three amazing meals for the day. You walk into breakfast and find a porridge like meal that Russians in the 16th century might have eaten during an exceptionally harsh winter. You think it's a joke but you're told lunch will erase any bad memory of this meal; it'll only get better. You arrive and you're given a barely edible\\, and quite possibly mildly poisonous\\, pile of mush but you're hungry so you eat it. And now you're told dinner will be a meal so mouth wateringly delightful that you'll feel like you've gone straight to heaven...Would you really believe them after the last two experiences\\, each progressively worse than the previous?(TFA was worse than the prequels\\, amazing but true). I think most people would choose to go to bed hungry rather than face the abomination that awaited them at the dinner table later that night. \\n\\nEnough. You broke me. I loved the older movies and at one point had read all the novels and most of the comics that had been released up to around the early 2000's. You managed to target something a man loved as a child\/young adult and destroy it because you hate it's primary fan base. I know you're happy about that and I hope you rot for it.","true":true}