{"101487":170282,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi is without a doubt one of the best films in the Star Wars franchise and one of the most unnecessarily controversial films in recent history. There is a simple reason for this: Star Wars fans are some of the most insufferable\\, whiny fans in the galaxy.\\n\\nAs a huge fan myself (Seen every movie\\, TV series\\, and read some comics\/ books) I am grateful that we have such a thriving and enjoyable experience to take part in this many years into the Star Wars franchise. Most fan bases don't get regular service like this\\, but we do. Yet we still complain and moan with every installment\\, no mater how well done. Apparently The Force Awakens was a rip off of the originals and the Last Jedi was too different from them. Give me a break and make up your minds.\\n\\nDon't get me wrong\\, I'm no apologist. I'm not a huge fan of the prequals\\, and while I enjoyed Rouge One\\, it was hardly my favorite entry.  The Last Jedi is what Star Wars is and should be about.  It's not the film I wanted\\, but it is the film I never knew I needed. Despite a few pacing issues and one side plot that dragged on a bit too long\\, the movie is near flawless. The action and visuals are some of the best in the series\\, if not the best. The music is wonderful as always. The acting is top tier. The character development and deeper exploration of the force takes the best elements of the Clone Wars TV series and adds new layers to the Star Wars universe. Without spoiling anything major\\, I can say that without a doubt Kylo Ren was made into one of cinema's most complex and intriguing villains in this installment. Rey was also explored in ways that made her character very compelling and relatable. I highly recommend this movie. I've seen it twice and loved it even more the second time.\\n\\nDon't listen to the whiny Star Wars fanboys who are upset this movie didn't pick up on their fan fiction wet dreams. This film went places none of us were expecting and it is better for it. I've seen so many people complaining about the lack of a backstory for Snoke or the Knights of Ren\\, but I'm frankly glad that wasn't delved into. These same people worship Empire Strikes Back\\, but that movie wouldn't be half as good if it had wasted time exploring Palpatine's backstory instead of advancing the plot. People are also still complaining that Rey is a Mary Sue becuase she has performed some relatively minor force moves like lifting rocks and one Jedi mind trick.\\nMeanwhile these same people are fine with Luke guiding missiles with the force while flying an X wing with no training. I'm not bashing the originals\\, just showing how dumb these criticisms are. The same \\\"fans\\\" would hate the originals if they were released today.\\n\\nThis movie did just what any great second installment in a trilogy does. It moved the plot forward\\, truly developed the characters\\, and set up a huge final climax in the third movie. Go see it. Leave your pre-conceived notions at home.","true":true}