{"101487":147911,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Johnson spends as much time as he can in this film compounding failure of storytelling upon failure of storytelling. We're expected to believe that a character messes up in not directing bombers we can barely see moving to return to their ship's hangar when at the same time we see that the ship they are meant to destroy is just a minute from blowing that ship out of the sky. This \\\"failure\\\" then spawns the 30 or 40worst minutes of the film simply because that character's leadership couldn't be bothered to sit down and have a 30 second conversation with him.\\nThe main drama of the film is an 18 hour long slow speed chase with three rebel ships barely outrunning a large fleet of star destroyers while slowly running out of fuel. Running out of fuel is something we've never seen before in Star Wars and while lightspeed is\\, we don't actually see any of the much larger fleet simply jumping ahead of the rebel ships to cut them off or simply reaching out to any other ships of their First Order which the opening crawl tells us is in control of the galaxy and having them set up a space roadblock.  \\nJohnson's biggest sin here is in forcing the trilogy into yet another big baddies vs. the scrappy underdogs conflict as in the first trilogy. This is after JJ Abrams set him up by having the villains knock out the capital systems of the New Republic in the Force Awakens. Johnson simply ignores this. The hundreds or even thousands of systems that make up the body of the New Republic apparently don't seem to mind that their UN HQ system was destroyed and the resistance don't get so much as a phone call from anyone when they send out a distress signal as their chase draws to and end and they seek refuge.  Johnson could have set up an actual war between two equal parties to start in this film and play out in the next but went with the same story from the original trilogy instead. \\nThe Porg penguins are awesome.","true":true}