{"101487":196316,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where to begin\\, what a non believable piece of garbage. First Leia gets blown out into space unconscious and she doesn't die\\, then wakes up and uses the force to fly like superman back to her ship and opens here eyes IN SPACE and she gets back inside how? You understand space is a vacuum yes? You blood will boil and you will freeze in less then a minute and die\\, who are these stupid writers? THEN when Luke and Kylo are dueling they run at each other strike swords then end up like 20 feet away from each other turn around and do it again\\, sword fighting doesn't require you to run away from each other for 20 feet and turn around and repeat. Its goes on and on\\, the imperial ships follow Leias ship through light speed or whatever then follow them at a distance instead of light speed jumping a couple destroyers ahead of Leias ships to intercept them\\, but of course we wouldn't have the obligatory \\\"weapons charging\\, need to give the rebels time to come up with some elaborate plan to stop us in time\\\" plan. Just like when they land on the planet (so incredibly far away from the door) and need to \\\"Charge\\\" the battering ram. Whoever wrote this garbage go back to script writing school\\, your terrible. Then luke dies from NOTHING?!? Just vanishes? and Reys parents are not even a story plot? The new evil guy Snoke has no backstory hes just here for a couple movies then gone? No story about where he came from or how he rose to power? No back story on who is Reys parent? And finally the unoriginal \\\"I see the conflict in you\\, you want to join us\\, NO i see the conflict in you turn to the dark side\\\" we already seen this long ago in Return of the Jedi. You writers couldn't come up with anything better that was more believable? really?","true":true}