{"101487":180780,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This fails as not only a Star Wars movie but a movie period! This is a trilogy so it's really the middle part of a three act play. The middle part that just took everything that happened in the first part and tossed it out the window. The previous movie built up curiosity about Snoke and Rey's background and the entire plot was driven by a search for Luke Skywalker. \\nSo\\, Snoke dies as casually as Han kills Greedo. Rey's parent's are nobodies and Luke's big contribution that we were all waiting for is to act like grumpy old man and create a five minute\\, smoke and mirrors diversion so a handful of rebels can sneak out the back of a cave (with Rey's help). They he dies alone in his self imposed solitude. \\nThe characterization throughout was awful. Were still just supposed to accept that Rey is a master at the force despite having no idea what it was  a short time earlier. We are supposed to accept that Snoke\\, the master manipulator\\, could not tell that Kylo was going to betray him. Hux is treated like a punchline in this movie. He's like the laughingstock character from a bad sitcom.  We are supposed to accept that LUKE SKYWALKER would think \\, even momentarily about murdering his own nephew in his sleep!! Poe\\, I guess is there to look like an idiot so that the purple haired leader can lecture him (and us ) about taking unnecessary risks. This is Star Wars after all! It was inspired by Flash Gordon and other such heroic fare that George Lucas loved as a boy. If Disney wanted to retcon this into some pretentious morality lesson instead of escapism and fantasy\\, why bother spending BILLIONS of dollars to buy it? \\nJust create your own fantasy and do what you want. I think we all realize that the original cast is what makes these movies sell so many tickets. The original cast and the original formula of the classic movies. But they new directors\\, like Rian Johnson apparently know better. \\nAs a basic film. This was terrible. This was a master class in how NOT to write\\, direct and edit a moive! This should be required viewing at every film school to see what not to do. Character arcs that go nowhere or are simply discarded altogether. Humor where it does not fit and hurts the characterization or the drama. Long subplots that go nowhere. Hamfisted attempts at feminist and diversity virtue signaling throughout. \\nIt's become a subject of news lately\\, why there is such a disparity between the critics and the users score here on this very site. I have no idea why so many \\\"professional\\\" critics rate this so highly. The cynic in me sees it as influence by Disney or perhaps a reluctance to criticize any movie that tries so hard to win diversity and feminist brownie points. I'm a very casual student of movies but I understand the basics of characterization\\, editing and telling a coherent story. This fails so badly that I've lost immediate respect for any \\\"critic\\\" that does not recognize how badly this film is put together. \\nTake \\\"Star Wars\\\" out of the equation and just imagine this screenplay being submitted to a screenplay competition or a class in filmmaking where structure\\, plot\\, characterization and pacing would be analyzed. Does anyone seriously believe this would do well?","true":true}