{"101487":129514,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am not a bot\\, but a disappointed  Star Wars Fan.\\n\\nThe Last Jedi film didn't \\\"feel\\\" like a Star Wars movie to me. I miss Star Wars creator George Lucas who told epic and visual stories that explored the mythology of the hero and his world.  I like that grand epic space opera style.   However\\, this film felt like an okay action science-fiction movie and that bothered me. I have never felt that way about any Star Wars movie in my life. \\n\\nThe actors gave great performances\\, but the plot holes and side detours in the film detracted from established Star Wars\/Jedi\/Force lore. I wish writers and directors would leave the revisionist\/retcon approach to telling a story in movies alone. It disrupts the continuity and shows no respect for the original source material. I feel cheated. What was the purpose of the Casino scene?  Did that add to the story? While it was beautifully shot\\, it was a waste of time. It could have been a freestanding unrelated Star Wars movie about space casinos.  I would have preferred that time be spent on Rey\\, Luke\\, Leia\\, Kylo\\, and the Force. Wasn't Anakin's ghost supposed to appear in this film?  I was looking forward to his appearance.\\n\\nI am a fan of the Original Trilogy (saw it on the big screen as a kid\/teen)\\, the Prequels (saw on the big screen as an adult and love them still. Revenge of the Sith is my favorite Star Was film followed by Empire Strikes Back)\\, and I even liked Rogue One because it also had the Star Wars vibe to me.  I was excited to see this film\\, but left the film disappointed. Maybe the book will add more to the story that the film lacked.","true":true}