{"101487":175147,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is a 'departure' from tradition in the sense that the Revolutionary War was a 'departure' from the UK. Not only did it completely re-write canonical characters and the rules governing the Force\\, it was a terrible\\, terrible movie. In the most basic sense of filmmaking it was a debasement: poor character choices\\, pithy on-the-nose dialogue explaining every intention of every character all the time\\, useless subplots with no resolution. Zero cinematic chops in service to any narrative climax - any buildup was quickly brushed away with cardboard dialogue. No dramatic action was used to move the story forward - everything is explained with the intrigue of a boardroom Powerpoint. And then Luke milks some lazy animal. It was a bad comedy. \\nIt's impossible to watch the original Episodes 4-6\\, jump to 7 and then watch this. It makes complete nonsense and doesn't fit into the long story that's taken decades to tell. That's why I felt betrayed. I grew up with Star Wars. The Force Awakens felt like I went on a date with my 9-year-old self - to be back in that childhood excitement and awe. To see the characters again (aged appropriately for the story) seriously made me emotional. Star Wars isn't that important; give us that jolt of nostalgia\\, take us on an adventure\\, let us bathe in the pretty music and space imagery. It's too late to make a 'departure'. This is an unfinished story that started in the 70's. \\nThe art direction of the originals is also burned up. Rian Johnson tried to duct-tape on the 70's-era computer consoles and spaceships of the Empire into the 21st Century and failed on both fronts. The original designs of the universe are obviously dated. But you have to live in that world and expand on it\\, not try to re-create a new\\, completely uninspired design and still think you can cut-and-paste the old on to it. A completely tone-deaf\\, uninformed\\, disrespectful move.\\nScreenwriters: There might be a book you've heard of...'Story' by Robert McKee. If you still have jobs after this you should give it a read.","true":true}