{"101487":121282,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Firstly - I am not a troll\\, I have loved all the starwars films\\, even Phantom Menace and yes I am an original trilogy fan ! I was genuinely disappointed by this film for a number of reasons - this was the first starwars film I walked out of the cinema not really knowing whether I enjoyed it. It was the openning midnight showing and buoyed by the positive reviews and buzz my expectations were high - Empire Strikes back high. I failed to see any comparisons - I was surprised by the Snoke twist - especially after all the mystery of his origins and agenda which were never explored in FA\\, JJ in his typical style hinted at much that wasn't followed up on LJ. Rey's parentage after waiting 2 years from FA was disappointingly revealed as no one -\\nI still don't believe this and expect her true identity to be revealed in episode 9. Having looked forward to seeing Luke return in this trilogy even in a support role as teacher (and yes I appreciate that this trilogy is about the new cast)  I was disappointed to find he was only in the last 10 seconds of FA - and I can totally see why Mark Hammel had disagreements with the direction his character was taking in Last Jedi\\, he was unrecognisable. LJ started to go wrong for me with Finn's sub plot at the casino - why this was included I don't know - it was an unnecessary distraction from what was happening to other characters and could be removed entirely with no impact to the actual story arc - I would have preferred more Captain Phasma who is a great character and was totally under used\\, and where are the Knights of Renn? Why did only Yoda appear to Luke? Surely Obi-wan and his father would have to?  In the end Luke Skywalker one of\\, if not the biggest iconic hero in any film saga bowed out with a whimper and will be remembered in Last Jedi for milking an Alien sea creature. I would have preferred Luke to have fought and held his own for a while against multiple Knights of Renn before being over run and catching a killer blow - que the 'Noooooooooo' moment from Rey. Forget the past\\, burn it\\, kill it if you have to'\\, was Kylo Renn talking to Rey or was this a subliminal message to the audience??? Really hoping for a better ep9.","true":true}