{"101487":155416,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My initial impression was that\\, rather than the best since Empire as the critics say\\, it was the worst since Phantom. After digesting for a day\\, I think it's the worst ever. I do not like the prequels\\, but I NEVER had the desire to walk out of the theater during the prequels. The only reason I didn't during The Last Jedi was because of the promise of a spectacular final 45 minutes that never materialized.\\nSPOILERS AHEAD\\nThe only way The Last Jedi compares to the original trilogy is in the nostalgic throwback to the gas shortages of the 70s. Since when do capital ships run on E85? Are you telling me that two fighters can easily destroy a \\\"fleet killing\\\" ship\\, but a fleet of star destroyers can't handle a stricken cruiser during a day-long \\\"chase\\\"?\\nThe Force Awakens had its problems\\, but it created So. Much. Potential for The Last Jedi. It left great cliffhangers and characters that could have been special. It was all wasted. \\nThe plot holes are wide enough to create a hyperspace lane. Rey\\, with no training\\, is all but a Force goddess. Snoke... just everything. Leia and her Mary Poppins walk. Kylo can stop a blaster shot in midair\\, but needs to be saved from a few guards? BB8 can steal an Imperial walker or anything else it wants? Rose goes from lowly maintenance worker to commando that can deactivate technology that nobody has ever heard of\\, to the best Pinto driver in the Resistance? I'll stop\\, but the list goes on. (Doesn't Rey know that she shouldn't use that \\\"shin\\\" of hers between 4:00 and 5:00? That's when Kylo showers after blasting his pecs.) \\nI hate every character now\\, other than maybe R2D2 and C3PO\\, and they don't really count. No second viewing. No blu-ray purchase. It was dreadful.","true":true}