{"101487":130294,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I created an account here\\, like many others\\, just to write a review of Star Wars: The Last Jedi.  Friday morning\\, my brother texts me \\\"Ya\\, I don't know about the Last Jedi\\\" having seen the premier the night before.  To my complete and utter surprise\\, he ranked this movie the lowest of all the Star Wars movies (not counting the Clone Wars animated movie).  I was complete and utterly shocked.  I read every spoiler and hundreds of both negative and positive reviews.  I had convinced myself a lot of the hate for this movie was due the fact many people's expectations and preconceived notions of the movie had been shatter; I though\\, now that I know what to expect\\, I can enjoy the film more.\\n\\nBoy\\, was I wrong!\\n\\nThe acting was very flat in several parts of the movie.  The CGI was excessive and hideous.  The movie had no focus. Characters were wasted and misrepresented. The pacing was terrible. It was a complete and total rip-off of Return of the Jedi and the Empire Strikes Back. It was extremely corny.  Pointless subplots. And\\, most of all\\, it was just boring.  My seven year old son told me twenty minutes before the movie ended that he was bored.  A SEVEN YEAR OLD BOY SAID HE WAS BORED WITH A STAR WARS MOVIE!!!  Oh\\, some stranger to the right of me feel asleep!\\n\\nI would highly recommend anyone considering to see this movie read through all of the reviews.  They are true!  And anyone and everyone who liked this movie can only call us cry babies and whiny fan boys.  Look\\, I know a good movie when I see one.  Force Awakens was no masterpiece but I've always liked it.  Rogue One was surprisingly good.  The Last Jedi\\, however\\, just falls flat.  It's like the director did everything he possible could to defy any expectations people had for this movie.  And the result is an unforgivable disaster! \\n\\nThis review from the Daily Wire perfectly sums up how I felt about the movie.\\n\\\"All in all\\, \\\"The Last Jedi\\\" was a putrid mess. The handful of entertaining scenes aside\\, the film was devoid of consistent flow. Any meaningful development in the majority of main characters introduced in the last film was brazenly sacrificed to score social justice points with new utterly useless characters in this one. In no way can I recommend you go see this film. But if you still choose to\\, may the force be with you.\\\"","true":true}