{"101487":136052,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I love the old SW movies. Even like the prequels... but this is the first time I am truly repulsed by a SW movie. \\n\\nLet me explain:\\n\\nWhat are the knights of Ren? Who is Snoke and how did he get to power? Who is Ray? \\n\\nThese are all questions director Rian Johnson doesn't care about. It's like he tried to erase what JJ did.\\n\\nInstead\\, Johnson\\, writes in the most incongruent version of Luke Skywalker imaginable. He might as well have Luke take up bowling and baking\\, because it would be more believable than the way he behaves in this movie. Absolute rubbish. No wonder Mark Hamill found it hard to swallow (watch interviews). \\n\\nThere are also things that make no sense and are out of character.... things like Luke burning down ancient Jedi books because.... well\\, just because. A \\\"hero\\\" burning ancient and irreplaceable books hasn't been around since... Nazi book burnings in the 30's. \\n\\nThe constant pushing of Ray down the audience's throat continues. Apparently all it takes to be a Jedi is getting your hands on a light saber. She's already at the level where she takes on people with years of training under Jedi masters... and pretty much whops their behind. It's like someone finding a tennis racket and a few days later\\, with no proper training\\, she takes on the best players in the world that practiced for years... and beats them. \\n\\nAt least make an effort to make things believable. No such luck though. \\n\\nForget the deep concepts behind the original 6 film series. Instead we are treated to Seth Rogan type jokes.\\n\\nAlso\\, Kylo doesn't wear that silly helmet anymore. Why did he wear it in the first place? Who knows? The director doesn't care to explain these inconsistencies or care about plot holes so big you can fly a Death Star through them.  \\n\\nIn the end it becomes painfully obvious what this movie is. It is the Disney-fication of Star Wars.... the Hanna Montana-fication of Star Wars. \\n\\nFor kids\\, this movie will be cool. It's shot in a beautiful way and there is plenty of action. So long as you don't care if that action doesn't make sense of is totally out of character for a Star Wars movie\\, you'll be fine. \\n\\nBut if you're a true Star Wars fan that's been on this ride for decades\\, this will be a bittersweet moment where you realize that Star Wars is dead. Long live Disney Wars.\\n\\nPS: For those wondering why almost ALL critics gave it such high marks\\, please understand that Disney threatens to remove access or previews of their content for critics that don't play ball. Google it.","true":true}