{"101487":99830,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After having seen this movie i did not leave the cinema feeling happy at all i felt really empty and a bit sad and not in the good way. Most of this movie was very entertaining and fantastic but the last quarter of the movie it became clear that the story was going no where and there was no direction of the plot. it did not Feel like this movie connected to force awakens very much at all. All of the big plot points form that movie where basically forgotten in this like who is Snoke? Who are the Knights of Ren? like if the Knights of Ren are just nothing now why even bother having Kylo Ren be called that why not just Darth Kylo? This sequel Trilogy was a mistake i feel and has no guidance at all they do not attempt to make the movies connect in anyway which is just lazy story telling and why change the directors for each film? it makes no sense why not have just kept JJ say whatever you want about TFA but at least he had clear plans for the future. In my honest opinion if you want to see a good star wars Film go watch Rogue One. This movie disrespects the Starwars Canon and the original Trilogy characters are stories\\, Not to mention the clear agenda being pushed by the director and higher up staff at Disney. We do not need forced diversity or forced female characters in starwars. Star wars was always diverse and always had strong female leads\\, all this movie did was hate on men and make every single male character look like an idiot compared to the female cast. Also the characters of Rose and Vice Admiral Gender studies did not need to be in the movie. I would like to see a cut of the movie that has them removed I believe this would be much better but won't save it.","true":true}