{"101487":177946,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The plotholes and weak characters are strong with this one.  I'll admit\\, the movie looked and sounded good\\, but omit the special effects\\, CGI and music and what you are left with in this movie is nothing.  A movie is only as good as the story it tells and no amount of special effects can replace the story.  This movie had no real story.  Really.  It's main plot was that the Resistance was involved in a slow speed chase (a la OJ) from the First Order and they WERE RUNNING OUT OF FUEL.\\n\\nSo\\, storyline issues to start with.  Throw in some cringe-inducing jokes and we are off and running.  I was hoping for a story here about good and evil\\, peace and war.  Snoke seemed like a worthy master villian\\, but he is wasted and you get no further knowledge of who he was and how he came to power.  Kylo Ren takes the reins of the First Order\\, but they seem to be nothing more than a bumbling joke instead of a reign of terror to the galaxy.\\n\\nLuke is going to train Rey (the Last Jedi)\\, right?  Sort of.  The way Luke was portrayed is the biggest injustice of the whole movie.  Luke\\, who defeated the darkside in Return of the Jedi \\, is now hiding on an island (yet there is a map to locate him?) because he tried to kill his nephew in his sleep.  This really seems to be a rewriting of Luke's history\\, and quite frankly\\, character assassination.  Luke is a grumpy old man who wants nothing more to do with Jedis and the Force and reluctantly trains Rey for about 4 minutes.  Rey doesn't seem to need the training as she is now the most powerful Jedi out of the gate.  \\n\\nPoe also seems to have gone through some character adjustments.  In The Force Awakens I viewed him as someone with confidence and leadership skills.  In The Last Jedi he is portrayed as a hot-head \\\"flyboy\\\" that needs to be put in his place by the women in charge (Leia and Admiral Holdo).  Holdo (should have been Akbar for this role) has a secret plan to help out The Resistance\\, but why couldn't she have shared this with Poe?  Because then we wouldn't have seen the most pointless scene of the whole movie involving Finn.\\n\\nFinn is caught attempting to bail by a mechanic named Rose.  They go together to a planet named Canto Bight to try and find a hacker in a casino.  This is the most worthless plot of the whole movie.  Rose is a throwaway character\\, who quite honestly was even MORE ANNOYING THAN JAR JAR BINKS.  At least Jar Jar eventually  proved to be useful.  All Rose does is whine about social injustices and then instead of focusing on the mission to help the Resistance\\, she frees some race animals and says it was worth it to stick to the rich people.  Without her in this film I probably would have given it one more star\\, but she really dragged it down for me and her pairing with Finn seemed to be a misuse of his character too.\\n\\nLeia is pretty solid in this movie.  I cannot fault her character as she is the Leia she always was.  The only thing I can say about her is there is a horribly corny scene where instead of dying (which would have made sense because Carrie Fisher has passed in real life)\\, she transports herself like Mary Poppins back to her ship.  I literally rolled my eyes at this scene\\, it was really cheesy.\\n\\nThe final thing that I really didn't care for was that I felt like the movie was trying to undo all of Star Wars lore and legend.  Yoda appears...yay\\, at first but then he seems slightly unhinged and even torches the Jedi books.  I just felt like this scene was symbolic of the direction Disney is taking Star Wars.  They want to head in a new direction\\, fine.  But you cannot burn the history that has built up for decades.  The characters they add at this point should serve a purpose.  Not be annoying minority check list marks.  I can accept a new set of heroes and villains\\, but it should still be a story of Jedis and the darkside.  Otherwise\\, what is the point in calling it \\\"Star Wars\\\"?","true":true}