{"101487":105714,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A slap in the face and a mess of a movie. The film offered the writer\/director a once-in-infinity opportunity to create the return of Luke Skywalker\\, and we get... milking an alien? It was the ruination of Luke Skywalker. Can anyone really think this is the best they could do? Lucasfilm had to expect a vehemently negative reaction to Luke's storyline.  This truly was an anti-Star Wars movie. The storylines for Fin and Poe were totally forgettable. They were useless digressions within digressions in which the characters seemingly fought to make themselves relevant to the movie. The casino was a royale flop. The CGI on that planet and in the fight scenes inside the First Order's ships looked unreal and were frequently inane. Vice Admiral Holdo? Lousy. Celeb cameos? In Star Wars? Seriously\\, that's trash. Return of Phasma? Lazy. Her role was fine for Force Awakens but she's just a shiny souped up stormtrooper. That's a limited use character. She's done. Move on. Make up a new villainous character\\, please. You've got the artists and budget to do so. Snoke was a pathetic villain with no gravitas. Since they never bothered to build up his story\\, I'm not going to bother to say more about him. That said\\, the New Republic must've been even more pathetic to get so easily rolled by the likes of Smoke. Kylo Ren is a lightweight. Where's the beef? Then there's Leia Poppins. She deserved better\\, too. Yoda and Chewbacca were among the occasional highlights\\, even managing to be delightful. Rey was also a bright side. The film did start to pick up in the 3rd act and almost seemed like it could come together. For all its myriad faults\\, the movie could have redeemed itself with a storyline worthy of Jedi Master Luke Skywalker. And in that it failed and the entire movie failed. Throw the writer\/director to the Sarlacc. Throw K Kennedy to the Rancor. Toss the rest of Lucasfilm into the Death Star trash compactor -- along with every last DVD or Blu Ray copy of the Last Jedi. The Force is not with them....","true":true}