{"40636":"18966","TLOU2":"TLOU2","2020-08-05":"2020-06-29","10":0.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"It’s a trash story. Filled with absolute nonsense.They dumb down Joel's character on purpose to make him weak and stupid. In the first game he was very smart and had a ton of experience. He didn't even trust a guy that was sick on the road. He chose to run him over. Later we find out that stranger on the road was not sick and it was all a set up. They do everything to make you dislike Joel and continue to spit on him. They have a trans female\/male shoot him in the leg and torture him with a golf club right in the first 2 hours of the game. They spit on him literally. They made Ellie unlikable and a selfish human being. She kills everyone and continued to blame Joel for saving her life. She cared so much in saving humanity because she has the immunity but instead she became a lesbian and chose not to reproduce. Let that sink in. She even let's Abby the one that tortured and murdered Joel in front of her get away with it. Abby also bit off two of Ellie's fingers. Her letting Abby go is basically saying Joel deserved dying. A loveable character who is the main character of the game. There was no justice for Joel. This game robbed everything from you just for shock value. The current narrative of destroying the male character to make the female character rise is very weak story telling. It is disrespectful to both genders. Females even hate it. Worst of all the pacing of the story is horrible. You literally play as Abby the character we hate for half the game. They tried so hard to make us like her but none of it worked. This game is a waste of time and money and should have never been created as a sequel. The critics are liars and they don't care about what the fans want. They only care about their political narrative and force you to like something that you will never accept. Then they insult you by calling you names because you don't like the product they are praising. They are the worst kind of human being. Trust the gamers that actually love playing the kind of video games you like. Those are the ones who you should listen to. Vote with your wallet and avoid this dumpster fire. Why care for a game created by a studio that is run by Neil Druckmann who is a male feminist and does not care about the fans and the people he works with. That's why 75 percent of Naughty dog left the company due to how he treated them. This game is created by people that don't care about you and backed by people that hate you. The game wasn't made for the fans and gamers. Vote with your wallets and avoid this at all cost. Especially how they are trying to trick everyone with false advertisement into buying this. Look it up on YouTube. Don't trust the shill media. Watch the negative videos about this game and you will see the truth. Long live Joel and RIP to The Last of Us franchise. Seriously… Expand","true":true}