{"101487":133183,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I grew up as a kid watching the first Star Wars and Luke Skywalker\\, Han Solo\\, Chewbacca and Princess Leia was my heroes. It is sad to see the path the latest round of trilogy has taken to kill off these enduring characters. I believe that Disney lacked the vision and creativity to keep Han Solo and Luke Skywalker\\, as they have already ran their course for merchandising and they are too much of a threat to the new characters that they want to capitalize on. \\nStar Wars was a space western with land speeders and other craft taking the place of Broncos and light sabers instead of six shooters. The ultimate bad guy in black. The good guys protecting the downtrodden and saving the day. The last installment lacked the qualities of the original trilogy and took a step back to being akin to Lucas second trilogy. \\nMany would disagree\\, but this is not Lucas storytelling. Our heroes do not get to ride off into the sunset. They don't grow old. They make way for newer characters that appears to have more concentrated character flaws of the old. Ben Solo trying to be a darker version of Darth Vader. Rey trying to convince Luke to train her just like when Luke was trying to convince Yoda in Empire Strikes Back. Poe as a more remiss version of Han Solo. There is a lack of originality. \\nThe battles was idiotic\\, for instance\\, how does Poe leave a dreadnought completely defenseless with one X-wing? Does anybody realize that a ship traveling at light speed could cause so much damage. Does the First Order not have shields? \\nThis movie was decent\\, but does not warrant the great reviews. What was the point of the prophesies in the older movies. Why did Disney lead us on about Rey's parents in The Force Awakens\\, if they are nobodies. What is the whole sequence of visions about\\, when Rey gets the light saber? The second trilogy already established that many from all walks of life could be a Jedi\\, they just have to go through the rigors of training. This came off like it was a new idea for the first time in The Last Jedi. So does the Ying and Yang of the Force revealed by Luke. This was already told to him by Ben Kenobi. \\nI understand that this is a difficult movie to make and there is a lot fan expectations. I just don't get why kill of the main character who journey we have followed all these years to just be sideline as an expendable hermit. So now\\, thanks to Disney I am no longer a Star Wars fan.","true":true}