{"101487":141152,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I thought Star Wars: The Last Jedi was fine as I was watching but the more I kept thinking it over afterwards the more frustrated with it I became. I saw the prequels first which were meh\/not good and then I saw the originals much later and thought they were great. So the argument of \\\"you grew up with them and viewing the originals through rose tinted glasses\\\" doesn't seem like a fair counter-point to my personal review.\\n\\nThe way this movie used certain characters...seemed so completely out of character. I hated how they treated Luke Skywalker especially. It just broke the continuity of who these people were in the first place. It's fine to break new ground but it just felt completely disconnected with was developed over a long time that made people a fan of this series in the first place. I get it\\, this movie made a major point of forgetting the past...but if you found the past meaningful and full of joy you don't completely obliterate it. You honor and build on the positive parts. Or at least that is my expectation of what wisdom gives you. So yeah if this movie set out do the unexpected it succeeded I guess.\\n\\nBesides my disapproval of the characters\\, there's the gaping plot holes and jettisoning of the previous movie's lingering questions with no worthwhile payoff. Wasn't a huge fan of The Force Awakens but at least it setup an interesting future that made me hopeful. Ironically however\\, with a movie all about keeping hope alive it killed my own hope for this franchise. Dang\\, can't believe a movie got me this disappointed to make an account and write a review. RIP Skywalker.","true":true}