{"101487":149868,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Life-long Star Wars fan..so of course\\, I wanted to love every second of this. I wanted to even side with the critics and appear sophisticated\\, snobbish even\\, in my discussion of The Last Jedi....but\\, quite honestly\\, I hated this film...and the more I get away from it\\, the more angry I get about the film. It's not as bad as\\, or worse than\\, the Phantom Menace as others have claimed...but it was\\, as a whole\\, entirely disappointing and entirely frustrating. Who was the hero in this film? Rey? Maybe. Poe. No. Luke Skywalker; wasted. Snoke; wasted. Yoda; wasted. The entire trek to the Casino Planet to save the Republic fleet; completely and utterly pointless and a total waste of screen time and character development. Finns battle with Captain Plasma; pointless. That new girl is in love with Finn; pointless. Rey looks on; is she jealous? Finns attempted sacrifice; pointless. Luke Skywalker's battle with Ren...they show you that it too was generally pointless. Luke didn't save the day...those crystal critters were the real heroes. Who are Rey's parents? FU Star Wars fans! Who is Snoke? FU Star Wars Fans! What happened to the 3 Jedi Kylo took with him in the Knights of Ren? FU Star Wars fans! Luke Skywalker (that's all I'll write) BIG FU STAR WARS FANS!! THAT STUPID ENDING WITH THE KID!! WHAT?? THE MOVIE'S OVER?!?!? FU STAR WARS FANS!!! You know...I started with two stars and dropped down to one...the people who made this movie hate Star Wars and hate Star Wars fans............AND I HATE THEM.","true":true}