{"101487":129655,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am still trying to understand. I saw this a second time (I was already committed\\, and I figured I would want to) and it was even more disappointing than the first. So much potential after TFA\\, but they ruined this movie. SPOILERS. Terrible storyline... slow speed chase? Tie fighters aren’t slow\\, they would have shredded that ship. Tracking light speed? LAZY (battlestar). There was no imagination\\, no thrill\\, no feeling of Star Wars. Princess Leia. I thought TFA didn’t do her justice\\, TLJ was so much worse. I always imagined that moment Leia finally used the force\\, how incredible it would be in a moment of desperation. What they chose completely lacked creativity\\, was poorly executed\\, and laughable. Both audiences cringed\\, it was just stupid. Luke. I mean\\, by the end of Return of the Jedi\\, he was savage!! All black - green saber - he was THE Jedi. It made no sense that he gave up after failing Kylo. None! This is the guy who never quit. The milking of the sea cow thing\\, stupid. All the jokes BAD. Yoda - I did not like anything about his scene. Chewys charm - Nothing. C3PO - no one can get his lines or character right after the original trilogy. R2 - nothing. BB8 (love) cannot ride an at-at - ridiculous. Hated it. The first scene\\, Poe on hold\\, made me cringe - BAD comedy. Kylo shirtless - why? Unnecessary. Phasma story\\, Nothing. Snoke story\\, Nothing. I loved the introduction of Rey and new characters in TFA\\, but this movie did nothing to add to them. Rey wasnt the same Rey. She had my full attention in TFA\\, but even she had stupid jokes. We don’t need force jokes. The gambling planet - awful - waste of time. Even the end with the kid and the broom was poorly done. I have never written a review here\\, but needed to add another 1\/2 Star review. Maybe someone will take note and fix this for future Star Wars movies. ","true":true}