{"101487":168404,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Some good parts but I still long for the 1977 Star Wars experience.  The dialog was so fun in the original with the characters constantly hassling each other.  Whatever happened to telling C3PO to shut up?  There are no rough edges in these movies.  The dialog is more overdramatic and comic book then entertaining.  This movie takes itself way to seriously and I can't say I really like any of the characters very much.  On another note\\, am I the only that notices that the CGI space ships still do not look as real as the elaborate models they used in the originals.  The ships and space scenes look like really beautiful animations but still animations non the less.  Is it because there is too much color.  The light in and shadows are not harsh enough?  I'm not really sure but it doesn't look real.  I think the CGI people are going for pretty over real and it makes it harder to suspend my disbelief.  Darth Vader was still a way better villian then this spoiled teenager villian they have now.  Not even close.  Finally\\, what was going on with all the \\\"forced\\\" political correctness in this movie.  Fine\\, have some strong female characters but this thing just did not know where to stop.  The political correctness was so forced and so artificial it was distracting.  Laura Dern as a General?  Really?  Her personality fits that role in no way whatsoever.  Doesn't she usually play a seductive southern tramp in a bunch of her movies?  I'm sorry\\, it just doesn't work.  What about the lead female character.  Could she possibly be more boring.  No personality whatsoever.  I think Disney should admit that they still did not go far enough with the PC.  Why should all the generals be human.  Why couldn't the Leia's back up general be a hermaphrodite insect.  Why are you people favoring humans!  How small minded of you.  Your are speci-ists.","true":true}