{"101487":99166,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A derivative and largely uninteresting movie\\, with some genuinely cringe-worthy moments. This film takes all the bad parts of both The Force Awakens and the Prequels and exacerbates them; imagery and entire scenes are lifted from the OT without context\\, characters' actions don't make any sense\\, the sense of scale and wonder of the Star Wars galaxy is nowhere to be seen nor are the universe's internal rules followed. There's an entire subplot that comes off like a sidequest from a video game and doesn't contribute anything to the greater story\\, complete with some Prequel-esque CGI creature antics and hamfisted Saturday morning cartoon-worthy messages.\\n\\nThere are some interesting ideas with the Force thrown around\\, but none of it leads anywhere. Mark Hamill does great job as Luke\\, despite clearly disagreeing with the assassination his character is subjected to. Adam Driver is entertaining as Kylo Ren; Rey is still bland as a plank; Snoke ends up amounting to nothing but the low-rent Palpatine everyone always assumed him to be. There's also some genuinely irritating thematic dissonance with the messages the movie is trying to get across -- lambasting core themes of the series such as heroism and sacrifice -- while also glorifying such themes when it comes to the writers' pet characters (such as the completely out-of-place Admiral Purple Hair).\\n\\nOn top of that there's some annoyingly out of place MCU-style self-aware \\\"wink wink nudge nudge\\\" humor that effectively prevents us from taking the film's main villains seriously\\, which was already a problem with the last film.\\n\\nIf this is the best they could do\\, then there was no point to continuing the Star Wars story after Return of the Jedi.","true":true}