{"101487":142157,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Its a good film in its own right but its an awful star wars film as little regard seems to have been paid to the character development from the originals. Whats the point of the previous 'map to skywalker' theme in the force awakens and then they find Luke and he's become a total arse until his last scence when he gets his 'predictable' obi wan style death to let the others escape which felt like a 'been there\\, done that!' moment. Please its so predictable the bigger shock was Snook dieing which confused me as two minutes earlier and he's so evil he makes Palpatine look like an amatuer and then he's dead in a totally anti climitac moment. Shame as I liked him as a bad guy and felt there was a really good story potential there but no.\\nThe only way I can justify this film in my head is if I consider it 'non cannon' Almost every character and every scene has an equivalent in the previous originals it felt like a re-make with a few twists rather than a continuation. Really confused by the 'new direction' comments from others when so much feels like its been done before\\nI actuallky like The Force Awakens but this has killed it for me. If they re-made it with Luke being the Luke we love from the originals and left his death to the finale then all other sins could be forgiven\\, but this is not Luke this is some kind of pseudo Luke who isnt recogniseable as a character we all love from the OT. For the first time in my life I really couldn't give a crap about the next installment.","true":true}