{"101487":155372,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My god I was so hyped when Rey found Luke Skywalker. The Music. The Emotion. It was all so perfect to see my childhood hero return to the screen and two years later I would get to see him in action once more! .....Holy crap was it a disappointment. Walking into the Cinema I was expecting so much from The Last Jedi. All the trailers throwing out hints that characters could change their loyalties\\, Rey could be seduced to the dark side\\, Kylo Ren could be seduced to the light side or maybe they'd join together! And yes\\, the film seems to begin on that path. An unknown connection brings Kylo and Rey together as they discover more about each other and become more emotionally connected. This all comes to meet when Rey is brought before the insanely powerful and mysterious Snoke who wishes Rey to join him and replace Kylo. All fans wishes to know more about Snoke and where he originates from come crashing and burning when in an unexpected turn of events when Kylo slays Snoke in his chair using Rey's lightsaber. This was the moment I was waiting for. Could we see Kylo Ren become Ben Solo once more and possibly take on the First Order?!.....no\\, not at all. He decides to remain as Kylo Ren and becomes the new Supreme Leader of the First Order. Wow what a waste of time that was. Some could argue that all Snoke was was a catalyst for Kylo Ren to eventually become to main and only villain for the films\\, but Force Awakens created so much mystery behind this character that fans wanted more! \\n\\nAway from that we have Luke Skywalker. Now when Mark Hamill openly admits that he didn't agree with the Directors portrayal of Luke Skywalker\\, you have to worry slightly. After watching the film\\, I have to completely agree with Hamill on this one. It is revealed in the film that Luke was prepared to murder his nephew because of the potential of Ben Solo being seduced to the Dark Side. This is the same Luke Skywalker that refused to murder child and pregnant wife murdering dad. However\\, Mark Hamill's performance is incredible to witness. Even know he hated what his character had become\\, his portrayal is amazing and actually saved the film from completely failing.  \\n\\nAll of this\\, unimportant scenes about animal cruelty and an 'obviously mostly cut from the film' Benicio Del Toro create a very underwhelming piece of cinema which will forever give the Sequel Trilogy a bad rep. I did walk of the cinema in denial at first\\, thinking that it was an amazing film\\, but eventually my Star Wars Fan Boy cloud lifted from my brain and came to terms with a very disappointing addition to the Star Wars saga. \\n\\nUnfortunately many fans are still in denial....but then again...the same happened with the prequels....","true":true}