{"101487":167926,"Last Jedi":"Last Jedi","2017-12-15":"2018-11-27","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So I really took my time to rewatch the film again since seeing it at the cinema when it was out last year. I wanted the dust to settle and time to pass so that I could\\, with distance\\, process what I’d experienced. Firstly\\, let me say from the outset that the original trilogy (Episodes 4-6) are their own entities\\, completely untouchable for all sorts of reasons; but in a large part due to the nostalgia I have when I relive my childhood when I watching them. I love them. Any other Star Wars film is fluff. There’s some decent fluff (Rogue One) and some terrible fluff (Episode 1) and mediocrity in between. The Force Awakens didn’t blow me away. It’s probably somewhere on the ‘passable’ fluff scale; it made some major mistakes like resetting Han Solo to square one in terms of his character’s development and the plot was pretty much a retread of episode 4. Never repeat yourself. It had some better elements - some interesting questions were posed and there were some intriguing set-ups which held promise to be paid-off in the sequel(s). I got excited for Last Jedi. I got giddy when they announced the title. This had potential. It had the promise of something darker perhaps. Something with a bit more meat on the bone. And then I went to see it. My overriding feeling (and there were lots of conflicting thoughts and emotions when I left the cinema) was one of disappointment. Let me be clear - I never expected to rekindle what I felt when I was a kid watching Episodes 4-6. But that was fine\\, I’m older\\, bringing life’s experiences to the table which now gives me new perspectives and expectations on what I want from these films. I purposefully underplayed it so that I wouldn’t be disappointed. Hell\\, part of me convinced myself that it was going to be awful before I even went into the cinema. For the first 10 minutes\\, I felt quite positive. There was the rather heavy-handed comedy moment\\, but I could live with that; it was feeling fun and\\, well\\, like Star Wars should feel - epic\\, bombastic\\, a visual feast. I was sold. Then Luke turned up. And a little part of that child in me started to cry. What?!! What the hell have they done to our Luke?? This is not the Skywalker we came to love. This is not the Luke I spent years dreaming I could be. This is not the Luke of the original trilogy. His actions\\, his motivations\\, his reason-detre. All a complete betrayal of the character that we know and love. Then there was more. Set-ups from the previous film that are never paid off. Some may say that was a brave\\, unexpected; bold storytelling move; but it just seemed like lazy writing to me. There were whole sections of story that seemed redundant. Casino Planet? In my mind that whole section could have been cut and you wouldn’t have missed it from the film. There was Mary Poppins. In a Star Wars film??? There were multiple characters doing all sorts of inexplicable things. There were some positives - it felt sweeping and epic and the design was\\, as you would expect from something this prestigious; sublime. But there was political correctness\\, there were social zeitgeist characters who seem to have been included by a tick-box committee; and there was a narrative disregard for what had come before. My 1 1\/2 stars are for those positive aspects I have mentioned; but I’m afraid that even after a fresh viewing a year later; the film just isn’t Star Wars to me. It’s something else posing as a Star Wars story; which has the audacity to rewrite the original trilogy’s lynchpin character as something we know he never was; and never could have been. I think it may be time for me to put any holes if seeing a fully satisfying new Star Wars film to bed. Or maybe it’s time to rewatch the originals again and remind myself of why some things should just be left alone. ","true":true}