{"101487":172955,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"the arching turbo laser shots from the Supremacy (in space)\\, the gravity bombs\\, The terrible design of those bombers\\, no explanation as to why the black captain guy had to go down with his ship\\, why kylo and his two tie escorts needed to return to the fleet because \\\"we cant cover you\\\"  when them 3 alone seem to wreck the entire fleet by themselves\\,  why not send hundreds of ties to attack if 3 can do so much damage? \\n\\nWhy is Poe suprised by Holdo when we find out who she is?  She is the commander of the cr90 with  extra metal welded on.  How could she possibly have a famous reputation with that piece of crap?\\nWhy didn't she have to go down with her ship?\\nWhy is a resistance group backed by the acting government of the galaxy so under powered.  The rebellion from the ot was able to amass a greater fleet when they were under the control of the Empire!\\nThe rebellion had cells all over the place and backup bases.  Why is the resistance so unprepared for war?\\nWhy not split up the fleet instead of losing all your ships one at a time?\\nWhy is Snoke angered at Hux about letting the rebels escape when the tracking device is on HIS ship? Is he not aware of this feature on his own flag ship?  How was he tracking them when he wasn't at the battle of D'Qar? \\nHow were the transports \\\"cloaked\\\" when Snoke could see them through his window magnifying glass.  This is the same for how Hacker Man could \\\"cloke\\\" there ship by licking his necklace?\\nWhy does Snoke talk about how Kylo could be the next Darth Vader but in the next sentence make fun of his mask?\\nWhy is Maz even in this movie?  This is like Obi Wan asking Dexter for help in rots on how to rescue the Chancellor!  \\n\\nWhy didnt the first order have tie squadrons patrolling there fleet at the first battle?  How can they take themselves seriously as a military with such incompetence?\\n\\nWhy do the remaining rebels claim to be \\\"the spark that will burn down the first order or whatever\\\" right after 5 planets have just been obliterated!  Don't you think the galaxy would alreay be pissed if the entire government just got deleted?  Why did the New Republic have there entire fleet at one place?  Are no fleets out on patrol?\\n\\nAlso with what you said about Rose\\, how was she able to catch up to Fin?\\n\\nThe people making these new Star Wars movies dont know Star Wars and probably arent even fans.","true":true}