{"101487":105693,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As it has always been\\, the visual effects and musical score were impressive and exciting. That is roughly the end of the positive aspects of the film. I'm not going to go into every single problem with the film\\, within it's own 2 hour continuity\\, within it's continuity errors from it's own prequel\\, or with it's continuity errors in relation to the entire saga before it\\, but I will say this: It felt rushed. The entire film takes place over a 24 hour span of time and they tried to do way too much in it while simultaneously doing very little. This Is a film that DID not learn from the mistakes of it's predecessors. You want us as an audience to like your characters? Give us time to. You want us to root for them to overcome their challenges? Actually make them challenging. You want to tear down our heroes? Make it believable. You want us to feel like your villains are real and threatening? Don't make them bumbling idiots. The audience understands as they walk into a film that there will be a certain amount of suspended disbelief. We know that we CAN'T walk outside and point our hand at something and it will float to us. But when the movies before yours have established how gravity in space Works\\, how shields work\\, how turrets or guns on a ship work\\, Don't tell us suddenly that it works completely different. Don't have your captain say \\\"our turrets can't hit their small ship because it's too close\\\" then 2 scenes later say \\\"we have to recall OUR fighters or their turrets will blow them up.\\\" Don't have your character say \\\"it's impossible to track through hyperspace!\\\" Then say 2 scenes later \\\"Hey\\, I know where the machine is that tracks through hyperspace because I used to mop right outside it.\\\" Don't advertise a fan favorite character like admiral Ackbar and then kill him after half a line of dialogue. We're not stupid. We know you put him in the commercial just to get us hyped and then you killed him without so much as a RIP. Don't make us have to reason out every scene for it make sense. Don't make us write the script for you. You don't want to explain in dialogue what's going on? That's fine. We don't want that either. We want you to show us. We came to watch this movie and escape reality  and your multiple continuity errors are jarring for the experience. Please\\, Disney\\, make better films and people will give you more money. Wasn't that the entire point of you buying this franchise??","true":true}