{"101487":175715,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-29","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi (TLJ) is in many ways the polar opposite of The Force Awakens (TFA). TFA\\, directed by JJ Abrams\\, took very few risks by creating a modern rehash of a new hope. While I wasn't the biggest fan of TFA's \\\"play it safe\\\" plot and writing it did however introduce new characters which I thought would be expounded upon in TLJ. \\n\\nTLJ\\, directed by Rian Johnson\\, does the opposite of what Abrams did in TFA by taking every risk in the book. However\\, The risks that Johnson took unfortunately hurt the development of the old trilogy characters as well as the new characters introduced in TFA.\\n+ The main thing I liked about TLJ was all the scenes with Kylo Ren. Adam Driver does a great job playing who I believe to be the only relatable character in the new trilogy.\\n- Luke\\, the former symbol of hope and optimism\\, is for some reason a disheveled hermit on an island. By this point you would expect him to be some kind of all-powerful Jedi but he's exactly the opposite and has cut himself off from the force?\\n- Leia is floating in the vacuum of space and uses the force to fly to a ship?\\n- Rey is a very one dimensional character and is seemingly elite at every skill. She receives one lesson in training from Luke and suddenly has full control over her powers. (unbelievable)\\n- Poe and Finn are basically the same impulsive and frustrated character. Poe's character is diminished by the introduction of Vice Admiral Holdo (bad character). Finn's character development is totally eaten by the introduction of Rose (ok character but shouldn't have been tied to Finn's arc). As it is the fans barely know anything about Poe and Finn but their character development is just destroyed by the introduction of these new and unnecessary characters.\\n- Characters like Maz\\, Phasma\\, and Snoke are heavily underutilized and are barely in the movie at all.  \\n- There is also a series of twists in this film that attempt to be clever but are totally unnecessary. While I didn't mind the BIG twist I did think it was a missed opportunity. \\n\\nOne of my biggest problems with the new trilogy and TLJ is that there are very few Alien or Droid characters. By now the world is aware of Disney's push to make Star Wars more diverse with the casting of Rey (Female Heroine)\\, Finn (Black Hero)\\, and Rose (Asian Heroine) to appeal to audiences that were perhaps not reached before (which is totally fine). What they should understand is that the HUMAN RACE\\, regardless of ethnicity\\, is a minority in Star Wars! If you look at the Jedi Council in the prequel trilogy it is almost entirely made up of Alien characters. This idea that you have to be a human to be a major character or a Hero in Star Wars is totally wrong! \\n\\nTo sum things up I believed this new trilogy was doomed after I saw TFA. The time jump from ROTJ to TFA was just too much (30 years I believe). I would like to know WHY the empire is still at large. WHY are the Rebels STILL on the run despite having won a decisive victory on Endor in ROTJ. TLJ barely touches on how Ben Solo turned to the Dark Side but I would have liked to have seen HOW and WHY he turned to the Dark Side. Where did Snoke come from?  Instead of giving us the juicy details TFA and TLJ just skip to the finish line deeming it totally meaningless. While Rian Johnson is catching a lot of heat for this film (and rightfully so) I am willing to give him another chance with his new trilogy. I can't help but feel he was tied down by the decisions of another director in J.J. Abrams. However\\, in the end Johnson and Abrams still have much to learn about star wars (yoda pun intended). Instead of making these films up as they go and totally improvising\\, Disney should have a REAL writer write a treatment for multiple films so there are no inconsistencies. Then they should get a REAL director to bring the story to the big screen. Overall\\, The Last Jedi disappointed me as a Star Wars fan and is nothing more than a visual effects spectacle with a thin plot and thin characters.","true":true}