{"101487":194683,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well where to begin I don’t ever comment on sites for movie reviews but after such a shockingly low fan score on here I felt compelled. Now I accept people have different likes and dislikes but I’m sorry some of the reviews basically all the one star reviews seriously don’t get this movie it’s utterly awesome it is STARWARS at its best but it’s also different it is moving things how ever tentatively forward. (You can’t ever truly recreate the kid feeling you felt when seeing a new hope or empire as 13 year old (the age I was when I saw it in 1997 and you shouldn’t basically want a new hope or empire repeats either). The cast are all excellent and wow Adam driver as kylo ren is awesome ( this coming from a fan who thought his turn in TFA was a very very weak Vader wannabe) take the mask off and unleash the dark side simply brilliant and Rey wow. Without trying to make to much of a political statement holy crap who ever thought a woman should never take a lead role in star wars let alone any movie needs a serious head check she was truly kick ass. As for unanswered questions I guess that’s a personal like or dislike me personally I like to be confused to be made to think holy crap and what the hell and this movie did this in spades. The movie as a whole was beautiful funny awesome and no way to long it wasn’t bored for a second. I personally would say almost and by almost I mean a hairs breath in matching empire. I felt like a kid in a sweet shop And Princess Leia amazing beautiful one of a kind a true role model for showing women can have the minerals to kick it with the guys All I can say is hoo ra for different as it definitely definitely works May the force be with you ","true":true}