{"101487":158880,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Oh my\\, where to start with this mess.  First of all\\, I am a lifelong fan of this saga and I take my Star Wars seriously.  While the prequels weren't my favorite installments\\, compared to this travesty they are Oscar-worthy masterpieces of cinema.  I waited a long time and felt tremendous excitement for The Force Awakens and I was not disappointed.  JJ Abrams set the stage for TLJ to really take this story in a new and interesting direction and Rian Johnson squandered the groundwork laid down for him.  But worse\\, he dumped all over what made these stories so special.\\n\\nMost egregiously was Johnson's treatment of our beloved characters.  Luke deserved so much better than the crotchedy old man sucking from a walrus that Johnson made him.  His actions were not in line with who we know him to be and his death was pitiful.  Leia Poppins - laughable.  She suddenly uses the force to resurrect herself and fly through space?  Chewbacca\\, C3PO and R2D2 were used as mere props in this movie.  \\n\\nThe characters I grew to like in TFA were taken in such disappointing directions in this dumpster fire.  Rey's story and lineage really don't make sense but I did like her interactions with Ren.  Snoke -still don't know who he is and how he became so powerful and now that he died the lamest death\\, it doesn't matter.  Poe and Finn were strong characters in TFA and in this movie are just annoying and their storylines were pointless.\\n\\nThis movie had ridiculous humor and really bad new characters.  Rose\\, I'm sorry but you make me yearn for Jar Jar Binks...you are that bad.  Finn and Rose spent the better part of the movie on a crusade to badmouth capitalism.  Poe was a hothead whose situation had to be corrected by the women.  Holdo couldn't spend 1 minute explaining the plan to him?  And\\, the crux of this movie is that the Resistance was trying to outrun the First Order but was running out of gas??  SERIOUSLY?? Lame.  Did I mention\\, Rose is really\\, really bad and ruins the one scene that could have given this flick some gravitas?  She stinks.\\n\\nThe humor in this movie did not work.  The scenes that were supposed to make a Star Wars audience want to cheer were few and weak.  So many unanswered questions.  So many opportunities to make this great were pissed away.  Cheesy scenes.  Mistreated old characters.  Annoying new characters that add nothing but a checkmark in a diverse\/PC\/affirmative action\/SJW cast.  \\n\\nI know it's just a movie\\, but I've sat with this disappointment for over a week and it feels like heartburn that won't relent.  I've truly loved these movies\\, characters and story my entire life.  I've feel so strongly that this movie just torched what I've held so dear for so long.  I'll get over it\\, but I think that I may have to be content with this saga ending after episode 7.  The rest is not worthy of calling itself a Star Wars movie.  Should be struck from the SW canon and Disney and Johnson should be ashamed of themselves for creating such tripe.  I wish we could demand a redo.","true":true}