{"101487":169435,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(Spoilers) I hate how much I am bothered by this movie.  Most people touched on the major points\\, like the paceing being way off and how they treated Luke's character. The other big problems are the overall story they are building. Who are the bad guys? The first Order in two movies have nothing to make us think they could be some kind of threat to the hero's. They built a big weapon and blew up some planets\\, only to let a handful of rebels destroy it. Last Jedi they spent the whole movie trying to kill the last group of rebels. They couldn't kill them at their base\\, then let one X-wing fighter take out all the guns on their super awesome dreadnought. That was followed up with a small squad of fighters destroying said dreadnought without much trouble. Yeah the rebels lost a couple bombers and 4 or 5 fighters but that was it. \\nThen the First Order spent the rest of the movie waiting for them to run out of gas so they could catch up to them. If not for the whole code breaker side story the Rebels would have got away with their stupid plan. Well lucky for the First Order the Rebels decided to wait in an old mountain base that only had old outdated weapons. Even in those old outdated ships the First Order still could not just destroy them. They only killed a handful while the rest got away\\, and Fin almost took out their battering ram. \\nThey punch a hole into the door and NOW they can kill the Rebels. Nope\\, they're fooled again this time by a Jedi astral projection of whatever that was supposed to be.  Rey\\, again\\, used an old ship to take out a bunch of fighters and was able to save everyone. \\nOk so it's not like the Empire could kill a small band of Rebels ether. But they had villains who were interesting\\, or at least you believed they could kill everyone. Who does the First Order have?\\nSnoke: aka the macguffin. Dead\\, and killed off before you could learn if he was interesting. Yes he could come back but that would just feel cheap.\\nGeneral Hux: He's already shown he's incompetent as a leader and so far has messed up ever assignment he's had. \\nRen: I like him but he's a student with delusions of grandeur. In two movies he's killed a couple unarmed people\\, threw a few tantrums and let a girl who has never used the force beat him in combat with a weapon she had only held for the first time only a couple hours before.  He's not a leader and he's proven he can't beat the hero. \\nPhasma: No idea why she is there. In two films she was tossed into the garbage shoot and in the second lost to Fin who was such an awesome Stormtrooper they made him the janitor.  They clearly don't like her and only add her to give Fin someone to pick on. \\nSo no bad guys but what about the new character\\nRose: She is annoying at her worst and pointless at her best. Besides the whole love interest they are hinting at everything about her could have been done by Poe. Hell even a love story with Fin and Poe would have been better than have to endure more Rose. \\nI get they want to do their own thing\\, but they are just making up new rules and saying screw it to the old movies and history. Luke death was lame and feels forced just to be rid of him. In the end what do they care they'll make billions off the movie and toys\\, books and everything else branded Star Wars.","true":true}