{"101487":187267,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie would be good for kids.... And people that don't Know much about star wars. It's all comedy and a huge space war. I'd rather watch Darth maul stab quigonjin  over and over again than watch this film again.  And why does Yoda sound like a damn muppet. Actually you know what I'd rather watch the clone wars tv show than watch the last jedi again. I really wish I didn't watch this movie.  This could have been so much better.  Rogue one was better than this movie. Makes me wonder why Harrison Ford wanted to be killed off. I'd want to be killed off too if I were in that mockery you guys call a a good movie. When has a star wars movie ever had so much comedy. I love how in the beginning Luke just throws the lightsaber like he gives no fucks. And since when have force ghosts been able to interfere with actual life besides as a guide. We got Yoda the arsonist setting shit on fire like ?? fuck the Jedi text books. Honestly just let George Lucas take it back into control because Disney and Rian are botching the fuck out of star wars. Honestly if you really wanted it to be funny you would have had Adam Sandler in there as the code breaker  Instead we got pointless Toro failing as an actor. It'd be like restarting lord of the rings with a new cast and enemy but we put almost an hour of comedy into it. Like WTF did I just watch.  Honestly the only person that could pull your franchise out of the dirt is Ewan McGregor on a different timeline. Those of you who haven't seen the last jedi just imagine star wars episode ll The clone wars but they kill palpatine","true":true}