{"101487":182677,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is one of the worst movies I have ever seen!!!  This movie is horrifyingly awful!  Rian Johnson makes 'The Phantom Menace' & 'Attack of the Clones' look as though they were Academy Award winners.  Do NOT go see this movie!  If there was a way I could un-see it\\, I would do it.  I never want to see this movie again for the rest of my life.  I have enjoyed and own all the episodes\\, even the ones with Jar-Jar Binks in them.  I have watched them \\\"a million times\\\"\\, with 'The Force Awakens' being my favorite.  I am not certain why J.J. Abrams decided to skip episode 8 (yet return for episode 9???)\\, he allowed the franchise to be destroyed by Rian Johnson.  Rian Johnson should never be allowed to work in Hollywood again\\, in any shape way or form!!!  Nor should his family members!  There is nothing positive anyone could possibly take away from this atrocious movie.  There isn't any coming back from this piece of garbage.  I won't bother with Episode 9\\, there isn't any point to seeing it or any purpose for that movie being made.\\n\\nThis is the first Star Wars movie that I have rejected the premise and\/or plot.  The whole movie is one day with one ship chasing another and everyone on the resistance ship arguing about what to do.  The main characters are completely misused.  The humor is not funny and\/or inappropriate because of the scene.  Two of the jokes are millennial slang.  The new characters suck and are not needed.  There is a whole scene where Finn & a woman go off to find a code breaker that is basically useless.   ALL the characters seem pathetic in this movie.  They literally and figuratively burn down all the Jedi beliefs while taunting fans by saying they were useless and pointless and that you embarrassingly believed in them and everything Star Wars.  The Mary Poppins scene with Leia is ridiculous.  General Ackbar is killed in a pointless way.  Snoke is killed in an absurd manner for no reason and his past is never explained.  Rey's family comes from nothing and she is nothing special\\, yet can do everything a properly trained Jedi can do without any training.  Captain Phasma has a tiny\\, tiny part that is useless and dumb.  \\n\\nI am a screaming political lefty and adore Bernie Sanders\\, but the liberalism (identity politics) is rammed down your throat in this movie until you choke on it.  That is the reason for the discrepancy between the professional reviewers coupled with millennials audiences rating this movie so high and the non-millennial fans.  This is a movie made for millennials and only for millennials.   \\n\\nI could go on and on and on and on and on and on and on and on and on and on.\\n\\nIn all\\, never allow your eyes to ever witness this movie!  I truly wish I could un-see it\\, my life would be so much better-off.\\n\\nPost Script - On a side note\\, read the positive reviews from fans\\, about a third of them actually trash the movie while giving it 3-5 stars.  The true Audience Review should be around 38% if it was properly graded\\, which is still 38% points higher than it should be.","true":true}