{"101487":99415,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A fantastic addition to the Star Wars saga. I liked TFA but my main criticism of that film is that it is often too derivative of the original trilogy. My anxiety was that all the new movies would be like that. I hoped though\\, that TFA was the movie that they had to make to show fans that these are not the prequels and that a reverence will be shown for the films and characters we love as we pass the torch to a new era of Star Wars.  The Last Jedi does not disappoint.  This film takes the elements of Star Wars and mixes them with the political climate of modern times to create messages of hope for the triumph of good in the face of evil as evil is present in our lives today.  Venturing into political territory is tricky because we are perhaps as divided politically today as ever and there are fans on both sides.  When Star Wars has made a political statement (insofar as dissenters have detected it) there has always been criticism and TLJ is no exception with its divided audience score.  I am reminded of the criticism of Ewoks from Return of the Jedi\\, oft uttered by fans who were older than six years old when the films came out.  After all\\, as anyone on the internet can tell you\\, there are really ONLY three Star Wars movies and those are the unaltered original trilogy AND maybe not even Jedi because how could Ewoks defeat the Empire with just sticks and rocks?  Ewoks are a metaphor for the indigenous Vietcong successfully defending their homeland against a vastly technologically superior military force\\, a metaphor that is often overlooked by critics of that film.  The Last Jedi\\, therefore\\, continues the Star Wars tradition of using space opera to convey a message of hope that good will triumph over evil. It uses the tropes of myths and fairly tales to edify a new generation of fans and this is\\, at its essence\\, what it means to be Star Wars.  The Last Jedi is a triumph.","true":true}