{"101487":136462,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm blown away by the sheer brilliance of this movie and utterly horrified to some of the half-a-star reactions to it. They got to be the angry nerds that wanted to preserve nothing but a traditional practically religious view that admits of ZERo nuance. And I don't see this AT ALL like gesturing to the film industry nor a conspiratorial attempt with a serious political agenda.I was pleased with the CGI and costume of Yoda\\, not to mention his return. I wasn't so big on ep 7 but this one resurrected my interest in star wars. It preserved enough of the older elements and justified the new editions to the plot. I still want a good backstory for Snoke. The length of the total movie wasn't terrible. The creatures and the casino scene\\, brilliant. And the Jedi mind trick Luke pulled off\\, wtf brilliant. I loved the action sequences. The humor did have its jokes\\, but they were unjustified. Honestly\\, it was funny mostly. I loved that part when Luke wipes the dust off his shoulder sarcastically after being blasted. And the cinematography and CGI mixture was brilliant. On Rey's first practice with luke she meditates and its so visually pleasing to get a glimpse of the force expirence from a first-person point of view.. the ocean showed blocked. And the main Jedi ideology coming to an end was such a valuable lesson remnant of Buddhist overtones. Ep 2 showed us how even the Jedi couldn't keep to their Jedi principles which led anikan to the dark side.. the theme of letting go was such a way to take the story.. and there are many ways to make a movie\\, many ways to go wrong\\, and this plot direction and performance\\, I thought\\, was so optimal.. I loved it! In the words of yoda \\\"failure\\, the greatest teacher is\\\"","true":true}