{"101487":136372,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm a long time fan of star wars\\, I've always enjoyed the movies and feel like they all have their strengths and their weaknesses. (Some more than others\\, sideways glance at Ep2 Attack of the Clones) It seems many of the die hard fans are deeply disappointed in this movie. That's too bad\\, I personally I enjoyed the film very much!\\n\\nPeople don't like the callous Luke\\, is it inconsistent with the Luke we saw 35 years ago\\, sure! But I find the deaths of all his students and the loss of his sisters son to the dark side a believable reason for him to be hurting. And for those who expected an epic battle between Kylo and Luke\\, Come on! Be realistic\\, Mark Hamill is 66 years old! The only way to do that would have been weird digital shenanigans that would have come off looking fake. \\n\\nAnd to the people saying he had a bad death. I completely disagree! I think he went out like Obi Wan Kenobi but better! You want a weak sauce death\\, Obi Wan (the jedi who defeated Anakin Skywalker) takes a few jabs at Vader and dies. He claims he'll become more powerful than Darth Vader can possibly imagine. But ultimately in the rest of series he's just a ghost that offers Luke some timely advice.  On the other hand in Ep 8 Luke out smarts Kylo Ren with impressive use of the force and saves the resistance. Personally I find that very satisfying.\\n\\nAnother thing I find odd is everyone's disappointment with the lack of backstory on Snoke. I think the rampant speculation led to silly expectations. Snoke's story in my opinion was always better off being hinted at rather than explained in laborious detail.\\n\\nThe movie is absolutely stunning and beautifully executed. Does it have some weak points\\, sure. Just like all the others. But its a great film and I intend to go see it again\\, before it leaves theaters.\\n\\nLastly\\, for all the fan boys ranting for Lucas to have had more influence. I know many of you are the same people who've been whining and moaning for over a decade now about how the prequels ruined Star Wars. Bunch of hypocrites! You can't have it both ways. Face it\\, you've built up ridiculous emotions and expectations over decades that no one\\, not Disney\\, not Lucas could possibly ever reproduce for you!","true":true}