{"101487":195720,"Last Jedi":"Last Jedi","2017-12-15":"2019-06-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What have you done to Luke!! The film was a joke. I honestly thought that I was seeing things! Let me be clear\\, this character is not Luke Skywalker. Even Mark Hamill knows this character is not Luke Skywalker and he tried to tell us this until Kathleen Kennedy told him to shut up. You can clearly see Mark Hamill's sadness in the way they treated his beloved character in press conferences leading up to the film. \\nThere is so much wrong with this film from Snoke's death without knowing anything about his backstory\\, Rey's parentage being nothing\\, Luke tossing his lightsaber over the cliff\\, Captain Phasma being yet again a cameo and having no charcater development whatsoever and Leia becoming Mary Poppins in Space.\\nHowever\\, these problems take a backseat to the character of Rose who is easily the worst character in all of the star wars films (yes\\, even worse than Jar Jar). For most of the movie she is just an idealist moron who tells us that slavery is bad and saving animals is good! I could literally go on for days to pick apart what an abomination this film is but the hatred for this movie from real star wars fans speaks volumes. This will only get worse as now I am supposed to believe that The Emperor will be making a comeback in The Rise of Skywalker even though Darth Vader clearly threw him 500 feet to his death. What's next Jabba The Hut and The Rancor from Return of the Jedi coming back to life","true":true}