{"101487":183060,"Last Jedi":"Last Jedi","2017-12-15":"2019-06-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the probably the worst movie of all time. The visuals and the sound where the only good thing about this movie. The rest of the movie makes no sense and shows no real value for any of the original characters. the start of the movie only shows me that Rian Johnson has no clue how space works and no creativity. He brings WW2 inspired bombers that make no sense (as if technology has gone backwards in these movies) the Asian girl that was in the bomber further proves Rian has o idea what happens in space. \\nNext we have what happens to Leia\\, one of the most ridiculous scenes to ever exist. Leia is blown up with fellow commanders of the resistance by the only 4 starships sent by the empire (which makes no sense anyway since the empire never really gave a shit about about their soldiers). She supposedly uses the force to return to the main ship; Never having any training of the force (we know she had an aspect from Luke in ep VI). \\nWe proceed to the fuel problem that arises out of nowhere\\, making no sense and never having any previous mention of fuel problems that builds this absolute terrible movie's plot. \\nThen we have Luke\\, who they decide to completely and utterly disrespect. He does things that his character would never do. He shows to have created Kylo out of a vision: which makes no sense at all\\,  since in ep VI the whole movie was to turn his father back to being good. He created the map in the first place so if he is needed he would return which was explained in ep VII. \\nRey is just a Mary sue of a character\\, nobody can relate to her\\, she somehow defeats the most powerful jedi to exist (Luke) with no training what so ever she has no faults\\, we have no reason to care about her since she will always somehow come out on top.\\n Also the throne room scene is just terrible. Snoke (the biggest missed opportunity) dies because he wasn't paying attention which was dumb. the whole battle was so poorly choreographed and shows no visuals on how Rey escapes the ship.\\nRose was such a shit character that if u removed her the whole movie would have been better (not because she's a woman\\, just a shit character). Phazma was pointless and finally the story had way to many plot holes. \\nFinally we have Luke's death(basically inevitable) makes no sense. He creates an apparition on another planet only to die right after. what was the point? If he was going to die anyway why didn't he just go there? They have managed to ruin the best character in the whole franchise (Mark Hamill knew this and had wanted them to change it).\\nDisney has no idea how the light-sabers work especiallly when it comes to killing someone and how Anakins light-saber fucking turns on. Even the porg that was jumping on it when Luke through it knew how it worked (It's the bar code looking thing at the center not the red button). When any of the characters that where hit by any of the light-sabers only had flesh wounds with no amputations like in every star wars movie that existed before VII and VIII. The aliens where just there for decoration and had no importance at all\\, the writing was lazy\\, no care for any of the characters\\, and somehow everyone had something convenient happen when they where in a difficult situation. \\nDisney should listen to the fans rather than generalize everyone as a misogynist or a manbaby or racist or sexist. Men love lead female movies when they are done right and not full of SJW bullshit.\\nEpisode IX better be a good fucking movie and should fire Rian Johnson for how shit he made this movie and how he destroyed the star wars universe altogether.","true":true}