{"101487":117031,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"don't even know where to begin. It sucked!My franchised is ruined. I did not like it and I am mad about. I have been a HUGE Star Wars fan for as long as I can remember. As a child up until this day I have read everything I could get my hands on and watch everything I could. My house is a shine to this series and I am utterly disappointed in what I watched tonight. It was marvel in space. I get it. That formula works\\, but its getting hard for me to separate all these franchises because they are all so closely following the same pattern.  It was visually wonderful and very much true to bringing the Star Wards universe to like. But the plot was boring as hell and the dialogue even worse. The comedy was cheesy and over the top to say the least. Luke character was so unlike him\\, it was unbelievable. The struggles between him and Rey just seemed to go on and on. Apparently you can become a Jedi\\, but sitting on a rock in 3 lessons\\, done and done. Luke was clearly over trained by Yoda. And what is the deal with the milk... honestly! All Leia needs to do it point and BAM shes alive\\, what the hell. This build up of Snoke and it was over so soon. I would have loved a few more answers about who he is\\, other than just concluding that story line so quickly.  How Rian's script passed anything I don't know. HOW DID THEY JUST GIVE HIM 3 MORE MOVIES!!! I don't know. but I wont be seeing them.\\n\\nThe movie just seemed to go on and on and on. Just when I thought it was over\\, they end up on Crait. I actually forgot about this scene from the trailers. The lead up to this was so boring\\, I actually wanted the movie to be over. I can appreciate what they are trying to do and agree with many reviews that  it is great to have this revamped franchise to bring my kids to and share my love of Star Wars with them in the theater setting. But\\, honestly\\, this movie has lost me. At this point I don't care how it ends. My Star Wars is gone\\, its extremely sad","true":true}