{"101487":146470,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was apprehensive to sit down and create this review as there's just so much to address\\, but here I am nonetheless. I'm going to try and keep this as succinct as possible. \\nLet's start with the positive: \\n- The acting and shooting was done very well.\\n- The Kylo\/Rey action scene was fun and had my attention (more on this later though)\\n- I generally enjoyed the scenes with Kylo Ren and thought Adam Driver did well with him (I know\\, unpopular opinion)\\n\\nAnd now\\, the negative...\\n- The Last Jedi and TFA completely nullifies what the gang from the original trilogy did. The struggles and sacrifices they made don't matter at all. Yes yes I understand the argument that just because the Empire lost at Endor doesn't mean that they lost the war. But for heaven's sake\\, at least give the fans SOMETHING positive to see from what our original gang did.\\n-Space Zombie Leia was absolutely ABSOLUTELY idiotic. I know it's Star Wars\\, but I refuse to believe that she could reverse herself from death and fly her body back into the ship. This was just lazy and unbelievable.\\n-Admiral Ackbar was lazily and callously killed off\\, further showing how Johnson and Disney care little about the original trilogy.\\n-Finn and Rose's adventure was completely pointless.\\n- It was too political. Vegan Chewbacca and the anti-rich people message on the casino planet just felt too forced. Rose's piece on why the Casino folk were so evil just felt so out of place. Star Wars should be a fun adventure for EVERYONE. By making subtle political messages to the audience it's promoting divisiveness. \\n-Snoke was handled poorly and was completely underwhelming. Phasma was proven to be as pointless as people thought she was in TFA.\\n-Vice Admiral Holdo was completely out of place in her goofy outfit and didn't look or act like a military leader at all. Plus her keeping her plan from Poe was confusing and illogical. She should have been completely replaced by Admiral Ackbar who is a proven and respected military leader (and looks the part).\\n-Rey being a competent fighter and force user despite not having any real training at all was just lazy and also unbelievable. \\n-Luke being killed off and disappearing off into the force was just flat out disrespectful to Luke's character\\, Mark Hamill and the entirety of Star Wars. Show us how powerful he is and make him a key player in bringing down the First Order.\\n- The humor in the movie was completely out of place and made Hux out to be a bumbling fool.\\n- The chase scene was ridiculous and unbelievable. Really\\, the First Order is just going to sit there and wait all that time?\\n-Finn and Rose should have died\\, I can't believe that the AT-AT's really would have ignored them.\\n\\nI could go on and on. My overall verdict is that the film was incredibly lazy\\, unbelievable\\, disrespectful to all the previous films and was full of plot holes. As a lifelong Star Wars fan\\, this film was very demoralizing. I had high hopes that this film would be great\\, but I'm finding myself losing hope and not caring anymore.","true":true}