{"101487":105244,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a male in my 50's who became a Star Wars fan after watching the original in the theater two different times\\, and becoming more caught up in the story with each subsequent installment. I have watched all the films even the prequels numerous times. I am just sick after viewing TLJ. I was not a huge fan of TFA\\, but it laid a solid foundation for TLJ to take somewhere. My honest opinion is Rouge One is a great Star Wars film. It felt like a Star Wars film! TFA to a lesser degree and TLJ to a greater degree did not. \\n\\nThe humor in TLJ feels forced\\, and ranges from silly to annoying when well respected characters do or say things they would not normally do or say. One of the first scenes really hacked me off when a cherished important beloved item is tossed away like it was meaningless. Rouge One respected the history and the lore surrounding Star Wars. TLJ seems to be more concerned with a weird agenda that promotes female characters at the expense of making male characters look inept or like bumbling idiots. There is also a very PC agenda going on. Rich people are evil\\, animal cruelty awareness stuff\\, don't eat meat crap\\, there is no good or evil. It's all thrown in there. The plot was lame\\, but the special effects were stunning. So many burning questions about important characters were left unanswered or after their deaths never to be answered. Bottom line TLJ first and foremost fails the fans and also just flat out fails at story telling or being just a decent film.","true":true}