{"101487":165972,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Sadly\\, this was a poorly wrought film.  The visual effects and soundtrack score were breathtaking and yet political correctness and plagiarism of dialogue from previous SW films (namely Return of the Jedi) served to sour my opinion of The Last Jedi\\, even before the final credits began to roll. I went out of my way to avoid any trailers and spoilers for The Last Jedi so that I could appreciate any story arc related surprises it might hold... and still I was disappointed. The Force Awakens was bad.  The Last Jedi was actually far worse. Plot holes abound. The Last Jedi is simply lazy film-making and\\, ultimately\\, a sincere disappointment to behold.\\n\\nWe have no character development and all of the questions left unanswered in The Force Awakens are still there. Instead the movie serves as a metaphor.  One that begins and ends with the way Luke's lightsaber\\, a perpetual symbol of the more noble elements of his masculinity and past\\, is treated - from the start of the film to the end. Luke Skywalker's character was essentially rewritten entirely for this terrible film\\, to the noted objection of actor Mark Hamill. Other classic (and some newly introduced) characters were killed both onscreen and off-screen with little dramatic flair.  One major and beloved legendary background character was reduced to the role of a mere a bystander casualty. A side-quest to what can only be jokingly referred to as \\\"Planet Monaco\\\" was an unnecessary distraction to enable a \\\"Free Willy\\\" moment.  I've long been a fan of actress Laura Dern - but to see a strong-willed female character with pink\/purple hair chastise an adventuresome male war-hero for 'mansplaining' and for contributing to 'Toxic Masculinity' in a Star Wars film brought uncomfortable political correctness to a universe where it need not exist in the first place.  If any of these new characters were jerks that needed chastisement\\, it's because they were written that way to begin with. \\n\\nHaving sat in on the first screening of the original Star Wars in 1977\\, and later working on the Prequels... I've found much of my personal life is still influenced by the Star Wars universe.  We always treated the subject with a degree of reverence mixed with joy.  As did the fans and the fansclubs.  But I'm sorry to say that The Last Jedi has done what no other film has done: and that is to destroy my love of this franchise.  To take line after line from the script of another Star Wars film\\, and embed it into the script of The Last Jedi\\, was irritating\\, jarring and saddening. It was also immensely lazy.\\n\\nI fell in love with the original film 6 months before it was released back in '77... not long after the Apollo moon landings ended and just after the conclusion of the Vietnam War.  The world embraced it because it stood out like a shining gem when much of our culture was dark and stale.  The frenzy that surrounded the original Star Wars movie is like nothing that we can ever expect to witness again today - and there was a wholesome aspect to it all. To see this legacy undone and to note that other reviews are oblivious to the blandness of this new sequel is dispiriting.  The only impressive dramatic and visual sequence in The Last Jedi was a flawed plot-device that makes a mockery of the motivations evident in the previous films. The Disneyfied end-shot was clearly designed to let us know that Lucasfilm now proudly wears the Mousketeer ears.  It was sickly\\, forced and reeked of something even Uncle Walt would have avoided including\\, if he were still with us.","true":true}