{"101487":170391,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars the Last Jedi was a travesty and a colossal disappointment. What Star Wars fan goes into a Star Wars movie to simply complain about it afterward? None. Star Wars fans go to Star Wars movies hoping for the joy of seeing that universe portrayed on screen. \\n\\n\\nMy unbridled expectation and excitement for The Last Jedi was quickly replaced with confusion then horror as my childhood hero was evicerated before my eyes. In the two hours it took for this film unfold the iconic hero Luke Skywalker was dismantled and replaced with an evil doppelgänger. A man who saved his father from the clutches of pure evil\\, knowing he most likely would die in the attempt\\, was emasculated and destroyed in this movie. Luke Skywalker was crucified unceremoniously and left for dead on the cross of a cash grab movie. The plot holes and leaps the rest of the movie make are just more examples of the disgraceful direction of Rian Johnson. For the first time in my entire life I have zero desire to see any future Star Wars movies. \\n\\n\\nEpisode IX? VIII left nothing for me to care about in the next installment. I can't seem to wrap my head around how this is connected to the Skywalker Saga. Episodes 1-6 were clearly about Anakin and then Luke Skywalker. Whereas 7-8 so far have been about Rey who is a nobody. Luke goes out of his way in this movie to be left alone then dies never having left his little island. I can't see how these movies will continue his legacy further. Would he come back as a force ghost mentor to Rey? Why? She needs no training and she found her place in the galaxy just fine. She handedly beats on Kylo whenever she wants and he supposedly is a bad ass. She needs nothing from Luke so it is pointless to bring him back as a ghost. So what is there to look forward to in the Skywalker saga conclusion since all Skywalkers are dead? Nothing as far as I'm concerned so I'll have to skip it. The Skywalker saga ended with Return of the Jedi as far as I am concerned. As badly as Disney would like to destroy the OT  movies I own them already and they will never be able to take away the fundamental joy of watching them. \\n\\n\\nSolo? No thanks I would rather shoot myself in the foot than walk into a theater where Han Solo is about to be destroyed as well. Once bit twice shy babe. I'll have to wait for it to be on Netflix so I can watch at a fraction of the cost(I pay for Netflix so I can't say it's entirely free) and if it's awful at least my conscience will be clear. \\n\\n\\nNew Rian Johnson Trilogy? Why on earth would I want to see a Rian Johnson trilogy set in the Star Wars universe? What would be the point? Force ghosts in his films can destroy in the living world so no point in an antagonist if they can be killed a galaxy away by a dead person. What's the point of Holo communication? In his films you can force talk across the galaxy like it's nothing. All ships would be running out of fuel and get stranded as well as being tracked all the time. The bad guys will likely be laughable morons incapable of tying their shoes. He flipped the Star Wars universe and the Force on its head in The Last Jedi and now the entire Skywalker saga and lore of Star Wars is meaningless. No thanks! Rian will have to eat a carts worth of horse manure before I'll ever watch another Star Wars film directed and written by him.","true":true}