{"101487":127499,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Here is why I hated Star Wars: The Last Jedi.\\n\\nHere is what was wrong with the movie. \\n-The Finn\\, Rose\\, and Phasma plot was totally pointless. Cut it from the film and absolutely NOTHING changes. It was a total waste like Rain did not know what to do with any of those characters.\\n-Luke is now a comedian and as soon as you see him throw his lightsaber over his shoulder in a goofy way\\, you know it isn't going to go the way you thought. He is a comedian until the very end. When we should have seen him do something EPIC he ends up being a distracting force image only. He isn't even there or even tangible. He then becomes one with the force afterwords ensuring we will NEVER get to see Luke in action like we wanted.\\n- Snoke is killed off in a cheesy way and in turn they ruin the only interesting character from the Force Awakens.\\n-Rey's lineage is revealed and is complete letdown and not important at all.\\n-The movie goes in so many directions with no real direction.\\n-The opening sequence was great.\\n-The Rey\/Kylo connection and fight was awesome.\\n-Luke and Yoda was great.\\n-The rest was just subpar and not interesting. It was a poorly written movie. The mystery of everything from The Force Awakens was ruined in this movie.\\nThe ONLY way this film can be even remotely redeemed is if they make Snoke Darth Plagueis and he isn't really dead. \\n\\nShame on Disney and Shame on Rian Johnson for making this film.","true":true}