{"101487":192524,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Very simply\\, this was just a poor film. I'm bewildered by the 'critical acclaim' which\\, reads as though another film was watched..? I was genuinely surprised that this film made it to release. There are many faults\\, mostly due to poor writing and lack of character development \/ emotional intelligence... but mostly it just made no sense...\\n\\nIt was long\\, badly written and boring. I imagine for most people it will have killed any further interest in the franchise. I don't see how anyone could be bothered by the fate of the remaining characters that sadly (through no fault of their own) don't gel in a way that holds any interest... \\n\\nI don't understand how this has happened? The plot regarding Luke was actually quite brave and could have worked if better executed. I think the acting was good\\, but overall\\, the film just doesn't hang together... To build up Snoke and then dispatch in a way that makes no sense was the lowest point. Again it was 'brave' but there needs to be reason for the sake of the plot and instead it just amounted amateur story telling... It added nothing. The frequent references to Rey's parentage throughout both films... then discarded as irrelevant... again just poor story telling. \\n\\nIt's really surprising because Rian Johnson is very talented and it just seems that he's been pulled in too many directions and been unable to stitch the film together a coherent film in a way that generates any kind of interest or depth... I wonder if it could be saved with the deleted scenes and heavily re-sequenced (?)\\, but the film needs to be shorter\\, not longer! \\n\\nHonestly\\, it just felt tired\\, boring and lacking in magic. A real shame and a missed opportunity...","true":true}