{"101487":134335,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I just saw The Last Jedi and find myself wondering what's wrong with me because I thought it was complete garbage. I'm so depressed right now. It took a big fat shit on the Star Wars legacy. \\n\\nI would complain that they didn't use the I have a bad feeling about this line\\, but apparently they left that for us audience members as we walked out because I sure found myself saying that.\\n\\nMore seriously though\\, it's a poor story that suffers from poor dialogue with unecessary\\, bad humor Rian Johnson completely pissing away every good idea JJ introduced in VII. Snoke had potential to be a fantastic villain and\\, like with so many characters and opportunities\\, were completely wasted. About a quarter of the film took place at the site of the 1st Jedi temple and we learned absolutely nothing about them. Hell\\, we didn't even really learn why Luke thought the order should die. The entire casino planet subplot was only there to give Finn something to do. It was pointless and achieved nothing. You could literally cut that entire subplot from the film and nothing story-wise would be lost. I have lots of other complaints about plot holes and other terrible moments (Superman IV Leia)\\, but I'm trying to avoid serious spoilers.\\n\\nIt seems pretty clear to me that anything Disney puts out with the Star Wars name on it is a cash grab that's made for a newer audience. Rian Johnson took Star Wars down a path I cannot follow.","true":true}