{"101487":156657,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"No spoilers will be included in this review.\\n\\nI have seen The Last Jedi 3 times in 3 days. I went to see it at 6pm on Thursday night\\, again with friends on Friday night and AGAIN on Saturday. I have never seen a movie that made we want to post a review more than The Last Jedi. I have found the movie to be very polarizing\\, even after seeing it multiple times. I saw some things I really liked and other things I did not like. Below are my thoughts and reason for rating. A summary will be placed at the bottom.\\n\\n1. Visuals. Best looking movie hands down. Beautiful cinematography\\, VFX and lighting. The shots in this film make me want to visit these places.\\n\\n2. Sound. As usual the score by John Williams is wonderful as he seems to blend old themes and new ones together\\, very rewarding. The audio is great as well which is no surprise\\, the sound mix as I heard it in a Dolby Atmos theater was very well balanced.\\n\\n3. Acting. Every character gets a moment to shine on screen\\, new and old alike. The writing does not really offer Oscar-worthy performances\\, however the actors really do a good job of trying to sell their characters as real people in a real universe. \\n\\n4. Story. The story is very action packed yet\\, well paced throughout most of the movie. It does seem like the film drags on a bit near the final act\\,  although the story still seems connected. The story does take risks which is good\\, but does not seem to offer satisfying character development. \\n\\n5. Fun Factor. Big blockbuster movies should be fun and The Last Jedi is one wild ride. While watching the movie you will likely laugh\\, cry\\, feel angry and even hopeful. I have seen children and adults alike who enjoyed watching it\\, so there is some appeal for all age groups.\\n\\nFinal Verdict: As a movie in general I would rate The Last Jedi as a whole a 7\/10. However as a Star Wars film with years of film history behind it I feel it deserves a 5\/10. There are so many possibilities with the franchise as The Last Jedi shows us\\, unfortunately it feels as though the film pushes more boundaries for the sake of it rather than delivering a fantastic well planned out story. I enjoyed many things about the film but I found myself unable to connect on the execution.\\n\\nOther thoughts: If you consider yourself a fan of Star Wars you will likely see it regardless of what others say and make your own opinion. I did not thoroughly enjoy it the first time but on subsequent viewing I began to appreciate it more. This movie has caused me to take a closer yet unbiased look at what makes a Star Wars movie a Star Wars movie. Which says something about myself and also the movie and it's direction. One thing is for sure people will be talking about this film for a long time.","true":true}