{"101487":118705,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Even if you try to avoid it\\, it's practically impossible to overlook that this movie is telling you something loud and clear: white males = evil or stupid or both; females and people of color = heroic leaders and smart.  If this weren't so blatant\\, perhaps it would have been fine.  There should be lead positive roles for people of color and women\\, but in the Star Wars franchise\\, it shouldn't come across in a way that implies political agendas are of prime concern and that plot only fills in the fluff after the main agenda is established.  Female leads need to credible and humanized.  One of the most effective and heroic female leads was Sarah Connor in Terminator.  Her part was outstanding because it was credible and relatable. She was a total bad-a$$\\, smart heroine.  But she also comes off as vulnerable and a person who makes mistakes.  She is human. TLJ goes out of its way to further a feminist idealized world without first asking what makes a good movie.  And perhaps that would be fine if that's what Star Wars had always been.  But it wasn't ever crafted like this and turning the franchise into a sterile dialogue on feminism and race leaves one a bit confused.  Even the good guys (Poe\\, Luke and Finn) have to get smacked into shape by stronger or smarter women (Poe has to be educated and disciplined by Leia and Admiral Holdo whereas Luke\\, after initially running away\\, has to be persuaded by Rey that the right thing to do is intervene and support the Rebels' cause; Finn is a traitor who is apprehended by Rose and later saved by her).  The effect is worsened by the fact that the movie's character arcs are not fully developed (we still can't empathize much with Finn because we don't have enough of his background story established; Rey gives off a very robotic\\, impersonal air).  Then there are the stylistic mess-ups\\, including \\\"flying Leia\\\"\\, the Luke Skywalker\/milk scene (and remind me why the Sith lord's red-armored body guards decide to attack after he's been killed\\, who are they fighting for and what interest do they have?).  Overall\\, the film left much to be desired.  It's sad that we've come to this point with such an adored franchise.","true":true}