{"101487":148366,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just how bad was The Last Jedi? Well\\, that depends on which part you're talking about. They nailed the iconic opening scene where the bright yellow letters announce the title\\, scroll up and disappear. Everything after that was utter drivel. I don't use that word lightly. You would be better off watching a play written and directed by 4 year olds. You know\\, the kind that children put on for their parents to watch. At least then you could've saved your money. From the \\\"your mama\\\" joke that Poe drops on General Hux all the way to Luke force projecting himself into a battle and then dying\\, the movie was a complete face palm. How do you mess up a Star Wars?! It's a softball tossed over the middle of the plate. Heck\\, even a schmuck like myself could've written and directed a better movie. There are literally too many bad moments to mention\\, so I've decided to intentionally limit this review. Seriously\\, I could write a two thousand word treatise on how deplorable this movie really was\\, but what's the point. When I saw it in the theater I audibly said\\, \\\"You've got to be kidding me\\,\\\" several times. Jar Jar Binks has nothing on The Last Jedi\\, and I mean that sincerely. Rotten Tomatoes has a policy where they don't count  1\/2 star reviews. Because that makes sense.  No matter. Growing up\\, I was taught to be honest and if my vote doesn't count\\, so be it. My conscience is clean. Please friend\\, I beg you. Don't see The Last Jedi. Or any other new Star Wars for that matter. Let the franchise die a natural death. To prolong it's existence would just be cruel.","true":true}