{"101487":147492,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I will start with the few things that this film did right\\, it had an amazing score and the visuals were out of this world. But the sad thing about this movie is that all of it's merits end there\\, in short this movie was a hot and lazy mess\\, seemingly written by people who didn't even watch the original trilogy. \\n\\nThe characters were lazily pasted into the story and had very little motivational sense in their positions. The story was lazily written and felt like it tried to shoehorn in as many tropes as it could not doing any one enough justice to even call them average. The characters often conflict even with the lore that Disney has given\\, the lore that was put in place by the Original trilogy. They shat on the Original characters and didn't bother to develop any others\\, Po had the most development of any character in this film \\, which had a plot that felt very crammed. I would say this movie was entertaining if it didn't bother to throw me out of my suspension of disbelief every few minutes by breaking established laws of it's own universe or just plain contradicting itself. Not to mention plot holes after plot holes. In all honesty this movie felt more like Guardians of the Galaxy meets Finding Dory than Star Wars. If you are searching for anything deeper than a pretty display of colors then this is not the right film for you\\, I suggest just holding onto your money for another more worthwhile task.","true":true}