{"101487":169505,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS \\n\\nThis is only MY opinion\\, if you don't agree that is perfectly fine with me. If you like the film that is good\\, I wish I did. Please allow me to explain why I personally felt the film was disappointing. This will probably come of as nitpicking...\\n\\nI don't think this was a bad film in isolation; but it seemed to abandon many plot threads from Episode VII. In light of this I left feeling that the film was hollow.\\n\\nThere were some great individual scenes\\, characters and story beats. Snoke was very coo\\,l when he was alive. Kylo Ren's ambiguity was interesting and some of the battle scenes were fantastic; the light sabre battle with the Praetorian Guards springs to mind. But I felt the film was ultimately dissatisfying.\\n\\nThe plot seemed to go nowhere; the core of the film was driven by convenience. \\\"We can track ships through light-speed!\\\" No explanation or elaboration\\, the entire film hinges on this; this narrative device was contrived. \\\"Starships can run out of fuel!\\\" Plucked of of thin air to facilitate the plot.\\n\\nThe pacing was awful\\, the middle act of the film dragged and dragged; not to mention the events of Rose and Fin's adventure were ultimately pointless to the plot. \\n\\nThe random off-beat adventure to a casino planet seemed tone deaf.  The film lectures you on war profiteering and then becomes a crazy slapstick chase seen. The tone was unbearably inconsistent. \\n\\nLuke was portrayed as a coward. In ROTJ Luke went to the Second Death Star armed with the sliver of faith the he could turn his father; the second most evil man in the Galaxy back to good. That fragile hope is the souls of the film. In TLJ we are expected to believe Luke considered murdering his nephew and best friends son because he sensed dark side tendencies in him!? This is completely out of character and Mark Hamill has alluded to as much.\\n\\nPlot threads from TFA were completely dropped. Where were the Knights of Ren? When did Snoke finish Kylo's training as he said he would? Rei's parents were brushed off as nobodies; a realistic yet totally unsatisfying resolution. Who is Maz Kanata? where did Maz get Luke's light sabre? Where did Snoke come from? Snoke was a seemingly all power ancient Dark-side user that rose to lead the First Order; nobody will want to know where he came from. Is Kylo Ren really the main villain for Episode IX?\\n\\nLeia flying through space was jarring and didn't need to happen; It seemed forced\\, forgive the pun.\\n\\nThere was token exposition from Maz Kanata; highlighting the lazy plot progression. I touched upon earlier\\, We need to progress the plot! \\\"Go to X find Y.\\\" Inspiring...\\n\\nAnother example of the paper-thin plot is Benicio Del Toro's character. Fin and Rose just happened to be in a cell with him. He's are a hacker?! (GASP) Then he betrayed them!? (GASP) this film has so many good twists! It all seemed so empty and convenient; a facade to inject meaningless tension into a tensionless plot.\\n\\nHow did Yoda's force ghost make lighting to destroy the old tree? Could't he just have mentored Luke to give him the resolve to do it himself? Or... couldn't they have had the guts to stick in Hayden Christensen to give Luke a pep talk; given the dynamic between Kylo and Luke\\, this would have been far more apt.\\n\\nThe new character Rose gets more character development than Snoke! Rey has no character development because she is perfect. \\n\\nLuke's reunion with Leia was turned into a joke; case in point: \\\"I changed my hair.\\\" (Audience Laugh) Remember this is in the context of their first meeting in years; not to mention the fact that Luke's nephew\/former pupil and Leia's son is attempting to murder them both.\\n\\nLuke's death was hollow; he could have at least showed up in person. Luke's sacrifice is boiled down to a trick. Snoke's death wasn't any better; killed by a trick without the finale we wanted. Both deaths were interesting in their own way; however\\, each felt underwhelming in comparison to the mythic story telling Star Wars is known for. I'm okay with the masters being killed off\\, but they went out with a fizzle\\, not a bang...\\n\\nRian Johnson did a good job of subverting our expectations; however\\, I would have preferred some predictable catharsis\\, as opposed to surprise disappointment. \\n\\nThere was a strong theme of learning from failure in the film; in the film Yoda says\\, \\\"failure is our greatest teacher.\\\" I do hope that Lucas Film can learn from this films failure to provide satisfaction in future. To clarify\\, I don't think the film will fail financially; doubtless it will make billions.\\n\\nI realise I just wrote an essay on a film i'm not that fond of. This is a reflection of my passion for the series\\, and my desire for the next film to be better. When I view the third film I may completely re-evaluate this instalment. Fingers crossed.\\n\\nI would be very interested to hear if other people agree\/disagree with any of these points.","true":true}