{"101487":174689,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The goods: \\nSome amazing interaction between the protagonists; both in dialogue and visual mediums.\\nA nice story that leaves a good amount of meat on the bone for ep9.\\nSome really beautiful nods to the original trilogy that were more subtle and less hammy than TFA.\\nSome really good acting.\\nMusic\\, as always\\, was phenominal.\\n\\nThe bads:\\nIt's not fair to say that the middle drags on because it kinda drags from the very start. Only the last third is decent paced.\\nSome of the acting is horrific. Hux is almost pantomime in its deliberate \\\"i'm a bad English guy\\\" manner but many of the supporting characters in The Resistance were wooden\\, boring or lacking in substance. \\nThe plot holes are again too wide to ignore.\\nA load of bad comedy.........again.\\nWe're back in a world where all the main characters are able to do everything amazingly well.\\nLots and lots of smaller gripes!\\n\\nOverall:\\n\\nNot a bad film by any stretch of the imagination. As with all the newer movies\\, it has failed to deliver the Star Wars experience (I kept thinking of S1E1 Battlestar Galactica) and is instead an action movie set in the Star Wars universe. \\n\\nDaisy Ridley and Adam Driver are both really good to watch\\, their dynamic is interesting and filled with tension. Oscar Isaac's character is re-worked so a large amount of the film is dedicated to justifying his new persona. Once those new characteristics are set then we start to see the reasons for them but they are not worth the overhaul yet (they changes and life lessons he learns may allow for larger character development in ep9). John Boyega's part doesn't do much for me. I felt he was much improved as an actor when compared to his performance in TFA (not that it was bad at all) but I wasn't that bothered about the storyline. Mark Hamill and Carrie Fisher greatly added to the film\\, especially Hamill who delivered some extremely challenging lines with believability where others may have hammed them up.\\n\\nScoring:\\nBetter than my initial reaction to TFA (I gave TFA 4\/10 with an increase to 5.5\/10 after a couple of viewings). I give this 6\/10 but doubt it will rise overly in the future. I very much expect the scoring on here to go down significantly as\\, while I did like it\\, to rate it as highly as Empire is an insult to both TLJ and ESB (and in my opinion Rogue 1\\, A New Hope and Return of the Jedi).","true":true}