{"101487":171871,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Terrible. I don't think of myself as a super-fan or a geek but I've loved all the previous starwars. I felt let down by TFA. But with this film I felt empty leaving the theater and after an evening of discussing it with my brothers we all found a profound sense of frustration and anger. \\nWhat could have been an incredible and epic movie was stifled\\, muted\\, and disjointed. They took the single greatest distinguishing handful of aces that the Star Wars universe possesses and left it unused: The Force(The struggle between selfless justice and selfish injustice IE:Jedi and Sith) This should always be the center plot point for a Starwars main episode. The reason StarWars is so much better than many other Sci Fi creations is due directly to the epic struggle to keep justice using the force(JEDI) while others seek to use this force for their own personal acquisition of power(Sith) Star wars needs to have a pure\\, powerful\\, evil villain to be at it's best. I believe if Kylo had Killed Hux it would make him much more menacing and powerful\\, I hated him after TFA but now he's the most likable character for me. These movies should be exploring the Jedi and the Sith more in depth and with much better Sith\/Jedi character development. Just to give you a taste of my own feelings on star wars: I do think the originals are the best. I loved most things involving vader\\, the vader-luke-emperor scenes in TROTJ(also almost all the original characters had great depth)\\, Loved the duels at the end of revenge of the sith were(yoda and palpatine with the lightning hands and Anakin vs Kenobi)\\, I loved the darth maul mystique and his duel with Qui gon jinn and Kenobi. However these recent movies made Anakin and Padme's performances actually seem decent comparably. I LOVE the Starwars universe and when I heard they were making more I hoped for movies more along the lines of the Knights of the Old Republic cinematics and storylines. That's perhaps hoping for too much. But this utterly horrible movie destroyed ALL gravity and emotion I had tied into Starwars. I can't consider this canon and don't know If I can even watch any more down this storyline. I have always loved all the Starwars for the universe in which it existed\\, I could even Ignore Jar-Jar as a one off and appreciate the good parts of the phantom menace. But this this is a horrible array of flat characters and dead end storylines that make me want to see everyone die except Kylo and possibly Rey.   \\nAlso: Lando was Amazing one of my favorite characters\\, on the flipside: I've wanted Finn to Die since he risked everyones life like a selfish immature idiot in TFA.  I've loved Leah and Also Rey so far but the Holdo was just a horrific leader. Were they supposed to wait and follow her order to do nothing as everyone and everything they loved and gave everything for was destroyed? Obviously you can't follow ANYONE blindly\\, so their duty to their cause demanded action and recourse\\,(obviously use the light speed trick with your other ships or at least once you're the last one on the ship\\, An Admiral of her caliber would be thinking way ahead.) I hate most of the new characters and I hate the lack of exploration of the Jedi and Sith arts\\, they aren't some hokey religion they are real disciplines with secrets and nuance and Millenia of history Dark and Bright. Instead Rey picks it up overnight. Also the old Jedi texts are just a couple of books. uugh. Last note: Yeah lets free the animals(fine) but leave the slave children who will be beaten or killed for letting them go. (WHAAAAAAT??!!!) \\nI could literally go on for hours and have already. It's just that the Starwars Universe has practically unlimited potential and in a couple of movies(especially the latter) it seems to have been smashed and shoved into a money making heartless adventure-less characterless cookie cutter. I've always loved Starwars and this is utterly lazy\\, terrible and clearly written by people who do not care for it as so many do. \\nObviously these are just movies\\, but they're some of my very favorite and most dearly beloved and I feel as if they've been defiled. Someone who doesn't know the story or care about it is telling it and it's all so wrong. Truly truly frustrating.","true":true}