{"101487":169449,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*SPOILERS* I've always heard about people being upset about a director \\\"ruining a childhood hero\\\" but never really experienced it until The Last Jedi.  Aside from a few good action sequences this movie was abysmal.  Luke Skywalker went from the quintessential hero to a fear driven hermit with no confidence.  His backstory with Ben Solo made it even worse.  Luke went from the man who never waivered in his belief that Vader could be redeemed to believing Ben Solo was a lost cause before he was even turned.  The big mysteries everyone was excited about since VII?  \\\"Who is Snoke?\\\" \\\"Who were Rey's parents?\\\" turned out to be \\\"Who cares?\\\" and \\\"Nobody.\\\"  Where J.J.'s movie turned out to be a unimaginative but well-made fond rememberance\\, Rian's movie was a poorly made perversion of Luke Skywalker's character.  I know Mark Hamill walked back his reservations but I'm inclined to think he was told to.  Possibly the most frustrating thing about this new trilogy is how empty and hollow the victory in Return of the Jedi was.  The Rebel Alliance went from a real resistance with resources and massive victories to a small and now destroyed fleet reduced to a pack of survivors crammed into the Falcon.  I've said in the past that Ren is a kind of sad sack replacement for Vader but he's apparently far more successful at stamping out resistance forces.  The professional critics must've seen \\\"Star Wars\\\" in the title and gave this a pass but I've seen better movies with a rotten score than this 91% and judging from the audience reception I'm not alone.","true":true}