{"101487":134272,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I just don't understand... no really. Can you tell me the plot of this movie? I'll wait for you to try to explain to me but in the mean time I'll tell you that this movie sucks. So before I rant get to know me. I loved Star Wars and even in elementary i would talk about Star Wars. I have all the games and I dressed like earth Vader all through my childhood. So I love Star Wars with a passion. This movie destroyed my childhood. In the movie they explain things no one cares about and the real story they give you half a** answers like an example is snoke; who is he and where did he come from?\\nNo we will just kill him and tell you in the books. What's kylo's motivation to do the things he does? Why does Luke die\\, Because he used the force? Is there a f***ing limit on the force now? They literally introduced a planet that was poorly added to the story and they will probably never use that planet. I think I'm the movie if they used commonsense\\, it would have been a 30 minute movie. They also ruined Luke (before he died in a stupid way) like an example would be when Rey walked up to him with his dads lightsaber. Like Luke would want to know where she got that and would ask questions. Nope he just throws the only thing of his father and half his life out for a quick laugh (it wasn't even funny) I would keep going but I think you get the point. Don't expect too see a Star Wars movie. Expect too see eye candy and a bad plot. Also I've seen it twice and it gets worse so my rating will be 3\/10 just because the action that's it","true":true}