{"101487":193264,"Last Jedi":"Last Jedi","2017-12-15":"2018-10-13","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Warning: This review doesn't contain any spoilers per se\\, but it does mention stuff you specifically won't find in the movie.\\n\\nI know this film is very controversial. There are choices I feel were misguided. But at the end of the day\\, I just came to be entertained and the film was very good at that.\\n\\nIt looks great with some visually arresting shots and sets. Snoke's throne room and the salt planet are especially eye-catching. Action is very impressive\\, including one of the best fight sequences in Star Wars.\\n\\nThe cast is all likable. Especially liked the new character of Rose whose determinism contrasts well with the reluctant Finn. Dialogue is good.\\n\\nOne of the strongest aspects of this film is that director Rian Johnson manages to defy expectations about what will happen. On the other hand\\, he seems so intent to go his own direction that he fumbles a little with carrying on the plot. He seems almost resistant to continue what JJ Abrahams set up in the last film. You still don't learn Supreme Leader Snoke's origins. Not even a single line of dialogue. (Though I'm not entirely hating the character even if he is a clone of Emperor Palpatine. He's got a bit of style and drive to him.) The Knights of Ren are barely mentioned. Supposedly the First Order has several force-using fighters\\, so where are they? Phasma was set up in the first film to be a big villain\\, but she is barely in this. Unlike some people\\, I don't mind the casino planet and the Resistance infighting. (Though I do agree that the reasoning of the rebel upper command could have been better reasoned.) Still\\, I think those subplots could have been easily shortened.\\n\\nI get that a lot of fans may feel betrayed\\, but I found this to be a stylish sci-fi action film.","true":true}