{"101487":146030,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've seen all the star wars movies\\, I'm 23 years old\\, as a kid I only saw the brand new trilogy. \\n\\nI never wanted to watch a new hope\\, empire and ROTJ\\, Then the day came 2005 it was the last star wars movie I watched the the old trilogy and i was blown away that feeling was truly amazing. \\n\\nI loved the force awakens and rogue one!!\\n\\nNow when I saw the last Jedi I went in expecting it to be like empire\\, it's not a bad thing.\\n\\nI would of still enjoyed it. What rian Johnson plus cast and crew have created here is a masterpiece I've never been on the edge of my seat wondering what's going to happen in the next moment. \\n\\nMark Hamil was brilliant in his role he should be nominated for an Oscar I'm not even kidding it was Oscar worthy. the way he acted is unlike any actor I've ever seen. it must of been years in the making for him to get prepared for such an amazing role.\\n\\ndaisy Ridly and Adam drive truly delivered brillant roles with such emotions you wouldn't think it was possible. \\n\\nCarrie Fisher role in the movie was quite something I'm not just saying this because of her passing\\, she was excellent I hope episode 9 will have some sort of input from her. \\n\\nThe last Jedi is the best star wars to date.\\n\\nI can't understand how life long fans can say this film was bad\\, surly you would want a brand new story and not the same story over and over again.\\n\\nAs a fan I'm very excited for episode 9 and rian Johnson trilogy as he offeres brillant ideas and stories to the star wars universe.","true":true}