{"101487":193051,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Visually there were some great moments but I was dead silent when I left the screening......stunned I think.\\n\\n\\nBad:\\nLuke!!!!!?\\nThe story about how Maz got Lukes sabre was ignored.\\nWhere are the Knights of Ren?\\nSnoke is nobody\\nRey's parents are nobody\\nFin was wasted in this movie\\nRose sucked\\nCode breaker search thread was stupid\\nPoe prank call was dumb\\nForce sensitive street urchin at the end was stupid\\nCaptain Phasma is dead again?\\nBB-9A had almost no screen time\\nMany of the beats in Return of the Jedi were mirrored in the Snoke\\, Kylo and Snoke scene\\, Look at your friends getting killed through my little round window and blah.\\n\\nThere was so clearly a political agenda being pushed throughout with the back and forth of do we or don't we accept sacrifice as an option and lets get as many \\nleft wing inclusionist boxes ticked and to hell with any real character development.\\nThis was not a good sequel  as it ignores and calls a halt on all that came before it and offers up no hope for the future of the franchise let alone the next movie.  \\nI believe that it should have been written all as one big story that could be broken into three movies that still contained their own satisfying conclusions while offering cliff-hangers for the next.  \\nThese movies are clearly changing direction with each director\/state of the political landscape in the USA\/Hollywood and it shows.\\n\\nGood:\\nKylo\/Rey battle is wicked cool\\nSuicide ramming was amazingly cool\\nCrystal foxes were cool\\nCool to see Turbo-lasers vs shields finally\\nFinally an A-wing yay!\\nLuke Kylo fight looked great\\nPoe character arch was cool\\nPhasma armour deflecting laser blast\\nPhasma laying down fire with blaster pistol\\nYoda was cool old Muppet Yoda\\n  \\nSo all apart from Poe all of the stuff I liked was purely visual which is not a good thing for any movie these days.","true":true}