{"101487":175333,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is beautifully shot and mostly well written. There are no weak performances\\, but there are some weaker characters and plot points. It offers some of the most amazing cinematography of the whole series and it's fair share of unforgettable moments\\, not just for Star Wars but for any film. There are some pacing and tone issues and Johnson's lack of much experience in this territory does show to a degree but its charms are too numerous to be utterly overshadowed including great performances from the title cast most notably to me being Adam Driver and Mark Hamill. The new cast additions are portrayed as well as can be but seem somewhat bland for my taste in Star Wars characters as well as socio-political commentary that is anything but subtle. No one knew what to expect and while it's impossible to please everyone there are many moments where it will do just that. I did not get everything I wanted out of this film and was honestly somewhat disappointed with the characterization of Luke Skywalker in particular but was simultaneously amazed at his portrayal from an actor who has not done much live work in film in a long time. That said I got plenty to be pleased by and more than enough to make up for the short comings. While it does get a little bogged down in the middle it finds it's rhythm again and quickly gets you on the edge of your seat for a phenomenal climax. I would recommend this to those who love good scifi\\, good character driven films\\, visually pleasing films and of course Star Wars.","true":true}