{"101487":98181,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Absolutely horrible movie and a waste of my time. Not even going to watch episode 9. I was never crazy about 7\\, but damn it looks like Citizen Kane compared to this crap heap.\\n\\n- Annoying \\\"humor\\\"\\n- Pointless subplot with Finn and Rose (wastes about half the movie)\\n- When Finn finally does get his cool moment to fight captain Phasma it lasts 0.05 seconds. After so much disappointment I was actually looking forward to that part\\, but they managed to screw that up.\\n- Finn finally does get to do something useful when he tries to sacrafice himself for the team\\, but then Rose screws it up and says something stupid along the lines of \\\"we need to defeat them with love not hate\\\". Shortly after like 50 of their friends are killed by what Finn was trying to stop.\\n- Luke and Lea have aged like crap. Feel bad that Carrie Fischer died but damn she was straight up elderly in this movie. Han was the wrong one to kill in 7.\\n- Overtly SJW. I don't have a problem with diversity in films\\, but when every scene is peppered with the perfect assortment of every type of people the agenda gets a little annoying staring you in the face. Rarely are there burger king kids clubs in real life\\, doing this to such a high degree just makes every scene feel artificial like you're watching a handpicked assortment of actors rather than a rebel fleet.\\n- The Villains are laughably awful. Snoke dies before he gets a chance to even stand up\\, Kylo is still a whiny emo child\\, and Hux is a hopeless punching bag. They're just not scary.\\n\\nThis movie is so bad\\, I created a rotten tomatoes account just to write this review.","true":true}