{"101487":194648,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well this is my very first review for this site. And I just got to say that TLJ\\, SUCKED! It sucked out loud!\\n\\nBut it really irritates me that this audience score doesn't really seem to want to budge. I doubt my review will make any difference here. But I will at least try. Now this is the SW film that really killed any and all enthusiasm I had for this great series. But to be fair\\, TFA was really the start. What is the point of all these new Disney Wars films? To remind us of the OT? Well if I want to be \\\"reminded\\\" of the OT\\, I will watch the OT. All these new ones are doing is taking plot points and dialogue from the OT and just putting a new coat of paint on them. I mean it isn't like in 9 the rebels won't beat the FO. Or that they won't restore the Republic(again). Or that Kylo Ren will turn to the light side and MaRey Sue will go and restore the Jedi order(again).None of this will happen...\/S\\n\\n\\nBut my biggest gripe is with how they treat the force in these movies. In TFA when Kylo Ren told Snoke that she was untrained\\, and then seen her use the force after that? It was pretty much game over time for me. They turned MaRey Sue into the new Tinkerbell. She will just fly around and sprinkle magic force pixie dust on everyone will be Jedi masters. No training required. This is all made for the \\\"Veruca Salt\\\" generation. The\\, \\\"I WANT IT NOW!\\\" generation. Instant knowledge\\, training\\, skills\\, etc. No training or hardship required. \\n\\n\\nSo basically when they do try something \\\"new\\\" or \\\"bold\\\"\\, this is what we get? When they aren't recreating the OT\\, they will just make the force where anyone is capable of manipulating it without training and effort. Like broom boy for instance. He just goes and force pulls a broom to him like no big deal. I am very sure he got loads of training in a stable after picking up space horse dung all day...\/S\\n\\n\\nThen in comes Johnson to try to solve MaRey Sue's issues by making her the balance of light to Kylo's dark. So they both get equally stronger. Except that it was Kylo that trained and earned all those skills! While MaRey Sue just gets all the skills without training and earning them. So I really don't see why they should both get EQUALLY stronger when one deserves it while the other does not. \\n\\n\\nNow on to poor Luke. He wasn't really happy with this new trilogy from the start. I know he came out and took back what he said\\, but the fact that he thought his character should be called\\, \\\"Jake Skywalker\\\" tells it all. No amount of apologies can ever take that away. He was right with his initial assessment. He should have stuck to his words the first time. But they made him hellbent on wanting to destroy the Jedi way. The \\\"real\\\" Luke would have never done this. He was hellbent on bringing them back in the OT. I am aware Tinker Sue took the Jedi texts. But Yoda says\\, \\\"page turner's they were not!\\\" Really? So all that knowledge and wisdom within those texts\\, bores you master Yoda? They even turned Yoda into an idiot. I guess he was preaching to the idiots that love this trash. Books of knowledge are lame and boring. \\n\\n\\nTraining? Discipline? Knowledge? A Jedi craves not these things! In the Disney era this is absolutely true. What is the point of having a special power or ability if one doesn't even know what to do with it? Or they can use it just by snapping their finger without the training and understanding that comes with it? If you look at MaRey Sue's \\\"arc\\\"\\, what has she overcome? What has she learned about the force? Other than she can use it? So will the future of SW just be a bunch of people that use the force with no training or knowledge? \\n\\nImagine in this new \\\"trilogy\\\" that everyone is using the force just because they all simply believe in it. Never being trained. Never having to overcome obstacles to reach that higher point. That would really make the force special\\, wouldn't it? \/S\\n\\n\\nBut this is all made for the lowest common denominator now. That is pretty clear. My interest in SW died in 2015. Before that it was such a happy and great feeling when a new SW movie came out. Now instead of a feeling of joy\\, it is only a feeling of morbid curiosity that I can look at a new SW film.\\n\\n\\nAnd if they were to take Kylo Ren and Hux and replaced them with Napoleon Dynamite and Pedro\\, would anyone even be able to tell the difference? I know I wouldn't see it. There is virtually no difference there.\\n\\n\\nLet's talk about Snoke shall we? One thing I find extremely hilarious is that when MaRey Sue beat Kylo Ren in TFA\\, all the \\\"Reytards\\\" were jumping in defense of this saying that\\,\\n\\n\\\"Kylo lost because he isn't the main villain! Snoke is the main villain!\\\" \\n\\nBut fast forward to TLJ and now Snoke is dead. But NOW the \\\"Reytards\\\" are saying\\, \\n\\n\\\"Well who cares who Snoke was? He wasn't even the main villain! Kylo Ren is was the main villain!\\\" \\n\\nSee? This is what I mean. Because I had to hear for 2 years prior about how Snoke was the main villain and Kylo lost to her in TFA because he was not the main villain. These defenders can't keep their BS story straight here. Because now with Snoke being dead\\, they are all saying\\,\\n\\n\\\"Who cares? He was just a nobody anyway!\\\" \\n\\nSo \\\"Reytards\\\"\\, cognitive dissonance much? \\n\\nReytard= MaRey Sue defenders\\n\\n\\nAnd to Rotten Tomatoes\\, Really? How is this trash still holding at 48%? I will admit that I am not sure how this system of scoring works\\, but after reading all the negative reviews with 1 star\\, this score should most likely be lower. Are you guys really that compromised? Please adjust this score accordingly. Your reputation is at stake here. If the audience score is much lower\\, then put the correct score up. This is really making you look bad. Have conviction behind your scoring system. At least you will be doing the right thing. And the right thing is what matters. Because this makes you seem like you are purposefully hiding the real lower score. Don't deceive your members by propping up an inflated score.\\n\\n\\nOh and here is just an FYI to all the douche bags whining about \\\"why\\\" others don't like this film\\,\\n\\nRead the 1\/2-1 star reviews and that will answer your questions! THERE ARE OVER A THOUSAND WELL WRITTEN CRITICISMS OF WHY SOME FOLKS DESPISE THE FILM. If anyone has to ask \\\"why\\\" others don't like it\\, while being able to see plenty of reviews stating the very reasons? Then it really goes to show \\\"why\\\" you morons like this trash! So now I just answered all of those\\, \\\"why don't people like this film?\\\" questions.\\n\\nAnd we have poor old R2 :( He is now basically relegated to the Falcon's lounge as the  trash can. Chewie is basically MaRey Sue's lap dog. He doesn't even feel like a co pilot anymore. He is her pet now. And 3PO. Who only exists to be pushed around and ridiculed. It would be great if someone would put all these old school characters out of their misery before this trilogy is over. Because they have to tear down the origianl characters to prop up these hollow\\, one-dimensional cardboard cut outs. The only new actor that will have a career post-ST is Oscar Issac. Ridely and Boyega? They better start thinking of new fields to get into. Because after SW\\, you won't be getting too many phone calls for gigs.\\n\\nThis film is also made for the libtard mangina's that wear pussy hats while whining for a safe space! Hey you TLJ lovers\\, I want to clue you in on something\\, there are only 2 genders! I know you libtards think there are more than that and you get confused when you have to choose which bathroom to use. So I know why you love TLJ. You are just confused. Libtards are known for being sexually confused. So I know that they would also be confused when it comes to entertainment. My suggestion would be to not wear your pussy hats too tight so that you can see how hollow and void of logic TLJ really is. \\n\\nBots! Bots!Bots! Russia! Russia! Russia Alt-Right! Alt-Right! Alt-Right! \\nYeah keep crying Pajama boys! Go soak your head in some soy.","true":true}