{"101487":125738,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Great movie\\, lots of great character interactions. Really interested to see where this goes in the future. Spoilers below:\\n\\n\\n\\nThe force wielders definitely stole the show. First of all Luke being a sort of washed up old hermit while expected was still kind of shocking to see. He has so utterly given up on the jedi that he every wants to destroy their last remnants. Him sort of turning to the dark side somewhat in terms of his interactions with a young Ben Solo were surprising. Kylo Rens struggle with his place in the first order certainly leads to some interesting scenes to say the least. He ends up hitting it off with Rey rather well because they share a lot of similar feelings and experiences. Both abandoned by their parents in different ways\\, feeling lost in terms of their place in the world creates this great connection between them then ultimately results in one of my favorite fight scenes in Star Wars. Their relationship going forward will certainly be filled with angst\\, drama\\, and possibly even romance. \\n\\nThe answers given may not be what fans wanted or expected however. I personally liked the explanation of Rey's parents(not everyone needs to be connected to the other movies)\\, but I bet that will leave some people as disappointed as the character herself. Snoke is given very little time or character. Seemingly less than the Emperor. Rey doesn't actually learn much from Luke after all and I expect people to continue to call her a Mary Sue\\, despite the fact that she does indeed have flaws( stubbornness\\, anger\\, implusivensss\\, etc.) and that she may be so good with the force due to the force bond she has with a trained force user.\\n\\nFinn and Rose's and Poe and Holdo's story while good\\, maybe had a few scenes that felt more unnecessary or that could have been used more effectively. Finn and Rose did make a difference in the story( I see people saying they didn't\\, but just think about how it ended) Rose is a great new character. She has great resolve and no hesitation when it comes to her beliefs. Holdo and Poe were interesting too\\, but felt weaker in conparsion to the rest of the plot. They do a good job in making you feel the plight and desperation of the resistance here. They suffer a crushing defeat at the end\\, sure with hope alive\\, but it makes a sharp contrast to the Enpire Strikes Back where the crushing defeat was in the beginning\\, but the rebellion wasn't quite so desperate or destroyed at the end.\\n\\nOverall the flow was a bit awkward at times jumping around so many characters. It feels as if some large pieces of the story may have been cut for time. However I really enjoyed this film overall and hope that the story gets a strong conclusion. There is a lot to wrap up: the war between the first order and the resistance\\, where the force users place in the galaxy belongs( I'm thinking grey Jedi order)\\, the individual characters and their resolution in this conflict.  I will be seeing this movie again for future analysis.","true":true}