{"101487":146112,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've stewed on The Last Jedi for a day now. I can say with every confidence that this is my least favorite Star Wars film. If you were hoping for continued development of these new characters or unveiling more of the mysteries that were introduced to you in the previous film\\, prepare to be sorely disappointed. A legitimate criticism of The Force Awakens was that it rehashed some old ideas. While this is totally true\\, it left you wondering\\, speculating\\, and excited about the future. This movie leaves you with none of that. It all feels empty in the end and I'm not very eager for more. It's like this writer\/director team hated everything about the first film and used this one to unburden themselves. They just threw so much away. Its not all bad. There are a few good scenes and concepts. All performances were handled well given the material. It just doesn't really mean much in the end. A huge portion of this films time is wasted on a quickly concocted setup for a future romantic interest for one of the main characters. This subplot\\, that only exists given a glaring plot hole\\, is confused and hamfisted with antiwar\\, environmental\\, and animal cruelty messages. Anyone of these themes\\, if done right and properly intertwined into the writing and plot\\, would have been fine. That sadly isn't the case. The only real theme thats touched on with any consistency is the follies of overconfident leadership and heroism. Came off as desperate \\n to me. Hopefully JJ can pull up from this and pickup the pieces on the conclusion because there really isn't much left to work with or time left to grow anything new out of it. I can't really think of anything to look forward to at this moment. I have seen every Star Wars Theatrical release in my life time multiple times. I seriously doubt I will even watch this film again until the next episode nears release. Pretty bummed actually.","true":true}