{"101487":139295,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really wanted to leave a 1\\,000+ page review that really means a 5\\,000 word review on The Last Jedi but I will not.  Every bad line of dialog\\, plot hole and bone headed mess of a story has already been highlighted by the viewers.  \\n\\nI left the viewing Thursday night disappointed\\, angry\\, and confused.  The critics had again mislead me.  I thought yes!!  The Last Jedi is going to be an excellent film\\, but from the first prank call scene on\\, I knew I was witnessing something unnaturally bad.  The film is an absolute mess.  Rian Johnson really demonstrates more than anything else that he is completely tone deaf when it come to Star Wars.  Like I said\\, so many fans have ripped the obvious.\\n\\nI will rip the not so obvious.  As Bryan is a USC film grad he would have been \\\"educated\\\" in film and more specifically what makes a masterpiece a masterpiece\\, and how you can be gud director!  George Lucas stated that a great influence in his original trilogy was the Japanese master Akira Kurosawa.  Great\\, except we had little Rain\/Ryan\/Brain\/Rain or whatever his name is ripping Rashohmon.  The three different visions of why Kylo turned to the dark side is a blatant rip from what is considered to be Kurosawa's absolute masterpiece.  But wait Ray laser sword beam (who really cares) is ever powerful and can read minds...great job little Rian!  You are a gud movie maker.  I really hope you never make a movie again you brain dead hack!\\n\\nI think the real reason I am so disappointed is that I know that Star Wars as an entertaining somewhat cohent franchise is dead.  As they say though\\, all good things.  At least I am in the golden age of television and for that i am grateful. RIP Star Wars and RIP Cinema!  \\n\\nGood luck JJ!!!!!!  Spoiler alert...you have no idea how to end this thing! #everymovieorseriesyouhaveevertriedtoend\\n\\nI want to make this very clear...I will never being seeing another Star Wars movie in theaters again.\\n\\nBut hey we are all bots so............................................................","true":true}