{"101487":145856,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've been reading the reviews here every day for over a week. I first want to make a comment about some of the accusations I've heard that the negative reviews are bots. This is so clearly not the case. All the negative reviews of this movie are clearly unique and typically fairly long and passionate and look very real to me. But a large number of the positive reviews are one line\\, generic and seem very bought and paid for. \\nWhat makes more sense; a multi billion dollar company like Disney hiring people to write good reviews for a movie they have 100s of millions of dollars invested in? Or regular movie goers? Fake positive reviews are very common on Amazon... why not for Disney? Also\\, something has to explain the 91% positive critic reviews. \\n\\nAs far as my review on the film. Everybody has a different take opinion of a film. We have all walked out of a film with a friend and had the totally opposite opinion of the film. Granted. But with the last Jedi there is just so much more going on than... \\\"It was just bad\\\" \\n1. The Social Warrior Justice political stance it clearly has (Chewy is a vegan now? Give me a break)\\n2. The anti-white stance (the resistance - good guys -  is highly diverse while the New Order - bad guys - is 100% white. Same was true of The Force Awakens and Rogue one (films I liked beyond this issue by the way)\\n3) Feminist Stance\/anti-male stance (Google the photo of Kathleen Kennedy wearing a T - Shirt that reads \\\"THE FORCE IS FEMALE - - the head of Lucasfilm\\n4. Then there is just the fact the script is bad. As stated a million times by others. 2.5 hour movie with the casino sub plot that is has no bearing on the story - only to advance the SJW stance.\\n5. Destroying Luke's legacy by making him a loser.\\n6. Destroying the parameters of what has been established over the last 40 years regarding the powers of the force. \\n7. The fact that the movie is a 2.5 hour TV commercial to sell toys and products. \\n\\nWhat makes me the most sad is the fact that the legacy of the original trilogy has been forever damaged. To paraphrase Rian Johnson \\\"The Star Wars Movies need to die\\\" \\n\\nPlease stop making them. I love Star Wars too much to see what Kathleen Kennedy and Disney are doing to them.","true":true}