{"101487":131836,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I feel the hate this movie has gotten from fans are from the hardcore fans that disapprove of change. Incidentally\\, these same fans are probably the ones that complained about Force Awakens having a lack of change. Ergo\\, you really can't please fans. \\nI personally see this as one of the best entries in Star Wars. I embrace the change to the status quo and the attempt to break the rules of Star Wars to enable a new order and a new line of characters to run with the story. I agree with Luke that it is time for the Jedi to end and this film does a spectacular job building up to the supposed end of the Jedi. Every character has some great on-screen moments. There's a scene I enjoy in regards to Leia\\, though it does feel like a bit of an ass-pull. The internal conflict within Kylo Ren makes up for his one-dimensional nature in the previous film. The good guys not all being on the same page to a point of conflict is actually cool to see. The bad guys\\, nearing the end\\, butting heads as they do makes me think there will be more conflict like that in the following film. \\n\\nOverall\\, this film does a lot to change this from your generic Star Wars to something on the level of Empire Strikes back\\, and I may personally like this better. I'm giving this a 5 because it is ludicrous for the audience score to  be 55% when this film is among the best of the year and one of the best Star Wars flicks to date. Haters need to step back and ask why they disapprove of the changes being made and if that is something really worth getting upset about.","true":true}