{"101487":181140,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film is terrible. As a film. As Star Wars\\, it's surprisingly bad as well. I don't know if I'm more shocked that it's just a bad film over all or a bad Star Wars film. The \\\"Critic\\\" consensus of this film is absolutely mind boggling. After seeing it myself and then check out critic review since the film left me so jarred; I could not believe what I was seeing. \\\"TLJ honors the saga's legacy\\\"? What? It does? TFA killed Han and Leia's relationship and even killed Han in a very anticlimactic way. The First Order exist like the Empire was never destroyed. Despite the good guys winning in Return of the Jedi\\, we have a \\\"Resistance\\\" faction like they're not in control! How is that honoring legacy? In TLJ\\, it get's EVEN WORSE! WAAAAY WORSE! Leia's role is cast aside with her being something of a side piece to an Admiral Holdo\\, some one we've never seen. Leia also demonstrates a complete lack of leadership in this film; something that in the previous films? She was a master class at. Admiral Ackbar has like a 1 second cameo and then is killed virtually off screen. Wow\\, what a way to honor that side legacy. And it's not just Old Triligy Legacy that's trampled here\\, it's even The Force Awakens. I never liked the Force Awakens. I found the film to be impressively shallow and Rey to be extremely irritating and frustrating to watch. However\\, in this film? They some how rip apart most of TFA\\, which is mildly impressive. I don't remember the last series I watched that was inconsistent with itself in such a short amount of time. Plot threads started in TFA were completely dropped or literally and figuratively\\, utterly killed. Snoke? Killed. Phasma? Brought back\\, was on the screen for a minute longer\\, killed. Rey's training? Maybe 12 hours... never completes her training actually. At least the one thing they keep consistent is Rey's power level being extremely high with no real explanation what so ever. \\n\\nThe worst travesty is likely what they did to Luke\\, and I see that I'm not the only one. After weeks of looking at everyone's reaction\\, most are pissed with Luke. Luke is so mishandled in this film that it's definately \\\"divisive\\\"\\, as in \\\"some people will ignore the errors because they're numb and some people will hate the errors because they're so fundamentally destructive that there's no salvation for the trilogy anymore\\\" divisive. TFA undid everything in the OT rather effectively on it's own\\, but at the very least it could have redeemed itself with this sequel by filling in the plot threads it sprung. Instead\\, TLJ literally takes place immidiately AFTER TFA\\, with the destruction of Star Killer Base being only a few hours old and during the running time of the film\\, we're told that the fleet running from the First Order only has about 18 hours of fuel left. So by the time Rey leaves to find Luke on a very distant world\\, to the time she suddenly arrives again on Crait (after her stint on Snoke's ship that ended up with the Supreme Leader being Wasted)\\, she doesn't even spend a full day with Luke. The time span of the film is a terrible choice\\, the editing is jumbled and the script has so many gaping plot holes that there's simply not enough suspension of disbelief to look past them. And Luke? We spend nearly a full 2 hours of this film (minus the absolutely atrocious side plot with Rose and Finn) deconstructing Luke and character assassinating him. THIS. THIS is what people are REALLY pissed about. Luke is so deformed from his true self from the OT that he's not recognizable. The worst part is\\, it didn't even seem like Jar Jar Abram's had the same idea for Luke. The 30 second reveal at TFAs ending seemed like Luke was going to be totally more appreciative of his character. However\\, in this film? Mark Hamill is literally acting out a different character than Luke. The facial expression on that shot is even different. Compare it yourself. Re-watch TFA's ending. Rian literally ran counter to J.J. Binks own film. Luke's expression at the first time we see him in this film is the perfect analogy for how I feel about Star Wars going forward. He takes the light saber\\, looks at it... then tosses it over his shoulder and walks away never saying a word. In other words \\\"I don't give a f***\\\". \\n\\nThe film as a film itself makes terrible blunders that if not for the Disney level pedigree of the creators and the Star Wars title\\, would see the film utterly ripped apart by critics. The flaws are truly gruesome here. The ROOM is a better movie because this film actually TRIES TO BE FUNNY\\, but FAILS at it\\, so it turns out to be incredibly cringe worthy and frustrating as a result. The Room is one of the worst of all time but the charm about that film is it's creator\\, the sincerity of it and how it actually thinks itself serious. There for\\, it's a cult classic. This film? This is a garbage cash grab. It really feels like it was directed by the marketing department. There's little vision. This is the worst Star Wars film for Set Pieces. Majority of the film is ships flying in space\\, slowly\\, during the longest chase I've ever seen. When you compare this film to Mad Max\\, Mad Max is the apex\\, this film is the literally bottom. Another scene is a boring Casino planet seen\\, which looks antithetical to Star Wars's usual designs. It's very Earth LIke and uninspired. Most SW films try to take you to 3 locales of unique visuals to space it up. This one squanders that. Now\\, Crait? I did find visually splendid. Bueatiful set piece. The contrast of Red and White is breath taking. You didn't even need the whole red crystals\\, just the surface contrast was enough. However\\, the set is very simple and it's also kind'a short. The battle on Crait is no where NEAR the grandiose of Hoth. Hoth also had a massive build up since we saw the crew on Hoth well before the battle itself. We saw terrible weather and Luke get lost\\, horrifying creatures\\, and the general scope of the land scape from above and below. In TLJ\\, Crait is no where near as setup. While it's gorgeous\\, it's barely utilized for the story's sake. Instead\\, it's literally a mcguffin since the planet is \\\"conveniently\\\" next door when the fleet runs out of fuel and it \\\"conveniently\\\" has an old Rebel Base that \\\"conveniently\\\" has a form of shielding plot device (a giant door\\, basically) that forces the First Order into a ground battle. How.... convenient. \\n\\nThe side plot with Finn and Rose is just... very bad. It feels even worse than above. They are sent by Poe who doubt Admiral Holdo to find a code breaker. Poe is shown speaking to Maz\\, which itself is wierd since... in TFA? We don't get much exposition to prove if Poe or anyone else besides Han and crew should know Maz but... what ever. They need a code break to turn off the Hyper Space tracking. Ok. So Poe sends Finn and Rose. They go to Canto Blite\\, this... boring Casino planet. It's basically Las Vegas for the galaxy elite. They get arrested for not paying a parking ticket (LOL WUT?) and cannot find the code breaker. HOWEVER\\, they do \\\"conveniently\\\" find a replacement who easily breaks out of his cell because he was... I don't know\\, waiting for gullible character's in the story? The whole sequence is way too long and causes within itself\\, plot holes to the main arch. If Finn and Rose can leave to go to an entirely different world... why can't no one else? They can cloak\\, too? I mean what happened to \\\"No Ship that small has a cloaking device\\\"? Whatever. To me the Canto Blite side quest was terrifyingly bad because it crams political statements into it\\, which means that in less than 10 years\\, this film will be badly dated and not persist at all as a timeless classic\\, PERIOD. Rose and Finn eventually end up \\\"rescuing\\\" the... Dog Horse... aliens... things\\, that are being used in Derby's for betting. They basically commit mild \\\"mischeviousness\\\" by releasing the Rich People's pets and then Rose says \\\"This makes it worth it\\\"... but at the end of it all? They see tons of slave children. CHILD SLAVES. However\\, literally doing nothing for them. The damned animals are let loose but never the kids? Wow.\\nNice morality\\, Rose. It's almost as bad as Finn defecting from the First Order because a fellow trooper died\\, only to have him suddenly blast all of his friends when he's leaving with Poe. This whole trilogy is devoid of a moral compass. \\n\\nThe dialogue is very campy. A joke is forced into every situation\\, which ruins tension. And some shots are simply jarring\\, with very poor setup or even a contradictory style to the trilogy over all. Leia Poppins is a good example of this\\, and Poe's \\\"mom jokes\\\" to Hux is another. Kills all tension\\, or looks very awkward. \\n\\nHoldo is a new character that is barely introduced at all. Not only that\\, but her script actually makes most of the audience think we should totally hate her. Her decisions are counter to common sense\\, and when Poe is shown questioning her and even eventually stirring a mutiny against her? We're actually rooting for it! Without the knowledge of the Hyper Tracker at first\\, we actually think Holdo is a spy! She seems to almost sabatoge everything on purpose\\, letting \\\"rebel members\\\" die for painfully long amounts of time before making a decision. This chick is a one-to-one brain dead Stand In for a Donald Trump. She's THAT stupid. But instead\\, at the end? POE IS WRONG! WHAT?! Holdo and Leia are best buds and some how\\, Poe is wrong? Holdo doesn't even tell Poe her plan\\, a plan that Poe (once he hears it post mutiny) he actually agrees with! So why didn't she just tell Poe? WHY?!  This whole god damned FILM is like this. WHY? NOTHING BUT WHY! Why is Finn shown to be so stupid! Why did Rose prevent Finn from growing as a character in the end!? Why is their side quest even in this film? IT LITERALLY ACCOMPLISHES NOTHING AND HAD TERRIBLE MORALITY. Why is Luke so\\, NOT Luke? Why is Rey still so strong? Why is Kylo still a child? Why is Snoke dead? Why is Hux in command if HE IS SOOOO STUPID? WHY is Leia FLYING? WHY IS FUEL SUDDENLY A PROBLEM?! WHY!?!??!?!?!?\\n\\nFuck this film. FUCK. THIS. FILM.","true":true}