{"101487":138874,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really enjoyed The Force Awakens but now I don't think I was supposed to.  In the Force Awakens we are intentionally left with many questions and in The Last Jedi none of them mean squat. This makes The Force Awakens feel like an episode of Lost.  Creates a sense of wonder and curiosity without having to deal with the difficulties of satisfying any of them.\\n\\nLast Jedi also failed to restrict itself to the rules set up in the Star Wars universe.  Both Leia and Luke use the force in ways that has not been established and I think it opens too many doors to garbage plot devices.\\n\\nFinn was wasted along with the new character of Rose.  There entire subplot felt very much like something from the Prequels. Rose's sister was one of my favorite moments of the film though.\\n\\nAs a stand alone film\\, without worrying about it's place in Star Wars or in the current trilogy\\, I think it's pretty well made.  Very Marvel like.  Jokes non-stop.  Dramatic moments are not held for more than a couple seconds.  Villains are mostly uninteresting but everything else kind of makes up for that. The set and costume designs were top notch\\, with Snoke's Throne Room being one of the most beautiful locations in any Star Wars film. Porgs were not annoying.  The performances between Luke\\, Rey\\, Kylo\\, Hux\\, were great.  All these characters had arcs and personal conflicts that I was completely caught up in.  There's one surprise character that shows up and the execution was better than I could have imagined.  The space combat and the light saber fights were well done. Not overly flashy dance fighting\\, but clearly skillfully done.\\n\\nAll in all\\, it was a good Marvel Film but not a very good Star Wars film... Actually\\, it's better than all the prequels\\, minus Rogue One\\, so I guess it's an average Star Wars film.","true":true}