{"101487":155562,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My score for; Star Wars: The Last Jedi is a 9 out of 10. The Last Jedi is an epic adventure\\, and the greatest departure from anything we’ve ever experienced before in the Star Wars universe. The line “This is not going to go how you think” from Luke perfectly captures the movie. Rian Johnson has taken the biggest risk\\, and expanded the universe more than any of the films to date. The Last Jedi picks up minutes after the ending of The Force Awakens with the First Order ready to finish off what remains the Resistance. The beginning give us one of if not greatest space battles ever in Star Wars. We get to see Poe as the finest fighter pilot in the Resistance\\, and at the same time we see his immaturity when disregards an order and consequences that result. From that point the majority of the film turns into a tension filled chase film for most of our characters. We pick up with Rey standing in front of Luke with her arm out stretched with his and his father’s lightsaber in her had. After that the interaction between the two is not what Rey or the audience would expect. We are introduced to a bitter and sullen Luke. Luke has given up on life from the betrayal of Ben “Kylo Ren “ Solo. Luke makes it clear he just wants to be left alone to die. From this we are given the best performance ever of Mark Hamill as Luke Skywalker. Mark gives us the Luke from the original trilogy\\, but this a Luke who is wiser\\, but also as Yoda said in Empire still looking to the future. Daisy and Adam have both come into their own as Rey and Kylo. They have cemented themselves as this generations light and dark of the Force. Their journey and connection established in this film gives us uses of the Force never presented on screen. As if Andy Serkis had not already established himself as the motion capture king. His performance as Supreme Leader Snoke seals it. Snoke is as menacing and as powerful as we had hoped he would be. Carrie Fisher in her “final” performance as Leia is perfect. When she is on the screen she owns each scene. Her presence is felt and powerful throughout the film. Finn’s role in the film is a side adventure with a bright new character Rose played bubbly well by Kelly Marie Tran. Their mission while at first may seem off to main story ends up proving crucial for the present\\, and for the future. I believe Rian has told the most mature story since Empire. There are a number of themes told during the film that have never been touched on in a Star Wars film. Rian for most part succeeds in delivering them in a fashion that fits into the universe as whole. He proves that universe isn’t as black and white as First Order versus Resistance. There’s gray on both sides\\, and there needs to be balance. This is actually the funniest film in the series to date. There’s a number of lines\\, and site gags that put a smile on your face. If not laugh right out loud. For those who may be concerned\\, the Porgs are adorable\\, and work perfectly in the movie. There’s a number of moments between the Porgs and Chewbacca the are heartwarming funny. John Williams once again has crafted a beautiful score of new music\\, and combining pieces from the previous films. This film is not without its issues though. The biggest issue for me was the film got a bit too preachy with social issues when Finn and Rose are on Canto Bight. The rich earning money from war\\, and the mistreatment of the poor was bit too in your face for a movie that is supposed to be escapism ultimately. There’s a few jokes that work\\, but could feel out of place in a Star Wars film. There’s a few scenes on Canto Blight that feel Harry Potterish\\, which do not fit a space opera. There’s also a couple of obvious CGI issues when Finn and Rose are on Canto Bight. The closing scene I would have made as part of the opening for Episode 9. The Last Jedi is a tremendous is step in a bold new direction for the series. Once you get to the ninth live action film in a franchise you have to take risks otherwise your story and characters will be come stale. With the choices made in this film this series can now go on for many films without feeling small or trapped\\, and relying on just a few characters to carry a series. While the movie has a few missteps it has earned its place as in my opinion in the top three of the film series. The Last Jedi gives you moments to cheer\\, to cry\\, and smile from ear to ear all the while keeping you on a nonstop thrill ride. ","true":true}