{"101487":188859,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"THOUGHTS:\\nLack of communication and I'm not sure these new story writers even grew up watching star wars as kids. It felt more like a guardians of the galaxy movie (MARVEL) with all the comedy in it. I'm not saying get rid of the comedy but when you have a suspenseful build up and then destroy it with laughter? That's just not star wars. It's like eating a piece of candy with the expectation of it being sweet and getting sour. Simply was not star wars.\\n\\nMAJOR MOVIE DISCONNECTS:\\n-What happened to The Knights of Ren?\\n-Does snoke have any back story whatsoever? (existed 1 episode & 1\/2)\\n-Nature vs. Nurture problem. If Rey comes from no significant bloodline of the force with a high concentration of midichlorians (nature) then why is it that she was able to defeat Kylo who 1. Is of the skywalker bloodline (nature) 2. Top of his class in Luke's Jedi establishment. (nature).\\n-BB8 operating the walker was awful. I loved R2D2 for his creative ways of getting out of situations with his limited capabilities. Just unrealistic and not Star Sars.\\n-Luke in the background of the cover? Okay so I guess we are putting the good guys in the back of the cover photo now. Not Star Wars\\n-Advertised as a dark overhanging movie? Supreme Leader is dead. Captain Phasma is dead. I mean the first order took a bigger hit than what was left of the resistence to begin with. I understand not everyone would agree with that but the movie did end on a good note with Luke explaining the spark to Kylo. Disney\\, you made another happy ending.\\n-Are Porgs the new Binks?","true":true}