{"101487":175891,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi was the most disappointing cinematic experience of my life.  I have nothing but contempt for this movie. This movie was disappointing for so many reasons. My expectations going into it were that they would do something unexpected. They did this but in the most unimaginative way that was incredibly inconsistent with what we've come to know about the star wars galaxy. Please\\, present something new. Make awesome new characters with their own awesome stories..... but a uber powerful force user with no training that came from nobody is LAZY! Its like they purposefully made it this way because nobody would expect it. As if they wrote the movie specifically to defy fan theory. lol.... And the Luke arch..... absolutely broke my heart. I've had some time to digest and I can absolutely accept his decision for self exile after such a crippling defeat to himself personally\\, his family and his whole idea of what he was trying to accomplish..... but I simply CANNOT get over the idea that he would contemplate killing Ben in his sleep. They could have cut out so much pointless storytelling that felt like it was written solely to give the new characters something to do and instead given 2 or 3 fulfilling exposition lines about the rise of the first order or how Snoke was seducing Ben or a better way for Luke and Ben to confront what was happening. Instead they forced this side adventure that felt totally out of place\\, had Luke do something that is in direct opposition of who many of us have known or entire lives\\, and for the second movie in a row failed to explain why our heroes success in Return Of The Jedi was obviously for nothing.","true":true}