{"101487":105115,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a lifelong fan of star wars who ended up going into technology AND working on airplanes after the extraordinary impact of the first three movies I am YET AGAIN completely disappointed in the latest installment of Star Wars\\, The Last Jedi. Where should I start? How about with the good. The young actors and actresses were great. Ray\\, Poe\\, Fin\\, and Kylo. Some better than others but by enlarge I look forward to seeing them in other films and watching their careers grow. Also it was good to see Luke Skywalker and Leia there as well. Now on to the bad.... There is a lot of it. The corny one-liner jokes were insulting to the audience. In a situation where a close family friend has died\\, people are dying\\, and there is yet again political unrest corny jokes are stupidly inappropriate. (writer fail #1). So we kill Snook (sp?) and we still have no idea how he got to where he is or what his connection was to the Sith. Just chop him in half and then make another corny situational jest about his two piece cadaver. (writer fail #2). Chewie puts alien birds in the falcon after killing and nearly eating one but stopping after they make him feel bad? REALLY? Stupid. Just stupid. Then we have to watch these things yapping away in the movie. How about you just hand out stuffed animals to the kiddies before the movie starts and not put in these stupid creatures and their lack luster contribution to the story (writer fail #3). Leia gets blown out of a ship and uses the force (Im guessing) to not die in the vacuum of space THEN flys back into the ship??? DEAL LORD! You (the writters) would have don't better to have the Green Lantern fly in and save her. Did you even notice that when she got into the completely depressurized bridge she opened the door to the rest of the ship and somehow the people in the hallways didn't get sucked out into space? LOL! I cant express how STUPID that was. If her character died there at least it would have been a good death for a warrior (writer fail #4). The bad guys are completely inept. How in the universe could they have gotten as far as they did in their careers and have been so bad at what they do is beyond me. At least the Stormtroopers were better shots (writer fail #5). So tell me mighty Disney.. how did the First Order get all of the money needed to build and sustain their Army and Navy? HUMMM???? You should have just emulated the stories from the EU books which explained this logically. Last I checked and by your own self admission money was a huge part of the film yet none of us knows how the 1st Order had any. Maybe Darth Sidious set up a trust fund for them. :P  (writer fail #6). When I see a Star Wars movie I want to see a balanced cast. I don't care the color or gender of the Hero's or Heroin's but clearly this one was about a politically left as it goes in the casing department. Male primary characters were all mostly unimportant and inept (both hero's and villains) and they were greatly outnumbered by their female counterparts. In fact they were mostly all emasculated. Ever heard of YING AND YANG? Humans work best with equilibrium NOT out of balance. Clearly you (the writers ) were making yet another political statement that was about effective as a Ford Pinto. Way to go folks (writer fail #7). Multiculturalism was all OVER this film almost as much as it was in the equally poor Spider-Man Homecoming. So here is the deal\\, this is a VERY heated topic in the world we live in and it should NOT be cheaply or lightly handled. Placing humans of every color all over the place does nothing more than raise situational awareness which we already know about. Something like telling the sky its blue (duuu). Develop your characters more\\, make they dignified\\, give them honorable importance\\, make them respected. SEE THEM AS IMPORTANT HUMANS rather then sprinkling them all over the place and making their characters ...cheesy. Its quality folks not quantity. Lando was WAY better of a character than any of the new non Caucasian characters. Why? Because he was not inept\\, was honorable\\, was dignified\\, and a solid leader. (MASSIVE WRITER FAIL #8) In short your movie sucked. The best parts were the new young actors (I wish them all well) and the special effects and the action sequences. Oh ya .... The First Orders uniforms were awful. Your costume designers failed there tool. You get an (F - -) for this film.","true":true}