{"101487":153379,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Maybe the worst star wars movie to date. Rian killed star wars.\\nAll the  1\/2 to 1 review ratings are spot on for the most part.\\n\\nAll the people giving this movie a 4 or 5 rating is people who are massive star wars fans that love everything star wars no matter what. Or it is people who simply don't know anything about the star wars universe and just want to see an action movie like Transformers or the like. And the movie is beautiful and there are some action... and that is it. That is why non star wars fans maybe like the movie.\\n\\nFor star wars fans that know a little about the star wars universe will cry in their sleep and have nightmares about this movie.\\nThere is no persistence star wars universe in this movie. It does not exist. Hold on... there lightsabers and spaceships like in the other movies... yes\\, but the star wars persintance universe is totally altered. There are so many plotholes and things that are not possible in the old star wars universe\\, that is now possible in the \\\"new\\\" star wars universe. \\nIs that a bad thing? I would say yes\\, because some of the new things that is now possible is killing super mega structures with ease. Snookes super ship is easily destroyed by hyperdriving into it with another ship. WTF!!!! This literally ruins any concept of going big is good. Like the empire did with death stars and what the first order did with the planet death star. You can just take a coupleof x-wing sized objects and a droid to drive it. Go hyperdrive into anything and it will kill it. \\nNo need for massive ships or even fighters. That is the dumbest thing you can have in your navy now :)\\nLets take this even further. If the hyperdrive weapons tactic is good against massive ship and objects... then would i not be good for killing planets? Why even build a death star when you can hyperdrive into a planet?\\nThis is a massive plothole of epic proportion if you ask me. There are many more epic plotholes. Read some of the reviews...\\n\\nStar wars is dead :(\\nThere is no question about it. And all the critics giving it a score of 92% (as of this moment) is treating the movie as an action movie with no established persistent universe\\, where everything goes and visuals are all that matter. In other words. The critics simply have not seen the other star wars movies... certainly not the original trilogy that's for sure.","true":true}