{"101487":169492,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"**SPOILERS**\\n\\n\\nNot a big Star Wars fan\\, but I did enjoy the film. I found that I related to Rey more in this film than the last\\, I liked and appreciated some of the new cast and found some of the unexpected twists in the film intriguing and the film was visually great.\\n\\nBut\\, certain parts of the film's humor didn't really work and part's of it came across as distasteful; like when Luke milked a space walrus.... . \\n\\nI was slightly confused at Po's sudden hot hotheadedness which appeared to come out of nowhere when compared with his character in the Force Awakens and Finn's sudden lack of bravery after being part of the team that took down the new death star and facing Kylo Ren. \\n\\nThe casino planet which Po was marveled at and Rose shunned appeared to be out of place\\, due to the fact that the characters mentioned seemed to focus too much on the casino's glamour and immorality and so only distracted from the larger mission at hand.   \\n\\nThe reason as to why Kylo turned to the dark side felt quite weak and the more robust villains (Snoke and Captain Phasma) seemed to have been killed off\\, leaving ones which weren't as threatening or menacing. It's hard to take General Hux seriously if he's clowned within the first 15 minutes by Po\\, has one of the hardest-hitting ships of his fleet taken out by Po and his team and then is thrown around like a rag-doll by Snoke\\, all within the first half hour. \\n\\nAnd we've already seen that Rey can handle Kylo despite having minimal training.","true":true}