{"101487":122982,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Go and see the movie for yourself two main reasons I see people complaining are A. Their fan theories were unfulfilled  B. It challenges what they percieve should be Star Wars. \\n\\nOne person\\, I came across described this movie perfectly for me at first I felt conflicted after seeing it it's a very different take on star wars but well worth a watch. \\n\\\"I applaud the decision to hit the restart button on some of the stale formulae we've grown accustomed to in SW. The whole concept of hero worship undermines the Everyman hero and I'm glad they had the bravery to really explore the notion of what really happens when you meet your heroes. They're just people. People dealing with their own failures and hang ups. The Finn\/Rose arc\\, Poe's mutiny\\, Rey's failure to turn Ben\\, all these are examples of our heroes tying their best\\, believing what's right\\, and failing. And as Yoda tries to tell Luke\\, who still hasn't learned this lesson\\, our failures are often more important to our growth than our success.\\n\\nPeople will be mad about this film. It will make them uncomfortable because it gets rid of the seemingly solid foundation of hero worship. But the heroes journey has always been about finding salvation and growth within. No ones coming to rescue you from yourself.\\\"\\n\\nThere were things I questioned in the movie\\, but that's been the same with every SW film and nothing was so extreme as to be too hard to swallow\\, as I almost felt about the prequels when they first came out. I really enjoyed being surprised with all the new things the Force could do (thank goodness being a Jedi doesn't just mean you can do cool Backflips and forcejumps). Bravo to Rian for expanding the scope of what it means to be a Jedi.","true":true}