{"101487":145850,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've been lurking for awhile and reading reviews. People have done a good job deconstructing this movie and pointing its flaws\\, esp. with how they dealt with Luke\\, but I have something to add with regard to Rey.\\n\\nThe most important friendship established in TFA was Rey and Finn's. Remember how devastated Rey was when she thought Finn was dead or had a chance of dying? Remember Rey calling Kylo a \\\"monster\\\" after he killed Han\\, the only father figure she'd ever had? \\n\\nWell all of that doesn't matter anymore. It's heavily implied that Rey and Kylo have a thing for each other in TLJ. Imagine developing romantic feelings with someone who\\, just last week\\, intentionally wounded and almost kills your first\\, life-long\\, and childhood best friend. Imagine developing romantic feelings for someone who just murdered your father\\, a day after you called him a murderer. Remember\\, this is the Rey who screamed out Finn's name like he was her only friend (he was) when he was getting entangled by the Rathtars. This is the Rey got all teary-eyed at even the thought of Finn's leaving her and the Resistance to flee.\\n\\nIs Rey an amnesiac? Rian Johnson shows utter disrespect to both Finn and Rey\\, and esp. to their friendship. Their friendship is now reduced to worthlessness. The same with her relationship with Han. What does Finn's and Han's friendship mean to Rey? NOT MUCH AT ALL in light of all this.\\n\\nNow you might argue that Rey\\, because she is the paradigm of hope\\, would always see the best in people and so would hope that Kylo would turn from his evil ways. They even have some things in common\\, two powerful wielders of the force n all (tho for some reason she is way stronger than him already\\, just look at the throne room scene). But still. You're telling me she's getting all horny for this guy who just did these things to these people? BS. Rey would be more loyal to her friends and family than that.\\n\\nTo top all this off\\, Rian Johnson portrays her attraction to Kylo as a *good* thing. Lolol. Not even as in any way bad. Remember: Luke stumbles in upon them force skyping in the hut as if they're doing a terrible thing\\, but Luke is presented as the intrusive one and the one at fault (Rey immediately lays into him). The morals are just so ass-backwards in this story. Poe is portrayed as the clown while Admiral Holdo plans an 'escape' but doesn't tell her top troops what she's planning to do\\, leading to a well-deserved coup. And then she has the audacity to wait until 90% of the Resistance is dead before she does her all-too-late kamikaze. Ugh. Amazing how a movie can retroactively make a previous movie's most important friendships and character development worse and meaningless.","true":true}