{"101487":101523,"Last Jedi":"Last Jedi","2017-12-15":"2017-03-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Alright\\, let's get this straight.  Star Wars Episode VIII: The Last Jedi is the most surprising Star Wars movie ever made!  While The Empire Strikes Back does have the holy of holies when it comes to twists\\, there were more mouth-drop moments in The Last Jedi than all of the previous Star Wars movies combined.  And that right there is the movie's greatest quality.  It consistently keeps you guessing\\, and it does not go at all how you expect.  Some of its other strengths are that it's beautiful with shot after magnificent shot and that its score is breathtaking with countless callbacks to music from both the Original Trilogy and The Force Awakens.  Speaking of The Force Awakens\\, is The Last Jedi a worthy successor?\\n\\nIf I had to pick (emphasis on HAD TO)\\, I think I would choose The Force Awakens over The Last Jedi.  Not because the new film didn't go how I thought it would.  That was the one thing I think makes The Last Jedi stand out from its predecessor.  But because The Force Awakens is such an easy watch.  You can pop it in and have a perfect stream of entertainment for two hours.  The Last Jedi is a bit more unwieldy.  It jumps around a lot\\, and it's about ten to fifteen minutes too long.  For much of The Last Jedi\\, you really can't tell where it's heading\\, and that is both a good thing and a bad thing.  The reason I think it's a bit too long is that I genuinely thought it was over twenty minutes before the credits actually rolled.  The movie kind of has two climaxes\\, one revolving around Rey and the other revolving around Luke.  Keep in mind that it was never boring; I was simply a little shocked that the movie was still happening during the last ten minutes.  \\n\\nDespite everything I just said\\, The Last Jedi is an incredibly worthy successor to The Force Awakens and to the entire franchise as a whole.  My only issue with it is that it doesn't have a clear purpose for much of its runtime and that it drags just a little\\, but that's mostly me nitpicking my heart out.  This movie is a Star Wars fan's dream.  It's exciting\\, it's beautiful\\, it's funny\\, and to be as clear as I can be: It is shocking.  I have to say that the two year wait was worth it.  The Force Awakens gave fans exactly what they wanted and expected.  You have to applaud Rian Johnson and everyone who worked on The Last Jedi for taking the story in a new and different direction.  I'm going to see this movie for a second time and a third time and a fifty-seventh time\\, and I think I'm only going to appreciate it more and more in the future.  Now let's speed up the clocks.  I'm ready for Episode IX!","true":true}