{"101487":174695,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The GOOD:  The dreadnaught was super cool.\\n\\nI understand they wanted to show that Luke was worn out by losing an apprentice.  Seems like a poor plotline for a movie installment.  The only interesting part of the film was the \\\"sharing of the mind\\\" plot between good and evil.  That was wasted by Snoke saying he set it up.  Snoke being wasted was a huge blunder too.  A villain stronger than Sheev Palpatine just appears and disappears with little story but a demonstration of being the strongest force user ever show on the screen.  What a waste of my brain.  Snoke was one of the reasons I wanted to see the movie.  Although the emperor played a similar role in ep 6\\, the emperors character was portrayed as being a man with a grand plan and power.  Snoke is just power and it is boring.\\nEpisode 4 was about reluctant characters moving into action against an enemy that \\\"couldn't be defeated\\\" (Luke and Han).  Episode 5 (the best) introduced force lore in a deep way\\, and tested the resolve of our heroes.  It also introduced one of the best plot twists in sci-fi history.  Episode 6 was about maturation\\, dedication to friendship\\, and facing ultimate temptation.  It was also about the redemption of Darth Vader.\\nEpisode 7 was about meeting new characters.  With no training\\, the hero is able to best a trained dark Jedi.  This was too farfetched for me and I dismissed the movie as not having time for character development.  It was basically ep 4\\, but lacked the outstanding performance of the \\\"elder wise man\\\" that Alec Guinness provided to a young hero in training.  Also\\, following Luke from simple farm-boy to Jedi facing the Emperor was key to the first trilogies success and set Luke up for success where his father had failed (the contrasting characters).\\nI thought the pattern would be repeated\\, and Ep 8 would be outstanding.  It was not.  Too much humor delivered without passionate performance or perfect timing.  When Han and Leia had their humor\\, or the droids\\, it felt natural and unforced.  In episode 8\\, it is like that person at the workplace holiday party trying to be funny\\, but isn't.  The harder they try to be funny\\, the more pathetic it gets.  \\nThe side plots are all flash\\, and appear to provide no substance going forward.  Where is it all building too?  For example:  Heading to Alderaan got Luke and Han on the deathstar and they rescue the princess (it means something).  The empire going to Hoth divided up the hero team.  Luke going to Yoda built up force lore.  Vader losing half the fleet in an asteroid field showed just how important a single potential SITH apprentice is to the Emperor and himself.  Cloud city was about going off to fight when unprepared (and meeting Lando) and the ultimate temptation (Let's rule as father and son).  Jabba's palace was about being reunited and pursuing tough causes for friendship and love.  Going back to Yoda was about accepting death and confirming Vader's ID (Also learning about his sister).  Facing the Emperor\\, in the midst of a trap\\, was the ultimate test for Luke.  All the different locations tied together.\\nEp 8 was so focused on not being the \\\"ESB\\\" that they purposely sabotaged the film to prove they wouldn't do what ep 7 did (copy 4).  They also wasted two interesting characters in Phasma and Snoke.  I guess in that way\\, they are continuing the Bobba Fett tradition.  Cool characters with little to no story.\\nI going to put my money on the back story spinoffs for my future star wars hopes.  Maybe a HAN\\, LANDO\\, bounty hunters\\, or SITH origins story will do the job.","true":true}