{"101487":165561,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"RIP Star Wars (1977-2017). For forty years you dazzled and amazed fans of all ages. We stuck with you through Jar Jar Binks and other misfires\\, always knowing that you had the best intentions at heart. Then Rian Johnson came along and decided to kill the past\\, and all that Star Wars meant along with it. \\n\\nMake no mistake\\, it wasn't theorizing fanboys with unrealistic expectations\\, misogynists or racists that did the deed. It was a horrible script written by Rian \\\"I wouldn't change a thing\\\" Johnson that did the deed. A script that ignored all that came before it\\, even tossing aside numerous plot threads left to follow by the immediate predecessor in an egotistical effort to make something \\\"unexpected\\\". Bravo - you squeezed out a turd Mr. Johnson. \\n\\nTo be fair\\, Rian doesn't deserve all the blame. Somehow other people at Lucasfilm and Disney read that script and actually approved it (none of them apparently realizing that the slow chase and casino stop were not unique\\, having already been done much better in either the original or remake of Battlestar Galactica). \\n\\nIn any event\\, given the results I will follow Rian's advice and let the past die. With it goes my undying love for and loyalty to Star Wars. I suspect there may be a widespread\\, similar reaction from much of the fandom.     \\n\\nLike many others\\, my one star goes to the one remaining piece of the Star Wars legacy: John Williams.","true":true}