{"101487":105998,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A Star Wars movie needs support on three pillars to be great - Spectacle\\, Characters\\, and Plot.\\n\\nThe last Jedi has spectacle in spades.  Fantastic effects and production design - the team that worked on this movie should be proud. Top tier. A fantastic score only adds to the experience.\\n\\nThe plot and characters however\\, are problematic.  It took me sitting a while with this movie to really realize why the taste it left was so off.   Well\\, think back to the 1940s: Movies commonly depicted men as being strong do-no-wrong leaders\\, while women were prone to emotional hysterics and needing the strong paternalistic guidance of the men in order to function under stress.  Could you make such a movie today?  God no.. it would be rightly criticized as being completely sexist. We've come a long way.  Or at least we did until the Last Jedi.  In a ham-fisted attempt at female empowerment\\, they simply took this exact sexist dynamic and reversed the genders.  The women are in charge and can do no wrong\\, while the men (all of them) are depicted as emotionally unbalanced or weak.  So you end up with every major character being either boring\\, annoying\\, or pitiful.  Ouch.\\n\\nSo by all means see the movie and enjoy the spectacle of a Star Wars universe.  But don't expect that you're going to be drawn into the story and end up eagerly awaiting Episode 9.  You may actually end up finding that your enthusiasm for this saga has mysteriously evaporated like Sand People into the hills.","true":true}