{"101487":169589,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoiler Warning!\\n\\n In my opinion\\, this film was ok but thats all.\\n\\nThe script was trying to be funny too often and at times the dialogue was really bad. The main plot of the movie was the Resistance trying to escape from the First Order\\, and that was it. A very long cat and mouse chase that should serve as a chapter in a story\\, not the whole story. There was no details on how the First Order has moved to secure the galaxy since it destroyed the senate or the current state of the Republic other than suggestions through dialogue that it has been destroyed....that was easy.\\n\\nThe Finn subplot was uninteresting. Whenever his story line came up I just didn't care.\\n\\nRey and Lukes story was the saving grace of this movie. I did however feel that the story of the new trilogy took a u-turn in regards to Luke. In The Force Awakens the Resistance desperately needed Luke to fight the First Order and bring back the Jedi. When he finally showed up he lasted 5 minutes and the manner of his departure\\, and his lack of interaction with the other characters ie Leia\\, was very unfulfilling. Some may argue that he brought back the Jedi through Rey\\, however this was a path she already seemed to be heading to with very little assistance from him.\\n\\nAs for Kylo. Why is he a bad guy again? Because he has a temper? please.\\n\\nIts not a bad film\\, there are plenty of great scenes with and without action but this just didnt feel like a Star Wars film and I left the cinema disappointed.","true":true}