{"101487":149384,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Last Jedi was a well made film that repaired a lot of things I felt the prequels. It is still one of my top 5 films in the franchise. It is allowing for a franchise to be able to expand while giving a a story of star wars that feels different while and subtle in its self awareness. For the next generation of star wars lovers that introduction in to the Universe was Force awakens this is the sequel for the to be able to imagine  them selves as young Padawans that it could be anyone from any were of any socioeconomic standing. With its well handled subtlety of self awareness. Its delivery of its under lying themes were so miss handled and blatant that it distracted from every thing the film dose beautiful. address these social and political issue dragged the pacing. Although there were good action pieces they are far from the best in the franchise. Also there is a a moment were Fin and Rose that felt forced and unneeded no build up hints.  My suggestions when watching this move not to think of it as a New Hope sequel but a Force Awakens Sequel were the knowledge of the life of Luke Skywalker is unknown just his Legend. And you shall walk out greatly satisfied. But for the Die Hard Star Wars fan this is your move to know the characters you grew up with are not important they are only here to pas the baton. This movie is the one that may hurt but is need for the franchise to grow and fulfill its potential. To allow for new characters to stand on there own to grow and do new things with the force.","true":true}