{"101487":169389,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers ahead.\\n\\nThe Last Jedi exists as an attempt to steer away from all the expectations from fans that have been building for decades. In doing so it wastes the emotional potential of properly utilizing one of the greatest cinematic characters in history\\, Luke Skywalker. Instead of an elderly portrayal of what was once the Galaxy's greatest hope\\, Luke has shriveled from one failure into a forceless hermit dedicated to letting the rest of the Galaxy deal with his mistake. The man who once believed in and pursued the redemption of Darth Vader does not extend the same grace to his nephew even before he has committed any wrong acts. \\n\\nIn addition to the disgusting and wasted portrayal of Luke Skywalker\\, the film is riddled with other moments that add nothing to the cinematic universe and attempt to dismantle all the past films. Nearly all of the crucial plot points of the Force Awakens are cast aside in the Last Jedi in favor of dodged expectations. The film spends makes no progress for the resistance as it instead focuses on a throwaway statement against war in the form of a casino planet that ultimately ruins the pacing of the trilogy. \\n\\nI give it one star for it's few redeeming qualities. Kylo Ren continues to be an amazing character that brings much needed depth and struggle to the dark side of the force and would have provided an excellent antagonist to the moral rigidity of Luke Skywalker. Unfortunately\\, I will have to pretend that this movie took advantage of that and other opportunities it ignored.","true":true}