{"101487":98528,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Absolutely the WORST Star Wars movie ever!  I have enthusiastically watched every one and even liked the last one (even though it was a little too much like the very first one - but it was still a great movie) - I will not see Episode 9. Yes\\, the movie was entertaining\\, but these literally were the stupidest characters I have ever seen before on screen with more plot holes than can be counted.  Honestly this was MUCH WORSE than the prequels (with the exception of all those scenes on Tattoine in the Phantom Menace)\\n\\nLet's start from the beginning.  After evacuating the planet\\, rebel cruiser and forces just calmly sit there while enemy forces jump in.  Easy decision...jump out of orbit.  Those escaping from Empire Strikes Back knew that.  Instead you send a single fighter to play chicken with a Dreadnought and the entire imperial fleet. And then\\, when general Leia orders Po to stand down\\, her troops follow Po instead?  They do not come back to the ship to high tail it out of there.  So much for leaders that are \\\"strong women.\\\"  She let herself get walked all over in that scene risking the fleet!  When she LET her people continue on that mission without forcefully calling them back (and jumping out herself) she was just as responsible as Po for losing all those bombers.\\n\\nThen that back and forth between Rey and Kylo was inane.  Rey witnessed this guy kill his own father in cold blood? Anyone think she would give him the time of day?  Mention this to Luke of course?  I mean imagine Vader appearing to Luke on Dagobah...think he MIGHT have mentioned it to Yoda?  Especially if \\\"afraid\\\" of your powers like Rey claims to Luke.  It is just inconceivable hat she keeps this quiet.  And then she seems dead set on saving him.  She barely knows him other than him killing his own father! Remember Luke wanted to save Vader only because he was family.  Rey had no real rationale to be so generous with Kylo.  Luke had more incentive to want to save him being blood.\\n\\nThe biggest problem with the movie is Luke.  Luke\\, the guy who wanted to give Vader the benefit of the doubt\\, we are to believe he for a moment thought about killing Kylo\\, his niece?  If he thought Kylo was 100% dark\\, then Luke would have been a HORRIBLE Jedi\\, given what a weak villain Kylo is.  Most importantly that is out of character for Luke who saved Vader who was way worse than Kylo!  Then you are telling me he just sits everything out\\, and does not even TRY to clean up the mess he made.  You have two POWERFUL force wielders out there\\, and he just sits back and does nothing!  if you had said he had to track down the Jedi temple to learn of some secret weapon to defeat Snoke\\, I could have bought that.  But the guy was literally acting like a weak and immature girl who had been dumped at prom.  The Luke in this movie is literally contemptible and irresponsible.  And we did not even get a REAL fighting scene from him (at least Obi Won got that when he lost to Vader)...Luke pointlessly fades away...what to give psychological hope to the galaxy?  Don't you would think they would have more hope from him having tricked Kylo and still fighting by their side? If you were going to kill him\\, let him go out with a bang taking half of the First Order troops with him!  That little hallucination trick was literally for nothing if he ends up dying anyway!\\n\\nThen Snoke...seriously no explanation for his back story before you kill him off?  Now leaving the First Order in the hands of a weak idiot that is literally the WORST and LEAST SCARY villain ever?  I mean this guy literally could not beat an untrained Rey in the first movie.  I do not care how unbalanced he was from killing his father or injured.  Heck he did not even do that well against Finn who got some hits on him!  He could have literally force choked both to death if he were semi competent.  Snoke versus Luke\\, or Snoke versus a turned Kylo\\, Rey and Luke\\, that would have been something worth sticking around to see episode 9.\\n\\nThen you are telling me that when they could be tracked through hyperspace\\, no one thought about laucnhing all the ships (remember Xwings and light transports have light speed in other movies) and splitting up?  I mean those last few ships that ran out of fuel and literally let themselves get destroyed instead of jumping into hyperspace (the First Order would be focused on the cruiser).  And then the First Order claims they could not send fighters to attack directly because there \\\"would be no cover\\\" yet they are able to use  their guns to continually hit the shields of the ship (which apparently did not work when a lowly figher hit the command deck) or when it hits the transports even further away?  Those star destroyers could not jump in front of the ships and surround them to kill them immediately?  And then what ships only have TWO light speed jumps of fuel?  How do you have the fuel to make one final light speed jump when you are nearly out of gas?  I mean\\, this situation was literally so contrived it made no logical sense. \\n\\nThen you have the new admiral decide not to tell her people how she plans to escape\\, leaving Po and the rest to wonder if she is just going to sit and let them die.  I mean there was NO reason to keep that a secret\\, it only undermined her authority (again\\, so much for strong women - these are not the leaders we want to emulate). Then Po and Finn even stupider.  Let's do a daring plan and NOT TELL anyone!  Literally no reason other than the person in charge would not like it?  Po barely knows her!  They could provide additional resources.  I mean that was as stupid as that single vehicle attack on the Dreadnought (which we are supposed to believe after the guy gets shot down FLEEING from a smaller Star Destroyer in the first movie).  Mean this stuff is not believable.\\n\\nOverall\\, it was like every character in this movie was unbelievably stupid.  I am guessing that is why a bunch of millennials are loving on this movie\\, they do not see all the plot disconnects and logical fallacies.  All they know is it was entertaining in a mind numbing close off your brain sort of way (suspension of disbelief as one might put it).  In a world where everyone gets a trophy just for showing up\\, I guess competence is not something that is valued anymore...","true":true}