{"101487":196276,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where should I begin with this movie? Well lets start with the positives. The action was cool\\, the movie had some funny moments\\, acting was good\\, and it was cool seeing Luke use a force ability from the expanded universe. That is basically where all of my postive feedback ends however as Star Wars Episode 8 is the worst movie in the series. Yes\\, even compared to Episode 1 I think this is the worst. Whether it be the killing off of important characters\\, the political jabs that are crammed airtight in the movie\\, or even crucial plot holes that ruin the experience\\, The Last Jedi fails to create a cohesive narrative and instead tries to play off of Disney's super hero movies with tons of jokes that don't fit in with the tone instead of keeping serious moments when needed. It is very apparent that this is Disney's attempt to erase the Skywalker lineage that is famous in the series in order to create a new cast in order to replace the old. However in doing so they also are ruining important questions that have been built up for the last 2 years. For example\\, who are Rey's parents? As a spoiler warning I recommend to stop reading from here on. They were drunks that had absolutely nothing to do with the force. Who is Snoke? Eh\\, some dude I guess? He is more powerful that Rey and Kylo Ren clearly so it is obvious that he must be important but he ends up getting killed in a pretty lame way. Where is the military of the Republic? Sure the 4 Republic planets were destroyed in Episode 7\\, but that doesn't explain why a GALACTIC GOVERNMENT only has 4 ships available.\\n\\nAll and all this movie is not recommended as it does a poor job at fitting in with the rest of the Star Wars movies and instead acts as a cash grab. Oh\\, by the way\\, Disney is paying off the reviewers who gave this a 93% here on Rotten Tomatoes just like with Thor Ragnarok.","true":true}