{"101487":169582,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"****Spoiler warning****  I had high hopes for this movie but it's very derisive in it's tone and portrayal of star wars.  First off the movie is slow and plodding during the second act\\, but really it doesn't need to be.  They tried to change this with cuts away from the retard race between the First Order and the Rebellion.  For about half the movie it's.  \\\"We gatta hurry\\, we're running out of fuel.\\\" but they never seem to gain ANY ground or move pretty much at all\\, and it seems like DAYS pass with basically nothing going on.  Time-wise it makes NO sense\\, then when they had a perfect opportunity to kill off a beloved character who is dead in real life\\, they are like Fuck it she's Superman.... Luke's character I didn't have that much of an issue with until the end of the movie\\, but Rey's backstory and the identity of Snook we're promised to be the big selling point here\\, and they were both just casually tossed aside as if the director is saying\\, no audience you are caring about the wrong things here.  Sloppy direction.  Then the thing that I think bothered me most is that it's pretty much cannon that hyperspace is not light speed so when you accelerate into hyperspace YOU LEAVE NORMAL SPACE.  The plan to simply crash the ship into Snoke's ship is dumb.  Finally the end of the movie.... The writers here... well...... they supermaned it.  Can't get out of a situation?  Give him a new power that gets him out of the situation.  Then they had the big reveal that although Luke could hurt Kylo\\, Kylo can't hurt Luke.  Which would have been great except then you fucking kill off Luke anyway???? Heroic sacrifice on the field would have been better\\, then another\\, Fuck it he's Superman!  It felt like a Non Star Wars fan making a Star Wars movie....  Sloppy","true":true}