{"101487":169476,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*Spoilers*\\n\\n1. The build up of Rey handing the lightsaber to Luke was built up for two years.  The hype was instantly killed by cheap humor.  Luke throws the lights saber over his shoulder.\\n2. Luke Milks detailed alien tits.\\n3. The conversation between hux and poe was carried out way to long for a laugh that wasnt even worth it.  \\n3. Leia should be dead\\, but somehow magically learns to fly and breath in space.\\n4. The purple haired chick doesnt tell poe the plan to land part of the resistance on a nearby planet to hide from the first order\\, this results in Poe thinking that she's actually crazy and takes matters into his own hands.  Poe takes command of the resistance ship and ends up putting the entire ship in danger.  I blame the purple haired chick who was being secretive of her own team and not discussing an important battle strategy to the most important man on the entire ship.\\n5. Finn and Rose story just gets in the way\\, they spend way to much time just goofing off with alien horses all to fail their goal anyway.  We get some lecture about how rich people are bad which brings us into the real world political agenda of disney and it's so one sided it actually makes me sick.  They hint that all rich people are evil and they later destroy all of their property and Finn says that he felt good doing it.  \\n6. On top of Leia being able to get blown up\\, sit in space without a helmet\/suit and then fly to safety - we also are introduced to a new force power that acts as a jedi force skype thing.  We find out that snoke set up the whole thing... without even knowing where Rey was?  How does that happen?  They can eve hurt each other through the jedi skype too which makes ZERO SENSE.  \\n7. Snoke has no backstory and dies instantly.  It feels like episode 7 was just a waste of time\\, I don't know how this weakling fool came to power at all.  He definitely should have seen Kylo turning the light saber\\, or even heard it.  Cool death though.  His monologue was a bit to much though as he described in way to much detail how Kylo was going to kill rey giving him the perfect amount of time to kill snoke on que instead. \\n8. Rey's parents are drunks?    \\n9. The most disappointing part of the entire movie was the Man hating attitude towards EVERY SINGLE MAN IN THIS STUPID MOVIE.\\nRey has to talk Luke of all people into not giving up.\\nRose has to yell at Finn for running away.\\nRey has to yell at Kylo for being evil.\\nPurple haired chick and Leia yell at Poe for being to careless.\\n\\nIts just a giant man hating fest and no one is safe.  I don't understand why there's all this hate towards men now in starwars.  I miss the good old days where men and women could shoot storm troopers in harmony without all of the pc bullcrap.\\n\\n10.  The director of this movie \\\"Rian Johnson\\\" said that he wants women and people of color to make  future starwars films.  There's nothing wrong with except for the fact that you're singling out white men who built the franchise and make up most of the fanbase.  Again I don't care who makes a starwars film but my god\\, why does everything have to be so in your face about diversity.  \\n\\n11.  The cast was bragging about diversity as if they were the first ones to do it.  Lando\\, Windu\\, leia\\, padme\\, the clones(all mexican)\\, jango boba.  These new starwars films are acting like the previous films were so racist and male dominated.  Darth vader the most popular star wars character is voiced by a BLACK MAN.  Get over diversity\\, we were better before it was forced.\\n\\n12.  At the end of the movie they suggest that anyone can have the force.  When anyone can have it\\, everyone will have it.  And when everyone has it\\, it won't be special.  My favorite quote of all time is from The Incredibles when Syndrome says \\\"When everyone's super\\, no one will be\\\".  That's definitely what star wars feels like right now. \\n\\n13.  Overall\\, this movie is just disappointing.  I'd say its the worst film in the franchise even worse than the prequels.  I'd give zero stars if I knew how to.","true":true}