{"101487":181756,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is a muck fest of a film that attempts to create a story for the post-modernist millennial.\\n\\nIt felt like a mash-up of elements from Empire Strikes Back\\, a little from Return of the Jedi mixed up with elements from The Matrix and a Chinese Wuxia film.\\n\\nThe script tried so hard to become \\\"fresh\\\" by trying to break movie tropes but it doesn't work. Certain things in life are true and universal. That's why Joseph Campbell's work on the Hero's Journey shows. A hero must undergo training\\, and a hero must sacrifice himself.\\n\\nI totally agree with Mark Hamill this is not the direction Luke Skywalker would have taken\\, it seems like the character arc of Luke regressed and I didn't like his eyes bulging out most of the time in regret and fear.\\n\\nBenicio del Toro's character seemed slapped on just to provide a betrayal but we never got to know his character and his betrayal didn't have much impact.\\n\\nHow did Poe and Rose escape execution? All the stormtroopers around them died except for them? And how did Captain Phasma survive and jump from standing next to Poe and Rose and then suddenly emerging from afar?\\n\\nThe rebels needed to go to the planet to transmit a message to the outer rim but yet Poe could communicate easily with Maz Kanata.\\n\\nThere is effectively no gravity. So how did the bombs fall?\\n\\nKylo offering his hand to Rey to rule the galaxy together didn't feel like a homage\\, but a parody of Empire Strikes Back.\\n\\nRose saving Finn from sacrificing himself wasn't heroic\\, it was a stupid and a cowardly selfish act. That would have been a saving grace of the movie\\, it would have changed Finn from being called a traitor (too many times in this movie) to a hero.\\n\\nSo now Jedis have holographic projection powers? And Leia suddenly exhibiting force powers?\\n\\nFight scene between Luke and Kylo felt like it was from the Matrix not Star Wars.\\n\\nSo even kids can suddenly get force powers? And that rebel ring is an on-the-nose merchandising attempt. That last kid scene really felt like it belonged to a Disney kids film\\, I half expected \\\"When you wish upon a star\\\" to start being sung softly.\\n\\nI don't really see much hope in the Star Wars movies anymore\\, I now hate the sequel trilogy even more than the prequel trilogy.","true":true}