{"101487":122102,"Last Jedi":"Last Jedi","2017-12-15":"2019-01-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"From the opening motions of the movie it drives out all knowledge of what happened and what should open out into the open void. Star Wars: The Last Jedi is an utter disappointment for many fans as it completely obliterated any chance of creating an incredible trilogy to look back on for the future. The plot holes were glaring at worst\\, leaving out many subplots from The Force Awakens like the Knights of Ren\\, the fact that Luke purposely left a map so he could be found\\, and how the First Order managed to control most of the valaxy after losing almost everything when the Starkiller base was destroyed. No questions were answered and more questions arose. Killing off Snoke\\, the character everyone was theorizing about and getting excited for. Instead it was a pointless cone on the ground in a parking lot to just walk around. The same goes for almost every character like Laura Derns as she comes out of nowhere and is obnoxious. Admiral Ackbar is just killed off without acknowledgedment. Luke just dies from the force and my god does it squander any chance for an epic confrontation. Of course the special effects are on point as any star wars movie should but it is almost becoming tiresome. The plot is weak\\, just a ship flying till it runs out of fuel. Rian Johnson has lost any desire to create something magnificent and creative in parallel to The Empire Strikes Back\\, but throws the opportunity away and loses every fans dream of hope. The Last Jedi is one of the worst\\, if not the worst Star Wars to have been released. The Phantom Menace is better for what it is worth.","true":true}