{"101487":166306,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Saw the movie the day after it was released with my wife and kids (ages 10 & 12). Walking out of the movie one of my 10 year-old sons said\\, \\\"the ending doesn't make sense.\\\"  \\n\\nI thought about his comment and then thought about the movie as a whole\\, and feel like his comment really applies to the whole movie.  It just doesn't make any sense.\\n\\nAfter seeing all the positive critic reviews\\, I was ready for the best Star Wars film yet.  The Force Awakens and Rogue One were very good and I was very excited to see how they would top it off and give us more background on all the characters. Unfortunately they didn't deliver.  No questions we were left with about about the characters from the last movie and resolved.   The star-ship battles are underwhelming and the sequences don't make any sense.  The ground battle is boring and the sequence doesn't make sense. The special missions that you think will be critical to stopping the First Order don't culminate to mean anything and could have just been left out.  When you think about it\\, it feels like 2 hours of the movie was pointless to the story. \\n\\nNow with that all said\\, there are funny and exciting moments and IF you don't think about what's going on in the movie\\, it's enjoyable.\\n\\nDisney must have paid off all Critics out there\\, because there is no way this film deserves more than 3 Stars\\, and that's only because it's a Star Wars Movie with Star Wars Characters people are emotionally fond of. If this was a Stand Alone movie not tied to Star Wars\\, the story telling and the brainless battle sequences of this movie would have resulted in this film getting crushed by the critics.","true":true}