{"101487":184164,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie in my humble opinion does not belong in the real Star Wars saga at all...Should be renamed and turned into Kylo or whoever's dream.\\n\\nForce ghost (Yoda) should not be able to perform any real actions other than talk in the universe or why doesn't he just fight kylo\/the first order? can't an army of Jedi force ghost's take on all evil? horrendous plot hole letting him call lighting down to burn the tree.\\n\\nLeia being able to pretty much resurrect herself and fly also creates countless plot-holes.....Why didn't Darth Sidious just fly back out the hole tht Lord Vader himself threw him down? since we never even see her use the force other than maybe telepathy with Luke....Giving her such an OTT scene just creates plot holes and the whole thing seemed ridiculous...\\n\\nAnd tht brings me to the best bit of the whole movie....Luke using a badass force move tht well also comes with plot holes....he force projects himself and in-turn the effort kills him....cool aye? his sister who is untrained...can fly\/breath in space....but Luke who was perfectly safe on his island has to die using such a POWERFUL move.\\n\\nThe film seems to remind me of like a group of friends sitting at a table coming up with idea's for a movie....but nobody being there to say cool idea\\,....tht would be badass but in reality it does not work nore fit...because of reasons X\\,Y\\,Z\\n\\nIt reeks of being written by one person...with said person not seriously taking other peeps opinion on board.....and not coming to terms with the fact that for the harcore fans....Star Wars is a lifestyle....it's more than just a movie....\\n\\nI knew a Star Wars would be made tht i didn't like with one coming out every-year...But what i did not expect is one so soon to ruin everything tht came before it.....it just doesn't feel the same after this....i feel like a remake of sorts is in order....\\n\\nThe whole Luke story ark is just depressing to me after this movie...I don't know how Rian thought this would float....The only thing i can think of is he wanted to leave a huge mark on the franchise.....he at the start would not of known about the new trilogy. Where JJ came with peace and love and played it safe.....Rian took a territorial leak over the whole franchise....\\n\\nSo many things i did not agree with in this film i could write all day...but the underlying feeling from me is.....PLEASE REMAKE THIS DISNEY.","true":true}