{"101487":121281,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Firstly I am not a Star Wars fan but enjoyed the original trilogy\\,  found the prequals mostly dull as dishwater (monologues and some poor acting) and the Force Awakens a dull lifeless story especially the acting. Oh the acting was terrible. So thought the Last Jedi must be better. How wrong can you be. A story so full of hideous pot holes and random nonsense its hard to say what part is worse. Acting again dull lifeless and unbelievable. Luke Skywalker who saw good even in Darth Vader now tries to kill his nephew just in case he turns bad and goes and sulks on an island for 20 years. Even when Finn finally does something selfless he is stooped by a stupid act of stuoibess? What kill someones trying to stop an attack by trying to kill both of you? Was this meant to be comedy? Snoke who appears out of nowhere gets killed easily and seems like a plotless idea. The Empire (a rebranded name is stupid)  is way stronger than the resistance so how did that happen? Surely in epidode 6 the empire was destroyed?  And worse of all hyperspace through a ship destroys it? Easy then to kill a death star or fleet of ships with cheap transports. Undermines all of Star Wars storylines. Vice Admiral Holdo's contribution is to say \\\"never allow women in charge\\\" as she isbterrible. Rey learns to be a Jedi in 5 mins. Oh thats easy. Kylo Ren just needs acting lessons and some backbone. Basically it makes transformers the movies look logical. And even the prequals look ok. I wish I could get my money back from watching this film.","true":true}