{"101487":161275,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Overall decent movie but very disappointing\\, literally takes every single thing people had to speculate on from The Force Awakens and throws it in the trash like they didn't even care\\, maybe this will lead to a bigger twist in episode 9 however there was nothing here to lead to believe this. The reveal of Rey's parents was a let down ultimately would have been fine if it wasn't something they clearly built up and wanted us to speculate on. Snoke made 0 sense in this movie and because of this movie he's less of an impact from the Force Awakens. It's as if they want us to believe that someone from the Darkside just mystically appears before everyone else was dead\\, as the force is a balance between light and dark it makes sense for a new \\\"Sith\\\" to arise\\, however not out of thin air. \\n\\nSo much of the rebellion were killed off due to lack of communication between the characters which was needless and felt only there to make us feel as if they were more likely to go extinct. The movie brought up more questions about the Knights of Ren with 0 answers giving the feeling as if there won't be any answer ever\\, Kylo apparently left with other pupils but they are nowhere to be found. The movie jumped between a few to many stories in my mind\\, giving us a lot of new characters that some we learned to care about but others we have no reason to care for but clearly the movie wanted us to such as the hacker\\, again felt like a large chunk of the movie going towards people making stupid decisions simply to make us feel as if the rebellion was going to die out.\\n\\nThe meeting between Luke and Leia was underwhelming\\, everything felt as if their whole relationship revolves around Luke training and failing Ben as if over the past 40+ years they had no relationship at all.\\n\\nOverall the movie had some fun action sequences and a few humorous moments that made it fun to watch. In the context that this is 1 part of a much larger story the movie is a let down as a solo experience of itself it was enjoyable.","true":true}