{"101487":175747,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi was a crime against the Star Wars fan base. First Disney threw out the expanded universe novels\\, then they decided to rub salt in the wound by filming a train wreck of a movie that goes against fundamental rules set in previous movie installments. The most insulting part is the fact that the science in\\, \\\"Sci-Fi\\,\\\" was thrown out the window. I knew less than a minute into the movie that it was going to be a painful experience when a Star Destroyer came out of hyperspace in orbit of the Resistance base and people literally looked up as if they could hear things happening in deep space. That was followed by the godawful bombing sequence\\, which was made even worse by Snoke's flagship hammering the Resistance fleet with turbolaser artillery in deep space. The obvious facts being that there's no gravity in deep space to make the artillery arc downward and nowhere in Star Wars cannon did capital ships ever need to stop for fuel. They have onboard power generators that last for years at a minimum (fighters and freighters notwithstanding). On top of all that they ignored the rules of hyperspace from all the other Star Wars movies and books and turned it into a WMD. That being the case\\, why didn't the Rebels have a freighter simply hyperspace into the main weapon of the first Death Star when it came into orbit of Yavin IV instead of dozens dying attempting a precision attack via the trench run? That begs a better question: If that's how hyperspace works\\, then why build a Death Star in the first place? It'd be much\\, much more efficient to just strap a hyperspace engine to an asteroid and send it on its merry way to whatever planet you want to destroy.\\n\\nOut of the goodness of my heart I won't go into the terrible directions they went with characters I grew up with. Luke Skywalker died a shadow of what he represented in the novels.\\n\\nIt was as if a million nerds cried out at once\\, and were silenced.  Rian Johnson has no business taking a Polaroid\\, much less directing a major Sci-Fi franchise.\\n\\nhttps:\/\/twitter.com\/DukeSkymocker\/status\/954602723449634818?s=19","true":true}