{"101487":132437,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If you are a Star Wars fan and you love this movie\\, I think you are giving it credit. If you are a Star Wars fan and you hate this movie\\, I can sympathize with you.\\n\\nGood: Space battles are awesome. BB8 Kicks some ass. You get a visit with a character from the previous series and it is fun. Good fight with lightsabers. The movie is gorgeous and has interesting alien designs.\\n\\nBad: Where to begin.... If you enjoyed The Force Awakens like I did and were hoping for an interesting follow-up to the story threads from that movie\\, you can just not bother with this movie at all. None of them are answered and it feels like Rian Johnson purposely ignored the most interesting parts of Force Awakens to mock you for even being interested in those things. This is the first Star Wars movie that ended where I could care less if I ever saw another one. Where they leave the film\\, almost all of the characters are exactly where they were in Force Awakens with subtle changes that don't leave me caring what happens to them. Finn is still running from the First Order\\, but trying to save Rey who doesn't really need saving. Sure he is brave\\, but he was brave in Force Awakens too. Rey is still an untrained powerful force user who doesn't know her parents but has some books that may help her. Poe is a hot shot pilot who's story centers around one of the most dubious plot devices in the movie. A plot device that is so shallow\\, it almost makes his character moot to the movie. Leia is still leading the resistance and Luke is still lost to the galaxy. Kylo does get a big promotion\\, but he is so bad at being a leader you kind of don't have any hope he will do a good job with his new found power.\\n\\nWhere the story ends\\, is not bad and opens the doors to possibilities\\, but they are possibilities you can't even discuss with your friends. These are probably the most interesting discussion you could have with your fellow Star Wars fans:\\n* Will the kid with the broom be important in the next movie? Maybe\\, but we could care less because they spent maybe a minute on him during one a scene in the film so useless it should have probably been cut.\\n* What will Rey do with the books she gets? Start a new Jedi order? They just got rid of the last one. Maybe she could start something new?\\n* Will Finn and Rose marry? Their romance was so forced\\, I could almost say it was unwanted sexual advances on Rose's part.\\n* Will Poe be a great resistance leader? He sure sucked as one in this movie.\\n* Will Klyo be all mean and badass? Probably... he has the biggest change in this movie but he really just has access to more toys now.\\n* Will Luke be in the next movie? I hope that he can redeem himself.\\n\\nI have never seen a Star Wars movie where I have nothing to talk about with other fans except whether we liked or hated the movie. That is why this film is so dividing. It provided no answers\\, but it also provided nothing meaty to discuss either. The threads that Force Awakens gave us to discuss were plentiful but by the end of this travesty of a movie\\, all of those discussions were moot. Welcome to the new era of Star Wars where the writers and director went out of his way to make Star Wars not interesting in the slightest.","true":true}