{"101487":169128,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So\\, yes\\, I? hated the last Jedi. This movie was a severe disappointment and not starwars to me. I? will start with the whole way that Luke was portrayed. Luke is the most Important character in the starwars franchise\\, and in this movie we see him supposedly trying to murder his young trainee in cold blood because he saw dark side potential\\, this is the act that pushed kylo to the dark side. It is crazy for us to believe this is the same Luke that we where left with at the end of return of the Jedi. The Luke that wouldn't kill Vader because he saw good in him would murder a kid in cold blood because he saw dark in him? This makes absolutely no sense and is a huge misuse of Lukes character. Then Luke is strongly against training Rey\\, then R2 shows him the video of leia and just like that he's right on board and starts the next day. Then Luke somehow force projects himself and then dies because of the stress it takes. He could've just came and fought and died and heroic death\\, and possibly fought kylo similar to the way that Ben did with Vader. I don't necessarily hate that he went into the force like yoda did but I hate the way that it happened. \\n\\n Now on to our heroic princess Leia. In one of the first scenes we see the ship get hit and everyone in the bridge die (including Admiral Ackbars death) except we see Leia floating in space. The audience assumes this is her death as ice crystals start to form on her. Then she starts flying toward the ship and remains safely on board. The look awful and stupid and made no sense. Then leia ends up alive and in a very pivotal role at the end of the movie leaving us with no clue how they will deal with the passing of Carrie Fisher in the next movie. \\n\\nI? think I? hated Finns character the most\\, his whole story line was stupid and pointless. First off he for some reason was trying to leave the ship so that Rey could supposedly find him and be safe? This made no sense for the character and what we saw from him in the force awakens\\, in which I loved this character. Along with him came Rose\\, a very forgettable character that I did not care about at all this just dragged this story out even more. \\n\\nBoth snoke and phasma where severely disappointing. We got no backstory or context on snoke and he did nothing the whole movie. Then he just dies out like it was nothing. Phasma dies after like 2 mins of fighting\\, we finally got the Finn \/ Phasma showdown and it was a huge disappointment. \\n\\nAll the new characters introduced where easily forgettable and not interesting. We don't get any good answers to anything at all. It was way too much like a marvel movie it didn't feel like starwars. There was no real plot or reason to the movie.. The force was over and misused. No real character development.","true":true}