{"101487":110833,"Last Jedi":"Last Jedi","2017-12-15":"2019-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Bottom line: Terrible screenplay with poorly thought out consequences\\, unwanted social and political commentary. However\\, it has spectacular visuals so that you won't notice any of that other stuff.\\nWent to the first showing of this movie on the day that it was released. Many of the audience arrived early and stood outside in freezing temperatures waiting for the theater to open\\, energized by the cold we were mostly chatty and excited. Wow! What a change the next three hours would bring! This has been the only Star Wars release which I have attended where nobody in the theater clapped or cheered during the end credits. The audience members walked out eerily in dead silence with no discussion of what they either liked or disliked about the film. \\nThe movie was full of jokes with the plot being the biggest one of them all. Out of all of these clever jokes the audience only laughed together once or twice together. There was one person that laughed from beginning to end and actually sounded like they might have been drunk- she even laughed when Leia was blown out into space. HAHA! Indeed! It seemed like the audience may have gasped more times at the movie than laughed at the imbecilic jokes that were offered up in every single scene. If my memory is correct there were three collective gasps and only the aforementioned one or two collective laughs (which seemed more uncomfortable than amused.) Is that really what they were going for?\\nStar Wars movies are no longer for Star Wars fans: this has been demonstrated by the words and actions of those currently involved in the production of this franchise. Why acquire a super successful film property just to rework it into something that is more similar to Transformers than the original Star Wars? Big budget films that spend everything on special effects while possessing an inconsequential story is what we can expect out of Disney from now on. The pre-Disney films were able to excite people's imaginations and keep us buying merchandise\\, books\\, video games\\, and talking about this far away galaxy for decades. It seems doubtful that these new films will be regarded kindly in time\\, if they are given any regard at all. \\nIf you happen to be a Transformers fan then perhaps you will enjoy the new Star Wars content. The new movies are bright and shiny and full of oohs and aahs with none of that annoying story to follow and nothing to excite your brain about. Star Wars is now just pop entertainment\\, they don't want us to think about it and they don't want fans to criticize it. This is Placebo-Star Wars.","true":true}