{"101487":153311,"Last Jedi":"Last Jedi","2017-12-15":"2017-04-12","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Maybe don't read if you haven't seen it. I write my reviews for myself\\, and\\, while I avoid outright spoilers\\, I don't intend this to be for other people. I felt like I was always waiting for some thing to happen\\, and whenever some thing happened it was never it. Maybe it's because I am not a big Star Wars fan--or maybe that is why my rating is not lower--but something about the ultimately inconsequential actions and pseudo-immortality of characters has left me disappointed. Perhaps that is why I liked Rogue One so much. And on the topic of characters\\, the movie suffers from its minor characters and it's unnecessary subplots. I would trade both Rose and Admiral Holdo (more so Rose) in a heartbeat for one single second longer of Captain Phasma on screen. I also can't get over the rehash. I looked past it in Episode VII\\, but I can't any longer. I tell myself that these reoccurrences are simply the Force working to balance the Universe or something\\, but I just want some originality. Now this movie isn't all bad. In fact\\, there enough redeeming factors for me have liked it\\, but I'm afraid that is all: I simply liked it. Adam Driver and Daisey Ridley are both fantastic. The score\\, as usual\\, was not to be dismissed. Many shots were so visually beautiful. One memorable scene left my jaw agape\\, and as silence fell over the theater I felt like I had gone deaf. It was that stunning. I want Episode IX\\, but really I think I just want more Kylo Ren. I don't think I'll be seeing Episode XIII again.","true":true}