{"101487":148733,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-04","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just Watched on Netflix\\nAs a stand alone movie\\, there were many rushed plots that made me feel like I had missed a scene or two. The jokes were flat and seemed out of place (Maybe they were going for a Marvel feel?) Visuals were great. It felt like a collection of hastily told short stories stitched together. All the characters were very shallow having only one or two main traits. The ones from The Force Awakens had the benefit of a whole movie. The ones introduced here don't have that benefit and because the plots and scenes are so rushed and under cooked\\, I am left feeling like this movie wants me to like the characters but doesn't give a reason to. All together it makes the whole production feel contrived. \\n\\nAs a Star Wars fan for nearly 20 years\\, I didn't know what to feel. I liked the prequels\\, played the games\\, listen to the sound tracks\\,watched the series and rogue one was quite enjoyable. I hated the Force Awakens but whatever. This...It was like watching a direct to DVD sequel of a classic Disney Movie.it LOOKED like Star Wars but none of the charm. The First Order is made out to be petulant or buffoons. This looks like a Star Wars movie but doesn't feel like one. That's really disheartening because Rogue One told it's own story and brought the visual effects that'd youd expect from a top tier production and I assumed this would be 10x better but it wasn't. This felt like Mulan 2 or Pocahontas 2 in terms of looking like the classic but lacking the quality.  I'm really glad I didn't pay to see this.","true":true}