{"101487":104545,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A poorly done film to the legendary Saga of Star Wars\\, The Last Jedi ruins any amount of logic that Star Wars held dear. The potential that The Force Awakens sets up is now crushed by this sloppy film and ruins the original characters by making utterly no sense nor connection to the original movies; almost as if the only connection this movie had to Star Wars was to bring back original cast members\\, but only to butcher their characters and push the new characters into play. The Force Awakens made Finn an enjoyable and fun character\\, but in this film he is boring and serves as a dull comedic act. Rose Tico is even more boring as she decides to travel with Finn to save animals from their stables rather than save her dying crewmates in space. Poe Dameron is an utter fail as him and Holdo battle it out for who's in charge. Poe becomes an utter disrespectful and trashy character unlike his previous self in The Force Awakens and Holdo would rather kill herself than share her plan to save her crew or use a droid to sacrifice themselves to drive the ship into the First Order. Luke Skywalker is utterly and totally wasted in the film as he is supposed to emulate Yoda from Empire Strikes Back\\, however they decide to make him a grumpy ex Jedi who refuses to teach Rey any significant power. Rey is somehow able to master her powers just by being told to reach out to the force and manages to save her friends from their impending doom. The allpowerful and hyped up Snoke is killed off immediately for shock value and does little to actually explain his role in even being in the previous film. Captain Phasma is yet again wasted\\, with her fighting Finn for a minute before being knocked into an explosion and again being wasted of any memorable or interesting detail. Kylo Ren and General Hux serve as the best aspect of this film\\, as their characters actually seem to grow; as well as DJ who is amazingly done and serves as a great addition for a deceptive villain. Also the movie delivers some wonderous effects and a scene or two manage to capture the fancy of being cleverly shot - however these minor details aren't enough to save this pitiful stench of a film to even remotely save the franchise. Too much logic and too many characters were ruined in this film - begging the comics and novels to somewhat make up some explanation as to why they all changed into such horribly written fan fiction garbage.","true":true}