{"101487":131095,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-13","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't like what they've done to Luke Skywalker. The once enduring hero of the entire Star Wars brand whose rise from an obscure feeble boy to overcome insurmountable odds and unimaginable cosmic adversity\\, rose to eliminate all evil and restored order to the galaxy.\\nThis was only made possible because he himself arrived at the pinnacle of his highest potential\\, as is the Jedi Master. Established as one with the inner all pervading\\, ever present indomitable force for all time. \\nHence even his screen presence without a script in the previous movie was enough to empower the audience to a sense of the highest authority which one comes to expect within the full embodiment of all things associated with such a Master of the force. \\nThe full value of Star Wars is built upon the unshakable principal that the highest good is found within a selfless heart that can and will overcome evil. And at the basis of everything there is a force within us that sustains all existence. By sacrificing the limitations of ones own divided intellect and submitting to the holistic force albeit under the enlightened tutelage of two Masters (Obe One & Yoda) you are can rise to become One with the force. \\nNow Skywalkers character has been degraded from the all powerful timeless Master of all things to a disgruntled\\, dischevelled train wreck who accepts wise counsel from his novice disciple. May the force be with you...What a travesty! \\nWhilst it's the role of Hollywood to create drama the twists to this character has effectively thrown the very principles which made the Star Wars a franchise under the bus. \\nHollywood might not rate too high on the topic of enduring core values. That's precisely why Star Wars has been world class franchise because the story until now had remained true to its values. \\nWhat a shame.","true":true}