{"101487":196298,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where to begin. If you know little of the Star Wars Franchise then you may be forgiven for loving this movie. Its many plot holes\\, weak characters\\, and childish moments create a lackluster experience. I will begin with the characters. \\n\\nFirst up is Rey. No matter what anyone says she is a Mary Sue. Her only struggle is emotional throughout the whole movie. I understand this is a nerd point but every other Jedi has taken years to learn the discipline needed to wield and understand the Force. There is 0 explanation given\\, let alone a plausible one given\\, as to why she is so freaking strong with the Force. Most of her character is wrapped in this identity crisis yet she overcomes every obstacle in front of her with ease. Her redeeming quality as a character is her foil to Kylo Ren. The new trilogy has thus far done a nice job developing how they are in some sort of symbiotic relationship. \\n\\nThat brings us to Kylo Ren. Why am I supposed to fear him? He has been bested multiple times and does little to instill a believable fear in the audience. It all goes to his master\\, Snoke. Here\\, there are two redeeming qualities. First\\, Driver portrays the character well especially the conflict that is internal. Second\\, we can't have a good foil in Rey is Kylo Ren doesn't provide the opportunity. \\n\\nSnoke is another problem. We finally get to see him \\\"live.\\\" He is truly powerful and the first one to render Rey vulnerable. His whole plan and connecting Rey and Ren was great. He needed much more explaining and background. Reaching back to an old canon connection would have driven this movie so much more than the mystery that still exists. I suppose they clear it up in the final installment. \\n\\nHow about another character that got short changed. Captain Phasma was quite BA in Force Awakens and Last Jedi until that final fight with Finn. Such a tough and scheming character deserved both more screen time and a better end. The worst part is it wasn't really Gwendoline Christie's fault. It was the result of being paired the personal bad guy to Finn\\, the worst character of the new trilogy. \\n\\nFinn is the worst and that's not a dig at John Boyega. I think Boyega is doing the best he can with a flawed character. No character growth or change\\, cheap one-liners\\, and a lack of seriousness that makes Finn feel like he was pulled out of a teen movie. \\n\\nNot a fan of Chewbacca being used for cheap gags.\\n\\nLuke's character and actions make some sense. Then there is the weird \\\"burn the old stuff down\\\" moment. Yoda offers great advice to Luke about being present but why would that necessitate the eradication of the past? \\n\\nHux is an 8 year old pretending to be a general. \\n\\nThat brings us to the brighter characters\\, Poe and Leia. Poe's arc in this movie was great. He was guided the whole time by Carrie Fisher's General Leia. Their relationship was amazing to watch as a reckless Poe is brought to heel by a strong Leia. Both characters were brilliant. \\n\\nOverall\\, I do not like the way Disney is heading. The cheap laughs that sucked the prequels down continues. Basically\\, the Last Jedi can be summed up in the opening scene. The cheap laugh as Luke tossed the lightsaber over his shoulder later makes you feel duped and used. But hey\\, lasers\\, lightsabers\\, spaceflights\\, and some bomber  pilot BA from the opening battle makes it a good movie on a superficial level. Suspend all critical thinking about storytelling or the mystery that Star Wars were in order to enjoy the movie.","true":true}