{"101487":100780,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"ahem...\\n\\nIf I was Hux\\, the moment I saw the painfully slow bombers come near to Snoke's ship\\, I would have ordered to move that ship some km away...\\nToo easy?\\n\\nRian Johnson is a tool. He copied some pretty awesome views from old WWII films and he pasted them into this space movie.\\nToo bad he forgot to apply space rules to them.\\nSo we have colossal gaffes:\\n\\n- Extremely slow Bombers. The enemy would have all the time in the universe to move the ships before the bombers even got near to them.\\n\\n- Bombs in space. Ok\\, they look good but... Gravity in space?\\n\\n- Ships which need to get fuel. In space\\, if you accelerate something and then stop accelerating\\, it will continue with the same speed forever\\, without the need for any fuel. Do you know it\\, Rian?\\n\\n- Fuel? Gasoline? Naphtha? What the fuck\\, Rian? When I heard fuel\\, I was expecting dark smoke clouds coming from the rear of the ships...\\n\\n- Laser beams that lose power after some distance? In space without any resistance? Or there is air in space? Which would also explain why Leia survived and no one got sucked out of the ship when they opened the door. \\nI suspect that Rian Johnson thinks there is air in space...\\n\\n- Laser beams that move in arcs? Really? No straight lines? That is a first! And what the hell curves their trajectory? Again\\, gravity? In space?\\n\\n- Ships without shields? Are they all suicidal?\\n\\n\\\"It is time for Rian to end\\\" \\nMaking movies\\, at least.","true":true}