{"101487":183664,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie deserves some credit for the awesome visuals and engaging action sequences; however\\, as a Starwars film and as a sequel to TFA\\, it completely dropped the ball. \\nLuke is not the man he used to be; an old\\, resentful has-been\\, wallowing in his own misery just waiting to die. Are you kidding me? \\nThe real issue with this movie is an absolute and utter disregard for everything and anything that came before. That's right\\, they just decided to throw it all out the window. Were you one of those fanboys who spent countless hours theorizing over Snoke's possible origins or how he developed a connection with Ben and lured him to the dark side? Well screw you!!! Were you one of those people picking up hints here and there alluring to Rey's true lineage? Well screw you too!!! Were you one of those people who thought Poe Dameron was a likeable\\, promising character? Well screw you triple!!! Did you actually expect Finn's little side quests to result in anything meaningful? Well you must be an uneducated junker from some backwater like Jakku. \\nThis entire movie was an exercise in futility. Nothing meant anything!!!! Apparently the force is something you can master overnight by just sipping green milk from the tits of sea giraffes and spelunking into dark caves. Oh well\\, so much for intense Jedi training? \\nUpon viewing this film you will inevitably be confronted with Kylo's maxim\\, \\\"Let the past die. Kill it if you must.\\\" Are you willing to embrace the darkside which this movie embodies? Or will you choose to cling to the light? The choice is yours.","true":true}