{"101487":158961,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Okay\\, Let's start off by saying l only think this deserves 2 stars because it's a star wars movie.\\nOff that note\\, I could be here all day with the flaws in the movie but I will keep it short and simple. \\nTo start off the Scene of General Leia flying through space back to the ship\\, for lack of a better word was one of the dumbest things I've ever seen on screen to this date.\\nSecond off there was no actual reason to care for any of these characters in this film. The character development was atrocious  and gave me no reason to care about relationships between any characters\\, besides maybe Rey and Luke.\\nThird comes the literal slow motion space chase. Since when is fuel a problem in any star wars movie ever? That has never been a thing and is something they made up to cause a plot to \\\"develop\\\" a horrible one at that.\\nNow let's go to the worst plot of the movie. Finn and Rose. I have said this since episode 7 that Finn's character was whiny and annoying and this still stands true in this movie. Finn's purpose is to literally run away from his problems it seems. The whole plot with him and Rose was the most pointless plot in the movie and the whole Casino scene was not needed even the tiniest bit. They sent them on this mission giving them a ton of screen time to have none of it work out at all. Now Finn Killed Captain Phasma and what drive does his character even have now? None and I thought he was boring before\\, boy is episode 9 going to be exciting for him.\\nThen there's the fact of every thing that was set up in Episode 7 either being completely destroyed or completely ignored. I've found out more about certain plots from episode 7 watching interviews of Rian Johnson. Touching on the subject of the director. WHAT WAS DISNEY THINKING? Giving this guy a whole triology after this. May God have mercy on our souls.\\nMy last item on my \\\"short\\\" review is how the beloved Last Jedi(Luke) was handled. Everything I know and read about Luke has been destroyed by this movie. Luke the most powerful Jedi to ever live in Hiding and literally scared because of something he may or may not have caused. The only justice this movie did for him was showing he had the power to literally move himself as one with the force and cause manipulations just like Snoke did to Kylo. And that Green Milk flashback they tried to do to episode 4 with the Beach animal was ridiculous. Like I said I could keep going but I think everyone gets the point.","true":true}