{"101487":149756,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Let's face it - this movie was a mess... the script was dull.  Luke's story ended in the worst possible way\\, it was not worth to wait 30 years to see Luke Skywalker fighting against his nephew as a... force projection. Another thing is that the resistance led by femine \\\"leaders\\\" ended up with no military power\\, no allies no future at all\\, compressed in the Millenium Falcon (heh..). I hope that Hux and Kylo Ren will easily shoot it down in the beggining of ep9.. Falcon is an old vessel that still may be tracked by 1st Order... To be honest feminist girl \\\"power\\\" stuff  injected in the storyline led to total anihilation of the resistance... The only strategy was to escape and hyde - pretty much girl alike ;) evil supremacists chase good minorities what a cliche :)) Rey - a potential jedi heritage successor is totally unatractive as a character . From now on we we can get any orphan in the galaxy and make him or her new semi-god with no jedi training and skills... let's tell everyone that the orphan has great power and that's it  we have a superman with no background and no history :) and the last thing -  Finn's character was a shame for Black audience - after watching so called episode8 I imagine him as a coward who flees anytime he seeks the opportunity to do so (twice in TFA: as a stormtrooper\\, after Maz advise him to talk to smugglers\\, once in TLJ: when he gets stunned)\\, later on his moment of glory is taken away from him by asian chubby girl.. shame she didn't kill him during the impact...  yet there were some good special effects and that's it. I hope someday Lucasfilm will return to it's roots until then I leave new SW motion pictures to others and return to EU books (unlike new-Yoda in TLJ I find books still very attractive:) Respect to all who hated Johnsons's sci-fi movie inspired on the true Star Wars universe.","true":true}