{"101487":147035,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was very disappointed.  If you haven't seen it yet\\, do not read my review because it will be full of spoilers.  I am shocked that with the amazing amount of money and talent that went into making this movie\\, the writing ended up being so terrible.  There were holes in the story line everywhere.  I don't know if a ton of stuff was left out during cuts\\, but it felt very much like the movie moved along with lots of new force magic that was rooted in nothing (Leia flying).  I assumed Luke would train Rey the way that Yoda had trained him so that it would make sense that she suddenly became this incredible fighter.  How many times was she told \\\"you need a teacher\\\" in the Force Awakens and this movie and yet she actually didn't really need one at all.  There were moments that were meant to be heartwarming (freeing those horse like animals at the casino city)\\, but they weren't heartwarming because the audience barely had a connection to them.  The new character (Rose) seemed pointless\\, but maybe she will prove what why she was such a huge part of this movie in the sequel.  The way Luke dies in the end can only be described as anticlimactic.  It felt as though the movie moved in an awkward way from one moment to the next hoping that the audience would simply love it based on their love of the prior movies.  Snoke is killed rather easily and we are left to continue to wonder who he was.  The best thing I can say about this movie is that the cinematography was fantastic.  That aside\\, I can only say that it was a total let down.  I'm so disappointed in your Disney.  You had so much to work with and did\\, unfortunately\\, a pretty lousy job.","true":true}