{"101487":173585,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The biggest problem with this film is the plot holes. Regardless of how die hard fans and casual movie goers feel about star wars and its rich legacy and lore. There are too many plot holes to willingly suspend disbelief; which is quite an achievement for a film franchise set in space with a variety of alien characters and an all encompassing mystical energy. Characters make decisions that don't make sense Even to people that don't know the characters so well. There is an entire \\\"side quest \\\" sequence that's so self indulgent and non-sensical it massively detracts from other\\, more interesting drama that is happening elsewhere in the film. Another issue is a lot of the humour just lands flat. Out of (for example) 10 jokes\\, only 1 lands. It's nothing to do with the context of the jokes\/ funny moments either; it's that the jokes are in and of themselves unfunny\\, and so only serves to further detract from any drama that was developing. Some character arcs are interesting and well thought Out\\, but it's not enough to save the movie from the arcs and development that are lazy and hacky.  Certainly Dameron Poe's arc is uninteresting and stereotypical\\, and what was once a potentially interesting character now just feels like a tack on into the universe to make another \\\"loveable rogue\\\" character. Some of the action sequences are well executed and feel impressive against otherwise flat and lifeless moments. The last 1\/3 of film almost saves the movie which goes to great lengths to avoid previously established ideas and contonuity; but tragically again plot holes throughout the last part of the film detract from a few otherwise good moments that were built up and well executed. Lukes final scenes certainly do enough to raise the stakes and cause goosebumps\\, but the action and plot going on around these impactful moments once again make them largely irrelevant. The score itself stands out as always but overall a few good moments aren't enough to save this mess of a movie which caused a significant amount of furrowed brows and audible \\\"what? How?\\\" During the screening I went to. Myself included. A disappointing addition to what was a promising start.","true":true}