{"101487":149794,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Let's start by saying this is not spoiler free. Now that said if I could give a 0 I would. Do not believe the critics or any of the blatant Star Wars homer fans. This movie is terrible. The plot is a rehash of the OJ Simpson SUV chase only with space ships. Oscar Isaac continues to be the most uncharismatic character ever. The movie contains a random\\, completely out of place Casino world where our heroes get arrested for a parking ticket. As if that's not enough\\, all the build up about how powerful Snoke is. Ends with him getting no explanation or character progression. He's unceremoniously killed off. Phasma returns about 2 hours in becausetjey apparently needed a cool fight and then she is killed off with roughly 5 minutes of screen time. Oh the mystery they built up about Rey? Her parents were junkie nobodies.  But let's add in a split second love story for Finn that has no place or given any time to seem remotely plausible. The movie seems written by someone who hated TFA and wanted to do their own thing and gave no effort to expand on what was built\\, so instead they ended all those storylines and killed characters rather than build them up. The writers couldn't even explain their own storyline. They build up Rey's training like there will be some evil entity in the bowels of the island. Send Rey down there and then inexplicably drag her back without really doing anything with it. So many scattered random scenes and none even seem to fit with one another. Blatant lazy story telling. Kris's entire bridge of her Star ship is blown I and she and everyone get sucked into space to die. Leia uses the force to pull herself back into the bridge and our heroes promptly just open the door and let her in. Never mind gravity and space and how that would suck them all out through the huge hole that used to be the bridge of the ship. Our heroes later take escape pods to escape the ship after is almost out of gas 2 hours into the movie and someone has to stay behind to keep the ship driving as a decoy. Apparently autopilot isn't invented yet in a galaxy far far away. These lazy writers could t even bother to say it was broken or something. Just a pointless character death. On and on. Scene after scene\\, everything is randomly cobbled together. It's as if the writers felt they could put anything on screen no matter how poorly written\\, slap a Star Wars label on it and that's all anyone would care about. Obviously they were right when I see the blatant homerism of the fans and critics. Do not be fooled. This movie is terrible from start to finish .","true":true}