{"101487":130627,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I didn't think it could get worse after the Force Awakens. But it did. It got so much worse and way more offensive. *some spoilers will be present*\\n Just like the first one they did the worst job imaginable setting up the movie. At the end of the last one the Republic had just one a pretty major victory but suddenly the republic apparently has been been crushed and most of the galaxy is falling to the Order even though basically there is no delay between films. Terrible fundamental chronology and context. \\nNotably it has less of the good Rogue One humor and more cringe worthy Disney comedy that belongs in one of their terrible tween shows; the sort the Force Awakens was so rife with.\\nThe fundamental plot was also kind of a joke. The ENTIRE plot is set against the backdrop of basically a highway police chase in space. Somehow it is FINE that the entire movie\\, no joke\\, the same ship is getting shot at and chased but somehow is just gonna keep running until the hero's finish their 2 hr movie to come save them... It felt severely  dumb and not even remotely imaginative. Tons of plot problem for the rest of the movies past and future were created with weaponizing hyperdrive which was retarded.\\nThis was probably THE MOST politicized movie I have ever seen. The movie openly calls all rich people evil at one point for starters. It meat shames and pushes vegan diets at another. \\n It was done to the point it was offensive. The bad guys were exclusively 100% white men with 1 exception. Goods guys were 50% women and diverse. So every little white boy who watches is supposed to only be able to think they are bad? Women empowerment up the wazoo. A political piece if there ever was one and a complete defacement of the Stars Wars IP on the grandest scale imaginable. I will hate disney FOREVER now. Well done you corporate A holes...","true":true}