{"101487":169459,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS!!!!\\nDisney! You fucked it up!\\n\\nThis film deceives with beautiful cinematography and a few great ideas (Mind-link between Kylo and Rey.\\n\\nBut the rest (60%) is a bag of shit and waste of time (and money).\\n\\nLuke\\, Rey and Kylo are good and interesting characters.\\nEven Po Dameron is ok!\\n\\nStrange things:\\n\\n- Bombers at the beginning burning in space like \\\"helium-zeppelin-balloons\\\"\\n- Bombers at the beginning dropping bombs in \\\"space = vacuum = weightless space = no gravity\\\"\\n- too many females on the ships on both sides! Pandering to feminist?\\n- females often small and chubby! Is that the \\\"space navy\\\" without physical fitness?\\n- many asians and black people! Diversity is nice but in \\\"star wars\\\" in that amount just serving \\\"SJW\\\".\\n- New Order trailing \\\"rebellion ships\\\" like on water! Is that a pirate movie on sea?\\n- \\\"male are idiots and females are always right?\\\" > that is reverse-sexist behaviour\\n- Luke´s character is totally portrayed wrong by Rian Johnson!\\n- the whole Fin & Rose storyline is tooo long....too boring!\\n- the Casino Planet scene is also too long and too boring\\n- Leia is 30 seconds in space and then she pulls a \\\"superman\\\"! No......No....Bullshit scene!\\n- Admiral Akbar with 40 years of experience as Officer and Admiral dies in a pittyful scene.\\n- Laura Dern is an Admiral but with pink-violett hair and she doesn´t wear uniforms?\\n- the secret plan of the \\\"females\\\" is stupid and not military strategy!\\n-Luke says \\\"I will teahc you 3 Lessons\\\" but then he does only one lesson????\\n- Daisy Ridley is skinny at the beginning of the movie and then gets \\\"chubbier\\\" to the end! Why?\\n- Snoke is \\\"nobody\\\" and is killed away without reason.\\n- the guards of snoke are \\\"really bad fighters\\\" > the fight scene is boring\\n- Phasma and Fin > most boring fight in history\\n- every 10 minutes some says \\\"forget the jedi\\\"\\, \\\"leave the past behind\\\" > Rian Johnson wants to kill of \\\"classic star wars\\\" and wants to start new characters!\\n- Dialog scenes and speeches are stupid (except the Rey & Kylo scenes and some of the Luke speeches).\\n\\nI will not watch Star Wars 9! Will not pay for it.\\nDisney lost me as customer! I will read my \\\"timothy zahn books\\\" and watch episode 4-5-6.\\n\\nDisney wants a \\\"neo-feminist\\\" \\, \\\"children & merchandising\\\"\\, \\\"everyone can do it\\\" and maybe in Part 9 with \\\"LGBT characters\\\" in Star wars. This is not star wars!\\n\\nIn my cinema 2 people in the audience said \\\"Its like star trek\\\".\\n\\nIf the audience is saying\\\" Star trek\\\" in a \\\"star wars movie\\\" someone fucked up (Disney).\\n\\nIf you are shallow\\, just want nice pictures and stupid sci-fi (including the message \\\"males are idiot and females are always right\\\") then watch it.\\n\\nStar Wars is dead!","true":true}