{"101487":168521,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Some of the user reviews here are being WAY TOO critical. (Spoiler alert!) This is a spectacular film and IMO one of the best SW films ever made. The action scenes are jaw-dropping\\, and the connections to scenes and characters from the very first trilogy are emotional e.g. Luke reuniting with R2\\, and Yoda's visit with Luke\\, who still treats Luke like the impatient student he once was\\, regardless of Luke's age. It's truly reminiscent of the interactions between Luke and Yoda from Empire. There are twists in the story that are unexpected. At over 2.5 hours\\, it's a bit long though I still came away from the theatre immensely satisfied.\\n\\nStar Wars has such a following and fans are so emotionally tied to these films that it's natural for fans to have opinions. In my opinion though\\, some of the criticisms here are just ridiculous. Yes\\, Snoke was taken out seemingly without much effort and people didn't get their theory validated. So what? There's more SW to come and maybe an explanation is still coming\\, folks. Yes\\, Luke is grumpy and jaded. It's 40 years later folks and he's had a tough life since bringing Vader back to the good side. Ask someone who is 60 whether they're the same person they were at 20. Give me a break\\, people evolve\\, life happens! Luke is not Obi-Wan\\, peeps! Yes\\, Leia uses the Force (or vice-versa?) to save herself after being blasted into space. Why is that so far-fetched? So what if you've never seen the force used like that in previous films.\\n\\nThis is an amazing film. I can't wait to experience it again!","true":true}