{"101487":175751,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi was a DISGRACE. I don't know where to start! I do not remember a single thing that I actually liked about the movie except the robot ironing the Sith wardrobe and the nice looking CGI (and silence) when Laura Dern (posing as some middle-aged hipster you'd see working at a vegan\\, nonbinary coffee shop in San Francisco) took the small ship and blasted through the other one in light speed. Almost everything that happened in this shitty movie worked against it. None of the plot twists were exciting enough to justify their existence! And what the fuck were these half-baked political messages they tried to ram down the audience's throat with some feeble dialogue about a rich-people planet. That entire location could have been done away with and nothing would have been lost. Most of the characters were like that as well. Rose was underdeveloped\\, impossible to care about\\, andLUTERALLY DID THE OLD MARTIAL ARTS MOVIE DEATH!!! FUCK YOU DISNEY!!!! FUCK YOU MICKEY MOUSE!!! YOU FUCKING HEAR ME?!?! YOU FUCKING SCARY MULTIBILLION DOLLAR CONGLOMERATE AMOEBA!!!! Those weird owl-penguin things were literally thrown in BY THE MARKETING DEPARTMENT so that they could sell some fucking toys\\, or at least that's my theory. They really gave us NO REASON to care about any of the main characters. NOTHING OF SUBSTANCE. FUUUUUCK. This is a poorly written review\\, I understand\\, but it's because I am beside myself. I just don't know how to cover all the bases here of how fucking wrong this movie got EVERYTHING. TWO AND A HALF HOURS COMPLETELY WASTED.","true":true}