{"101487":178791,"Last Jedi":"Last Jedi","2017-12-15":"2020-04-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There were so many inconsistencies and problems with this movie. How do you even begin. First of all\\, Disney is just hell bent on destroying the origional cast. Poor Luke.... they RUINED him. How can you turn one of the most beloved characters in all of cinema in a matter of 5 minutes. \\\"Let's turn him into a bratty five year old who doesn't want it anymore\\\" they must have said. They ruined him so much I was a little happy when he died. That's crazy. And talk about a horrible ending. You set up snoke as this big bad guy only to kill him in a split second with no big pay off at the end!? Dude I got sent back to thoughts of highschool blue balls watching that \\\"scene\\\".\\n\\nBut then... there's the inconsistencies. The last movie ends with a solid win for the rebels\\, and then picks back up with them LITERALLY ALMOST EXTINGUISHED.  The goal of the last movie was to give Luke back his saber... and he throws it away like it's trash. The first movie sets up Rey's parents as something special... then only to be let down in the second movie. And don't play the whole \\\"but she was palpatine's grandaughter\\\". BS. Why tell us they aren't important just to let us down for no reason??? There's no pay off in that. Let's have the big bad destroyer struggle to catch up to a ship who's already on their last straw and can't jump to light speed. BECAUSE THAT MAKES SENSE. Then Leia is magically a Jedi!? How the hell does that make sense!? They ruined Han for this!? I can go on and on but I'm sure you stopped reading. Thanks for ruining Star Wars!","true":true}