{"101487":138485,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"In TFA\\, Han Solo declares - \\\"That is not how the Force Works\\\". Too bad he was not still alive to tell that to Rian Johnson.\\n\\nLast Jedi is the 8th part in a 9 story arc and quite honestly was completely unnecessary to try something new in this film. It needed to be faithful to the plot\\, story and characters that preceded it leading to the finale. Johnson was getting a separate trilogy of movies which he could use as a playground to experiment new ideas with.\\n\\nIf HARRY POTTER in his 8th film tossed aside his magic wand and declared he wanted to be a Muggle and didn't want to fight Voldemort - the audience would have been critical and upset. Because that story development would have been unfair to the story\\, the character developed and more importantly a slight to the fans who made the franchise successful. That is the type of butchery that happened in this film.\\n\\nAs I read the reviews\\, I am noticing a trend. The critical one star reviews are usually book-long thoughtful criticisms with many points whereas the glowing 5 star reviews are short with two sentences of the same points - \\\"new direction. One of the best yet. Saw it three times.\\\" That makes me feel like the 5 star reviews are actually the shill reviews\\, not the other way around like we are led to believe by bloggers.\\n\\nI don't care about the obvious political commentary peppered throughout but at the same time I can't help wondering why feminists are holding up this movie as a film depicting them as good leaders. The female leadership plans were to evacuate three times during the course of a single movie and led to the resistance being wiped out. The movie began with an evacuation\\, then they evacuated the last capital ship\\, and then they evacuated the planet which they just evacuated to. The one thing that this film taught me is that if there are female military leaders then you should keep your bags packed. Because you will be running away. A lot.","true":true}