{"101487":129531,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am not a huge fanboy of starwars\\, i mean i have not read the novels or the other comics\\, i dont have any actoon figures or video games. But\\, despite that I have watch all the films and have been a fan of the franchise. Star Wars always was able to bring magic and mystery and their storytelling. And also have a significant family element with the Skywalkers.\\n that being said I was very excited to see The Last Jedi especially with all of the group of you saying how it would be one the best Star Wars films. However\\, my personal opinion this might be the worst of the films. The prequels although they were cheesy and had very poor dialogue and acting at least kept up the lore and mythology of Star Wars. The Force awakens was able to play on this even though it did seem quite right and a repetitive story it came to a new hope.\\nThe Last Jedi completely ruined in mythology and magic of the Jedis and a Star Wars in general. He also was just poorly written with many plot holes. Poor character development. And very unsatisfied answers to questions that were set up quite well in the force awakens.\\nAfter leaving the theater I was somewhat disappointed but the more I thought about the plotlines and the story in general\\, I feel as if they effectively tried to kill off the old Star Wars to make room for an ongoing franchise where they could bring a new characters and establish new storylines. Which seemed to me is a complete tragedy. Especially the treatment with the Skywalkers.\\nOn a positive note the action sequences and cinematography was actually quite good. And I would love to give it more stars as I have like Star Wars in the past. But I am just so upset with the treatment of the storyline and its main characters.","true":true}