{"101487":188994,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"TLDR: This unnecessarily 'gritty and dark' version of a classic space opera is a waste of money and attention. Save your money and don't watch it or buy the OT and PT on DVD and the books and pretend the new trilogy doesn't exist.\\nI have so many issues with TLJ. I watched this film twice....TWICE! Not out of enjoyment but out of hope that maybe I missed something vital that would tell me why this was considered a good film. I felt even worse after watching this trainwreck of a film a second time. The first time it ended I felt as though there was no hope left for SW but after watching it the second time I was crying in horror. \\nI have seen many defences of this film saying that SW fans are butthurt because the film is 'original' 'nothing like the other trilogies' or 'has a different portrayal of Luke'. Yes I am a long time fan of SW but I can also appreciate new interpretations of source material as long as it's a good and enjoyable film. It was a mediocre film at best. There was little plot apart from a two and half hour chase between the First Order and the Rebel Alliance\\, most of which could have been cut or been avoided by not purposely avoiding common sense (here's looking at you Holdo). The Casino scene which is shoehorned in the middle of passable action achieves pretty much nothing but gives the movie plenty of opportunity to pile on lazy exposition and avoid coming up with a useful way that contributes to the plot to show the audience why they should care about the Rebellion's fight against the First Order. I understand that it is world-building but that should not be done through exposition and in the middle of the damn film. As for being original\\, several scenes were pretty much  an amalgamation of The Empire Strikes Back and The Return of the Jedi\\, which I don't have a problem with. I enjoyed the callbacks to a New Hope in the Force Awakens (which is a good film) but to use 'it's original' as defence against criticism is a falsehood and a poor defence. \\nThe main theme of this film is to 'let the past die' which is Rian Johnson goes out of his way to butcher everything that made the OT special. Luke isn't as much as a hero as he was previously\\, he's now a mean\\, cowering hermit completely unwilling to help his friends. Anyone can use the Force now without training (I know Leia in the books had some Jedi training but that was not hinted in the films and to an average viewer it came out of nowhere)  and Rey is officially a Mary Sue who can use the Force easily without any training when it took Luke soooooo long to master it. Even a random untrained kid had an easier time using it than Luke did apparently. The Jedi apparently had no redeeming qualities and Luke has now done a 180 and has decided the Jedi should end. This Luke is not the Luke of the OT even Mark Hamill had to think of him as a completely different character. \\nThe film everyone praises is a stand alone film but in the future when people binge the whole trilogy VII\\, VIII and IX it's going to be completely disjointed because all the new characters lose their characterisation that they developed in the first film. Finn is back to being a coward again\\, Rey....wasn't even a character in this. She felt more of a plot device than a character in this. Poe's storyline upon rewatch makes him look like a complete idiot. Luke's reaction at the end of TFA doesn't line up with his tossing away his lightsaber. All of this barely touches on the lack of character insight we get in the film. Jokes are so forced now and so referential that it removes the immersion of the film. All of a sudden I am reminded this is a film - or  a parody of a film - and a bad one at that. It has poor pacing\\, a barely present storyline and tries to hide it through battles and special effects.\\nOverall\\, coupled with the word 'laser sword' and the weird milk creatures\\, I'd say don't bother watching the next one because I sure as hell won't be.","true":true}