{"101487":134011,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have to give this two and a half stars as that is the exact middle ground here. Time will tell how this film affects a franchise which I still love. I have not only never seen a Star Wars film that has given me this reaction\\, but I have never seen a film that has given me such a split down the middle reaction. I almost literally don't know if I like it or don't. The parts I liked\\, I REALLY liked. The parts I didn't I REALLY didn't. Too many twists. Like why keep toying with your audience in a will they\/won't they fashion\\, is a character dead\/aren't they dead fashion. Empire had ONE twist. ONE twist guys. \\n\\nIt did however have possibly the best lightsaber sequence in the whole saga. \\n\\nLuke made a dark decision in his past which I am still struggling to accept as authentic to his character. It feels out of place and just put in to shock.\\n\\nHowever Mark Hamill as world weary and somehow wiser was compelling.\\n\\nThe plot was ridiculous. But it ultimately led to some fantastic sequences. \\n\\nSplit down the middle. Not what I wanted\\, so of course I am disappointed overall. The Force Awakens felt like job done\\, on to the next one. This feels like \\\"Man\\, I wonder what George Lucas' ideas for VII\\, VIII and IX were?\\\" Perhaps they should have gone with those\\, but with other film makers seeing that vision through. Honestly? The best Star Wars movies are the ones where they followed Lucas ideas\\, but Lucas let (frankly) better directors and writers handle the film making itself.\\n\\nI have to say: no other Star Wars movie made me sad like this one has. Luke's story is more tragic and depressing than even his father's. That is unexpected. But is it logical storytelling?","true":true}