{"101487":120105,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Fantastic addition to the Star Wars Saga\\, really enjoyed this... visually stunning in places\\, shocking twists and great new ideas... better than TFA\\, can’t wait for Episode IX... I’ll have to make do with a few more visits to re-watch! ***** Spoilers ***** I’ve read some reviews from “Big Fans” and am shocked and saddened that they don’t like this film and are even picking plot holes where there aren’t any... here are my thoughts 1) “Where are the Knights of Ren”? - well\\, you know the guys in red in the throne room?... 2) “It is too long” - No\\, it’s not long enough and there are sequences that could have been longer... filmmakers have to sacrifice things for the overall story and the director clearly wants to keep he audience guessing 3) “Worst movie of the lot” - you really need to have an open mind people... they aren’t going to just re-hash the old stuff again (like TFA)\\, this introduces new story lines and locations which is a good things\\, not bad 4) “Too much CGI\/Jar-Jar comparisons\/Just there for toys” - what because there weren’t characters in the original trilogy just for toy sales?? The Porgs are used sparingly and lighten the tone 5) “Too much comedy” - it’s nice to see\\, in my opinion\\, it’s not the Dark Knight trilogy!! Star Wars has a tradition of comedy in it and it’s just the modern take on it with a modern film 6) “Unrealistic” - OMG! It’s a “fantasy” sci-fi film... get a dictionary and look up “fantasy” 7) “Hux is portrayed as an idiot\/the First Order look stupid” - this is a common and very misguided comment... Hux and Kylo both crave power and have a superiority complex.. they are naive and lose their leader and don’t get on (as per TFA)... I think their portrayal was spit on 8) “No character development” - there was plenty and Rey and Kylo come out most developed and more likeable than TFA (they needed to as I thought they were disappointing previously) 9) “Leia does a Superman” - she is force sensitive and just because you haven’t seen it in previous films doesn’t mean it’s not possible in a “fantasy” movie (see above) 10) GO AND WATCH IT AGAIN!! - I watched at midnight for TFA (and TLJ) and the second and third viewings cement the films more in your mind and make them more enjoyable (and the forth and fifth time)\\, that’s what makes the original trilogy so iconic... they’ve been watched so many times!! Just my opinion but “big fans” who claim they aren’t going to watch episode IX aren’t “big fans” they are stuck in the past and need to embrace the fantastic job Disney are doing to give the franchise a new lease of life!","true":true}