{"101487":194808,"Last Jedi":"Last Jedi","2017-12-15":"2016-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Went to see The Last Jedi tonight. 5\/5? Best Star Wars film since Empire? Afraid not. A big disappointment. 2.5\/5.\\n\\nReviews said it took risks and didn't rely on old tropes like the Force Awakens. Sadly it ripped off many scenes from A New Hope\\, Empire and ROTJ. There was a much more interesting\\, alternate path it could have taken but didn't. \\n\\nI also feel Luke has been wasted and I really dislike what they have done to him - the hero of the original (and by far the best) trilogy. \\n\\nThe film is also overlong and like many have said it sags in the middle with a casino scene that should have been left on the cutting room floor. What was going on with the large camels? Made me think of the pod race! \\n\\nOh\\, and it follows its predecessor in taking liberties with the Force. No training needed nowadays people. You're just born amazing. Which sadly seems to be indicative of our modern world where all too often young people are preoccupied with finding instant fame. \\n\\nSome said it was a very emotional film. I think I must have been watching something else. And as for the humour\\, as other viewers (not critics) have commented\\, it was Marvel-esque and completely out of place in a Star Wars film. \\n\\nOn a first watch I think it's the third worst Star Wars movie. Only Phantom and Attack are worse.\\n\\nThe Force Awakens wasn't perfect but it still set up the third trilogy in a promising way. But that promise has been irretrievably thrown away with terrible character arcs.\\n\\nThis should have left me itching to watch the next instalment but instead has left me quite uninterested\\, which is quite an achievement given my love of Star Wars. You leave the cinema just not caring what happens next.\\n\\nThis needs to be wiped from the memory. This is Star Wars's Indiana Jones and the Crystal Skull.","true":true}