{"101487":141548,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It is difficult to express how disappointing this film is; it is only made worse by the inexplicably positive reviews. It is almost as if this film paid no meaningful attention to what came before - not even the Force Awakens. Even the prequels were less disappointing even though in some ways this film seems like a funner ride. I think if it were a Marvel movie I might have enjoyed it...but its not a marvel movie. I agree with many of the other thoughtful critical reviews and they express the problems with the characters and plot better than I. My fear however is that this is really the future of film. Everything seemed so flat\\, superficial\\, and pointless. Even characters with real potential like Rey or Kylo don't grow in complexity. Adam Drivers acting alone makes the character interesting. I\\, like Mark Hamill\\, think everything that they have chosen to do with his character is contrary to what is known about the character. Something like his temptation to kill Kylo make sense\\, but not the run away cynicism that is one of the most tiresome qualities of our culture. People seem to really think this film was emotionally complex and some sort of game changing maturation of the franchise? Really? Rose\\, the space millennial\\, is more painful to watch than Jar Jar ever was because the film actually wants us to take her character seriously - this is not a comment on the actress but more on the character. And all the out of place\\, forced\\, immature humor! This is not Guardians of the Galaxy! Luke brushing his shoulder off after the laser attack at the end was so out of place and out of character - emotional complexity! It does not even make sense in the context of this film much less the character as a whole. Carrie Fisher was the only truly bright spot in this film and in my opinion was not given much to work with. There were some things out of left field that I think could have been pulled off better\\, but at least she seemed like Leia. She is also the only one who lent a sense of gravitas to any of what was going on around with the resistance and their losses - they clearly tried to give the Laura Dern character that sense\\, but I am not sure why it did not work for me. Rey and Kylo as characters and the actors who play them have the most potential for the next movie\\, but I really don't know how they can turn it around at this point. Anything interesting from the Force Awakens was totally wasted in this movie. It is very difficult to see the positive response to this film as anything other than a sign of the unrecognized\/unacknowledged  superficiallity of our culture; immature humor and sarcasm pass as depth and complexity. I almost feel guilty for enjoying Thor Ragnorak and Guardians of the Galaxy movies now\\, but at least they were not trying to be something more than what they were. Perhaps Leia would rightly and amusingly tell me to \\\"wipe that concerned look off my face\\\"\\, it is just a movie after all - I just think this movie is a more revealing of where we are culturally than where I would hope us to be.","true":true}