{"101487":172314,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Terrible Star Wars movie. Full of sloppy writing and massive Canon loop holes. \\n\\nA cinematically pretty movie\\, it becomes evident very quickly that the directors put zero thought into this films relationship to the other Star Wars movies. Instead of focusing on critical character development\\, the movie went for cheap yuks and thrills in the form of bad jokes\\, a batch of useless characters and exhausting\/unnecessary chase scenes. Throughout the movie I found myself asking\\, okay so when do we get to the important parts? In fact\\, the movie brought nothing to the table in terms of storyline\\, and honestly\\, it feels like despite having a second movie\\, we are exactly where we were after ep 7. \\n\\nWho was Supreme commander Snoke? Doesn't matter. \\nThe knights of Ren? Who cares. What's the deal with Phasma? Doesn't matter. Rey's Parents? An afterthought. Since when can Jedi's use their powers to breath in space? At what point did \\\"gods speed\\\" replace \\\"may the force be with you?\\\" Why was Luke as deeply Jaded as he was? Why does a trillion dollar space ship not have autopilot? The list just goes on and on.\\n\\nThis movie had some nice moments (Rey and Kyle fighting together) but overall was just really a horrendously poor excuse for an installment of a Star Wars movie.\\n\\nNot sure who paid RT to post a 90% score but this movie should be removed from the Canon because its total garbage.","true":true}