{"101487":165156,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson has produced the most original Star Wars movie since The Empire Strikes Back. It is so original that it copies nearly verbatim entire themes and scenes from the movies of the original trilogy. It is so bold that it hints at a lesbian relationship between admiral Holdo and Leia Organa but it does not dare to let them share a passionate kiss as they part. \\nIt also lets the legacy characters of Luke and Leia shine so much that the first is described as a deranged coward hiding from his responsibilities and the second is a motionless statue of salt in the middle of the ship's bridge apparently unable to do anything useful. Rian Johnson honors her by transforming her ridiculous death-non-death in the most infamous Internet meme SuperLeia.\\nTLJ develops the new Characters introduced in The Force Awakens further. It develops them so good that we still do not know who the parents of Rey are and why she is so powerful with the Force. The transformation of Rey into Mary Sue is complete now.\\nYou can see a direct link from Luke Skywalker at the end of Return of the Jedi\\, a man who as chosen not to fight with a lightsaber but with a lasersword\\, which is omething that does not exist in the Star Wars universe.\\nThe problems some people seem to have with TLJ come down to either expectations and\/or the narrative structure of the movie. It is a character-driven story\\, so you best focus on the people running aimlessly from scene to scene instead of trying to understand how the hell it is possible to create so many plot holes in a single movie. Don't let the gaping holes distract you. Simply skip them and enjoy the CGI.\\nThe central characters have an impressive journey in this movie and after a second viewing you will notice that they are now in the exact situation they were at the beginning of the movie.","true":true}