{"101487":182070,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is easily the worst Star Wars film ever.  Even though JJ Abrams was Executive Producer on The Last Jedi.  His vison was easily lost from TFA (which I wasn't a huge fan of but he left a lot of interesting plot points\\, literally gave the next person (Hack Rian Jonshon) a lay up to make a really awesome film). So many plot holes to count. They ruined lukes character and didn't develop any of the new ones as well.  Kylo basically gives a big F U to the crowd with his dialogue in Snokes throne room (Speaking through the hack Rian Johnson).  Honestly I get moving on from the past Saga\\, sure\\, but we all know Disney will make a million movies. So just make these last 3 good (well 2 now\\, well 1 now that this one is horrible) and then they can do what the want with the franchise.  They could have made their money and made a good film\\, but they didn't.  Too much humor in serious scenes.  I came in wondering a few questions. Who are Ray's parent?  Who is Snoke? Who are the Knights of Ren? How did Maz get Luke's Lightsaber? Just to name a few.  Zero answered.  I went in with 0 answers or expectations.  Got zero answers and lost all expectations.  Also\\, to those that say we are all complaining that TFA was too close to a new hope and this one was too far from the OT.  Well they stole most of everything from ESB and RTOJ in this movie.  Oh\\, except the slow speed spaceship chase.  No matter what I say you'll see it cause it Star Wars but I hope once you do you'll join the rebellion and try and get a film we deserve.  As the wise Lando once said \\\"This deal is getting worse all the time\\\".","true":true}