{"40636":"29590","TLOU2":"TLOU2","2020-08-05":"2020-06-24","10":6.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"Man I waited 7 years for this game. And It was something I was looking forward to in 2020. Unfortunately 2020 is a cursed year. The Last of Us 2 was a huge disappointment. And I have a lot to say. The game was a beautiful and entertaining game. I had fun wondering around Seattle. And the opening of Jackson. But I am really disappointed with that I was sold on a game by the trailers shown and ended up with a different game entirely. My problems with this game is completely the story and the narrative it decided to tell.  Right off the back 30 minutes into the game they kill off one of the most important characters of the Franchise. Joel!  I was sold on a story I thought was going to be another adventure with Joel and Ellie dealing with their conflicts from where the first game left off. Instead I got a game that felt like It was a shove into the mud on a rainy day. Instead I got a game that was a false glimmer of hope of trying to gain justice and ended with more tragedy than triumph. I absolutely did not feel anything Naughty Dog was aiming for. And maybe it was just poor execution. But right after joel died all I wanted was to get vengeance and justice for his death and I was IN for that. But it kept dragging on and on and eventually you get into these missions where I feel like the game was trying to make you empathize with the Antagonist. Which is all well if you hadn't killed off an important character too soon. After that all I felt was lust to kill Abby. And I completely did not care for Abby's friends. Nor the kids she cared about. During all of the Abby drama. I just felt like I wanted her dead\\, her purpose meant nothing to me. And I was just trying to rush through her story to get back to trying to kill her. And then when you finally got back to it\\, You are let down. Ellie let's Abby Live. She finally could of had justice for Joel. And Ellie let her go.. How big of her. But that's not okay for a player who wanted to get justice served.  Maybe others feel differently. But I was not happy at all with that decision. And to make it worse. Ellie lost some fingers sl she can't play the guitar Joel gave her and she lost everything. Dina was gone all of her belongings were put into one room just to be left to be forgotten. And that hurts. Joel dying was not the reason I was angry at this game. It was that it felt like the game didn't want to continue where the first game left off. Sure it did! But in poor poor flash backs just to establish a bunch of meaningless characters for a future game. It just felt like a huge disrespect to the first game. Unfortunately Just like this game. I will also leave it to be forgotten. I am just disappointed. Huge fan lf the franchise and my love was killed and I feel like the first game is meaningless now. Hopefully Part 3..if there is a part 3 ..makes up for what was unfairly done. I just hope I'm not sold on a game I won't get.… Expand","true":true}