{"101487":188546,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This what Star Wars looks like when it's directed by Michael Bay's spiritual successor. There are some great explosions and lightsaber fights\\, but story and characters take a back seat to the action. The forced laughs are haphazardly inserted and feel like more of an afterthought. The casino plot line just doesn't make any sense at all. Killing the trilogy villain in such an unceremonious manner robbed us of a incredible potential story arc. No backstory to this immensely powerful Sith Lord. No protracted moral equivocations for the protagonists. No epic showdown. Nothing to look forward to in Episode IX except Adam Driver's impulsive desire to kill everyone.\\n\\nI go against the grain in that I enjoyed the prequels. Despite their flaws\\, they added delicious complexity and history to the universe. They were necessary to understand the events that were to come. They make the originals complete. What does VIII add? The honest answer is: very little. It's a fun ride\\, but Star Wars deserves more than just a fun ride. It deserves exploration of characters\\, the Force\\, and the universe that was so lovingly created back in 1977. Instead we get the story of a few forgettable characters who are explicitly outed as being inconsequential.\\n\\nI understand that there is an underlying theme of nihilism: nothing and no one really matters. But really\\, what kind of conclusion is that? This is not some pretentious arthouse piece on the frayed edges of humanity. This is Star Wars. Where is the grandeur? The spectacle of characters\\, families\\, and civilisations spanning millennia\\, all intertwined by the power of the Force? It's not here\\, so hopefully Disney deigns it important for the final movie in this saga.","true":true}