{"101487":174677,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The good:\\n\\nThe first 40 minutes of the film was extremely solid\\, maybe even better then some of the movies input higher on the list. It did well to set the tone and pace of the movie and remind us where all our heroes are.\\n\\nEverything with Luke and rey was great\\, along with everything with Rey and Ren. It was just a shame that the 3 best characters and actors were confined to a reletivly small portion of the film.\\n\\nFrom a technical standpoint the film looked great. Although I didn't agree with some of the choices of shots\\, the move was really well edited and flowed well.\\n\\nThe bad:\\n\\nIntroducing a random vice admiral that was only in the film to die was retarded. The first time I watched it I thought \\\"oh I guess this will be the new military leader that will spur everyone on in leias absence. If the character was going to die anyway I really think it was a terrible idea give her such a limelight. The whole design of that character (didn't have to wear a military uniform For some reason?) pissed me off\\, and it would have just been better with ackbar or Leia.\\n\\nThe entire casino plot was so bad I'm actually astounded it got through the draft readings. It was such a dumb heavy handed way to take a jab at the rich and I was visibly cringing through most of it.\\n\\nThe abundance of cgi animals was dumb. Porgs\\, horses and foxes for no other reason than to connect with dumb plush buying normies.\\n\\nThe ugly\\n\\nThe Asian woman single handedly destroyed the film. The moment that Finn meets her\\, his character is ruined. Every scene that she's in is ruined\\, and for all Poe was doing in the film he should have replaced her and made that part of the film at least have some character development. Everything that character did in the film was so perplexingly stupid and badly written\\, I wonder if it was a last minute write in. They introduced a stupid as fuck romantic plot line for no fucking reason and it was so predictable and boring.\\n\\nKilling off Luke Skywalker. Oh boy here we go. Now after watching the movie a second time\\, I didn't actually mind his characterisation for most of the film. He was sorta just barely hanging onto his old personality and was tempted to train Rey despite himself. The truth of him confronting Ren was OK I guess. It still doesn't feel like something luke Skywalker would do\\, even if pushed. He would always try and redeem. The last scene of him sitting with Yoda was really good\\, I liked it more the second time.\\n\\nThen they ruined it.\\n\\nHaving luke die the way he did was a move by someone who doesn't like what star wars is. The entire movie was a middle finger to fans of the OT\\, and a vanity project by Rian to cement his name in Hollywood. No doubt he will not be forgotten any time soon for his ability to fuck up a series. The fact that he was given writing and directing control meant he was free to push his stupid fucking agenda into the series. Now we're left in the worst position possible: Carrie fishers character who is secondary to the plot is alive but the actress is dead but mark Hamills character who is critical to the plot is dead and the actors alive. It's such a disgusting bait for the GoT crowd to lap up because killing important characters is so cool now.\\n\\nNow there obviously going to have to do some dumb force ghost bullshit to bring him back\\, but rian has achieved his goal. He's the guy who killed Luke Skywalker off\\, and he'll always be remembered because of it.\\n\\nIn conclusion\\, first act was good and everything with Rey\\, Ren and Luke was the best part of the film. Everything else dragged the quality down so much its hard to look at the film seriously.","true":true}