{"101487":174421,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The first movie I ever saw in a theater was Star Wars in the summer of 1977. Like most people my age\\, Star Wars was the greatest part of my childhood. By the time the prequels came along\\, I was a father and introduced my son to the saga. Now\\, after seeing this hot pile of crap\\, I wonder how it all went so wrong. I have watched this movie three more times via a friend’s iTunes download...still\\, nothing. The movie just wasn’t very good at all. Starts off with a corny crank call. A needless side story to a casino planet (I feel so bad for Kelly Marie Tran). A missed opportunity to send off Leia with a purpose (don’t get me started on Leia “Poppins”). A waste of a legendary Jedi. A waste of a worthwhile villain. Last and worst of all...the flashbacks! Flashbacks are a lazy storytelling technique that have no place in Star Wars. What was Disney thinking? What was Rian Johnson thinking...he’s a hack?!? I wonder if Lucas regrets selling his franchise now. This just wasn’t a good movie. Episode IX will most likely be the first Star Wars movie that I’ll wait a few weeks to see just to find out how it’s received before I spend my money. Good luck J.J. Abrams...Johnson set the bar so low and weighed it down with so much utter BS\\, you’ll have a tall task of lifting the series back up and\\, if what you did to Star Trek is any indication\\, I’m not holding out much hope.","true":true}