{"101487":149352,"Last Jedi":"Last Jedi","2017-12-15":"2017-11-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Last Jedi is boring\\, cringe worthy and destroys any potential for the next movie. It left me not caring if they finish the trilogy. It’s full of eye rolling humor and paper thin characters. Subplots that go nowhere and have you checking your watch. Johnson was given a gift in the character of Luke Skywalker. It would be really hard to mess that up\\, but he did in grand style. Rey and Luke are wasted on boring scenes on the island. Luke was a character who risked everything to find the good in a man. Now he wants to kill his nephew in his sleep. He doesn’t care if his friends die. He ran away and hid on an island. He milks an alien and drinks it angrily. Seriously. He is discarded to make way for the new generation. But is there anybody we care about? Rey was barely advanced as a character. Finn could be cut from the movie. People aren’t angry because this movie went in brave new directions. It was a simple and boring story with a slow speed chase scene dominating the move (two starships traveling at exact same speeds). This movie wasn’t dark. It was goofy. I only hope Disney really thinks about what it’s doing. I have no interest in a trilogy created by Johnson. Warner Brothers waited way too long and allowed the DC universe to become a series of disappointments. I’ve never felt this way about a Star Wars movie (even the weaker ones). If this is the type of movie they want to make more of\\, then I know to save my time and money. ","true":true}