{"101487":178769,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There were moments that rang true to Star Wars: the opening sequence was a fantastic space battle\\, the tension of it was intense but also light hearted. But things went south rather quickly after about the first 15 minutes. I'll try not to spoil anything. There is a scene with Leia that defies in-universe rules and looks idiotic at best. The force - which has been the unifying myth of the OT and PT is here reduced to nothing but parlor tricks and magic shows. Luke's story arc here insults the journey he has already taken in the OT and reduces him to a laughable character. His actions and choices are out of character and no explanation he can give account for this. The Jedi are basically insulted and reduced to villains in a story where they have never been such. Moreover\\, Luke's criticism of the Jedi seems completely out of context given that the ONLY two Jedi he has ever known were Obi Wan Kenobi and Yoda. It's insulting to Luke\\, the Jedi and the OT to see this hero become so bitter and dismissive. It is also an insult to the audience who has loved this saga precisely because of Luke\\, his journey and the Jedi. \\n\\nFaced with a Luke who is a bitter\\, cowardly failure (why?) whose choices (why?) make no sense\\, Rey must train herself in the use of the force - which is odd\\, since she seems to be gifted with it beyond any Jedi ever. Nothing is explained. It is one thing to be a force sensitive - Leia. It's another thing to be a trained Jedi Knight - Obi Wan. It's a whole other thing to be a force prodigy - Anakin\\, Luke. But Rey seems to defy all of this and is able to use tricks (and they do seem like tricks more than anything else) that no Jedi or Sith has ever managed to use. She also appears to have an advanced degree in electrical engineering\\, mechanical engineering\\, several galactic languages and is able to fly the Falcon better than Han and Chewie combined. And there is literally no explanation for this. There are plot holes in the interactions between Rey and Luke\\, his abilities and hers. There are story plot holes that literally make no sense. There is humor that goes way beyond the usual lighthearted banter of Star Wars and reduces the film to a parody of itself. Most of all\\, there is a heavy handed political tone to it that is far more appropriate to 2017 earth\\, than to a Galaxy far far away. Even the rich seem to be vacationing at an Earth like French Riviera with the same gambling machines and games that one would find in Vegas. There are Earth phrases such as \\\"God's speed\\\" being said by characters NOT on EARTH and who do not follow Earth religions. Laura Dern seems to be placed on the ship as a strong female lead\\, but that is entirely erased by the fact that a military commander is wearing an evening gown. \\n\\nThere are good points\\, as I said. Like the opening sequence. The battle of Crait is visually wonderful. But just as with the rest of the movie\\, the plot holes and issues with in-universe known rules about the force are entirely violated. \\n\\nThis movie might appeal to fans who have never seen the OT or the less loved PT. But it won't ever appeal to the audience who fell in love with the OT precisely because it seeks to destroy that legacy. It's okay to create something new. It's not OK to destroy the beloved thing in the name of making something new and still call it by the same title and include the same characters.","true":true}