{"101487":136644,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm mainly writing this to combat all the people who are rating this movie down way to low.\\n\\n1) It is a very well Directed\\, Acted\\, Plotted and Written movie. The end. It's objectively well made.\\n\\n2) It had unexpected twists which is what made the originals so good. Luke being Vaders son. Vader killing the Emperor. Han being put in carbonite. Luke and Leia being related. NO ONE saw those coming.\\n\\n3) Snoke\\, like the Emperor was a Bad Evil Wizard. That's it. The prequels fleshed out Palpatine\\, not the original movies. The prequels are universally reviled.\\n\\n3) The humour was fantastic. Made it similar to the OT. Had real levity and not cheesy at all.\\n\\n4) The second act was weak. Yes. I think it flicked back and forth from the 3 stories to much\\, didn't stay with one story long enough.\\n\\n5) These movies are Fables. Fairy Tales. Fantasy. They are not Sci-Fi. Stop it with trying to figure out why droids or auto pilot wasn't used for the lightspeed kamazi. Why the First Order didn't just jump to kill them etc. They damn well know what they are doing. It's meant to be a bit silly. ALL of them are.\\n\\n6) Finn and Rose 'pointless story' had a point. It was to build the characters. That is good film making. Character leads plot not the other way around. They made decisions that made sense at the time. It didn't work out\\, but it made sense. Finn grew from being a coward to being crave and believing in the Resistance.\\n\\n7) Luke's plot makes perfect sense to. It was a great send off. Only thing I wanted to see was him use his green lightsaber in an epic fight against someone. but whatever\\, it was good regardless.\\n\\n8) The EU never happened. Luke didn't go have kids or whatever. Luke did what happened in Force Awakens and Last Jedi. That's it. This is the story. The question is was THIS STORY poorly told? No it wasn't.\\n\\n9) The 'fan boys' are rating this movie based on things that never happened. On story beats that don't exist. On theories instead of reality.","true":true}