{"101487":127943,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Honestly Rhian has absolutely butchered what was a great first movie by jj. Just a sample of why this is the worst piece of garbage ever directed for such a series.\\n\\n1- Why make such a big deal that luke lightsaber was calling for rey\\, where she had visions once touching it? Was totally unexplained.\\n\\n2 - why make even the smallest mystery surrounding rey parentage when they are just supposedly gutter trash that sold her (cant change it now in the 3rd film\\, it had to be in this film that we found out).\\n\\n3 - How can a child of gutter trash with zero training in the force or lightsaber fighting then keep up with\/ defeat kylo ren?\\n\\n4 - How can rey out force Kylo ren for lukes lightsaber in the first film with zero training\\, when Kylo is the grandson of the most powerful jedi ever?\\n- if the writers try in the 3rd film to suddenly say rey is a new \\\"the one\\\" i will spew.\\n\\n5 - How can leia suddenly use the force........? Why not use it in the first film.\\n\\n6 - why would you even try an recreate the scene of luke skywalker and vader in the lift on their way up to meet the emporer in this film... rey - \\\"i can feel the conflict in you\\\".... spare me\\, did you not think we would see through it?\\n\\n7 - why the hell would Disney hand over all control to a director whose greatest achievement to date is looper? What a total bulls up.\\n\\n8 - My faith in critics has always been low\\, now i see its justified\\, scared little ponies not wanting to bite the hand that feeds them.\\n\\nAnyway\\, this was my short version\\, if you want the full length version visit - lastjedisuxbalz.com","true":true}