{"101487":106540,"Last Jedi":"Last Jedi","2017-12-15":"2019-01-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"At the first watch of this movie. I thought to myself\\, well they can't mess this up that badly. I was wrong. The First Order comes back again being the copy my homework but make sure you change it slightly type deal. The Empire built to keep the universe under it's boot and scared is not the same as reconquer the galaxy. The Resistance named prior to the First Orders existence (No idea what or who they were resisting prior) not evolving their technology or tactics. The entire movie seems to revolve around no one telling anyone anything leading to the plan that was pretty sound to be stupid because the main leader (No one even knew who she was) didn't want to tell the most trusted people. Luke being discovered\\, the mystery that I wanted to know just led to the worst part of this movie\\, he was hiding because he was done? What the? Luke? Who's this Terminator built\\, face changing\\, body snatching person that's here cause that ain't Luke. But just to sum my main issues up. 1.) The character designs took a 180 with everyone that people could've loved and turned them into mush and they killed off all of the characters. 2.) The plot was stupid and the decisions was something that could have been to the tune of Benny Hill theme with everyone running around with their heads off. 3.) Everyone was celebrating at the end of the film\\, there's maybe 30 of you. You're kinda screwed\\, maybe you should kinda look like it.4.) The throne room fight scene. If you don't know why? Youtube it.","true":true}