{"101487":193235,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(Warning\\, possible spoilers)\\nThis is the worst Star Wars movie ever created. I thought they could not make a worse movie than the Phantom Menace but Disney has done it! The story in the Last Jedi is horribly written; every time a character is introduced they hint at a backstory but never do any exposition after they are introduced. A few examples of this is Snoke\\, whose existence\/history is mysteriously never explained\\, and Vice Admiral Holdo whom Poe Dameron is surprised by after he meets her\\, but the movie fails to explain why. This is a theme in the movie so if you want an explanation for anything\\, look elsewhere. There are a few instances where the movie goes a bit deeper and the results are disturbing. I don't remember the exact line\\, but one of the resistance members muses about killing a group of people on a planet they visit because they aren't very nice people. The movie also seems to glorify martyrdom through the sacrifices that recur throughout the movie. Luke Skywalker was a character I was excited to see in the new movie but I was disappointed at his portrayal as a weak\\, bitter old man who reluctantly agrees to teach Rey the ways of the force. Although this is one of the only reasons he's in the movie\\, he is non-existant as a teacher and fails to impart any knowledge at all despite being a Jedi Master. It's ok though\\, Rey is naturally gifted enough that she knows exactly how to do everything after a single lesson from Luke. He is treated as a throwaway character when he could have been so much more. The special effects in this movie are great\\, probably the one good thing about it.","true":true}