{"101487":169516,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"[SPOILERS]\\nThe movie has some great emotional dialogue and connections with\\nRen\/Rey\\, some great action sequences and cinematography. I thought Adam Driver's performance was spectacular. \\nThe plot however\\, has some serious holes and some really unnecessary characters. Let's start with Leia's newfound Force powers and superman flight...I mean really? Fully trained Jedi weren't able to do that. Something more subtle would have been much much better than getting sucked out to space and superman flying back to the ship. Instead it comes off as a cheap trick and needless. Second\\, how is DJ in a position to betray the rebels? Rose and Finn just met him and they are careless enough to reveal that the Rebels are getting away with the smaller transport ships? If they were able to fly away on the transport ships couldn't they all make a short jump to hyperspace in different directions so they couldn't be tracked? Why didn't the rebel admiral tell anybody of her plan (completely forgot her name because she was so unremarkable)? Because she didn't want to look like a hero?!?! Seriously? That's terrible military leadership and makes no sense. Which then makes the whole Finn\/Rose casino subplot useless. Also\\, Phasma had great potential\\, but they killed her off...useless. \\n\\nEvery fan was interested to see where Snoke came from\\, but instead of creating an interesting back story (literally anything) they just killed him out of convenience and laziness. I appreciate the Sith apprentice kills the master thing\\, but couldn't they at least reveal how Snoke rose to power?\\n\\nLuke Skywalker's character was well written\\, until they wanted to create that big plot twist and have him almost murder Ren in his sleep. If Luke is the most powerful Jedi at the time\\, he could have just confronted Ren face to face and destroyed him. This plot twist makes Luke seem cowardly and entirely un-jedi like. I did like the action sequence at the end with hologram Luke. I think it was perhaps too soon for Luke to disappear\\, however.\\n\\nIn the OT it took a lot of training to be able to use the Force. Now\\, apparently any kid with ability is a master at using the force?\\n\\nOk\\, I get it\\, Disney wanted to do their own thing and put their mark on the new series\\, but this new direction does terrible service to the OT. The movie is still fun and exciting but I think most big fans will find it underwhelming.","true":true}