{"101487":128615,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"How come the 4 and 5 star reviews when you click on the name it comes up with page not found hmmmmmm\\n\\n***spoilers ****\\\" \\n\\nSo so many issues\\n\\n1) how can Leia an untrained force user fly with the force and if this is a force ability why didn't the emperor  a much more experienced force user do so in return of the Jedi to save his life \\n2) how did the bombs fall in space with no gravity?\\n3) If the purple haired girl had told Poe about the plan it would have worked. her being a d*CK about it caused the side quest which led to first order getting the info and then she gets praise for being an ass. communication is key to leadership but not according to disney\\n4) If light speed can be used as a weapon why didn't they use the smaller ships before they were blown up. Everyone could have carried on in the big cruiser\\n5) this isn't a plot hole but what a disappointment about Disney's Luke Skywalker in the comics he's a bad ass the ultimate Jedi master now he's just a whiny little b*tch\\n6) Snoke where's the back story? you set him up as the big bad and then like that he gone. Where was his motivation? how did he get involved with the first order ? Why is he the only one to appear huge in the holograms ?\\n7) If anikin the most powerful confirmed force user and trained in the Jedi arts since young  still got his butt kicked in episode 3 by \\nhis Jedi master how come  Rey with little to no training beat Luke in a Duel\\n8) Why did Kilo spare his mum at the beginning just to turn round at the end of the movie to try and kill her ending the partnership with rey\\n9)How come the first order has so much stuff ie weapons and vehicles it not just stock pile left over by the empire as is all new and upgraded they lost starkiller base which had to have most of their stuff. It was pointed out that the galaxy was reasonable peaceful with the republic rule in force awakens so they can't have infinite resources because they aren't taxing the people they don't have a home planet to gather resources from. I get the film said that they buy their weapons from dealers on the gambling planet but where the money coming from? And who builds a planetoid deathship just incase some idiot wants to buy one?\\n. If the galaxy was at peace why are the rebels there what were they rebelling against. And if they are more like the republics police \/ army why do they refer to themselves as rebels also why isn't their more of them and why aren't they better equipped\\n\\nThere's so many more plot holes I can't list them all the only good point of the movie was the Rey Kilo tag team","true":true}