{"101487":100762,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A group of female resistance leaders\\, General Leia Organa (Carrie Fisher)\\, Vice Admiral Holdo (Lara Dern)\\, Lieutenant Connix (Billie Lourd)\\, and Commander D'Arcy (Amanda Lawrence)\\, are trying to escape the clutches of the evil \\\"white man\\\" First Order after our first hero Paige Tico (Veronica Ngo) sacrifices herself to help everyone get away despite the incompetent blunder by the male Poe Dameron (Oscar Issac). \\n\\nMeanwhile her sister Rose Tico (Kelly Marie Tran) is saddened but stops a cowardly Male deserter named Finn (John Boyega) from escaping.\\n\\nFlash over to our main hero and the greatest Jedi left in the universe Rey (Daisy Ridley)\\, seeking advice from a grumpy\\, worthless old Male Luke Skywalker (Mark Hamill) who does nothing by drink green milk and fish.\\n\\nWill they save the day?\\n\\nFinally the wait is over. Two long years of speculation and fan theories to end. Who is Snoke? Who are Rey's Parents? What has Luke been doing? All answers we have been waiting for about to be revealed....or are they?\\n\\nNope\\n\\nWe get zero backstory on Snoke. What was his claim to power? How is he training Kylo Ren? All that thrown out the window in one fell swoop. Killed him off with nothing but a peep. \\nRey's parents?? Nope she is nobody. Not a Solo\\, not a Skywalker\\, not a Palpatine. Just some orphaned girl randomly out there. What has Luke been doing? Nothing. Drinking green mil\\, fishing and being grumpy.\\nRian Johnson was either too dumb or too lazy to even come up with an idea for any of these main plot points setup in The Force Awakens.\\n\\nMy problems with the film are still the lack of character development and timeline inconsistencies.\\n\\n-We know at the end of The Force Awakens\\, Rey hands Luke his old Light saber (or Laser Sword for whatever reason he calls it this). The Rebels destroy Starkiller base and everyone escapes the exploding planet. Snoke says leave the base and come to me\\nwith Kylo Ren\\, it is time to complete his training.\\n\\n-Now to the Opening of The Last Jedi...The Rebels have a new base\\, tracked down by the First Order and they are trying to escape. Yet after this is shows Rey handing the lightsaber to Luke? So no time has passed at all from Starkiller base to this??\\n\\n-Bombers in space?? How does that work exactly with gravity and all. TIE Bombers actually Fire the bombs at the target. The Resistance bombers just drop em?? in space??? with no gravity???\\n\\n-So far every original character has been wasted. R2 does nothing\\, C3PO does nothing\\, Leia does nothing\\, Chewie does nothing. All they do is serve as an ooh look they have the original people in this one. Leia was said to have a \\\"huge\\\" part in this film but she really\\ndidn't do anything that any other character couldn't have done. Her lines were boring and she was in a coma half the film. \\n\\n-The new characters (Finn\\, Poe\\, Rey) are all one dimensional and have no way to evolve. Rey is a master at everything (Mary Sue)\\, Poe runs around hugging people and Finn just continues to do his best impression of Denzel Washington. These characters at no point will fail at anything they do\\, are never in any real danger at all. \\n\\n-Poe comes up to talk to the First Order. Trying to stall with a terrible your mom\\, crank phone call joke. Is this Spaceballs? or Star Wars. Poe single handedly takes out every gun on the Dreadnaught with ease.\\n\\n-Luke: We last saw Luke sensing the \\\"good\\\" in his father Darth Vader that had been corrupted by decades of hate. Yet Luke cannot sense any good in Kylo and wants to kill him? The problem with this is two fold\\, Luke has already proven he can sense good in people. And Kylo Ren's\\nwhole character is based on him constantly being pulled back to the light \\\"good\\\". Rey sees it\\, Han saw yet Luke can't see it??? \\n\\n-Leia: Really should have killed her off on the beginning of the film but yet they blast the whole bridge into space killing everyone...except Leia..she wakes up and Mary Poppins herself back to the bridge. They open the door (Which probably shouldn't be a good idea because they would get sucked out into space. But nonetheless\\, Leia is ok and falls into a coma.\\n\\n-Laser Sword? Does Fox still own the rights to use the term Lightsaber? No reason at all for Luke to call it a Laser Sword\\n\\n-Rey: Gets really no training from Luke\\, nothing. A wasted opportunity with the evil cave to present her a challenge? nope\\, just duplicate you 100x and snap your fingers...\\\"There's no place like Home\\\"\\n\\n-Jedi FaceTime: If Snoke is that powerful to bridge to force sensitive peoples minds. (One who he has never even met) Surely he shouldn't have a hard time finding Luke.\\n\\n-Vice Admiral Holdo: If she would have told people the plan was to evacuate to Crait then Finn and Rose would never even had to go to Canto Blight to find a \\\"Master Codebreaker\\\". This would give more time to parts of the film that needed to be fleshed out. Reys training\\, escaping to the planet etc.\\n\\n-Canto Blight planet: These were wasted scenes and fit more in a Fifth Element movie.\\n\\n-Captain Phasma: She is now the Kenny of Star Wars. Oh my God! They killed Phasma!....YOU BASTARDS! Wasted her once again.\\n\\n-General Hux: Once again another one dimensional character. Just snivels and whines. How the fuck is he in charge of the whole First Order?\\n\\n-DJ: Well Finn and Rose don't get the codebreaker they want but ended up getting one they shared a jail cell with. They sneak onto the Destroyer and get caught. DJ rats out their plan that the Resistance is evacuating to the planet Crait.\\nBut DJ shouldn't have this information. Poe found out after they boarded the ship and never relayed that info. But Somehow DJ knew and the First Order pays him off. WHY??? even if he did know (Which he sure doesn't) The First Order should have just backstabbed him. Instead they give him a huge reward and let him go for breaking in?? nope\\n\\n-Rose: Rose dooms the whole Resistance because she has a crush on Finn?? Wasted opportunity was going to be a great moment with Finn finally becoming a hero and she ruined it for a weak ass kiss.","true":true}