{"101487":169401,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS ALERT!!!  SPOILERS AHEAD!!!\\nThe words that I would use to describe this movie are simply disappointment and overhyped.  As a long time Star Wars fan and having loved The Force Awakens I am amazed at how they completely failed at this one.  By the end of TFA we had Rey finding a beloved Jedi master\\, introduced an insidious new villain (Snoke)\\, set up mysteries of lineage and back story and the visions of future epic jedi battles dancing in our heads.  Everything was in place for an exciting continuation of the Star Wars Skywalker story.  Instead we witnessed an incoherent story line with a failure at every level of the set up from Episode 7.  I will break this down into specific nonchronilogical failures otherwise this review will go on forever.   Snoke\\, a scary and powerful master force user with no back story is killed in a most anticlimactic way.  Luke Skywalker is a sad\\, pouting and shallow character who instead of us showing his true power pulls a trans galactic hologram hoax and then as the audience applauds with the realization he is safe simply disappears and becomes one with the force?  The mystery parents of Rey's that were theorized about for two years and promised to be revealed were nobody of importance (then why was Luke's lightsaber calling to her).  Instead of Luke \\\"passing on what he has learned\\\" he teaches Rey three lessons two of which were not lessons and not memorable.  A lot of time was spent watching a a slow moving space ship chase with an inconsequential failed mutiny.  A side story with Finn and Rose was nothing more than a lecture on class warfare and the evils of the military industrial complex.  Too many times the characters were saved just in the nick of time by shear luck.  Snoke's promise of completing Kylo's training was nothing more than humiliation and the challenge of striking down Rey after it was revealed the connection between Ren and Rey was orchestrated through Snoke.  Mighty Chewbacca could not eat a Porg after living Porgs stared at him.  I could go on and on with silliness and tragic story flaws and failures of understanding of what made Star Wars so great.  The only reason I gave it 2 stars and not less was because of a few scenes.  The jump to light speed through Snokes ship was beautifully done.  We saw two moments of a recognizable Luke (laying on the ground chatting with a very bad CGI puppet looking Yoda and floating while meditating before disappearing).  This movie was so frustratingly disappointing I left the theater feeling depressed.  No epic Jedi battles (even the battle with the Pratorian guards was silly and anticlimactic)\\, no jaw dropping moments of revelation\\, no character development (so why should we care).  Instead we are left with the only intimidating villain dead\\, Luke disappearing after not teaching anything or showing us his true power\\, weird force powers invented (Leia floating through space was a beautiful yet silly scene...makes all those space ship battles wth the Jedi less impressive knowing they could just fly through space back to safety).  Sorry\\, I am going on and on because this movie was such a mess.  The only explanation I can guess as to the critics good reviews are that they either own a lot of Disney stock or are terrified to give a bad review due to Disney's power in the entertainment industry.  I am heart broken and disappointed.\\nAmended:  After seeing it a second time (in 3D) I changed it to a 3 with the hopes of correcting some major issues with Johnson's writing and directing blasphemy.\\n1.  The only thing we know about Rey's parents is what Snoke revealed to Kylo in their visions about each other.  Snoke admits that he lied to them because Kylo was too weak and Rey was not wise enough.  So the anticlimactic ending to Rey's lineage can be corrected.\\n2.  Luke can still come back and pass on what he has learned if he returns as a force ghost.  This is likely because he tells Kylo that he will see him around.  We also have a scene where Rey has the Jedi texts in the Millenium Falcon at the end of the movie.\\n3.  Kylo maybe more of an adversary then I gave him credit for.  He does trick Snoke into believing that Snoke can see his true intent which allows the apprentice to kill his master....a very common theme in the Sith.  He also wants Rey to join him which is a common theme with Anakin wanting to over throw the Emperor and ruling the galaxy with Padme in Revenge of the Sith and then with Luke in Return of the Jedi.\\n 4.  A dominant theme in the movie is suggested by Yoda...failure is the greatest teacher.  Finn and Rose failing on their mission.  Poe failing with his mutiny.  Kylo failing to turn Rey to his side.  Rey failing to convince Luke to return.  Hopefully all of these failings teach these main characters how to become stronger in the future\\, turning them all into true leaders.","true":true}