{"101487":169268,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"***SPOILER ALERT***\\nThis movie was disappointing to say the least. First off\\, what is this movie about? The main plot is a snail race as the rebels try to escape the First Order and survive. But that's the plot; what is it about? And who is really the main character?  Many of the subplot lines have no payoff which I think people are mistaking for plot twists. Many of the characters are really interesting but nothing is done with them. Here are 12 ways this movie could have been way better\\, in my opinion. \\n\\n1. Luke and Rey - Rey's journey is more like a bunch of installments of a sitcom about a girl living with her hermit uncle. Luke never really trains her\\, she ends up sort of doing it on her own; kinda\\, sorta maybe. It seems that the Director is trying to have Rey convince Luke that being a Jedi and fighting for people who can't fight for themselves is a worthy cause. But it's lackluster at best and because of that\\, Act III is kind of a letdown. What needs to happen is for Rey to be more into the Force and Jedi training than she is and as a result Luke gets reacquainted with what he loved as a young Jedi. In the process of trying to get Luke to come back Rey finds herself. Her dramatic question here is\\, \\\"Will Rey find the confidence to be the hero she was meant to be?\\\" Luke's dramatic question is\\, \\\"will he rise above himself to save the galaxy again.\\\"\\n\\n2. Finn and Rose - this was actually rather amusing\\, albeit completely useless. The sequence where Finn and Rose go to Canto Bight is a McGuffin. They find the guy they are looking for but never talk to him. When we get to the end of the sequence their plans come to nothing and we are left wondering what the sequence was all about except for the Director to make some statement about rich people making money off of war at the expense of poor people and slaves. And it's kind of in your face and way too altruistic\\, just tell a story people. What needs to happen is for Finn to reveal along the way why he hates Phasma and how much he cares about Rey. Rose is a foil for Rey. She's got the same background but not the Jedi powers. But she's a confident and loyal friend. She cares for the people around her more than anything. Hence the reason why she saves Finn from his own self destruction in ACT III. Finn needs to realize what he likes about Rey as he spends time with Rose. Rose is a great character\\, I really liked her\\, but she needed to die. Reason being is that her real love was for her sister. Her thematic question is\\, \\\"will she get revenge for her sister's death?\\\" the answer is yes. She needs to save Finn\\, thereby redeeming the feelings she has that she failed her sister. And by saving Finn she does damage to the First Order's plans during the attack thereby getting her revenge. \\n\\n3. Finn and Phasma - Finn has a hatred for Phasma but it never gets built up so we feel his emotion whenever he sees her\\, they briefly meet and she dies. End of story\\, nothing to see here folks\\, nothing to see. Phasma is a mannequin who finally shoots her blaster but for the most part is relegated to saying \\\"on my command\\\" once again. NO ONE IN THE MILITARY TALKS LIKE THAT! Dude\\, seriously\\, Disney\\, hire me to make your military characters authentic. Ok\\, Ill do if for free. We need to see Phasma doing what she does best which is carry out the twisted bidding of General Hux. Hux needs to order Phasma to chase Finn and Rose to Canto Bight and stop them from doing whatever it is they are going to  do. The climactic battle between Phasma and Finn needs to happen at Canto Bight in ACT II not on a Star Destroyer in ACT III. Finn needs to win but not kill her. She has potential to be a great character\\, so the franchise needs to capitalize on that and keep her terrorizing everyone. \\n\\n4. Finn and Rey - There's a love story here that the franchise seems apprehensive to reveal. Finn loves Rey\\, but Rey doesn't get it. She just thinks they are friends\\, a common theme in society today. Finn never really gets to do anything to save her or fight for her because there's a desire by the franchise to keep Rey asexual and not in need of needing a man. Let's get over it. Love goes both ways. Let's let Finn step up and win Rey's heart. \\n\\n5. Kylo and Hux. The conflict between Hux and Kylo is great in the dialogue and acting\\, but Hux has no leverage over Kylo like a Tarkin or Thrawn would. They just seem to fight like brothers who have yet to grow up. Can we give Hux some kind of presence like Tarkin. \\n\\n6. Snoke - We finally get to experience Snoke\\, but then he dies. I get it\\, it's so Kylo can become the supreme leader. But honestly it's too early for that. Snoke needs to stick around for a bit longer. He should die in ACT I of the next movie. That's when Kylo should take over.  \\n\\n7. Benecio Del Toro's character is super fascinating\\, but he eventually just walks away like nothing happened and where we had a new Lando\\, we have nothing. Instead he should have been the guy they were looking for all along. He should have had the ability to change his looks and he was actually the guy on the gambling floor. I'd need another day or so to figure out a different story line\\, but he needs to need Finn and Rose. Currently he's the one that helps them. Why? It should be the other way around. Finn and Rose should be offering him help. If Phasma shows up like I stated above then we have some very tangible reasons for the three to help each other out. Ultimately\\, Del Toro should hate the First Order for some reason. But have no love for the Resistance either. He just wants to get paid\\, but he has some kind of moral struggle with abandoning Finn and Rose. Without this dynamic the sequence has no purpose whatsoever. The Character is a ruse that just adds to the colossal disappointment that is The Last Jedi. \\n\\n8. Poe and Leia. The love story between Poe and Leia is palpable\\, but for some reason beats around the bush. It's not romantic love but mother-son love. Poe should be the son that Kylo never was. Poe loves Leia like the mother he wanted. Which is why he cares for her so much when she's in a coma. The only thing we get out of the current story is him touching her hand. Overall\\, Poe needs to grow up. Poe is cool\\, but the most fun we ever get out of him is the opening scene to TFA. He spends most of this movie doing pretty much nothing\\, except mutinying. The dramatic question here is \\\"will Poe grow up and become the man he is destined to be? Will he become the leader that Leia has been for the Rebellion?\\\" In the process of dealing with Holto he should become this man and leader; and show us how great he really is. Right now he's just \\\"cute\\\". Weak sauce!!!\\n\\n9. Leia and Holto - Holto is a foil for Leia (and Poe). She should reveal Leia's care for her people as well as Leia's command presence. Right now\\, Holto jumps into the story out of nowhere and we're given a brief backstory in a single comment by Poe. Then Holto and Leia have a really awkward chick moment of holding hands and trying to tell each other\\, \\\"may the force be with you.\\\" GAG\\, PUKE\\, GAG!!!! People are about to die\\, let's have a sense of purpose here. It seems that Holto's existence is also to show how Poe is a pig. Holto needs to instead show how great Leia is and be the opportunity for Poe to step up in an epic way\\, not through mutiny. In the opening battle scene we need to be introduced to her as she flees from her own ship and crew as a coward. Her cowardice would make Leia's courage look even more valiant\\, but instead\\, as it is now\\, Leia has competition on the screen. Come on screenwriter! Anyway\\, in my world Leia should reprimand Holto like she does Poe\\, but  not demote her. Leia has compassion for her because Leia understands the burden of command. When Leia is in a coma\\, Holto gets command over Poe because of rank. Whatever fear the people had before hand\\, is worse. They look to Poe for leadership and it's up to Poe to step up or not. It's also Holto's chance to step up as well. Holto admits her weakness\\, asks for help  and ultimately suggests going to the rebel base on the planet. Poe rallies the troops to support her and he also  suggests sending Finn to Canto Bight as another option. With all options in the works\\, Poe and Holto work together. In the process Holto redeems herself and Poe learns what it means to really lead. In all this we see the legacy that Leia will leave when the day comes for her to depart. Holto's self-sacrifice by scuttling the ship will be heavier and carry more meaning when it happens. As it is now\\, it's really stupid. Like super lame. Her motivational speech is the worst ever. Plus\\, no good leader keeps their plan a secret from their people. I don't agree with how Poe reacts in the movie\\, but I don't blame him. Those types of leaders are irritating and frustrating. Anyone in the military would know what I am talking about. \\n\\n10. The Force - The Force as it was in the original trilogy was great. But then George expanded on it and made it more New Age. The new movies have made it worse. The Force can never be a true balance between light and dark. There is no equal weight for both. If the light needs the dark then the First Order isn't bad\\, it's needed. And the Resistance's desire to win is just as oppressive and evil as the First Order is. And in all that there is no way for humanity to grow and get better. Nothing is good nor bad. Good is evil and evil is good.  In reality\\, the Force is the light and the Dark side is an aberration of that. It's what the Force looks like when selfishness and the desire for personal greatness exceeds one's care for their fellow man. When we meet Luke in the this movie\\, his relationship with the Dark Side needs to be palpable. He ran from the Jedi order and the Force\\, thinking it needs to die. But Rey reminds him of the goodness that once was the Jedi Order. Luke's struggle in this movie is whether he will live in the light (save the galaxy again) or live in the dark (being a hermit solely worried about himself). In the end of the movie\\, when he sacrifices himself in the final battle he shows just how good the Light Side and the Force really is. It gives hope to the Galaxy again. And to Rey. It shows Rey the burden that she must carry and she has to ask herself at the end of the movie if she is up to the task. When Luke dies it is weightier. But he shouldn't die here. That should have been changed when Carrie Fisher died. Leia should have died. Another aspect to the Force is the line about needing to burn the old books because things are changing. I get it\\, this speaks to organized religion in our society. But just as the franchise's understanding of the Force is messed up so is societies understanding of religion. Did anyone notice that the Jedi texts were on the Falcon at the end of the movie? That's because the truth is that the old Jedi texts are needed. Rey can't become who she is suppose to be without knowing what the Jedi order is about. And because Luke didn't do much in the movie to train her she needs something. The Jedi order and the Force will never change\\, the galaxy will though. \\n\\n11. Leia's death - At the end of the movie Leia and Rey have a moment at the ramp to the Millennium Falcon. When Carrie Fisher died the Franchise should have spent the money to change this scene with CGI. Leia needs to look at Rey and tell her that Poe is the leader now. Rey needs to try to get her to come on board\\, but Leia has one last battle to fight\\, and that is to save her real son\\, Ben. She then turns to head back to the Rebel base to find him. We know that she is not coming back. \\n\\n12. Overall Dramatic question - There doesn't seem to be a point to this movie. Social Justice Warrior want to say it's about the nobodies coming to power. But Power corrupts those who aren't prepared to bear the burden of power. There are good people in powerful positions\\, and there are bad people in low positions\\, just as there are bad people in power and good people not in power. What this movie should be about instead is sacrifice. The dramatic question should be this\\, \\\"What are you willing to sacrifice your life for?\\\" As it currently stands this movie sucks. If they had made the movie I just laid out we would walk out of the movie asking ourselves who or what it is that we love and how we\\, ourselves\\, are willing to die for those people or causes. \\n\\nThis movie sucked really bad. It actually makes me want to go watch the Prequels because I might have a newfound appreciation for them after this. Overall the characters a great\\, they just need some development\\, some direction and a plot that they can all get behind.","true":true}