{"101487":139313,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really wanted to like this film. It's preachy\\, but lacks a moral. There's plenty of grandstanding about \\\"resistance\\\" and \\\"following orders\\\" and running away or not running away. But what was the moral to the story? And which side won? It's not clear. \\n\\nThe pacing is also terrible. There were at least 10 moments where I thought \\\"ah\\, this was the climax\\, the film is going to end\\,\\\" and then the film went on for 30 minutes or more. \\n\\nSpoilers below!: \\n\\nThe plot is also overused at this point. What's the point of a \\\"rebel runs away\/fights the evil empire's big weapon\\\" movie for the umpteenth time? And the time scale often doesn't make sense. We start with 18 hours until something bad happens\\, then Finn and Anna have a long adventure that should have taken them days in flight time alone\\, and yet they return just in time.\\n\\nThe movie also had too many new characters that we are meant to care about. When they sacrifice\\, we're supposed to feel bad. When a new villain attacks a new hero\\, we're supposed to despise them. But we felt nothing. Characters we already loved have been edited out of the story\\, leaving us with a cast of fresh faces which fail to elicit emotion. The good guys are dull. The bad guys aren't frightening.\\n\\nI don't care about narcissistic Rey\\, no matter how often she stares at the camera with wide eyes. I don't care about incompetent Finn. I don't care about \\\"spunky\\\" Anna. I also don't care about Supreme Leader\\, Shiny Stormtrooper\\, any of the Rebel pilots\\, or the prickly young commander. The only characters I connected with were the thief (who turned into a villain?) and the penguin creatures. The most emotional moment of this film was when a CGI penguin was cooked and eaten.\\n\\nYou know what I'd enjoy? A Star Wars film with Harrison Ford as the primary character. Leave out the new characters that nobody cares about\\, and bring the real Han Solo back.\\n\\nThis film was so poorly done\\, that the prequels look like masterpieces by comparison.","true":true}