{"101487":124750,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Great film\\, I personally loved it. I'm not even too big of a Star wars fan\\, but I found it enjoyable. I loved the fact that it wasn't similar to the originals in too many ways\\, but they also made it feel like a true Star wars film. Some things that were similar were mainly callbacks for nostalgia purposes. It provides many interesting twists and proves that not all the interesting characters are related to Darth Vader. The Finn and Rose subplot was not the best but it helped bring the film to an all time low of sorts. This \\\"all time low\\\" of the movie was when the rebels had almost nothing left\\, Rose and Finn's plan had failed. But of course Admiral Holdo then sacrifices her life and the ship to save the rebels. They escape to Crait. And the great part is only shortly after is pretty much the climax of the film. Luke Skywalker returns and gives the rebellion hope. Hope is one of the main themes in Star wars and this film focuses on that a lot. Some things I didn't like\\, the Rose and Finn kiss. It was almost like he was kissing his sister\\, weird and there was zero emotion put into it\\, plus there was no romantic build up. Killing Snoke was a bit underwhelming but they might bring him back. The lack of  lightsaber fights was kind of meh but that isn't too much of an issue. Captain Phasma was a waste again and they could've sent a few more memorable characters off better\\, eg Admiral Ackbar. But overall\\, it was a great movie and when I watched it me and my friends has to sit there and think as well as just being dumbfounded by the plot twists and Luke's very peaceful and imaginative death. \\n- Jules\\, 13 years old","true":true}