{"40636":"33091","TLOU2":"TLOU2","2020-08-05":"2020-06-25","10":10.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"For someone new to the franchise this was an incredible experience. I am moved to write this review mainly because I highly disagree with those who rate it negatively. It's not unlike getting to the top of a great mountain vista and having your teenage son berate you for making you miss their Saturday morning cartoons. There's no accounting for taste but then again a refinement of cultureFor someone new to the franchise this was an incredible experience. I am moved to write this review mainly because I highly disagree with those who rate it negatively. It's not unlike getting to the top of a great mountain vista and having your teenage son berate you for making you miss their Saturday morning cartoons. There's no accounting for taste but then again a refinement of culture does echo the divine. And there is something divine about this game for me. It's beauty it's attention to detail it's immersion. It's story. A lot of feeling people put a lot of work into this and I applaud their monumental efforts and appreciate how touching it was for me to experience. I mourn the fact that so many others for whatever reason failed to appreciate this for what I can only assume is a lack of depth empathy and intellect. I can maybe see where people were thrown off but again it seems to me to be just poor taste. The metaphor that comes to mind would be taking someone on a roller coaster ride and having them complain about the ups and downs and the fear they felt. While the reasoning is valid it is simply a failure to appreciate something that is wonderful to behold and to experience if one has an open and undefiled mental state. And the fact that so many people are playing this game and reviewing it seems to bespeak an underlying lack of awareness on the part of those giving it such negative reviews. Perhaps they like it more than they are even aware but for a few key ingredients that they are stuck on which didn't go as they wanted which would have made it a pretty white bread sequel in all honesty. In any case good art is appreciated and celebrated in its time by the masses but great art often goes undetected or is even ridiculed except for a select few. The fact that this game is so hype and so hated by so many may actually be a credit. Truly though it is a credit unto itself. One does not need to read the reviews to know it one simply has to play the game. And for people who aren't gamers cinephiles perhaps would marvel at what could be done with the medium. For this game truly played like a movie like a long uninterrupted epic with themes and motifs and tropes and the like. Maybe someday in the future they will have high school or even college age students play this game and its predecessor like you might read a book for a liberal arts class. For that is what this ultimately is - a genre defining work of art. I hope people come around to it and replay it for it is definitely as good if not better on the second playthrough. And again applause for the creators and the designers. Thank you for your dedication and your commitment to your craft. It takes courage integrity and grit to do what you did here. Thank you.… Expand","true":true}