{"101487":169512,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"===SPOILERS===\\n\\nWow. What a way to turn an entire generation's hero into a depressing\\, suicidal man. Who left a map behind so someone could find him to only tell them to go away and let him die alone? His reason he was there was to die. Not to find a way to beat Snoke or bring Kylo back into the being of Ben Solo and infold of the light once more. Nope\\, just to die.\\n\\nNot only that but to also offer little to no explanation on how the First Order took over the galaxy in which the Resistance is muddled with also being the New Republic? Wasn't the FO an Imperial Remnant in TFA and the Republic was demilitarized? I very confused. Does that mean Coruscant has now been destroyed by the FO?\\n\\nKnight of Ren? Dropped.\\n\\nGeneral Hux? Reduced to the landfill that is most of Rian's joke throughout the fill. While seeming to now have become a sniveling minion. Sure Piett from the Originals was somewhat kiss-ass to Vader\\, but at least wasn't reduced to a joke that is made fun of from both sides of the FO and Resistance.\\n\\nRey. Why ow why is still still so powerful with little training? I understand her and Kylo are 'Connected' as it were but it doesn't mean they should be of equal strength - Luke struggled to find his power\\, he trained for it. While Rey is simply gifted with it and it makes her by far the least relatable protagonist Disney has out on screen while I suppose makes semblance to Anakin being born a slave and rose into a Jedi but even he wasn't showing feats of unbelievable strength in the Force.\\n\\nWith what little training scenes Rian should have made Luke truly pass down his training to her in a far more meaningful way\\, like being handed a touch to make the generational passing of the mantle more spirited\\, more meaningful and more logical opposed to \\\"Here's some breathing techniques now get out and let me die\\\"\\n\\nPhasma once again under utilized and now supposedly gone? Guess we'll see in EP9.\\n\\nFinn and Rose's adventure to find the unneeded DJ wasn't fun to watch\\, and being reminded of the timer every couple of minutes was insulting - Along with the freeing of the space horses.\\n\\nI understand wanting to do things different but the movie lacked Star Wars' soul and emotion. While it was a great feel and had me engaged throughout\\, it just wasn't a great or even good Star Wars film.","true":true}