{"101487":180834,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film definitely has what The Force Awakens didn't - Character Development. Finally! And some good development too\\, from Poe learning it's not all about sacrificing yourself to be a hero to Rey actually coming across A problem and not easily beating it first try. However this film does have some major issues. To begin with\\, Kathleen Kennedy's style of enforcing feminist type characters and plot points has returned and it's annoying. Why? Because it's unnecessary\\, again. The best example is the new female admiral\\, played by Laura Dern\\, that has dyed purple hair and likes putting \\\"flyboys\\\" like Poe in their place. Her character\\, although played well by Dern\\, was a complete waste of time and frankly an unnecessary addition to Star Wars. Another major issue was the whole Canto Bight subplot that was a huge waste of time. The largest issue was the handling of Luke Skywalker who is guaranteed to disappoint true Star Wars fans. Even actor Mark Hamill stated that fans would be disappointed. In Summary\\, The Last Jedi is somewhat an improvement compared to The Force Awakens and yet doesn't feel like.a Star Wars film because director Rian Johnson has tried to hard to be different\\, he almost completely threw out all the plot points J.J Abrams set up in Star Wars 7 in favour of his own views which will continue to confuse fans when JJ takes back the mantle of Director for Star Wars 9 and will have to deal with this blow to the story he started because Disney had no idea of how they wanted this trilogy to go and instead of 2 years of planning followed by back-to-back filming like the Lord of the Rings trilogy\\, they have just allowed their directors to screw each other other with creative differences.","true":true}