{"101487":129337,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a huge Star Wars fan and have been since I was a kid watching A New Hope.  I had high expectations for this movie as did my kids who are all Star Wars fans. I have seen every Star Wars film and enjoyed them all.  I came out of this movie disgusted with how Luke's character was portrayed.  I have many issues with the movie - the Leia scene floating in space was ridiculous\\, the terrible jokes that fell flat\\, etc.  I get that the old Star Wars characters need to be written out of the story\\, but there are much better ways to do it.  Luke Skywalker is the boy who blew up the Death Star\\, destroyed an AT-AT walker with only his lightsaber\\, risked everything to save the galaxy and his friends by confronting the two most evil villians in the galaxy alone (the emperor & Vader)\\, and turned his father Vader back to the light side effectively ending the Sith rule of the galaxy.  It is impossible for me to believe that because he sensed his nephew growing in the dark side and betraying him he would\\, abandon his friends\\, give up all hope\\, cut himself off from the force\\, and go to a secluded island to die alone and destroy the last remaining artifacts of the Jedi.  The scene of him throwing away the lightsaber and ignoring\/refusing to train Rey while talking about the Jedi as if they were an old obsolete religion made me sick.  Rain Johnson went for shock value in this movie over substance and character development and it did not work.  The face of Star Wars - Luke Syywalker became a miserable\\, weak old man\\, depressed and uncaring about his own friends and family's suffering.  I don't believe that Rian Johnson understands what Star Wars fans truly love about the movies.  Characters with no background stories or meaningful relationships to each other in the Star Wars movies are dull and boring.  Not every Star Wars movie needs a shocking twist or surprise plot turn.  Fans are just looking for a good story with characters they care about and can relate to.  This is what George Lucas gave us.  This is the only time in my life that I left a movie theatre seeing a Star Wars film and caring less about the next sequel and feeling disgusted about what I just watched.  My kids felt the same way.","true":true}