{"101487":146661,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was hyped I can admit that and excited for the next generation of SW heroes to take center stage.  The new heroine Rey is great addition to the long lineage of SW characters and I thought she did great with what she had to work with.  Lets cut to the chase shall we?  SPOILERS AHEAD\\n\\nI hated just about everything about this movie from the rail-thin plot to the mischaracterization of Luke Skywalker. The \\\"admiral\\\" in a purple dress? Pathetic. Could you be less military? She makes the \\\"hard\\\" decision to blow up an enemy armada even after she has already committed to sacrifice herself. That's what you should have done in the first place\\, idiot. Hell\\, if that was possible\\, you should have had one of the other two ships do it! Not telling your people your plans to get them to a base where they will be safe? Stupid decision. Why not tell people that there is specific hope? Do you want a panic; a mutiny for no reason? Benicio del Toro...what the hell was the point of him? Or the entire plot line to the casino planet? Also\\, the only way you can get filthy rich is off war? Really? Rose. What was the point of her? Luke's whiny\\, depressed\\, fearfulness followed by his unexplained merging with the Force? No. He was a figure of hope. He isn't a whiny bitch who milks weird sea cows and abandons his friends and family because he made a mistake. Carrie Fisher's weird\\, Mary Poppins moment? Suddenly she's some inspiring military leader? Even in the badly done \\\"new canon\\\" she's described mainly as a diplomat. Even if she was a \\\"military\\\" leader\\, what was the deal with wanting to stop the attack other than that you are a squeamish about casualties? The shit tactics of using a single pilot to render a dreadnought defenseless is just as stupid a ploy as the one you slapped and demoted Poe for! Porgs. Really? Why? The weird reappearance of Yoda that didn't add shit to the plot? The dark side vision that was almost completely devoid of meaning? Aside from all of that how is the resurgent \\\"First Order\\\" so strong so fast and so completely? How did the fledgling Republic manage to concentrate its forces to the point where they were all groundside for the destruction in The Force Awakens? All of a sudden the forces that managed to defeat the Empire are so damned weak their \\\"last \\\"fleet\\\"\\\" is no more than one MonCal Cruiser and two pathetic support ships and a few shittily-designed bombers? I get that LucasFilm was purchased and they inserted shitty computer generated cartoons to substitute for dozens of years of canon\\, but still\\, can you not fuck with everything that made the SW universe great? Hell\\, we still know nothing about Snoke. He was this \\\"super powerful\\\" Sith? person who suddenly appeared with stupid looking samurai guards on a giant-ass ship... Ok? We know nothing more about Rey. Like\\, at all. We don't really know much more about any of the characters. So few good things have happened to the series since Jar Jar Binks was invented for comic relief and to appeal to idiot children that I almost gave up my obsession\\, but if the movies continue to suck goat balls\\, I might just have to resign myself to re-reading X-Wing and Timothy Zahn Star Wars books in a vacuum.","true":true}