{"101487":177780,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The opening scene was supposed to be funny\\, I guess.  It came off as campy and poorly timed.  They ruined what SW was about and basically took the last 7 films and destroyed what was created.  The side story of Rose and Finn going on that mission was a complete waste of time.  It accomplished nothing at all but freed a bunch of horse looking animals that would probably be rounded up later.  Too bad no thought was given to the kids that were left behind as slaves.  By the way\\, the end scene shows that mystery kid using the force to grab the broom handle.  I'm sure we'll never see him again.  You could cut out that entire mission and the overall story wouldn't change at all.  The long drawn out space chase was stupid.  Just launch the Tie fighters against it.  They made it sound like they couldn't function that far out\\, but other past movies showed them farther away from a death star.  I was expecting Luke to step up and maybe fight Snoke at the end\\, after all they showed Luke on the Falcon.  It wasn't until R2D2 showed him a recording of Leia's plea for help video that he decided to do something to help.  Honestly\\, I was expecting to hear a thud or a clank sound after Luke disappeared\\, because I was thinking his fake hand should have stayed behind.  Right?  Overall\\, the movie made no sense and made Episodes I - III look good.  I think I'll stick to the previous movies and not watch any additional sequels.","true":true}