{"101487":187417,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This sequel had so much potential (because of ep. VII) but keeps letting you down over and over throught the entire movie. It has some good things\\, but it has even more bad things.\\n\\nGood things about the movie: \\n- Good visuals\\n- New ways of using the force\\n- Entertaining\\n\\nBad things about the movie:\\n- The portrayal of Luke's character is inconsistent (lets be real\\, this is not the Luke we know\\, the hopefull guy who saw goodness in Darth Vader\\, now is a whiny old man who doesnt care about anyone).\\n- Rey is still a Marie Sue (this is more a problem of ep. VII\\, but this movie does nothing to correct it. Rey is good at everything with no explanation\\, fighting bad guys? Always wins. Piloting the Millenium Falcon? Sure! Using the force for mind control and grabbing objects after learning about the force just 2 min. ago? Easy! Winning Kylo using the lighsaber for the 1st time? No problem. Lifting giant rocks with no training? I could go on and on...)\\n- Why is Rey one of the main characteres? Besides talking to Kylo Ren and lifting some rocks what does she accomplish in this movie?\\n- The whole casino scene is just pointless. (nothing is accomplished in this arc).\\n- During the chase arc\\, why the New Order doesnt send small ships to attack the Resistance's main cruser? \\n- Why general Holdo doesnt tell her plan to anyone? \\n- Finn\\, Poe and Rey don't get any character development. (Finn had so much potential\\, but keeps getting blocked first by Rey and now by Rose)\\n- Rose is pointless (there's absolutely no reason for her to be in the movie besides blocking Finn's character evolution).\\n- There's not even a sentence about Snoke's motivations or backstory. (how did he fund the First Order? How did he find Kylo Ren and turn him to the dark side? \\n- Phasma is wasted...again.\\n- The humour is so... Marvel...\\n- The knighs of Ren... no clue about them.\\n- Leia Poppins (on paper sounds like a good thing Leia using the force\\, but the execution in the movie was so cringy).\\n- There's any reason for Luke's death? (I don't mind him dying\\, but we get no explanation for his death... did he use all of is strength to project himself to another planet?).\\n- American political agenda and SJW inflences (please don't bring those subjects to a Star Wars movie\\, this is not the right franchise to do that).\\n- Besides Snokes death and Kylo being now the new leader\\, the story didn't evolve or go further from The Force Awakens.\\n\\nEp. IX has a lot of problems to correct. I hope it does\\, but I'm not hopefull.","true":true}