{"101487":196679,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While the casino subplot may have been unnecessary (albeit with good intention)\\, this movie is a masterpiece. Star Wars: The Last Jedi not only adds in a new chapter to the franchise but also brings focus on the gray areas that reside in the force and its users. Daisy Ridley and Adam Driver steal the show with their chemistry and bring us one of the best fights ever done in a star wars film. The negative audience response to this film is clearly based less on the efforts of this film and more toward the overall animosity the franchise has received since it was brought to Disney. Complaints of the movie for taking the risks it did and showing us new sides of these characters show just how hypocritical these fans are as their main complaint with Force Awakens was the lack of ingenuity by essentially taking the plot of A New Hope and switching up the characters. While it is true that there was a lot of great things in the expanded universe of Star Wars before the retcon\\, we must accept that with every great idea born from it\\, came  10 ideas that were steaming piles of crap. This is not the Star Wars you grew up watching\\, but that does not mean it's bad by any stretch of the imagination and honestly now Star Wars fans know what it's like to be Star Trek fans in the wake of the Abrams films (the only difference being that Star Wars was a cultural phenomenon that touched everyone whereas Star Trek created a very deep following for a select few). This is a great film that takes risks and does something new\\, go see it and watch it as such. This bold direction of story telling should absolutely be rewarded","true":true}