{"101487":113460,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Comedy\\, Horse Racing activists\\, and Mary Poppins\\nMinor Spoilers!!!!\\nThe Last Jedi is a movie plagued by a scene from the Force Awakens. At the beginning of TFA when Kylo and Poe are face to face it is suspenseful and has a good joke. Sadly\\, Disney saw the audience reaction to this one joke and decided to cram it into every portion of The Last Jedi. Suspense was killed by an overabundance of jokes that should of been at a total of 3 instead of 30. I knew it was going to be bad when they botched the first meeting scene with a lightsaber over the shoulder. I believe that everyone wanted to see Luke and Rey train in a similar way to Yoda and Luke. However\\, training was non-existent and was plagued by jokes and porgs. The biggest waste of time was the casino planet and Disney trying to teach a life lesson. This theme of people being oppressed\\, rich people only dealing in arms\\, and the evils of animal racing felt like a sermon. The worst part of the movie was Leia floating through space like Mary Poppins. Nothing like an iced over person in space who magically comes back to life. \\n\\nDisney missed the mark on which movie to give a different\/comedy feel. The Han Solo movie would have been a good one to try the new format\\, but sadly they threw it into the main series as a mark for eternity. If Disney wants to keep the series going they need to move away from the Marvel format and mimic the feel of the Force Awakens.\\n\\nTFA and TLJ are currently the political parties in the United States. TFA was deemed too conservative and similar to the old times. Instead of moving to the middle\\, Disney instead went to the other side of the spectrum and was too Liberal. Hopefully IX will be right in the middle (with JJ Abrams of course)","true":true}