{"101487":186789,"Last Jedi":"Last Jedi","2017-12-15":"2018-10-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was not only a horrible joke on long time Star Wars fans.\\n1. Most things that happen in this movie break the original \\\"laws\\\" of the Star Wars universe (and I'm not just talking about the little things Lucas did.\\n Jedi no longer have to train\\, they can just get more powerful by accepting that they can use the force apparently (as is displayed by Rae as she basically trains alone majority of the movie and by the end she moves rocks even Yoda found difficult with great ease.\\n Yoda comes back as a force ghost and can use the force to effect physical objects in the real world (which means no one ever had to fight all the back to the 1978 Star Wars) and Luke can just transcend whole galaxies by using the force but somehow thinks he's too weak to beat Kylo Ren...\\n\\n2. This was a big one. \\n(A new hope) Luke as a child never knew who he was\\, grew  up with his Aunt and Uncle and was a farmer on a desert planet. (think about that for a moment... how HORRIBLE is your life as a FARMER in the DESERT) suddenly he finds out that his existence is much more\\, he can use a mystical power that is apart of the very fabric of life itself and he plays a vital role in the known galaxy and he is the key to it's salvation. He is willing endure whatever it takes to save his father in the process and even loses his mentor and a hand in the process. Flash to \\\"TLJ\\\" and now Luke has seen Kylo Ren rising so he runs and hides like a coward and leaves his friends to their fate...\\n Sorry but that was lazy\\, pathetic and effortless writing and despite Abrams and Johnson trying to say that people didn't like the movie because of chauvinism women are NOT the issue in this move at all.\\n It's a horrible lack of imagination which makes it even worse because if they couldn't figure out how to make a decent movie they should have used one of the many books for reference because though the writers of those got paid millions less they were millions of times more creative than this piece of trash.\\n To quote JCVD in *The Expendables 2 \\\"I want my money back!\\\"","true":true}