{"101487":149993,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Like many of the reviewers here\\, I have waited some 40 years to see Luke Skywalker and the gang again- and to relive the magic that is Star Wars. Like so many of the reviewers who have chimed in\\, Star Wars is part of my personal mythos. More than a movie- so much more. I really enjoyed TFA. Loved it\\, in fact. Thought Abrams did a great job conveying that same magic of the originals through the sotry line and music. \\nThe Last Jedi\\, however\\, left me feeling bewildered and disappointed. In fact\\, the disappointment began early on in the film. I rushed to see if opening night- with great expectations. \\n\\nThe film relies far too heavily on those familiar star wars gimmicks without delivering in character development or story line. Abrams laid some phenomenal ground work in TFA\\, teasing us with the idea that Rey was a Skywalker\\, setting up Snokes as a supreme and powerful and villain\\, giving us new characters Finn and Po\\, and teasing us with the ultimate holy shit we've waited forty years to see Luke Skywalker in the next film OMFG moment. \\nSadly\\, TLJ drops the ball on all of this. \\n<> I didn't mind that Luke tossed the saber over his shoulder like it was a piece of cosmic trash- that seemed pretty Zen to me- like something yoda would do. However\\, the rest of his narrative was troublesome to me. Was Luke that much of an unenlightened asshole that he would attempt to slay his own nephew while he slept- and then retreat to an island with a death wish- without any intervention from Yoda or Obiwan- or any kind of hindsight that perhaps he made the wrong move and needed to come out of hiding? Seems unlikely for such a powerful Jedi. Which brings me to two other points- where the hell was ObiWan and why in gods name did they use a shitty CGI version of Yoda? Why not use the original puppet? Don't take me out of the movie by showing me a CGI version that wasn't even done properly. Which brings me to another point- I was totally taken out of the experience of the movie when Laura Dern appeared as a major character. WTF Disney?! I love her as an actress but the only thing I see when I look at her are her most recent performances in Big Little Lies- when I see her I think HBO and Billy Bob Thorton- NOT star wars- there was no need to cast such a well known character actor in this role- that felt like a major fail to me- as did the appearance of a stuttering Benicio Del Torro or whatever the f his name is\\, as another main villain. Too eccentric with his portrayal- it screamed hollywood and took me out of the picture. \\nSo much time was wasted on the new character Rose I found myself checking my phone- \\nno new character development on Finn at all- but they squeezed Rose in to this ill conceived plot (yep running out of gas) and wasted too much time there and the stupid romance set up.\\nMy major problems with this film was that we were all so looking forward to seeing Luke train Rey- and that didn't happen. She's a freaking Jedi master with NO training what so ever. It's almost as if Mark Hamill told the movie makers that he couldn't do any saber scenes- and they obliged- so not only did we see ZERO Jedi training- we didn't even get a decent light saber fight out of his role. NONE. Sure he can leave his body and that's cool and very Indian Sadhu like but shit guys\\, how about giving us the Luke we've been waiting forty years to see- not this disgruntled old man with a death wish.\\nThe way he died was cool- but seemed way too soon- after all- we just got him back- why send him off in a puff of the force so soon?!!! Can't he stick around a while!!??\\nOh- and they teased the shit out of Rey's lineage in the last film only to tell us that she is a nobody. Hmmm ok. \\nI originally loved the Leia flying scene but now I feel like it was cheap since we also didn't get a back story on her and it was the only display of her using the force in the last two films. They left a huge hole by not addressing HER death in real life- and now we are left wondering if they are going to CGI carrie into the next film.\\nAdam Driver's performance is the strongest in the film- he's just a great actor- but again they dropped the ball giving us this rich interaction between he and rey only to do nothing with it. Snokes may have lied about bridging their minds- but for such a powerful villain who can read minds\\, he sure as shit didn't see the light saber that Ben was aiming at his mid section. (WTF!?)\\nChewy and 3PO had some cameos that felt pretty forced and silly and the reunion with R2 was cool but his screen time was also too short. BB8 pulled off some cool shit so that was nice. \\nThe bird things were absurd- \\nthe whole conflict was weak and they seemed to be cramming us with the idea that a Jedi could be anyone and didn't have to come from a Skywalker lineage. BUT WE ALL ALREADY KNEW THAT. I left this movie depressed and disappointed and it was more about the movie itself than it was that all of the OG characters that we know and love are dead. \\nI'm done with this franchise. \\n#notmystarwars","true":true}