{"101487":136615,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm in my 30's. I'm not the oldest of Star Wars fans\\, and I'm far from the youngest. I grew up on the OT and absolutely fell in love with the entire Star Wars universe. I had dictionaries\\, EU books\\, loads of toys\\, posters\\, the list goes on. I still hold onto that stuff to give to my future children someday. I'm super stoked the franchise will have an impact on future generations as it did me. That being said... This movie really disappointed me. I haven't felt like this since Ep 1 and JarJar. Why? Well\\, certain websites will have you believe it's \\\"alt-right\\\" Star Wars fans that don't like the sex and race of the new characters. That's far from the truth. Truth is\\, it had so many plot holes and it repeatedly told the fans that the past didn't matter. Literally. Line after line telling us to forget the past. And moving on with new characters\\, of course\\, I understand that\\, but making comic relief out of getting rid of old characters is insulting to hard core fans that have poured out money and time into this franchise for decades. I'm fine with Disney starting an all new trilogy. I loved Rogue One. Hopefully the new Han Solo movie will be awesome. But this movie.... too many chances with characters that sit so deep with many many long term fans that made the franchise worth the $4 billion that DIsney paid for it. I have no idea where episode 9 will go. I'm very skeptical now to see the future Disney Star Wars movies. I normally go watch a new Star Wars movie 5 times in the theater. I am done after 2 viewings. I gave it a fair shot. The 2 stars go to the Star Wars they got right\\, which is actually a good amount. A shame that it doesn't counteract what they got wrong. Was awesome seeing Mark Hamill back on the screen\\, sorry what they did to Luke\\, Mark was disappointed and I now see why. And Adam Driver is fantastic. Daisy Ridley is fantastic. John Boyega is fantastic\\, would have liked Finn to have a more important and worthy roll. And of course\\, Carrie is the GOAT of the film (even with that one scene... y'all know which one) and SPOILER:\\n Admiral Ackbar...he deserved more","true":true}