{"101487":199985,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"You do not need to go back to the original movies or the lore established over almost forty years to show that this is a bad movie. In fact it actually weakens your arguments since it makes it easy to dismiss the critique as the whining of hurt fanboys. All you need to do is to simply work with what was established in the direct predecessor to see the glaring obvious shortcomings. The big challenge for fans of the old movies was to accept that this trilogy is not going to be a genuine continuation of the original movies but rather a reimagining or a kind of remake masquerading as a sequel. Once you accepted this J.J. Abrams delivered an engaging story\\, state of the art visuals and most importantly unbelievably great characters. The scene were Finn lifts his helmet and reveals a human face beneath the inhuman garb of the stormtroopers made it instantly into my list of top three star wars scenes. What some of the so called professional critics dismiss as fan theories that did not pan out are plain and simple logic deductions based on what was established in the Force Awakens along the lines of what is generally and objectively regarded as good story telling and character development. Nothing that was established in the Force Awakens was followed up upon. It was not the fans that had unrealistic expectations for the interactions of Luke and Rey\\, it was the very preceding movie itself that did set the whole thing up. A young woman of mysterious origins with powers she couldn't possibly possess\\, easily besting trained users of the force\\, having visions when finding the sabre of a legendary jedi master\\, the aforementioned jedi master having gone into hiding not without leaving a mysterious map that could reveal his position in times of need. Come on! I am not making this up! This was the story that was started in the Force Awakens. If you need any prove\\, that the guys styling themselves professional critics have it wrong is the fact that Disney is bringing back Abrams. This move is neither cheap nor easy to communicate internally because you can be sure that he won't do this without getting full creative control. The fact that this unanticipated move was made before The Last Jedi was released and started to provoke negative reactions proves that Disney is aware that the people that were entrusted with the franchise dropped the ball. Ultimately it is a pity because of Rey\\, Finn and Poe. I liked these guys.","true":true}