{"101487":148792,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Kathleen at Lucasfilm: HeY lady write me a star wars-movie where all the women are extremely brave and all the men are extremely stupid. Rianne director: I am not a lady! Kathleen: Whatever girlfriend\\, write and film! Rianne: shouldnot we think about what the viewers want to see? Kathleen: I told you I am not interested what viewers like. I am only interested in how the world should be in my view. Rianne: what do you mean? Kathleen: Well even though in REAL history men did all the fighting\\, all the dying\\, all the hard physical labor\\, in my reality they were really always the suppressors of all the womenfolk. Rianne: how.....? KAthleen: I didnot hire you to think\\, DO IT YOU SPINELESS MORON. Rianne: okay\\, okay. I will kill of this totally heroic dude I heard off called Luke in the most lame manner possible. Kathleen: love it already. Rianne: I wil do a \\\"Yo mamma\\\" joke. Kathleen: Love it. Can't you do a fart joke for the kids? Or something really dumb to cheer on for the kids? Rianne: sure. I have a few jokes. Throwing away lightsaber over shoulder by Luke: hilarious! Kathleen: Okay girlfriend. Do as i tell you and you can make a trilogy. Rianne: wow thanks.\\, but i really have not seen all the earlier movies. Kathleen: whatever. I want all the men be jokes\\, be angry boys or worldwar 2 SS-guys. How hard can it be? Rianne: euhhh? Can i make this snoke ... Kathleen: No he is a bad man\\, some kind a starwars-Hitler\\, so he has to die silly. Rianne: why? Kathleen: cause all the men are some kinda Hitlers\\, do i have tot explain everything? Rianne: no\\, no\\, daddy\\, I mean momma.\\n\\nPhasma -  female SS-leader. What does the viewer see: beautifull woman but totally unconvincing as a character. Motives: just wants to  be mean in a shiny harnass? What is her driving force? But again an NPC who is killed of against an invincible lead character\\, no surprise here. 1-Dimensional character\\, the archetype is the \\\"evil\\\" person.\\n\\nHoldo - an heroic  female admiral. What does the viewer see: An NPC who choses to help the cause by killing herself while destroying the capital ship of the enemy. Beautifull actress but why? Don't they have remotes in the future? We didnot get any chance to know her.  Another a not so interesting NPC who is killed.  Another heroic 1-dimensional character\\, there is no archetype.","true":true}