{"101487":131927,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I felt this film fell flat and crushed the momentum of the franchise. A typical sequel from start to finish - not much different than Thor: Ragnarok. The director was not up to the task of taking the helm of such a difficult project. Professional critics seam detached from these films entirely (or scared of backlash for putting this movie in its place: bottom of the crap heap?). My profile pic is 1979 six year old me wearing an original Star Wars shirt - lifelong fan and of the EU\\, etc. I've worked in Film & TV music and have scored soundtracks - so I'll critique the area I MAY have a better ear for than the average film critic. John Williams did what he gets paid to do (though he's lost a couple of steps\\, imo.): He scored the entire film start to finish - which often means filling the movie with tracks and giving the director options to use throughout so they can set the mood of the scene more to how they see fit. It sounded like Rian wanted to use everything John Williams & Co created for the film which oversaturated the movie with almost relentless and non stop orchestral flares and chunks that were out of place and didn't quite match up with the mood of the scene. I don't know much about Rian but if I were to guess - it sounds like he doesn't have a lot of experience in painting the space with orchestras. Halfway through I was tired of the music positioning and improper invocation of a musical mood that didn't really belong. Where I'm no expert but have an opinion: the script forced itself on the viewer and the prior films \\\"spirit\\\" felt largely ignored. I don't think this guy is up for the task - JJ Abrams is much better suited.","true":true}