{"101487":174095,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The feeling that struck me on immediately exiting the cinema after witnessing this film was very difficult to articulate. I felt all at once empty\\, uneasy and unsure but I couldn't shake an incredible sense of fascination with what had just been presented to me. I enjoyed the film sure but there was just something niggling at me that made it feel different to any other Star Wars experience I'd had prior. \\n\\nI thought long and hard and then it suddenly dawned on me and all the pieces fell into place. That uneasy dissonant feeling that plagued me throughout my viewing stemmed from a slight shift in the way these beloved characters that I grew up with behaved. The romanticised emotions displayed by the idealistic swashbuckling Luke of yore give way to an all too lifelike damage husk of a man with echos of PTSD thrown in for extra discomfort. The likes of Rey and Po even feel more rooted in an alternative reality modern day when compared to The Force Awakens. For me\\, and I'd wager many other viewers this slight alteration creates an 'uncanny valley' effect in which the struggles faced by these characters veers from threats based on high fantasy to tangible human threats that feel all too real.\\n\\nThe film shines a bright light on the grimy aspects of what an intergalactic war would entail and feels decidedly more mature than previous installments. Baked into the film are strong social themes and commentary on issues such as inequality\\, animal welfare\\, corporate greed and war profiteering. This may not be to everyone's tastes but I feel this presents a strong moral compass for the film and doesn't detract from the pacing or plot in any way. \\n\\nSpeaking of which each character enjoys a satisfactory ark in their own rights. Rey and Kylo being of particular interest with a relationship that subverts expectation and pays off exceptionally well\\, and this film is all about subverting expectations. \\n\\nTo (poorly) quote Luke Skywalker \\\"This will not go the way you think it will\\\" and he's very right. Many of the films beats do take a completely unexpected turn or leave characters who would ordinarily have a back up plan or make a plucky last minute escape in dire situations or dealing with a problem in way not often seen in these types of productions. This works insanely well in the films favour but also works drastically against it as I feel many audience members will be looking for those familiar fantasy beats that provide such great escapism. Unfortunately for them this film will leave them likely feeling cold and unfulfilled as it's priorities are found elsewhere. Rian Johnson has chosen not to pander to 'fans' (who incidentally decried the previous film for being 'too safe' or a 'remake') and taken a step in an unusual for this genre new direction. If you're luke warm (pardon the pun) when you leave the cinema then think about some of what I've said in this review and you just might find yourself having the same Eureka moment as I did when you realise that what you just saw perhaps wasn't bad but merely the evolution of a franchise which always brings with it some teething pains.","true":true}