{"101487":105010,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a fan of The Force Awakens and Rogue one\\, I have to say this is the worst made Star Wars movie of all time. For the first time I left the theater wondering what I just saw. The critics praised it so much\\, I thought to myself I can't be the only one disgusted of what just transpired on screen. But as a few days have past already\\, I clearly see that I am not the only one that is critical of the movie. Disney is trying to make things new and go into a new direction\\, I get it and I am always open to it. They set it up however in such a sloppy way that it makes you wonder are they doing this on purpose? Are they deliberately trying to get rid of the first generation of Star Wars fan by pissing them off so much that they will never want to see another Star Wars movie again? Apparently so\\, at least in my opinion\\, but this Star Wars movie is so bad that I had to post a review. I love the original trilogy and not a hater on the prequels or the TFA and Rogue One (with the exception of Attack of the Clones)\\, and I never thought I would hate a Star Wars movie until The Last Jedi. Eveything that is built up in TFA is ripped to pieces and thrown in the trash. Its almost like the director did a big \\\"F-You\\\" fans you either love it or leave it. Reys parents turned out to be nobodies that were drunkards who sold her for money....accept it. Princess Leia escapes death in the depths of space and uses the force to fly back to her ship and save herself...accept it. Supreme Leader Snoke\\, who was built up to be the most powerful user of the dark side of the force with no backstory yet is easily and swiftly killed by Kylo Ren...accept it. The while TFA revolved around Rey finding Luke Skywalker who turned out to do nothing but push Rey away because he is so distraught about his nephew turning to the dark side....accept it. (Mind you this is the same Luke Skywalker who was willing to sacrafice himself for Han and Leia in Empire Strikes Back). And apprently Rey who has never been trained in the force now has powers and abilities just as equal to Kylo Ren (who was supposedly Lukes best pupil)....accept it. I mean I could go on and on how badly thought out this movie is\\, but I won't. Unfortunately\\, this movie is so horrendous that I am not looking forward to the next Episode. The Skywalkers are dead....and so is my interest in Star Wars.","true":true}