{"101487":181254,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film spat on everything set up in episode 7. It felt like terrible fan fiction\\, and the plot was unbelievably bad. THEY HAVE HAD THIRTY YEARS!!!! It should have been amazing! Instead it's an overly convoluted waste of two and a half hours. \\n\\nPros: \\n-Benicio Del Toro is fantastic\\n-the hyperdrive manoeuvre \\n-Mark Hamill still kills it\\, even though the character was poorly written\\n\\nCons:\\n-NOTHING MATTERED. Rey's history\\,Snoke's identity\\, Luke\\, the dark side pit scene\\, the stupid side quest to space Monte Carlo\\, the Jedi... nothing in this god damn movie mattered at all. And that was the point of it\\, \\\"Haha look at us\\, we're pointing out cliches and turning them on their head! Aren't we bold and awesomely intelligent filmmakers.\\\" That's really good and all\\, but maybe make your own parody to do this. Don't make Star Wars into the a parody of itself. It was a slap in the face to millions of people. \\n\\nFin is wasted on a side quest the writers put in to make him seem useful. Pretty big waste of an awesome character. The new girl is fine. The whole relationship between them felt wayyyyy too forced. And their revelation that \\\"arms dealers suck\\\" was a groan fest. \\n\\nLuke dies FROM PRAYING TOO HARD!!!!\\nOur childhood hero has a stroke while praying...  and then obi-wan's it out of there. SO DUMB! \\n\\nAlso it was self aware in the Disney marvel sense. The jokes were out of place. Star Wars isn't self aware. It's beautifully corny! That's the god damn point! Don't messs with that! \\n\\n I think I'm done with SW films. Star Wars legends is now canon in my head again. I'm forgetting all about this awful film. Pls save us\\, JJ. \\n\\nI can't\\, for the life of me\\, fathom what the actual critic's are smoking with their generous reviews. It's not a good movie. If this was not Star Wars it would still be bad...but I wouldn't care. I wouldn't have signed into rotten tomatoes for the first time ever to voice my sadness and dissatisfaction with the movie. I felt so empty walking out of the theatre. It breaks my heart to say it\\, but the movie sucks. I'd give it a negative rating if I could. Please don't give them money for this heap.","true":true}