{"101487":183810,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie essentially writes the trilogy into a corner with nowhere left to take the story and no reason to look forward to episode 9.\\n\\n***SPOILERS AHEAD***\\n\\nI'll start off with the good because the film is not without it's moments.  Adam Driver as Kylo Ren is terrific. They could have kept him the the mask and made him Darth Vader 2.0 but giving him layers and internal conflict was the right way to go. I've heard people complain that he isn't enough of a badass\\, but acting like a petulant child is part of what makes him such a great villain. If he was a badass then people would like him. You're not supposed to like the villain.\\n\\nIf Luke Skywalker had to die a pointless death (he didn't) then at least it was a respectable death. Having him fade away while staring off into the two suns was a more fitting end for a hero than say getting stabbed through the gut and tossed down a mineshaft by your son.\\n    \\nSome of the action scenes are done remarkably well. The two lightsaber battles are the highlights of the movie. The scene immediately before the Kylo\/Luke duel where Kylo commands an entire fleet to open fire on Luke just to have him walk out of the smoke unscathed was awesome. Unfortunately it gets cheapened almost immediately after when it's revealed to just be some sort of force hologram. When Kylo kills Snoke and teams up with Rey to battle the (red storm trooper ninja looking guys) is one of the coolest moments in any Star Wars movie.\\n\\nOk\\, now for the not-so-great stuff. First it's glaringly apparent that episodes 7 and 8 were made by 2 different people with 2 very different visions of how this trilogy should play out. This movie barely acknowledges that the events in TFA even happened. The victories won by the resistance in TFA had no effect on the empire (new order\\, whatever) and they're back\\, stronger than ever now\\, with no explanation as to why or how. TFA is guilty of committing the same crime against RoTJ. It's like those events never occurred and the universe is reset with no explanation. It's just lazy storytelling. At this point in the franchise you have to be wondering what the point of winning all of these battles and destroying all the these Death Stars is\\, if the universe is just going to reset back to default after every film.\\n\\nThen there's the whole subplot with Benecio Del Toro. Why? That entire section of the script should have been burned. I really wanted to see Fin's character developed but he continues to be a useless character who accomplished very little in TFA and even less in TLJ. I feel like now it's too late at this point to will him any sort of value as a character. He's joined by the somehow even more useless \\\"Rose\\\" and they team up on some sort of quest on this casino planet that somehow ties into this weird animal rights storyline. The whole thing should have been scrapped. \\n\\nThe two big mysteries that everyone wanted answers to coming into this film were \\\"Who is Snoke and what's his backstory?\\\" And \\\"who are Rey's parents?\\\" For the first one they give us nothing. No answers. No backstory. A lightsabre through the gut and one of the only interesting characters left in the franchise is no more. For the second they give us worse that nothing. Rey's parents were nobodies that traded her for booze.  Which I fine. Not everyone in the Star Wars universe has to be blood related to other main characters. But why. Why why why wouldn't you just say that from the beginning. Why hype it up over x amount of years and 2 movies just to have the big reveal as.... nothing. Now it's entirely possible that JJ will come along and reverse this decision in episode 9. Kylo could have been lying and Rey's parents could be royalty. Nevertheless this revelation in episode 8 is one of the most anticlimactic events in cinematic history.\\n\\nThere's the pointless death of Luke Skywalker. I'm really not sure why anyone thought it was a good idea to bring back all the original heroes just to kill them off one by one. I get that they're trying to have this trilogy be about the younger cast\\, but if that's the case then why not just set the new trilogy far enough in the future that the old cast is already dead and gone and only their legends remain in the universe? As it stands now the movies have devoted copious amounts of screen time to characters that are now dead and we're left with a bunch of characters that we barely know or care about.\\n\\nPerhaps the biggest crime of TLJ is that it leaves you with practically no reason to want to see episode 9.  Luke is dead. Han is dead. The Leia character is still alive but Carrie Fisher is gone so I don't know how they'll handle that. Even Snoke is dead. Now we're left with characters that we have no emotional connection to. I was actually glad when it looked like they were going to kill Fin off so he couldn't take up any more screen time. Of course we'll see the resistance rise up again and topple the empire\\, but that's already been done like 4 times throughout the franchise now so who really cares at this point? There's the inevitable final showdown between Rey and Kylo but Mary Sue (oops\\, I mean Rey) already easily defeated him the first time she held a light saber. So where could you possibly go with that?\\n\\nAll this is especially bad in comparison to what an amazing job Empire did with setting the stage for the final chapter in it's trilogy. At the end of Empire it felt hopeless for the heroes and I couldn't wait to see how they would get out of the predicament they were in. At the end of TLJ\\, I just feel hopeless for the franchise.","true":true}