{"101487":187378,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This review contains SPOILERS and is very long.\\n\\nI saw this movie last Friday and have been thinking about it all week. I recognize that it's a very divisive film\\, and that there are extremes on both sides (you're just a butthurt fan if you didn't like this movie\/too much SJW propaganda Disney sheeple). When I walked out of the theater\\, I didn't really know what to think. I hadn't gathered my thoughts completely on the movie at that time. I didn't necessarily dislike it. But I didn't like it\\, either. At least\\, that's how I felt after leaving the theater. I can now firmly state that I dislike this movie. But before I explain why I dislike this movie\\, I think it is important to highlight what I *did* like about the movie.\\n\\nThe visuals are stunning. There's a lot of richness to them and they are well done. I admit\\, I liked the casino. I did. Additionally\\, I found Poe's character arc to be enjoyable. I saw development there and I believe it was an important addition to the story. The opening scene with the bombing run had me on the edge of my seat. I don't gripe about the bombs and the way they dropped through space because\\, frankly\\, this is Star Wars. Let's face it\\, it's not entirely faithful to what we know about space. And that's okay\\, because it's fantasy. So\\, I didn't have a problem with that\\, and the scene had me on the edge of my seat. Poe is clearly an awesome pilot and the Force is with him. This was an amazing way to open the movie and I loved it. I also happened to like Admiral Holdo\\, and Rose was cute too. I also enjoyed the seemingly infamous critique of animal cruelty and the immorality and greed of arms dealers. Those were nice. I also didn't mind how Luke died. The way he was at peace and became one with the Force was beautiful. His trick on Kylo Ren was amazing and I clapped\\, along with others\\, at that scene.\\n\\nAnd now\\, for the reasons that I didn't like the movie. They will be organized by topic. The first is Snoke. The second is Kylo Ren. The third is Finn and Rose. The fourth is Luke Skywalker. The fifth if Rey. And as a side note: the porgs were annoying and didn't need to be in the film. I know why they were in the film\\, and that just makes them even more annoying.\\n\\nSo...let's talk about the Snoke problem. Here's the thing: I get that the movie is subverting our expectations. \\\"He's not that important. Haha! Gotcha!\\\" Except--he is\\, at least a little bit. Fan theories aside\\, let's examine this from a story perspective. Even though the Empire has fallen\\, we have this new villain who is apparently very strong in the Dark Side\\, stronger than Sidious and Vader. Is he a Sith? Vader and Sidious were the only Sith\\, as far as we know. So if he *is* a Sith\\, what about the Rule of Two? If he's not\\, well\\, where did he learn that Dark Side stuff? And why is he there? What are his goals? How did he come to lead the First Order? We still don't know where the First Order came from. This wouldn't necessarily be a problem if we didn't already have six movies prior to this new trilogy showing how the Empire came to be and how it came to an end. The First Order just looks like it came out of nowhere\\, and we have no explanation as to its existence OR its former leader\\, Snoke. Furthermore\\, how could Snoke be so powerful\\, even claiming to have linked Rey and Ben (brilliant\\, by the way) and claiming to know all of Ben's thoughts\\, and yet not have the foresight or power to sense Kylo Ren's turning on him\\, or the fact that the lightsaber was beginning to move beside him? This is weak. Not only that\\, but TFA and even this movie built him up\\, only to kill him off. It's not that Snoke had to live--but his death comes across as dismissive. There is this build up even in TLJ\\, and then he's just tossed aside. It comes off not only as dismissive\\, but careless. And we have no backstory. No explanation. Nothing. Even a crumb of an explanation. I mean\\, this is the guy who began tempting Ben to the Dark Side. Why? Why Ben? Why anything? The only way they can remedy this problem is if they somehow bring him back effectively and believably in Episode 9\\, or if they at least talk about him and answer some questions. If they do\\, this will no longer be an issue for Episode 8. But right now\\, it is. And if they don't bring him back in Episode 9\\, well\\, then this critique shall stand. Kylo Ren is still not a strong enough villain to be worthy of replacing him\\, either\\, not after his sloppiness in the ending.\\n\\nSpeaking of which. There has been this real build up since TFA that Ben is struggling with the pull of the Light. I thought this was amazing and had a lot of potential. A *lot* of potential. And Rian Johnson wasted it. This whole struggle with the Light ends with Kylo Ren choosing the Dark Side in the end. Okay. Fine. This concept in and of itself is not the problem. The problem is that Kylo Ren doesn't seem to have a very good reason FOR choosing the Dark Side. He's struggled so much with the pull of the Light\\, sparing his mother\\, and then had that epic turning point where he killed Snoke and fought side by side with Rey\\, only to...choose the Dark Side? What? The problem is that it's not only unbelievable (to me)\\, but it makes everything thus far *feel* pointless. When Rey said \\\"Don't do this\\\"\\, she took the words straight from my mind! That's *exactly* what I thought. Not only is he now a villain\\, but he isn't a strong one. And neither is Hux. They're weak villains\\, and every good storyteller knows that awesome villains are critical to any story. Why is Vader so iconic? Why do people love Heath Ledger's Joker? Because they were *awesome* villains. But Kylo Ren isn't an awesome villain. I cringed with every bad decision he made in the end. He's weak. And that damages the story.\\n\\nFinn and Rose had a subplot. And I actually enjoyed it a little bit. Yes\\, it did hurt the pacing\\, but I was willing to forgive that because it was necessary for the story. Except for the fact that it turned out to be pointless. They didn't succeed. The entire thing was a wasted venture. Now\\, this can be great. Things don't always go the way we plan. The problem is that it wasn't a great enough subplot to withstand the blow of it coming to nothing. And I think that's the big problem for a lot of people. It would be easier to forgive the dragging of the subplot if it amounted to something. But not only did it drag\\, it amounted to nothing. Nothing! That makes it feel like a waste of the audience's time. People don't want to pay money and spend their time only have to it wasted. Furthermore\\, Finn had to basically undergo the same character arc he already went through in TFA. Why does my man Finn continuously have to escape cowardice? He already did that in TFA. Furthermore\\, his heroic moment was stolen by Rose. I was ready to cry and mourn the loss of Finn\\, and he would have died a solid hero. That would have been epic\\, and I'm certain it would have sealed him in as an awesome hero in the Star Wars legacy. But then Rose stole it. And for what? Love? Okay\\, that's beautiful. Except that it's NOT believable! This love thing is weak and feels forced. And the kiss was so awkward. I rolled my eyes and felt hugely disappointed. As I said\\, I thought Rose was cute. But the subplot\\, Finn having to go through a character arc that he already went through\\, and then his heroic moment being stolen for love that isn't believable are all big issues.\\n\\nNow there's the matter of Luke Skywalker. Hmm. The problem with Luke Skywalker is not that he's kind of a curmudgeon or even that he's a little old and bitter. The problem is that this story runs contrary to his character. Yes\\, it is true that people change over time. However\\, important qualities about a person often never change\\, and the event that took place to change him was not only unbelievable (for reasons I'm about to disclose)\\, but wasn't strong enough to permanently alter a very important part of Luke's character: his heroism. First of all\\, he tried to murder Kylo Ren. I don't care if it was a split second thought. No. I don't buy it. He sensed the Dark Side in Ben\\, his nephew\\, and he didn't even bother to talk to his sister or his best friend about it. He took matters into his own hands. And even though he put himself to the hazard in order to bring Vader back to the light because he sensed good in him (and Vader's redemption was not promised him\\, either)\\, he suddenly gets it in his mind to try and kill Ben? What? This doesn't seem like Luke. And that's the problem. Yes\\, I am a fan of Star Wars. I *love* Star Wars and I love Luke Skywalker. But this goes contrary to his character. Luke is optimistic and self-sacrificing. And this leads into my next point: Luke's heroism. Why the hell is Luke such a coward? In ANH\\, Luke rushes off to go and rescue Leia\\, and then puts himself in danger against seemingly insurmountable odds to destroy the Death Star. In Empire Strikes Back\\, he has premonitions of his friends being tortured\\, of his friends being in pain. So what does he do? He stops his training to go and rescue them. And then in Return of the Jedi\\, he creates a plan to rescue Han and completes it successfully. And there was a lot of risk involved in that! Throughout much of Return of the Jedi\\, Luke is strong\\, calm\\, and collected. He's confident! And this is the man who refused the Dark Side and then\\, knowing that the Emperor was there\\, tossed away his lightsaber and\\, with defiance\\, told him that he had failed\\, that he would never turn to the Dark Side\\, and that he was a Jedi. Luke is not a coward. He *is* a hero. The OT built his character to be this way. He went through character development\\, all the while being a hero. And now this story just demolishes it and changes his character completely. He *always* put others before himself in the OT. That's who Luke is. But in TLJ he refuses to help the Resistance. He refuses to help Rey. And even when he learns that Han dies\\, he still doesn't do anything. His best friend. A man he sought to rescue on more than one occasion\\, and a man who rescued him on more than one occasion--and his death isn't enough to convince Luke Skywalker to do anything. That is not only unbelievable. It's disgraceful.\\n\\nLast is Rey. First of all\\, I don't mind that Rey's parents aren't anybody special. I can get behind that. And I liked Rey in TFA. I defended her against accusations that she was a Mary Sue. Kylo Ren *was* injured badly by a wookie crossbow and emotionally reeling for killing his father\\, and Rey had had practice defending herself on Jakku. She was also shocked by her accuracy with the blaster. That was clear. The Force is also with her. Great! I accept that\\, gladly. The Force awakened in her and it was awesome. What I don't accept is that she's had no additional training whatsoever\\, yet holds her own with Ben against the praetorian guards. These guards are either wussies\\, or Rey *is* overpowered. They're there to protect the Supreme Leader! And I don't care if the Force is strong with Rey. The Force was also strong with Anakin Skywalker and Luke. Anakin still got beaten by Count Dooku in AotC and Vader toyed with Luke in Empire. Both of them were strong in the Force\\, and both of them needed to improve. But Rey? Rey has had no additional training\\, yet she fights like a master. And it has already been established in previous films in this storyline (Ep. 1-6) that the Force doesn't automatically make you a master in lightsaber combat. Yes\\, we see her practicing by herself on the island. But that's just it--you don't get better just doing stuff by yourself. How can you improve if you don't have a teacher to show you better techniques and also to show you where you're messing up? When I saw this scene\\, the two of them fighting\\, I loved it. I was on the edge of my seat and it was awesome. But after thinking about it\\, I realized that Rey continues to be overpowered with no additional assistance from anyone. Unlike Ben\\, those guards were *not* injured. And she didn't just fight these guards one-on-one. She held her own against *multiple* guards and even saved Ben in the process. I can believe that Ben lost to her the first time\\, all of the factors considered. I just can't suspend my disbelief regarding these praetorian guards. (Side note: I did love when Snoke lectured Kylo about how he lost to a girl who had never even held a lightsaber.)\\n\\nI understand that Rian Johnson was trying to take the story in a different direction. That\\, in and of itself\\, is not a problem. But he didn't really build on anything from TFA. Instead\\, his treatment of those matters seem dismissive. It's like he just wanted to tell his own story and tried to get rid of everything done in TFA. And it was done sloppily. He made Finn go through the same character arc that he already went through in TFA. Is Finn going to try and run away again in Episode 9? Johnson continues to make Rey OP. And several of his \\\"gotcha\\\" moments\\, and they were there\\, were disappointing. Twists and turns are awesome\\, and there's no doubt that this movie has them. But they felt like twists just for the sake of being twists\\, and they were disappointing because they usually amounted to nothing or unraveled things that had previously been built up. I had such high hopes for this movie. I knew that Rian Johnson was directing it and I had heard that he was a great director. The trailers were awesome. I was so hyped for this movie and yet\\, in the end\\, I found myself disappointed. I'm a big Star Wars fan\\, but I'm having trouble mustering up any excitement for Episode 9. Will I go see it? Yeah\\, I probably will. Episode 9 has the potential to redeem Episode 8\\, and therefore Episode 7 (which I loved before TLJ). But I am very skeptical and wary.\\n\\nI give this movie 2\/5 stars because I don't believe it deserves any fewer than that. But I also don't believe it deserves any more than that\\, either.","true":true}