{"101487":147705,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wouldn't say it's the worse Star Wars film but I wouldn't say it's the best either. My first viewing of it that I thought it's really good than I expected with the exception of some issues. The plot was decent enough with a few surprises but at times it feels that there's build up with no off the Ray's parentage and other scenes that should've had more focus that others\\, like Ray and Kylo Ren's connection Most characters did their usual roles very well especially Mark Hamill as Luke Skywalker & Andy Serkis motion capture as Snoke performances are great as always. Music score by John Williams is magnificent as always that hits right out of the park. the criticism I thought of the decision on \\\"Superman Leia\\\" that I'm kinda mixed because of the death of Carrie Fisher in 2016 that thought if this would create a emotional moment of her fate and Kylo Ren's reaction seeing it since he changed his mind moment prior\\, it's still good seeing her but that scene in particular doesn't set right with me since I know she wouldn't return for Episode IX. Other is the questionable political commentary that this film include for reasons that I couldn't get behind\\, other example of an feminism empowerment through character Amilyn Holdo played by Laura Dern. The actress did her performance very great but it's the character is been written to be quite passive without given information about her plans even when every ones supposed to be \\\"equality\\\" on the same side. \\n\\nOverall I still like the film despite of the issues it has but that's mainly my opinion\\, I can't say it's the worse nor the best one film but it's rough in the middle for Star Wars standards. I'll have to see what's in store for Episode IX before given this trilogy its final mark overall.","true":true}