{"101487":128792,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"How to sum up this movie? Well\\, Rian Johnson certainly did his best to subvert audience expectations. Literally\\, anything that you thought was important\\, established\\, or expected is thrown over the shoulder contemptuously. Unfortunately\\, Star Wars fans were expecting a good movie and that expectation was also subverted as this is a steaming pile of crap. \\n\\nNo one's motivations or actions make sense or are in line with any sort of established character they might have had. Rey continues to be the most Mary-Sue character that ever graced the screen. Her only flaws appear to be caring to the point she sees good where it might not exist and wanting to parents to love (this isn't a joke\\, I honestly think those are her only two flaws). Leah is pointless and should have died. Luke is basically a completely new character and you can practically see Mark Hamill dying inside. Poe gets talked down to constantly for trying to do the right thing. Finn (probably the most interesting of the new characters) goes off on a side mission that amounts to nothing and could have just remained in a coma for this movie for all the point that he serves. Rose is a joke who literally stops someone from protecting the things he loves to tell him to protect the things he loves as the thing he loves is blown up. Kylo is moderately interesting\\, but for some reason no one actually cares about his whole dad-killing issues anymore (Rey basically is in love with him... which was an odd choice given the events at the end of the Force Awakens).\\n\\nThis is just a bad film. It has the story that reads like a preteen's fanfiction and pays absolutely no attention to anything other than creating a visual spectacle. I'm almost positive that Johnson had ideas for scenes and then wrote story to get him to those points. This movie actually makes the prequels good by comparison. Those who say that it is the best movie since \\\"_________\\\" are either very young or.... well\\, let's hope that they are very young. This movie did what I didn't think a movie could do. It made me give up on Star Wars. I might see the next one out of morbid curiosity\\, but at this point I have seen 5 bad Star Wars trilogy movies in a row (we'll leave Rogue One out of this\\, though it was no gem itself). As someone who grew up loving it\\, read many of the former Expanded Universe\\, stood in line for hours to get opening night Episode 1 tickets\\, was extremely excited about the Force Awakens (disappointed in it\\, but it was at least understandably iffy as a soft reboot)\\, and also saw this opening night... yeah\\, I'm done. There's either no way to make a Star Wars movie that isn't bad or it is in the hands of incompetent idiots who don't know how to do it. Either way I'm tired of crappy movies with plots thinner than the armor those paper mache bombers in the opening scene were made out of.","true":true}