{"101487":170275,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"'STAR WARS: THE LAST JEDI' is the type of film you would want to watch if you are just waiting for the big finally movie. A filler movie. Kind of like 'HUNGER GAMES: THE MOCKING JAY PART 1'  Where the entire movie is not it's own but very dependent. This movie has some great ideas in it and just like there is a powerful light there is a powerful darkness and the darkness is the wasted time. The writers of this movie were not in a rush but did not take the time to think things out all the way. Lets just go over the cons. First (SPOILERS AHEAD) they completely threw Snoke out the window and not caring what the fans wanted at all. They came up with so many  theories and ideas of who Snoke was and they ignored all of them. They had 2 years to come up with a clever way to reveal who Snoke was and they completely wasted our time with Snoke. Two\\, they threw another big story line out the window. REY'S PARENTS! Really? REALLY? So you are going to tell me that the first 6 movies were based on Skywalkers and then you just say that Rey's parents are just some nobodies that sold her for drinking money? LOL what a big slap in the face. People have waited for 2 years for 3 main things: Luke\\, Rey's parentage and Snoke's identity and you threw all 3 of them out. THATS RIGHT\\, they killed off Luke. You make me buy a ticket and then come to your theater with my car to tell me that Luke will not be in episode IX? Ugh. though yes this is a maddening review but i loved this movie but I just don't have time to tell you everything that I loved about this movie.","true":true}