{"101487":175196,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"The Last Jedi\\\" is a horribly written\\, contradictory pile of shit! If you tell me to keep my \\\"Kylo-Ren\\\" in check\\, screw you.  (Actually I think Kylo is the embodiment of Disney saying \\\"DIE! OLD Star Wars!!!  Make room for MEEEE LOVE MEEEE Love my cute little Porgs!  While I make Luke suck blue milk from the tit of a creature I CREATED!\\\") Even the title of this film doesn't make sense. Is Luke the last Jedi\\, or not?  The movie's theme\\, \\\"a legend will spark new hope\\\" suggests it's only Luke as a man who dies\\, but new Jedi will come due to his legend\\, but the movie does not follow through on that theme\\, and destroys the legend of the original movies.  \\\"The Last Jedi\\\" is insulting and damaging to the original films.  \\n\\nFirst lets look at the writing itself.   There is no main character\\, except Luke\\, and there are redundant scenes and story holes.  In an interview on \\\"Late night with Stephen Colbert\\\" Mark Hamill pointed out how he is not the main character anymore\\, \\\"this isn't Luke's story\\\"\\, but in this movie it IS his story. He's the one who learns something (more on that later) and he self sacrifices in the end. Even then his character does not fully develop.  So much time was wasted watching Rey trying to convince Luke to train her. We get it!  We don't' need repetitive scenes telling us this information.  Why didn't Yoda show up sooner to pull him out of his funk?  If you want to show how hard she's trying and how stubborn Luke is\\, do a montage\\, even that isn't good enough because Luke NEVER trains her.  This mistake was repeated on a smaller level\\, as if by an amateur writer and director with Luke asking over and over again\\, \\\"who are you\\\"?  No change in his delivery\\, no new information\\, just the same constant\\, boring demand!  Do we learn who Rey is?  I assumed Kylo was fucking with her when he told her she came from nowhere.  Or was he?  The shit shoveler kid at the end of the film seemed to come from nowhere (was not a fan of the acting by the children btw).  Rose came from nowhere.  Is that another theme?  \\\"Power can come from anywhere\\\"?  make a choice on theme and stick with it.  The writing was all over the place\\, and I'm sick of the new movies recycling so many ideas\\, and lines!  \\\"Fulfill your destiny\\\"\\, \\\"over confidence is your weakness\\\"\\, Rey watching her fleet be destroyed.  A Hoth planet... oh no it's salt.  It's not thematic\\, or nostalgic\\, it's lazy!  Why have Snoke?  Why not have Kylo do his own thing (like he finally does) and just be mindless uncontrolled rage?  Disney is too afraid to come up with their own ideas and think we're going to geek out to hear the same lines. I suppose the code breaker was a new and unique idea.  Why did we have to revisit the character from \\\"Force Awakens\\\" to find him? We didn't get her guy\\, did we?  Are we supposed to assume the gambling guy wasn't really him?  Benico was?  It's a stupid\/needless piece of confusion.  If it's a misdirect\\, why not clarify that the gambler stole the flower.  If the imprisonment is just a way to make us think\\, \\\"oh shit what will they do now?\\\" why not have the guy with the flower appear in the cell as well\\, for cheating?  Why not send them there for a specific code breaker\\, why not just a code breaker?\\n\\nLets talk theme.  There are many floating around\\, \\\"Fulfill your destiny\\\" could have been a theme to tie in with Luke's desire to not fulfill his past legend.  Yoda says live in the moment\\, not the future\\, not the past. Luke is not a slave to his past legend and Rey or Kylo are not slaves to their destiny.  Does that theme come through in the movie?  \\\"Power can come from anywhere\\\" (rip off from Ratatouille)\\, maybe\\, but that undermines all the greatness in the Skywalkers and mystery around where Rey came from.  Again I'm still confused if she really came from no where\\, or Kylo was just fucking with her.  The shut shoveler at the end ties in with this theme\\, but feels like an after thought.  The one that is most constant is \\\"Legends can spark new hope\\\". Was Luke right or wrong in not wanting to fulfill his legend?  He says\\, \\\"no\\\"\\, he whines during the whole movie that the answer is \\\"no\\\"\\, but at the end of the film we see evidence that it is their legend that WILL make the rebellion survive.  The legend of Leia\\, the legend of Luke will inspire children.  The legend of Fin inspired Rose.  No\\, these people aren't the perfect beings legends have made them\\, but it is the legend that sparks new hope. The problem is Luke never implements what he learns about his own legend.  He faces Kylo\\, but does he use the lesson he learned?  No\\, he just says \\\"sorry\\\" and gives the rebels a chance to escape.  He hides on his island like a coward.  One could argue that he symbolically sent his legend to face Kylo.  I LOVE that idea\\, but it was not fully realized.  Luke did wear his black robes instead of white like he did in Return of the Jedi.  To fulfill the \\\"legend\\\" look\\, but doesn't use his green saber!  Why not go all out with this idea and have Luke appear as the young Jedi master he was in Return Of the Jedi using Disney's all powerful CGI fountain of youth.  Btw\\, didn't Kylo notice Luke was using he blue saber?  The one he JUST busted\\, jus saw!  (On a side notes\\, why didn't Luke freak out about his blue saber?  He lost that with his FUCKING HAND!!!! ) Does Luke's final appearance inspire anyone?  No.  Does Rey see it or learn something?  NO.  Did his appearance\/his legend scare the shit out of the bad guys and make them run?  NO! Does he just defeat Kylo\\, or Snoke with it?  NO! If Luke and Snoke are the foils to each other the way Kylo and Rey are\\, (a comparison the movie points out) why doesn't Luke face Snoke?  WHO THE FUCK IS SNOKE?  Are we going to find out in the next movie?  It doesn't matter now\\, he's dead.  Does no one care where this asshole with Sith power came from?  We're tying all the other characters into a past\\, into the originals\\, but the new supreme master of evil just... showed up?   Luke says he's just a man and not a legend\\, but he goes and does something we've NEVER seen a Jedi do before\\, not even Yoda that's pretty bad ass.  So clearly... you are a legend.\\n\\nWhat about Yoda's other advice?  \\\"Ben we lost\\, Rey we must not\\\".  So.... Why not train her instead of let yourself die\\, Luke?  You ignoring Yoda... I suppose it wouldn't be the first time. Rey says Luke was \\\"at peace\\\" when he passed.  Why?  He still didn't fucking clean up his mess!  He didn't train Rey\\, or the shit shoveler with the power of the force we saw at the end\\, or all these other poor souls who are going feel lost and tempted by the dark side!  Luke is still running away from his mistake and responsibility.  Is this the end of the Jedi or not?  Luke says there will be more Jedi.  So why not fucking train them!?  Does the end of the Jedi mean the end of any Jedi with some integrity!?  We're gong to leave Rey with her ass in the wind?  Clearly she has power.  Why not train her?  If it IS supposed to be the end of the Jedi then why didn't he kill Kylo?  Isn't that what he told Leia he'd do?  Too much killing?  What about Poe then? Does NO ONE care that asshole Poe got EVERYONE KILLED because he disobeyed orders MULTIPLE TIMES!?  Sending Fin and Rose away got the code breaker involved\\, who gave away their secrets and boom almost everyone DEAD!  Oh but Poe is such a cute Han reboot rascal (down to a similar costume).  It's OK. Is communication the theme?  Because if Poe knew what the fuck was going on\\, maybe he wouldn't have gone rouge and gotten everyone killed.  If Luke and Kylo had talked and communicated... maybe????\\n\\nThese sequels are doing the same thing the prequels did fucking up and taking the joy out of the originals.  Stylistically the sequels are better than the prequels\\, but damn!  If the theme of \\\"The last Jedi\\\" is\\, \\\"legends can spark new hope\\\" then the legend of the original episodes IV\\, V and VI have sparked jack shit.  These sequels are an insult to the originals.   The prequels showed us that Darth Vader was a whiney bitch when he was a kid.  The sequels show us that Luke turned into a whiney bitch as an old man.  The only Jedi with integrity all the way through was Obi-Wan.  Please save us Obi-Wan!  You're the only hope for saving this franchise. Wait... no!  Keep him out of this\\, I don't' want his character ruined as well.  I will admit I geeked out over the line they took from Terry Gilliam's Brazil\\, \\\"You're under arrest for parking violation 27B\/6\\\"\\, but again... why?  Just because it's cute?  Or is the movie trying to say they're living in an Orwellian world?  Am I digging to deep?  It's just for fun you say?  Good movies are fun AND every tid-bit means something\\, that's what makes them last.  The Last Jedi will not last. \\n\\nPS  there's not gravity in space.  How did the bombers \\\"drop\\\" bombs on the ship in the opening?","true":true}