{"101487":169781,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars fan my whole life. So hyped for 2 years to see where this next epic saga will go. All these potential mysteries like who are Reys parents\\, is Snoke Plagueis? The build up and tension of Luke taking that lightsaber and being on screen and speaking again with a new hero in Rey. SO MUCH POTENTIAL. This movie trolls and destroys all of that. I knew from the scene when Luke tosses the light saber over his shoulder which felt like an out take. This movies humor was worse than Space Balls. Cheap laughs that undercut dramatic tentions moments\\, and a plot that pretends to be so shocking and intricate but it's just a farce for how disorganized and messy and plot hole filled this movie actually really is. It almost feels like Disney highway robbery. The whole Cantobite sequence with Finn and Rose is cringe-worthy and serves no purpose. Could have been avoided if bland new character Admiral Holdo just gave Poe her plan....Maz Kanata is basically squashed as a character and makes a weird sexual inuendo joke about the hackers abilities. Captain Phasma who had nothing to do in the first film still has nothing to do only she dies this time. Snoke is built up to be this mysterious all powerful dark side force user and shows such immense power\\, only to be cut in half in a cheap shot by Kylo with no explanation what so ever as to his back story. So lazy. The Jedi lore is all messed up and laughed at and they burn it down. NOW onto the utter disrespect and tear down of Luke\\, this sagas great heroin. They decide to make his story arch one in which he got scared of a little dark side in Ben so he tries to murder his only sister\\, twin sister\\, and best friends son in his sleep.........................................which in turn creates Kylo Ren. Then he lies to Rey about it. And is a total coward. Then he finally shows up at the end to save the day oh wait it's not really him it's just a projection of himself then dies off as a ghost. I can get past the other messy bad things about this movie but their handling of Lukes character is disgraceful and Mark Hammill has fundamentally disagreed with their choices but acted the part anyway. Overall this is THE most dissapointing star wars to date. It fely like a cheap\\, corny Marvel movie with no real plot. Oh and Luke drinks green milk out of a 4-boobed creature....that actually happened. JJ should have directed all 3 and now needs to clean this up. The prequels at least tell a story. I give this one 2 thumbs down.","true":true}