{"101487":189755,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To quote my son: \\\"I really liked the reclining chairs and the button to move the seat.\\\"\\nThis film should be hauled away as garbage as a disjointed uninteresting mess.\\nWhen I saw the original\\, I was given hope fun and a sense of adventure. NONE of those things exist here.  If you are inclined to like the few lines of dialogue that are not somberly slow\\, then yes\\, it has a few lines of that - but this basically loses any fun from the original and now takes itself very seriously.  I guess that's our age of deconstruction and a dark storyline.\\nFrom the first scene it proves it is a boring slow paced uninspiring dark sad mess with colloquial phrases (of course attack of the clones calling someone \\\"Dad\\\" started this trend)\\, and reveals what a cash grab this film series has become.  Disney has perfected the Pavlovian response and from the years of going to see films just to finish off a series and we all line up. I am done with this crap.\\nThe film starts with starts with a childish insult fest between Poe and the Orders general.  Really are they that childishly stupid? I guess so.  Why not just send them an insulting twitter message?\\nThe bomber crews slow strafe to the battleships and the fact that over 100 people disregarded direct orders to retreat show a lack of discipline and faith in their leaders.  Leia has lost it\\, and it shows. \\nWith the grabbing of a medallion which seems mystical but is not -- we are supposed to care that the moronic bombardier\/gunner is dying and later her sister shows it as a connection.  Just the fact that the character could not re-climb a ladder and is kicking the ladder to get a control is not heroic\\, but idiotic.\\nThe next scene of Finn in a plastic bag leaking and NO ONE whom is running past gives a damn.\\nWhat the hell was that? Funny? No.\\nThe fact that the rebellion even exists only shows how their entire cause is lost - the Republic fell in about 2 weeks - must be some crappy administration.\\nAnd their plan with 400 people is to run - yet as they get picked off\\, why didn't the order launch EVERY fighter form the half dozen destroyers chasing them?\\nThen when did Leia escape Krypton to learn to fly in space? Stupid.\\nWhy can't we tell the head of the entire fighter wing what the plan is? Because. . .I don't know.\\nDon't tell the new Admiral of an idea to stop the tracking - that would make sense!\\nLuke as a bitter old man drinking a creature's milk is weird. Why leave a way to be found if you don't want to be?\\nI agree with him\\, throw the lightsaber\\, feh.  He's done some am I.\\nKylo Ren says it best\\, let it all die - Disney you are doing a great job of that.\\nHow is it that Rey knows everything? In the original trilogy it takes 3 movies and time to learn Jedi things - here\\, 10 minutes.  \\nPorgs\\, which are not named\\, why are they there?  I don't know.\\nI could feel the coldness of the production form that Irish isle myself in the slow pacing.\\nThe laziness is also apparent - there is the fight scene in Jedi and the assault on Hoth.  And that throne room - if it was any more poorly designed you could have shown the backlot - a red screen. I don't get these story choice in the least - it is so recycled it hurts.\\nThe casino scene was entirely unnecessary. In fact\\, think a moment - if they could escape with miniships in multiple directions at light speed\\, why didn't they?  And again pandering to babies and children the end scene of a kid using a force power to grab a broom looking up to the stars.  That's not hope or marketing - it's whining.\\nAnd as for the rebels  - run out of gas and get picked up one by one.\\nThe fact that no one answers the rebels distress call only show everyone has moved on -- so should we all.","true":true}