{"101487":197404,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"With the Mandalorian getting high marks on Rotten Tomatoes and elsewhere it made me go back and check what that wreck of a movie The Last Jedi was given. 91%!!! Can I say WTF? on here?\\n\\nTake the ridiculous premise of Speed (except set in Space so it makes even less sense) with JJ Abrams mystery box writing (essential bits of information withheld for no blasted reason other than taking the absolute laziest\\, most incompetent route to a plot point while making the characters look like subhuman idiots in the process) and that is the first half of what makes the movie terrible. \\n\\nThis movie goes to lengths to deconstruct all the hot shot one-in-a-million cowboy gambles. Laudable goal. Not very Star Wars but laudable. This is further highlighted with the cowboys being brash jumpy and mostly male and their counterpart being a composed female leader. However\\, the hot shots are only taking those gambles because the sage leader has withheld information for ...this is where I would otherwise wave my hand and say \\\"reasons\\\" but the film doesn't even bother at pretense. When the cowboys are finally privy to information that should have been readily shared long beforehand they essentially bow to their wise leader with a \\\"so sorry we should have trusted your leadership\\\" instead of \\\"why the bleep didn't say so!\\\" as anyone would rightly say in such a circumstance. \\n\\nThe other half of what makes this movie awful\\, is all the lineage it wastes. Instead of having Leah take a meaningful role in the resistance\\, they create a new meaningless leader out of thin air. Instead of Leah\\, who by all accounts should be essentially equal to Luke in The Force\\, take on the role teacher for the new young female Jedi\\, that Jedi has to go off and find Luke who doesn't want to be found and doesn't want to teach. Also\\, why exactly is she going off for training since she basically already equalled the highly talented\\, highly trained Sith Lord with zero training or preparation on her part?\\n\\nThe result is that a movie which while trying to be pro-woman 1. creates a female leader with the worst most stereotyped male behaviors 2. Praises that woman for her decidedly asinine leadership 3. Gives the new female Jedi all the power for zero work (previous film but still) 4. Still sends her off to a man for training for some reason. 5 Takes an established female character with extensive military and political experience on top of being one of the most powerful force users and relegates her to a shadow and her force abilities to parlor tricks that don't meaningfully figure into the plot and 6. all the while being too oblivious to realize the counter-productive harm it does as the straw-man punching bag the likes of which sexists can only dream. \\n\\nI'm a dude (disclaimer) but a pretty committed egalitarian and I can only cringe at how bad and useless it is making women look and cringe a again for thinking it is doing the opposite. The 80's films with their princess in need of rescuing still managed to have a stronger and better female character. More's the pity because that character is ostensibly in this movie as well. \\n\\nThen again the male characters are pretty\\, awful\\, unlikable and or useless if not quite to the same degree. And there is the  non-sense\\, Rube Goldberg plot with heinous dialogue. So may it is just a...what do you call it?  Oh yeah! A BAD MOVIE!!!\\n\\nAlso 44% audience score.  That I can believe. But these are mostly fan boys and girls that are willing to bend over backwards and forgive a lot\\, so that should skew high\\, making the critic score even more untenable.  \\n\\nSo 91%? No. I can think of no explanation for this that doesn't involve a conspiracy.  Regardless of the reason this is far from the first befuddling discrepancy as RT is inches continually closer to completely loosing its credibility.","true":true}