{"101487":181382,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film was the biggest built up thing over the last two years. Expectations flying around the place\\, theories sparking massive online discussions on every piece of blog website and media.\\n\\nYet all of it crumbles and disappoints.\\n\\nEvery piece of lore that was made just falls apart horribly in The Last Jedi (I will leave spoilers until the end). \\n\\nPositives first\\, The Last Jedi has amazing visuals and sound. My eyes were pleased with the vast amount of new things\\, space battles and not so much land battles. Really nothing much to say as every star wars film is a visually pleasing. That is all i can say good about it sadly.\\n\\nThere is little to no character development in this film making it very bland and making me not care about anyone anymore. leia is the only character that is set and charge in her way of and trying to help Po understand that you dont need to be a hero all the time. He is the only character in this film whos actions had consequences\\, the rest of the characters fell back on ex machina moments and I felt no real threat was in their way. \\n\\nI guess spoilers. Its hard not talking about this film without discussing moments.\\n\\nRose. She was the most cringiest\\, most unnecessary character and she felt so forced into this film I was actually face palming in all the scenes with her. She adds nothing to the story and sadly Fin adds nothing to the story this time around. They team up and all they are is filler content that adds nothing. \\n\\nPhasma\\, we were told she had a much bigger role in this. No. She did not. 5 minute screen time and then she dies. \\nThe Supreme leader dies\\, snoke\\, without us knowing any background\\, no context. Whats the point of creating such a menacing character only to have him die in what has to be one of the dumbest deaths. If he is able to connect Rey and Kylo through the force\\, how come he couldn't feel Kylo move the saber that was right next to him. It made no sense. \\n\\nRey actually never got trained by Luke and somehow she was mastering the light sabre when in TFA she was very amateur with the art of fighting. It was full of plot holes and just overally disappointing.\\n\\nThis film leaves you with way more questions than answers where it should be concluding and wrapping up for the 9th film. I dont recommend anyone seeing it unless you like star wars then sure. People are saying that TFA was unoriginal and people complained and TLJ is original and people are complaining. That isnt the case and this film takes off some scenes from return of the jedi and does so horribly. I give this a 2 out of 5\\n\\nThe overall aesthetic of film was pleasing but the big nail in the coffin was the cat and mouse sequences\\, boring dialogue\\, little to no character development\\, cringe fest moments\\, disappointing conclusions and resolutions and no mention of the Knights of Ren.","true":true}