{"101487":199085,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow\\, calling this \\\"Not good\\\" is an understatement. This installment of the franchise is a lumbering\\, leaden\\, bowl of uninteresting mush. This is not surprising however. The story comes across as a big splashy and hamfisted attempt to bring all that is bad about the SJW community into a movie and virtue signal for HOURS. Look\\, Disney\\, we get it. You're afraid of being called racist\\, homophobic\\, sexist\\, misogynistic and maybe even 'white surpremisists' (the far left's latest screed that they call anyone that disagrees with them) But guys\\, enough is enough\\, stand up for yourself if you're not going to do it for the franchise. This movie pushes all the worst tropes of far left extremism by wrapping them under the guise of Star Wars. Look for \\\"We must tear down the Patriarchy\\\" by casting the remains of the Empire as super abusive nazi parodies (The Empire's left overs are worse than ever) and must be torn down. The Resistance is still part of the patriarchy and so too must be burned with fire till it's gone. All men are wrong\\, no matter what they suggest. Women in the show are large and in charge. The Mary Sue is even more Mary Sueish. Luke is pathetic (all white men are to be deconstucted until they are shown to be awful and wrong) The litany goes on. Saw the movie and I'm tired of the franchise now. Lucas really cashed in here. He sold a dead franchise (all the story was told) for billions\\, and now disney is flailing around without a story to tell so they're trying to burn the old franchise to the ground to start over. Too bad they chose \\\"bad Robot\\\" to start over for them. This movie is failworthy.","true":true}