{"101487":181816,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is an interesting movie with very dynamic space battles which is fun to watch. However\\, the storytelling is disappointing with a lot of plot holes that somehow made the movie felt shallow. From a fan's standpoint\\, the Star Wars religion that has been built up over the decades by the various SW movies\\, novels\\, comics took a huge turn in this movie to become something more magical\/nonsensical rather than the force at work.\\n\\nThis are some things I really did not like:\\n1) The plot and storytelling does not make sense. The 1st Order is chasing the rebellion fleet\\, Holdo made a decision and Poe is unhappy. He sends Finn and Rose to find a code breaker to get the 1st order off the rebellion's back. They failed and hence cause the secret plan of Holdo to fail as well. Rey look for Skywalker\\, looks for Snoke and somehow rescue the rebels in Crait. Is just seems the plot is made up by a series of very bad decision making by the good guys and the bad guys. To summarise\\, 1st order chased the rebellion\\, shit happened and they escaped and Rey came back.\\n2) the movie is too draggy\\n3) The humour is unbearable...leaking Finn...Hux's mama... Luke milking the Bantha\\n4) The dreadnought should have a deflector shield which is common concept for starships\\, battle fortresses in other movies. A mere star fighter should not be able to take down the cannons that easily.\\n5) A couple of star destroyers and a flag ship armed with cannons derived from the death star technology cannot take out a cruiser but can take out a rebel base on a planet. With the rebel fighters all destroyed\\, TIE fighters can take out the rebel fleet easily regardless of whether the star destroyers can cover them or not. This logic is kind of weak.\\n6) The tracking light speed part seems like a genius concept but it has a big loophole. The tractor is on Snoke's ship. The rebellion fleet went into hyperspace when Snoke's ship wasn't there and the dreadnought was destroyed. How did Snoke's ship track the crusier?\\n7) Leia is strong with the force but flying through space using the force is unheard of and watching that scene felt really really strange. It seems like magic.\\n8) Yoda\\, seems more powerful in death with the ability to manipulate the clouds summon a lightning bolt. This power of the Yoda's force ghost is unheard of. He could have just use it against Darth Sidious\\, Snoke\\, Kylo and he will win because Siths cannot kill a ghost but a ghost can kill them.\\n9) What exactly is the point of Yoda appearing only in the moment of Luke wanting to burn the tree and books? He (or Obi-wan or Anakin) could have appeared earlier and wake Luke up from his despair. I also could help noticing that the puppet action is not very well done given the technological advancement in film technology. \\n10) Fear\\, anger\\, hate lead to the darkside. Luke is full of fear but it did not lead him to the dark side but made him into a common snarky old man. It is a bit degrading for a hero.\\n11) Visual telepathy between 2 apprentice force users is a new concept which makes jedi masters and sith lords look like amateurs or it makes Snoke the almighty force user...who somehow died because of misinterpretation of intentions.\\n12) I just cannot get the scene of Rey in the dark side hole. The point is....?\\n13) Snoke...I cannot decide if he is strong or weak with the force when he can read Kylo Ren wrongly. I may be tempted to buy his action figure but after his death\\, I am definitely not getting it. With him gone\\, the whole conflict in the movie seems petty and it is no more light versus dark but more of the lost child versus the miracle child.\\n14) The Falcon somehow manage to drop out of light speed in front of Snoke's ship. I wonder how Chewie is able to calculate the exact coordinates of the ship and drop Rey off in the hanger. \\n15) After the clash with Kylo Ren\\, Rey somehow got back into the Falcon unnoticed while Finn and Rose struggles to get out.\\n16) Canto Bight scene is too shallow and Finn and Rose somehow got easily satisfied with a random code breaker instead of the very specific guy who is crucial to the survival of the rebellion. \\n17) Holdo could have inform everyone of her plans and nothing will be misinterpreted and hence no need for a wild goose chase to Canto Bight. If the Canto Bight scene is meant to introduce the kids  who are strong in the force (or possible runaway younglings from Luke's temple)\\, it is too forced.\\n18) Luke's force projection power is unheard of and I do not understand why he is not using his green light saber in the projection. \\n19) Rey is too powerful with the force that it makes Jedi training and the concept of master and apprentice redundant. \\n\\nOverall\\, to enjoy the movie more\\, one cannot bring along the prior knowledge of Star Wars. Treat it like a brand new Sci Fi film and it is will be easier to watch.","true":true}