{"101487":100087,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After watching the film and taking the time to digest everything. Most of my complaints are going to be similar to others. Snoke and the Knights of Ren? What happened to them? It's almost like well we didn't like that idea so we're just going to throw it aside. Luke Skywalker\\, wow\\, basically for someone who knows the lore and the mythos I was very disappointed. All this buildup and you basically made Luke Skywalker a footnote\\, almost like he was just an extra. No exploration nothing. Force Awakens Rey get's Luke's lightsaber and they made a very big deal out of that scene like it was really important. Well that was never developed either. It's like you developed all these ideas in Force Awakens and then just threw them all out the window. You don't go into the whole Luke\/Kylo relationship not really anyways. Rey's training\\, what training? It was a joke. I am supposed to believe she just woke up one day and knew how to do all this. Really\\, come on it is such a disservice to loyal fans of the brand. I have no issue with Rey\\, I think the character and the idea was great. I like Rey but it seems everything was rushed. Disney also and they experienced this pain on the Marvel side of the house and for some reason people have a hard time accepting this. People don't have a problem with change or diversity but to have change and diversity just for the sake of having it. The new female character\\, Rose i think\\, felt very shallow. After the movie I felt why is she here? Hodo really? That was just handled terribly. Again there is a part of me that wonders how much of this was Rian Johnson and how much was Kathleen Kennedy. If Rian was completely onboard with this does Disney want him on board. Marvel just cleaned house. I really was looking forward to this movie and felt like so many things were marginalized. I agree with Mark Hamill this isn't my Luke Skywalker nor is it my Star Wars.","true":true}