{"101487":167694,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So disappointed. Story line contains so many disconnects and inconsistencies. Luke finally says the force connects and balances\\, good and evil in the universe. Meaning the force is not good or evil. It appears as though the movie will take a more eastern philosophy of balance\\, not a philosophy of good winning over evil. Luke disavows the force  and the Jedi Order\\, so that\\, evil will cease to exist. The thought is if all the good is gone\\, then evil will be gone as well\\, so the force will balance. So\\, why does great evil exist in Kylo Ren\\, Snoke\\, and another when there are no Jedi? They should not exist at that point\\, and definitely not be that strong. That's just one inconsistency. The story line disconnects are incredible too. Why is it that Admiral Holdo cannot find the time to tell her leaders the survival plan? Does the script writer really expects the audience to believe that the crew would sit there for eighteen hours waiting for certain death? Does the script writer really think the audience will believe that Holdo will not brief her senior leaders on the plan? At the same time\\, the script writer inserts the underlying message that individual initiative in the rebellion should be punished? ALL the previous episodes relied on individual rebel initiative and determination to survive. In fact\\, it is one of the main themes of the series. In this film\\, the rebel command appears more like the empire with its strict\\, tight hold of individual freedom of action. Hans Solo would have been shunned in this environment. There are other disconnects. The one with Rose saving Finn from is a particularly maddening one. The story offers no closure or answers\\, just good and evil continuing ad infinitum. Leaves the series open for yet another sequel-which I will not see.","true":true}