{"101487":130040,"Last Jedi":"Last Jedi","2017-12-15":"2019-02-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I can't believe what Kennedy and the so called \\\"story group\\\" is doing to Star Wars. I think its quite obviously apparent to us all that TFA & TLJ are muck\\, devoid of suspense and tension. It's as if these people have never watched 1-6 or played any of the games or even read any of the books. \\n\\nNobody cares about Rey\\, Finn or poe\\, seriously kill them off in the next movie and we would actually be relieved. \\n\\nAsk yourself what each movie about:\\n\\nFrom the perspective of the protagonist and the audience -\\n\\n\\nEP1: How Anakin meets Obi wan.\\nEP2: How the clone war began.\\nEP3: How Anakin became Darth Vader.\\nEP4: How Luke and Obi Wan meet.\\nEP5: How Luke finds out about his father and begins his training.\\nEP6: How Vader restores balance to save his son.\\n\\nThese next two........ God I don't even know......\\n\\nEP7:  A scavenger gets Jedi powers from nowhere ?\\nEP8:  (I honestly have no idea what to say) eaaa the scavenger grows stronger in the force. Maybe or steals books from a hermit....?\\n\\nIf I were Bob eiger I would fire everyone in Lucasfilm and start again with a crowd of people that actually loves Star Wars. Any fan would take a salary cut to work there! Hell Id work for free if I could even help the new movies in the correct direction. \\n\\nI won't go on but to leave you with a quote from Kennedy\\, and I'm paraprasing \\n\\n\\\"Im looking for female directors and I have so many guys calling me up saying I'm such a fan. All the toy companies were saying Star Wars mostly appeals to boys.....WE HAVE TO CHANGE THAT. It has to appeal to both\\, Whats wrong with that?\\\"  \\n\\nWell Kathleen I will tell you whats wrong with that\\, Its called Star WARS!! as a percentage women DO NOT participate in WAR\\, yes there are some and they are in my opinion total bad asses like Leia\\, Jyn\\, padme. Warrior women are not the norm and by injecting literally a 50\/50 split of genders in every frame\\, as a fan it IS SO JARING! Movie goers are not stupid we see these obvious intentional choices and it totally takes you out of the movie not to mention it dilutes the actions of the female characters.   \\n\\nFOR GOD SAKE GET SEASONED DIRECTORS LIKE NOLAN\\,SCOTT\\,LUCAS\\,TARANINO\\,KOEN BROS\\, ETC ETC ETC \\n\\nWE WANT QUALITY NOT MEDIOCRE. WE CARE BECAUSE TO US ITS NOT JUST A MOVIE ITS AN ESCAPE\\, ONE THAT SOME OF US LIVE AND BREATH THAT GIVES US SOME COMFORT IN OUR EVERY DAY. IF ITS FOR BOYS THEN WHAT THE HELL IS WRONG WITH THAT??? CAN WE NOT HAVE ONE THING TO OURSELVES.","true":true}