{"101487":135760,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I loved this movie! It was full of surprises and dark. I really am looking forward to this new direction. It has stepped away from the thirty year old trilogy for a new generation. The way the Force was portrayed was unlike anything I ever expected. Watching the new ways it was used made me happy. It was done really well.\\n\\nThere are some parts that are not my favorite\\, but there are parts of the original that give me the same feeling. \\n\\nI am happy that there is no overlord guiding the dark force user anymore. It is just a Rey versus Kylo future to wait and experience. \\n\\nFight scene in the red room is one of my favorites of all time. The backdrop of red\\, the skill of fighters\\, the way the camera moved\\, amazing!\\n\\nIt is time to forget the past. The original heroes need to say goodbye. This is a new generation\\, a new war\\, a new use of the force. I am satisfied that this was not a throwback to original fans. I understand people are upset about the loss of their childhood hero\\, but come on. Luke never fought unless he was forced to. We were never going to get some crazy later sword fight with him. Go back and watch the originals. Pay attention to who Luke is. His sacrifice made complete sense. He went out the way he should\\, and we will see him again. His final scene was perfect. \\n\\nI cannot wait for the ninth episode\\, and I think this movie created a wonderful canvas to move forward in a very fresh and bold direction. This is a universe not just a singular storyline.","true":true}