{"101487":161982,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Perhaps the most ambitious Star Wars film made.  While not perfect\\, it takes many bold risks with beloved characters and challenges what we know about them.  Luke Skywalker\\, childhood hero to many of us\\, is revealed to be a broken\\, bitter man.  Crushed by his failure to keep Ben Solo from going to the Dark Side\\, Luke's abandonment of the Jedi way and of his own legend as the Last Jedi may be painful and difficult to watch for those of us who grew up on the original trilogy.  Nevertheless\\, the exploration of Luke's own failures and the failures of the Jedi Order (tying neatly in to the prequels)\\, this film forces us to question what it means to be a hero and what we do when our heroes turn out to be less than what we'd hoped.\\n\\nMark Hamill gives his finest performance as an actor in this film.  Daisy Ridley holds her own as Rey learns to harness the power that's been awakened inside her.  \\n\\nAdam Driver continues to make Kylo Ren one of the most interesting characters in the entire saga.  Kylo Ren is a deeply conflicted man.  His struggle to master his emotions and the Dark Side is powerfully portrayed by Adam Driver.  In many ways\\, Kylo Ren is the character Anakin Skywalker should have been.\\n\\nNot to be outdone\\, Carrie FIsher turns in a fine performance in her last screen role.  Leia's compassion and wisdom come through in every scene she's in.  Her absence will leave a large hole to fill in Episode IX.\\n\\nWhile the film is too long and the Pow and Finn storylines tend to drag\\, the Last Jedi is a worthy addition to the franchise.  While it may not be my favorite film in the series\\, it's one that I will be contemplating for a long time.","true":true}