{"101487":129495,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am huge star wars fan and had huge expectations for this movie. \\n\\nFirst i'm going to go throught the things i liked about the movie.\\nThe movie was beautifully made movie and visually stunning. The action looked amazing and was really entertaining. The acting was over all good and in particular Adam Driver did an amazing job as Kylo Ren. \\n\\nHaving that out of the way i'm going in to the bad thing about this movie and some plot holes of the movie. \\n\\nwhere do i start? In the beginning why is Poe joking in the phone with hux? It fel so out of place.\\nNext up why do bombs fall downwards in space? Now Snoke dies in this movie\\, how? why? we didn't know anthing about him? Who is he? Why is he so powerfull? We never get these questions answered.\\nThe writing in the movie is just bad. And the things characters do are so stupid some times and out of place. Luke Skywalker they destoryed luke in this movie. It was so not Luke Skywalker how he was written in this movie. It was out of character of him to want to kill ben solo\\, just because he had a little bit of dark side in him? This is just ridiculous. And the Leia is superman? \\nLike i was stunned watching the movie. I was like wtf am i wachting here? I can go on and on about it this.... \\nAnd then they weaponized hyperspace? That opens so many plot holes in the whole of Star Wars.\\n\\nI want to talk about Kylo Ren and how badly he was developed in the these new Star Wars movies. Kylo Ren Dark lord trained for years in the ways of the force by Luke Skywalker. Turned to the dark side and is super power as it seems. Then in the Force Awakens Rey show up with no training and kick his ass... \\nThis made Kylo Ren look so weak and uninteresting. And Rey is just power because reasons.\\nIts just badly written. \\n\\nThen after Kylo Ren kills Snoke in the most stupid way ever. Like Snoke is supposed to super power full and know everthing that is happening. But he can't sens Kylo turning the lightsaber?\\nThen they start fighting his guards. But They where almost killed by Snokes guards.So what i don't get they set up Kylo and Rey to be so powerfull without any training. Snoke talks about completing the training of Kylo. And Rey never held a lightsaber in her life and was master when she first touched it. Then hey should have destoryed these guards with there lightsabers and force powers. But no the barly made it out alive\\, extremely disappointed.\\n\\nNext up the Finn and Rose story line with and the cameo of the EA casino gave me an uninted laugh. With the Star Wars Battlefornt 2 lootbox thing going on. This casino planet was bad and should not have been in the movie. And i felt like there where some political undered tones thrown in there for just the sake of it. And they talk about the rich are bad and they sell guns to the first order. But later you see that they sell guns the both sides so it doens't matter anyway. It was just so stupid. But they went to the planet to get the codebreaker but later in the movie. It was not needed and making this whole subplote not needed.   \\n\\nBut at the end when Luke comes back to fight Kylo. I was like yes a least an amazing ending fight. But then we see Luke is a hologram....\\nand then dies for some reason anyway. What a waste of an amazing character.\\nOverall this was massive disappointment and i really did not like it.","true":true}