{"101487":105698,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As I've sifted through my reactions over the past few weeks after seeing this movie\\, I've come to the following conclusions:\\n1. This isn't a horrible movie. It's on par with most of the Marvel movies. It is\\, though\\, a bad Star Wars movie. The script does not even closely reflect the history or language of other Star Wars films. The characters do not fit into their own Star Wars story. The music was under-utilized. The direction of this film could have created a new generation of Star Wars stories and fans without completely leaving the timbre or feeling of the old films aside.\\n2. Seeing how much this film has made in the box office tells us why it was made. To repeat an observation from above\\, this is exactly the style and format of the Marvel films. They aren't meant to be good films or represent good film making. They are meant to make money and KEEP making money. The production companies now know exactly how to get billions from cheap thrills and they will keep doing it.\\n3. The controversy over the Rotten Tomatoes scoring perfectly embodies several things. Audiences had to see this film because it was \\\"the\\\" film to see; then they didn't know how to react if they didn't like it. Film critics knew they had to give good reviews if they wanted to appease the mega-buck owners of the production company. Who in their right-mind would give a negative review to the biggest blockbuster from the biggest production company in the world? The controversy isn't whether the scores were tampered with or not. The controversy should be about why film critics are eating out of the hands of film companies\\, even when a film is obviously sub-par.\\n4. Storytelling. It comes down to storytelling. Great films tell exceptional stories. The Last Jedi had some really cool moments. There were some fascinating visuals and scenes. But the storytelling was not good. There really was no story to be honest. Characters were either overly dense or overly emotional\\, but rarely cohesive. From the opening scenes\\, humor was used to gain popularity\\, not to advance the scene or story. Unfortunately I don't think there are very many film directors who are exceptional storytellers anymore. Certainly not any who make \\\"blockbusters\\\". Most are too worried about the bottom budget line.\\n\\nAs I said before\\, this isn't a bad film. But what's worse\\, it is now a normal film. It's what audiences are used to. Film makers have a huge task ahead of them. Quit being \\\"normal\\\" and start making films again.","true":true}