{"101487":190592,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ummm...yeah a Star Wars movie by a director who seems to hate Star Wars and it's fan base.  Not good.  No I was not expecting this film to magically transport me back to my childhood.  I was\\, however\\, expecting a modicum of competence in storytelling and character development.  I was expecting a filmmaker who could focus on one thing at a time and move the Star Wars saga forward with characters I care about in situations I found interesting and exciting.  What I got was a movie made by a director with the attention span of a 7 year old in a Tilt arcade.    This is not mearly BY FAR the worst Star Wars movie ever made;  it's a bad movie period.  What kind of company hands the reigns to the single most popular and iconic movie franchise of all time over to a rank amateur like Rian Johnson who has all of two low budget films to his credit.  And likewise\\, what kind of narcissist looks at the original legendary Star Wars trilogy\\, perhaps the most enduring and influential films made since King King and The Wizard Of Oz and says to himself\\, \\\"Those films suck.  Only I\\, Rian Johnson\\,  know how to make a Star Wars movie.  I'm going to kill off or ignore all of the beloved characters from the past and replace them with shallow replicas played by bland young actors who would otherwise barely make the cut in daytime television.  Because I hate Star Wars I am going to ignore all of the vital plot points which drove the Star Wars saga forward.  It took six years and three films to tell the story of Luke's journey from a whiny farm kid on a desert planet to a full blown Jedi Knight.  What took George Lucas six years to do I\\, narcissist amateur Rian Johnson\\, will undo in 70 minutes.  I will make Luke Skywalker into a weak\\, bitter\\, ignorant recluse who once had the power to defeat Darth Vader but somehow totally collapses because his nephew's training didn't go well.   I will use Luke to voiice my own contempt for the Star Wars trilogy and when I'm done with him I will kill him off so I can look forward to my brilliantly progressive vision of a Star Wars universe","true":true}