{"101487":158898,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Oh where to begin... I went into this film thinking we were going to get something with depth\\, emotion\\, and answers.  Instead it was just a giant mess.  The opening scene with Poe... so stupid.  What is with the idea that films NEED comedy all of a sudden?  Seriously\\, it made me cringe.  I had hoped that was the last of it.  \\nThen we get to see Luke.  Rey holding his saber.  Luke taking it and tossing it over his shoulder.  Some audience laughter.  But come on.  They took a beautiful scene from TFA and turned it into a punchline.  \\nMilking a creature on the coast.  Dumb.\\nPorgs.  DUMB\\nJust so much of this movie was a waste.   I have no idea what is going on at Lucasfilm and Disney but it is like they could give a crap about what real fans WANT to see.  Instead they are just making it up as they go.  \\nAgain another movie without a significant lightsaber battle.  \\nThey had the absolute perfect opportunity to kill Leia off but no.  Lets have her now be space ghost Leia.  \\nInstead lets kill off Luke.  \\nAnd now what do they do about Leia?  I assume they held back footage of her to use in the third film.  \\nBut we got literally no answers about anything.  And no real cliffhanger for the next film.  \\nI found myself mentally comparing this movie to Revenge of the Sith while I was watching it.  And I really am trying to figure out WHY the prequels are looked down upon so much.  At least the end of ROTS felt like Star Wars.  I was sad and happy at the end of ROTS.  \\nThis movie just made me sad.  Sad for the fact that Disney simply does'nt get it.","true":true}