{"101487":137149,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"In 3 days The Last Jedi will be released on DVD and BluRay. I expect Disney's damage control shills to inundate Rottentomatoes and the other critics sites with tons of fake reviews stating that this movie is the best Star Wars ever and inviting everybody to buy the DVDs and BluRay.\\nJust the way they lured the fans with cleverly misleading trailers and carefully leaked news like when Kathleen Kennedy said that Luke Skywalker would have been very important in TLJ... everybody knows what they did to our beloved Luke.\\nIf you are reading the audience critics in order to decide whether or not to buy the DVD\\, please take a look at the thousands of extremely negative reviews coming from people who have NOTHING TO GAIN by praising a disgrace of a movie and NOTHING TO LOSE by crashing it. \\n52% of the moviegoers who watched The Last Jedi have said they do not like it. They took the time to tell you why with page-long reviews.\\nThe reviews which make the other 48% are one-liners with generic phrases like \\\"Best Star Wars ever! Wow!\\\" and 5 stars.\\nMoreover the bulk of the positive reviews has been posted in the first days of the screening in the theaters and guess what? They were ALL paid advertisements from people who live with what Disney gives them.\\nWho do you believe?\\nPlease don't buy anything related to Disney's Star Wars. They have to understand that making a good movie come first\\, and social justice and feminazism should not have anything to do with Star Wars.\\nThe toys are already rotting on the shelves. Let's have Disney find a large enough landfill to bury the tons of unsold toys and DVDs and BluRays\\, like Atari did with the infamous E.T. videogame in 1983.","true":true}