{"101487":121087,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Finally got my chance to see this movie and I have to say I have so many mixed feelings on it. The first half of this movie is pretty all over the place. The editing is very choppy\\, the pacing is slow\\, and for the most part you just feel like you're sitting there watching a bunch of nothing happen. the story they were trying to tell in the first half is just pretty uninteresting and visually it's just pretty bland. the movie really only takes place in a few locations and there's nothing really exciting about where they're at. I always felt like there should be something more in each location. also the bad guys in this movie are just not good. for as much power as they have they seem to not be able to do anything with it. either they can't shoot down something that's right in front of them or they're losing fights to characters with way less experience than them. The new emperor is just very weak and there's nothing interesting about him either visually or story-wise and the same goes for kylo Ren. He is most definitely no Darth Vader\\, or not even a Darth Maul. there's just nothing scary or cool about him. and he can't fight for shit. Truthfully Its not until the 2nd half where I actually started enjoying some of the stuff in this movie. some of the effects are nicely done here and this movie also has pretty good costume and alien designs. And they only went to one planet that was in any way visually interesting. I also liked any time the movie actually started to dive into the theories of the force and into some of the more sci-fi stuff. I just wish they would have went deeper into the lore of what the good and bad side of the force really means. it seems like there's a deeper story there but they really didn't spend any time to tell it. as far as the actors go\\, for the most part they did an okay job. Princess Leia was pretty good throughout and they even did something that I've been waiting for her to do for a long time. Ray was okay but it kind of felt like she took a backseat to Luke Skywalker in this movie. and Luke Skywalker was just average to me. I like a few of the things they did with him towards the end but for the most part he just walked around being grumpy all the time. in the other characters were okay as well. I like the adventures that they went on but I do wish they had didn't war with that as well. In all this is really not the Star Wars movie I expected it to be. I've never really been a fan of Star Wars but I have always liked the mythology of it. I kind of expected more of a bigger story and for them to dive deeper and Advanced the mythology of Star Wars. but instead this just felt like a okay episode of a Star Wars TV show. this was just middle of the road.","true":true}