{"94533":"94536","UD":"UD","2015-09-30":"2015-09-30","8":8.0,"História espetacular\\, ótimos gráficos\\, porém a movimentação dos personagens não é boa e o jogo é totalmente linear. Apesar dos problemas é um grande jogo.":"I enjoy watching horror movies because they are always fun to watch especially after a hard day’s work and I always wanted a special horror game that combined all the best elements from horror movies. Thankfully\\, Until Dawn succeeds in doing so.\r\rEight friends gather together in a remote cabin on top of the mountains. Things start of well with each of the characters trying to have a goodI enjoy watching horror movies because they are always fun to watch especially after a hard day’s work and I always wanted a special horror game that combined all the best elements from horror movies. Thankfully\\, Until Dawn succeeds in doing so.\r\rEight friends gather together in a remote cabin on top of the mountains. Things start of well with each of the characters trying to have a good time; however\\, little did they know that they are not alone; something or someone is watching their every move. Panic escalates when the group suspects that they are being hunted so they start helping each other to find out the mystery behind all of this\rUntil Dawn is a survival horror game that focuses on quick time events\\, each of the characters will face different situations throughout the game and you will have to control each of them by taking choices and tough decisions that will affect how the game plays out for each character’s.\r\rThe choices and difficult decisions I had to make kept me at the edge of my seat because of how smartly they were done. I had to stop and think for a while on what choice is best.\rFrom the relationships between the characters to the shocking deaths\\, everything you do means something. Would you take a short cut and avoid the risk of falling or would you play it safe and follow the footsteps? The choices are endless. I liked how the characters interacted with one another; each one has his or her own personality traits that helped in making them feel unique. My personal favorite was mike\\, a funny and brave character.\r\rThe controls are simple\\, choosing your actions were straightforward and the sensitivity controls worked perfectly especially by adding tension in climax situations.\r\rThroughout the game\\, you will collect totem prophecies which foretell a possible future event. How you play will determine whether or not the prophecies come true. Collecting clues is important as this will help in solving the mystery\rThe details of the facial expressions are impressive and the overall eerie environments along with the good camera angels successfully give you a sense of loneliness\r\rThe main campaign took me around 8 hours to complete but the replay value is high so you will find yourself going back and playing the game many times to try different things.\r\rI enjoyed the progression of the story. After a series of strange events the characters find out that a psychopath is after them and the suspense and tension rises. The psychopath reminded me of Michal Myers and Jason\\, the way he walked and stalked you was scary.\r\rUntil Dawn never felt boring I just wanted to keep on playing and find out what happens next.\r\rUntil Dawn is like watching an awesome horror movie\\, the creepy music and countless number of scares were awesome. The clever story is filled twists and turns and I never expected anything. This game is one of the biggest surprises this year. a truly engaging game and a great homage to horror mvoies.… Expand","true":true}