{"101487":123895,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"---Good---\\nIt's visually beautiful.  Effects are amazing. Musical score is amazing.\\n\\n---Bad---\\nThe plot makes no sense.\\n\\nNothing happens\\, they're just trying to fly away while running out of gas.\\n\\nIt didn't occur to the bad guys to just warp ahead and come at them in the other direction\\, therefore the whole chase was just a really bad plot device and nothing more.\\n\\nSide mission to the casino planet was a waste of time.  They just wanted to deliver a animal rights public service message\\, and yet failed to save the abused orphans.  Essentially the plot was used to promote a specific agenda at the expense of making sense or even a meaningful contribution to the overal story. Shame on the screenplay writers for this.\\n\\nThe \\\"Luke Skywalker\\\" character was essentially re-invented.  No personality resemblence of the character from any past movie was present in any form here.\\n\\nThey pushed the force into an unlimited magic plot device to implement the nonsensical plot points they wanted to make.\\n\\nYoda introduced simply as a plot device not as a character.  Clearly they wanted to make new Yoda toys\\, google \\\"last jedi yoda toy\\\" and you'll see it's true.\\n\\nMillenium Falcon used as a plot device rather than a tool for character development.\\n\\n---\\n\\nBasically\\, the entire movie's plot was a series of bullet points that need to be connected by irrational side plots or force magic.  Horrible writing... Feel ashamed\\, screenwriters should.","true":true}