{"101487":145959,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never given a rotten tomato review but I feel I must with regards to this movie.  Quite simply\\, Disney and Rian Johnson have ruined star wars and have officially let it die. \\n\\nThe problems:\\n1. Rey has no backdrop.  Just a random with greater powers than the skywalker bloodline\\n2. Snoke has no backdrop.  Just a random\\, powerful enough to appear equal to the emperor we've seen before\\, but in reality pathetic and easily dispatched in seconds.\\n3. Luke was egregiously mis-handled.  The hero of the universe in the original trilogy\\, a beloved character that never gave up and chastised a Han Solo for bailing on the mission in a New Hope.  Now\\, just a coward on a remote island.  Unwilling to help even when it is made known that his sister needs it.  Even when the threat to the galaxy is very well known by him.  It just is bonkers.  In the original trilogy he didn't even know the power he had\\, just a farmboy at the time\\, but he bravely stormed into battle to fight the tyranny of evil.  Now\\, a jedi master\\, he won't even entertain a conversation from Rey regarding why he won't help.  It's so absolutely terrible.\\n\\nThe plot holes.  There are so\\, so many.  First Order ships unable to finish the rebels until they run out of gas over a 20+ hour period?  WTF.  A hologram of luke going into battle against an entire fleet of First Order and not telling the others \\\"hey - use this time to GTFO using a backdoor\\\"??  wtf is this plan.  I mean at one point they even contemplate that they can't just leave Luke alone out there and have to help him.  HOw completely stupid is his plan if a bunch of people die in real life going to save his freaking HOLOGRAM???  the gambling casino turns up a convenient code breaker?  maz kanata is brought into the movie via a phone call to give a code breaker identity???  i mean.. did a fourth grader write this storyline.\\n\\nAn interview with Hamil himself said it best.  He noted that in TFA\\, he and Leia should have been there when Han died.  They should have seen the gravity of the moment and let the audience see the weight of it.  Instead\\, in his own words\\, you have two people (Rey and Finn) watching it and they've spent a grand total of 20 minutes with the guy up to that point.  What a freaking joke.  \\n\\nThis reboot is a complete disaster.  Honestly\\, Lucas may not have the directing chops or talent assessment chops to make movies anymore\\, but at least let his creative essence write the damn storylines and use others to cast and direct.  These stories and the complete trashing of childhood heroes is a travesty.","true":true}