{"101487":181519,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is a bad film. It also neglects the previous film in its own trilogy to take the story on what feels like a different direction. \\n\\nIf you watch The Force Awakens to prepare for watching this movie\\, you're wasting your time. Honesty\\, the remnant of the First Order is magically in control at the beginning of this movie and every single previous character arc is ignored. Previous character growth is ignored and you may feel frustrated watching them make similar or the same exact mistakes again in this film. Otherwise\\, you may find that a character's personality is now completely rewritten. \\n\\nTrilogy aside\\, this film suffers from many plot holes that will cause you to scratch your head at least a couple times. We even took a detour from the movie for a subplot with the lovable Finn and a cool\\, new character Rose but their portion of the movie dragged on. This detour saved us from having to watch a boring \\\"chase scene\\\" between huge starships taking place at a turtle's pace but makes the situation seem just as cheap as the lazy writing that created it. The lack of pace may allow you to ask why things are happening as they are but the story truly falls apart after reflecting back to the film after leaving the theater. \\n\\nThe film has some amazing special effects that are just spectacular. For example\\, the incredible lightsaber fight between young force-users and the final battle scene were pure art. However\\, the story between the beautiful non-speaking portions fails and hollows the story to not feel epic. \\n\\nI'd say this is a must-see if you loved the previous film\/films. I loved The Force Awakens and was ready for another adventure but feel disappointed. This film is where Star Wars \\\"jumps the shark\\\" and \\\"nukes the frig\\\"\\, and I disgust those scenes... they make me upset. Still\\, go see the film because you may really like it like many others\\, but be warned that nearly half of the audiences are not enjoying this film and that is shocking to consider.","true":true}