{"101487":185926,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie tries very hard to take SW in a different direction and I credit it for that. New ideas\\, new themes\\, new visuals etc. I have two issues with it. \\n1: Rian uses 'subversion' as the theme instead of a storytelling tool. So much time is spent subverting Episode 7 that so little happens in terms of the saga's plot. There is the idea that the old ways must die i.e. Jedi-Sith\/Good-Bad\/Light-Dark etc. The idea that the Jedi are the sole users of the Force. It's a bold\\, fresh and interesting idea. But at the end of the movie\\, Rian returns to the same old SW. Rey chooses the Jedi\/Good\/Light and Kylo chooses the opposite. The Jedi texts weren't really destroyed like we thought\\, so Rey will eventually start a new Jedi temple. After saying the Jedi should end\\, Luke then tells Kylo that he won't be the Last Jedi\\, as the movie's title says. So\\, it's hard to look on the bright side of this 'subversion' when even the director abandons at the end of his own movie.\\n2: Because the movie focuses on theme (which it abandons at the end) rather than story (a slow ship chase in space)\\, the Trilogy's story remains stagnant. Rey is still the might Jedi from Ep. 7. Kylo is still torn between the Dark\/Light like in Ep. 7. General Hux\\, 2nd in command and villain heir-apparent is portrayed as a joky character that isn't intimidating. Snoke (main villain?) and Luke (main hero?) are both dead. The Resistance's victory and advantage in Ep. 7 has been neutralized. We still don't know much about the First Order\\, their strength as compared to the Resistance\/Republic (2 different entities?). It's not satisfying story wise and leaves the writer of Ep. 9 in a very difficult position.\\nVerdict: I like the ideas. They are excellent. But the execution was terrible and it left the Trilogy in a bad place.","true":true}