{"101487":144492,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It was basically a rehash of Empire and Return of the Jedi at once. And fragg those porgs aka New JarJar. If the resistance had the ability to destroy Snoke' ship by hurling another smaller ship at lightspeed\\, why didn't they do it before they lost 99% of their forces? Instead they send Finn to ride alien horses and waste time. And talking about time: AGAIN WITH THE TIMERS.... *sigh*... Hux could have made a couple of star destroyers jump ahead and flank the Resistance fleet. Done\\, victory for the First Order. On the flip side\\, Leia or Holdo could have send one of the support ships to turn around and FTL-ram the pursuing fleet. Done\\, victory for the Resistance. The whole thing is so dumb. \\n\\nso many characters have been ruined:\\n\\n- Rei was the least ruined character\\, her lines are not that interesting and her scene in the dark side of the island was a waste of time.\\n- Finn was ruined by portraying him as dumber and more stubborn than the previous movie. And that whole casino waste of time.\\n- BB8 is still ok.\\n- Leia suddenly can use the force too now and can somehow use it to fly in space while unconscious in vacuum after a massive explosion.\\n- Kylo Ren: He was ok\\, he was Kylo Ren. \\n- Hux: This General should have enough military knowledge to flank the Resistance Ships. Otherwise\\, he is ok.\\n- Luke: Made into a grumpy hermit\\, that wont even get out of his hut to help his own sister\\, until the very end. He is guilty of something worse than turning to the Dark Side: Apathy and indifference.\\n- Akbar: killed unceremoniously. He deserved better than that.","true":true}