{"101487":169288,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoiler-filled review. basically\\, this move is just one giant miss opportunity after another. This movie\/new trilogy is constantly setting plot devices up to tell us they dont matter. That first Jedi temple that is hyped up and we see in Rey visions?it just gets burned down and we are told they ancient jedi text are useless. Supreme commander snoke? we are given no back story on where this extremely powerful sith came from and he dies in the most disappointing way.Rey parents\/origin which has been hyped up in both movies? turns out they were no one special. Luke is the only one who can stop the first order right? o turns out he stays on the island the entire movie does basically nothing and then peaceful returns to the force\/dies. Plasma has to have a lot more impact this movie right? has one fight scene before falling into a ball of fire to mostly like die. movie basically puts mystery box after mystery box in front of you but turns out they are all empty. on top of that the plot is terrible. movie starts out with rebels running from first order movie basically ends with the rebels still running away from first order but they have just moved a few planets over. On top of all that Fin goes on a huge quest to allow the rebels ships to escape the sight of first order but in the end the plan fails and the commander of the rebels ships actually had a plan all along but refused to share it with her soliders so her plan ends up only half working either because when finn plan fails the first order also finds out the commanders plan. basically tension of the movie ends up to not actually exist and if the commander of the rebel ships just told her officers her plan instead of hiding it then everything would of worked out fine.","true":true}