{"101487":120084,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-09","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Fans: Who is Snoke? Rian: Doesn't matter. *Kills him*\\nFans: Who are Rey's parents? Rian: No one. *Spends half the movie telling us this*\\nFans: What's the deal with the Knights of Ren? Rian: Who cares. *no mention*\\nFans: How was Anakin's blue lightsaber recovered? Why did it call to Rey?  Rian: Who cares. *no mention*\\nFans: How does Rey have force powers with no training? Rian: Shutup. Buy some accompanying book to find a stupid non-answer.\\n\\nWhy does Holdo not tell Finn about plans? Why doesn't everyone use hyperspeed to blow everything up all the time? Why is the entire Canto bight subplot ultimately meaningless and remind us of the prequels? Why doesn't Luke ACTUALLY travel to Craite and sacrifice himself if he ends up doing that anyway? Why did Admiral Ackbar get killed so unceremoniously? Why? Why? Why?\\n\\nSarah Connor\\, Ellen Ripley\\, Danarys Targaryen\\, Princess Leia and Imperator Furiosa just to name a few\\, are amazing female protagonists. Rey's potential is squandered. Holdo is a joke. Rose is literally cringe. \\n\\nFinn and Poe are clowns. Luke Skywalker\\, one of the most legendary pure characters and symbols of HOPE - A NEW HOPE - is nowhere to be found. \\n\\nPros:\\nVisual effects\\, ships\\, action\\, Yoda\\, Rey & Kylo relationship and fight in Snoke's red lair.\\n\\nThe movie looks and sounds great (except the subplot on Canto Bight looks atrocious) and even has some amazing moments like the hyperspeed sacrifice but the second you start thinking about anything\\, the entire movie collapses under it's stupidity and lack of respect for what came before. I understand KK\\, RJ and Disney have a political agenda here but Star Wars (at least the numbered canon theatrical entries) has always been about the Skywalker family. Ep1 - Ep7 understood this and here in one fell swoop\\, RJ basically said \\\"I don't care about any of that. To heck with the fans who made Star Wars what it is today.\\\"\\n\\n1 Star for visual effects and some cool moments.","true":true}