{"101487":127988,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Honestly\\, this is at the bottom of my list as far as all of the Star Wars movies are concerned. It is a better made movie and extremely beautiful and well directed but there is a direction and choices that were made in this movie that ignores and straight out disrespects it's lineage. \\n\\nI'm all for passing the torch to a new generation and taking Star Wars in a new direction but that doesn't mean that elements and plot points that have already been established can be ignored. Whether you only like the Original Trilogy or not\\, the prequels and the subsequent animated series set forth during that period prior to A New Hope ARE canon. \\n\\n**********Potential Spoilers************************\\n\\nAnakin and his line are BAR NONE the strongest force users PERIOD because he was born of the force. Though\\, in the movies whether or not he is the Chosen One is debated but it is has been established since that in the current canon that he is a product of the force. Training or not Rey should never be able to be on par with Kylo. The argument given in the movie is that Kylo's decent into the darkside and forced the Light to give rise to his equal. Yettttt we clearly see other force users exist throughout the galaxy. It just isn't clear how the force behaving in this way fits in with what we already know about the force. Is she a new chosen one or a new conduit of the force but if that's the case\\, she had both her parents. She wasn't a spawn of the force. Unless the origin we get is just a lie to get her to fall to the Darkside.\\n\\nI do love every scene with Luke and Rey. Poe's arc is amazing as well and we see the forced used in ways that we haven't seen before. Finn and Rose's story could have been extremely cut down because it was mostly pointless except to set up Poe for failure and set up the last scene of the movie. \\n\\nPhasma again is completely wasted and still a throw away character. For a woman like Gwendolyn Christie to be in these movies\\, she deserved more as do the women that wanted a strong powerful woman character to look to. \\n\\nSnoke\\, wasted.\\nFinn\\, wasted.\\nPhasma\\, wasted.\\n\\nI just have no idea where they are going with this story. I wanted to like this movie and I want to like where the series goes. I just feel like they trivialized and undermined the established lore and history of these films only to \\\"let the past die.\\\" \\\"Kill it.\\\"","true":true}