{"101487":196096,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"When I heard that this film was 'shaking up' the formula of Star Wars I was optimistic and went into the cinema with an open mind. \\n\\nTLJ offers up some of the finest visual spectacles in Star Wars history. Fight scenes are immersive and one particular use of audio (or the lack thereof) holds a resonance that was breathtaking.\\n\\nHowever (and it is a big however) despite glimmers of brilliance TLJ throws at you perhaps the worst concept of storytelling I have ever experienced in a large release. It quite simply feels that a coherent and satisfying story was sacrificed for the sake of jamming as many plot twists into the film as possible\\, I guess as an attempt to be 'edgy'. In short there are 3 instances where main characters are set up for emotionally charged\\, meaningful deaths\/exits. All 3 shrug off these perfect opportunities\\, with one major fan-favourite character dying a minute or so later in a massively disappointing anti-climax. I genuinely can't think of a poorer piece of writing that I have encountered. The leading characters that we all grew up with are turned into pathetic messes\\, while iconic supporting characters (admiral Ackbar) are given meagre off-screen deaths that scream of a missed opportunity. I can't believe that it slipped through the grey matter of the big wigs at Lucasfilm and Disney that if a character you have no emotional connection to is the one to make the 'grand sacrifice'\\, no one is going to give a damn.  \\n\\nTo conclude TLJ feels like a seriously well funded fan movie...if said fan had missed the point of everything that had made Star Wars great. \\n\\nSomeone please tell Rian Johnson that it is possible to 'shake-up' the formula without changing it all together.","true":true}