{"101487":188873,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Thought this movie was awful when it came out.  Humor was more appropriate for SpaceBalls than Star Wars.  The overarching plot was awful.  The bombing raid jumped the shark (which is hard to do because\\, in the end\\, Star Wars is a kids film\/comic book\/space opera not grounded in science or reality).  Rose the character (not the actress) was horribly developed and the \\\"chemistry\\\" between her and Fin was worse than between Anakin and Padme in the prequels.  In contrast\\, Finn and Rey had a great chemistry together in TFA.  \\n\\nWatched Last Jedi the week before release of RoS and had to stop watching it was so dreadful.  But then I watched it again after watching RoS.  Played it for the kids but fast forwarded through anything not involving the Jedi or the force (as well as Luke's milk scene) and\\, low and behold\\, I really liked it.  The scenes involving Luke\\, Rey\\, Snoke\\, Ren\\, and Yoda were all really interesting.  Was it how I would have portrayed it?  No.  But it was really interesting.  It added a depth to the overall story.  Even the Lea Poppins scene became more bearable in the context of establishing the Skywalkers are really strong in the force.  \\n\\nCut out an hour+ of this film\\, remove the pointless space battles and chase  and the Canto scenes\\, and there is a really interesting movie in there that advances the overarching Skywalker saga in an unexpected but intriguing way.\\n\\nThose force related scenes in Last Jedi really work in light of what RoS does.\\n\\nRian did some really interesting things in this film.  But then he did some really brutally bad Showgirls\/Cats level misfires.  He\\, like Lucas before him\\, would have benefited from a strong editing team.\\n\\nThere is a really good movie in Last Jedi Disney.  Give it to Filoni to sort out in a special edition version.","true":true}