{"101487":133680,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have been a True Fan of the Star Wars Saga since I was 5 Years old. I was Born in 1980 and grew up in the Surroundings of the the Original Trilogy that captivated young boys and girls (including adults!) all over the world! Then in 1999 George Lucas returned to give us the Backstory that we had all been waiting for. Granted a lot of Fans were not overly happy with the outcome (over use of CGI - Scripting was pretty Terrible and Some of the Acting was a little Stale) but the story stayed TRUE to itself that lead into Episodes IV - V - VI. 30 plus Years after Return of the Jedi JJ Abrams wanted to tell the continuing part of story with The Force Awakens. He wanted to put us right back in that nostalgia seat we loved sitting in back when we watched A New Hope. He Delivered. I fell in love with what he had done! Returning Characters with all new Characters and the most important: ALL! NEW! MYSTERIES!!!! I was So excited after this film to see the next installment and get some answers we had waited 2 years to see! Answers we can say 'OH MY GOD I NEVER SAW THAT COMING!!' and more importantly!!! Luke Skywalker! Mine and 80% of ALL Star Wars True Fans Hero of the Story! We will See Luke Once Again in fierce combat ready to claim his Hero spot once again!! And what did we get from all of these expectations??....\\n\\nNothing....\\n\\nWe got absolute Garbage. I was completely and painfully gutted by the outcome of this horrendous film. Everything that George Lucas had created\\, Everything that Abrams was inspired to create in a new continuing story was DESTROYED in 2.5 Hours of the most unrewarding\\, degrading\\, deflating and rudely flushes EVERY previous film\/story\\ndown the toilet. I am no longer a fan of the new Canon story line and I can only prey that with the new Live Action series we will finally see what we\\, the TRUE FANS\\, have longed to see: The Old Republic and the MANY MANY stories that can be told! After watching this film though? I have very low expectations.","true":true}