{"101487":130386,"Last Jedi":"Last Jedi","2017-12-15":"2019-03-03","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Identity politics aside. Subverting my expectations aside. \\nEven those things are even more reasons why I'm heavily disappointed\\, even angry at this film. \\n\\nI was not told anything about the film before watching\\,  so my impressions were my own. I did not like it. Even with fight of each side\\, \\\"This film sucks.\\\" And \\\"This film is great.\\\" Afterwards\\, I tried to find reasons to like the film. To be a fan is to love something at the best of times\\, and the worst. \\n\\nThe reasons I disliked the movie\\, again\\, with the identity politics causing me to be uncomfortable\\, and the subverting of my expectations making me confused.\\nWhat makes me upset is the inconsistencies in plot. Things taken from the previous film and disregarding a lot of it. \\nSecond was the disrespect of Luke. Luke was the embodiment of hope. How he would fight as a soldier against the empire. How he would fight for his captured friends on Cloud City. The best possible proof of his good will was that he went to convert his father from evil\\, just by faith and a chance. This is hope\\, this reckless hope in the eyes of most people. This character trait was disregarded as he tried to murder his nephew who was good... And had a small entertaining thought to be evil? This makes no sense. It took me away from the film and into thought. It's not that I could never imagine my hero to fall\\, but how they fell. It was something that is truly a stretch of the imagination\\, and fabricated to create a situation that went against the plot of The Force Awakens. \\n\\nThe movie had too much comedy that was placed at weird moments. \\n\\nCanto bight was a time waste.\\n\\nNo respect for now dead past characters.\\n\\nI have an opinion\\, and having the directors and cast attack me for this opinion makes me stern on my choice. Not out of pride or malice\\, but to make a decision. I wanted to be neutral\\, but if I a fan have the power to speak\\, I must. So I have.","true":true}