{"101487":196387,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While certainly not the best Star Wars movie (that title still holds on and will hold on to Empire)\\, this eighth film in the franchise is by far the longest film in the series... and it feels that way. That's not to say it wasn't fun and there are some bad ass moments\\, but I suggest for Episode IX that they trim the fat. Whereas Force Awakens was essentially New Hope\\, The Last Jedi has some elements of Empire but not that much. There will be spoilers in this review\\, just a heads up.\\n\\nI appreciate Luke actually speaking for a change\\, as opposed to the very end of FA\\, but seriously\\, he is one pissed owf dude. He's become the Bill Crotchety. Not even Obi Wan was this crotchety. Rey seeks to learn the force but Luke only wants to teach her how much of a failure it\/he is. Meanwhile\\, the ship Leia is on is under attack by some dude with no soul and Kylo Mantha Beating Solo. I found the first attack scenes to be fun and brilliant\\, and then the movie slowwwwed down. Especially when Leia somehow survived that? Really? It picks up again when Laura Dern's Wig enters the scene and pisses owf everybody else. This isn't a movie where you want to cheer for the Rebel scum. They're a bunch of douches who forgot how to fight a war. That's one thing I noticed about this film\\, it is a lot darker than the other films int the franchise. I enjoyed the melding of Solo and Rey and thought that the fact that they could communicate via the force was interesting. I almost fell bad for Solo but then I remembered he killed Harrison Ford (or did Harrison Ford kill Solo?).\\nThe culminating battle was neat but I felt it should have ended like Finn wanted to\\, or at least get rid of his sidekick. Make her do it. I also found parts of this film could definitely be riffed on\\, like Luke having fart power to lift off a rock. Oh yeah and some little stuboy knows the force too. Please don't get that kid from Jingul Ahl Duh Waye!\\n\\nOverall it was a good entry in the series but I'm still conflicted how I feel about it. Maybe that's the point of the story. We're left to wonder which side we take. Should we take the dark side and expect the Leia-(and someone else)-less IX or should we celebrate the 9th entry with optimism and hope because Rey has a light saber at the end of this film. I dunno. I suspect that's what's polarizing audiences. The film feels long\\, disjointed\\, but then again it's Star Wars. That's just normal... right?","true":true}