{"101487":134356,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I just wanted to add my two cents since there are so many negative reviews. \\n\\nEpisode 7 sets the new stage for a new trilogy for primarily a new audience as well as long-time fans alike. That's why it plays out like a \\\"Greatest Hits\\\" rather than its own film. It's vanilla\\, but a nice nostalgic romp.\\n\\nThe Last Jedi\\, is the new Star Wars\\, folks. Rian Johnson has swung for the fences and created something new\\, bold\\, and absolutely entrancing. Sure\\, it doesn't all work\\, the Finn\/Rose stuff is absolute filler and a distraction from the Kylo\/Rey\/Luke story that is some of the best storytelling in the history of the franchise.\\n\\nThis movie is all about eradicating the past to build your own future. And that stretches into the story itself and not just the direction Star Wars is going. What you know is over. This is Star Wars. Most people that jump on in the audience comments on RT are a vocal minority.  And is not representative at all of the general movie-going audience. That's why a turd burger like \\\"Transformers: Revenge of the Fallen\\\" can somehow muster 57% rating on RT from audience reviewers. Movies\\, like all forms of entertainment\\, are subjective. \\n\\nIf you haven't seen this movie yet\\, but you dig Star Wars. Go. If you have never even seen a Star Wars movie\\, but are interested in checking out The Last Jedi: Go. You can legitimately watch this film and enjoy without knowing a Deathstar from a Death Trooper. \\n\\nRian Johnson has created a new\\, bold world for Star Wars full of emotionally-driven characters full of depth. He has GREATLY expanded the Star Wars mythos.  And\\, apparently\\, he has also created food for trolls and people who are scared of change. I cannot wait to see what he has in store for his very own trilogy.","true":true}