{"101487":188274,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was painful!\\n\\nIt's interesting to me that many people don't understand why many die-hard fans dislike this movie. Some have even insulted us by calling us \\\"trolls\\\"\\, \\\"fanboys\\\"\\, etc. I'm going to explain it from my point of view. There are a plethora of places to begin. I'm going to start with the things that bothered me the most and work my way down.\\n1. Rey's character. How in the world does Rey know how to do all of things concerning the force without ANY training? This is one of the reasons that people were so interested in Rey's past (including who are her parents) because to use the force the way that she has means you have been trained somehow\\, somewhere. It is utterly ridiculous that Rey was able to beat Kylo Ren with absolutely no training! How did she even know that mind control was a power of the Jedi? And even if she did know about it\\, how did she know how to use it? She's never held a light saber in her life\\, but picked it up and proceeded to kick Kylo's butt?! Someone who HAS been trained? What in the world?! Any martial artist knows that you had better get some training before you start swinging a samurai sword before you cut off some meaningful body part! It takes time and a lot of dedication to master that type of weapon. That's basic common sense (that obviously isn't so basic anymore)! Having Rey use the force this way basically throws away the first 6 movies! It completely destroys them! It basically says\\, \\\"you wasted your time watching those movies because there was never any need for a Jedi (or Sith) to be trained...I mean look at Rey!\\\"  Once again\\, utterly ridiculous!\\n2. Luke's character. What they did to Luke was a travesty! One of the most driven and positive characters was turned into a broken\\, negative coward. Really? There is no way that Luke would have tried to kill his nephew just because he sense the dark side in him. His father was ALMOST COMPLETELY DARK with just a sliver of light in him\\, yet he refused to kill his father. A Jedi is supposed to be selfless and help whenever he\/she can\\, yet he cuts himself off from the force so that not even his own sister can communicate with him? Luke would never do that. To be honest\\, I never expected to see Luke in a light saber battle with Kylo Ren or anyone else. Luke is supposed to be the greatest force user of all time. I expected to see him do some truly remarkable things with the force. I learned that he became so powerful in the force that he could teleport himself (kindof like Rayden of Mortal Kombat). These are some of the things that I wanted to see from Luke-a powerful Jedi Master. Then he dies in a very unsatisfactory way. Sigh! And then let's be honest\\, why in the world would anyone want to see a light saber battle between Kylo and Luke WHEN REY ALREADY BEAT HIM...AND BADLY?! Which leads me to my next point...\\n3. Kylo Ren. They needed to develop this character a lot more. What was the relationship like between him and his parents? Why was he led to the dark side? How did he come to meek Snoke? Why does he want to be like Vader? Doesn't he know that before Vader died that he came back to the light? I was left with many questions concerning this character. Then they had him be beaten by a girl with NO training. What kind of villain is this? A weak one I tell you! \\n4. Snoke. Who is this guy? They set him up to be the main villain in this flick only to prematurely kill him?! He was extremely strong in the force. He could have been the perfect villain for Luke to go up against at the end. I get it\\, this is not Luke's story anymore. But you have to have him go out better that what he did!\\nI could also talk about Finn\\, Rose and Poe but there's no need. Most have already commented on that. Ultimately\\, even in the fantasy world there are rules. When you lay down those rules and let the audience know what they are\\, you can not go on to BREAK those rules. Rules like how the force works\\, how one is trained and acquires the ability to use the force. You cannot break those rules and not dump on all of the other movies which were true to those rules. That's why the Matrix Reloaded and Revolutions were considered bad movies. This is just my take. It was a poor storyline\\, poor character development and a disregard of the questions posed by TFA. If you are the type of Star Wars fan that just like the CGI\\, lightsabers and ships flying in outer space then you might really like this move. However\\, if you love Star Wars for the story\\, then this is going to be a huge disappointment!","true":true}