{"101487":166766,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Shame on Rian Johnson for not doing his homework.  Disney and the director ruined this movie and perhaps the entire trilogy if not the series...in my opinion.  But then I am a die hard fan who grew up with the franchise.  Watched it countless times.  Anyone who has done that knows that George Lucas created the series with Luke at the heart of it all.  Sure we all love Han and Leia and all of the characters but let's face it\\, Luke is our central hero.  It was essential for the fans at least\\, that the writers stay true to the Luke character.  They did not.  What was written of Luke Skywalker in The Last Jedi was a sad\\, sorry\\, cowardly hermit.  I actually feel sorry that Mark Hamill was given this crap to act out.  I get that these new movies are about the next generation\\, and I love that\\, but if you are going to have the former characters in this movie\\, then the writers had an obligation to the fans to give us our true characters.  What we were given was not our Luke.  Our Luke longed to leave the farm and join his friends in battle and threw caution to the wind and fearlessly did so.  Our Luke raced without hesitation to rescue the princess in the hologram being held in prison by Darth Vader.  Our Luke defied warnings by Yoda and Obi Wan and raced to to save his friends in the cloud city.  Our Luke marched in to the den of Jaba the Hut to free Han Solo without fear.  Our Luke willingly confronted Vader and the Emperor to try turn his father from the dark side...he did not run from any of that.   So why should we believe that this new Luke would hide out shut off on an island for 30 years sulking\\, wishing to die\\, refusing to help\\, while his friends...his sister... battled the dark side all that time? And even when his sister lost her true love and then was perilously close to death he selfishly refused to leave and go to her??  And even at the last battle he stays cowardly on that island and only shows up as a hologram rather than fighting the battle one on one like a man\\, like a Jedi?  REALLY?  The fans that knew this character have been robbed.  This is not our Luke.  Our Luke would not have done this.  We get that he was likely going to die in this...that was expected.  But we deserved a better death.  Luke deserved a heroes death.  Shame on you Disney and Rian Johnson.","true":true}