{"101487":193683,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Was poorly written story. Adding force powers that causes me to wonder why don't they just make a Jedi army of the undead. Seriously who will win against a hundred Yoda's who can summon lightning. People will say well they can't do that all the time. My response please explain then when they can't or can because the movie just shows they can. Saying they can't because XYZ is putting headcannon to this. \\n\\nThe Luke skywalker Arc was disliked because we don't get to see why Luke became supposedly cowardly. Why did he fear Kylo? Was it because of the fight he had with Vader? Which he won\\, was it because of the lightning he took from the Emperor. He watched the man die and it lasted for maybe 5 minutes which would then never happen to him again. Leading to him to do what we have learn the wise Jedi masters to do. Grow beyond the horror's in their pasts. Like Obi Wan not wanting to just run away and hide when he nearly died to Anakin and sensing the death of all the Jedi.\\n\\nAnd the lack of any military knowledge is completely apparent in this film. I am really sadden by this. The First order could have just sent ships head though hyperspace. Why have to wait. Better yet why not just sent all their Tie fighters. It is shown they should have plenty? As the fan's we are made aware of the number of fighters carried by the First order and Empire being pretty numerous. But if the only care about victory I don't see why they would care if they lost a few. But better yet\\, how would they lose any when they know the Resistance doesn't have any fighters left. We should be afraid of the first order yet they give us nothing to be afraid about.\\n\\nThese are just a few issues. But hopefully if people read this\\, they will see why the film isn't all that good.","true":true}