{"101487":162610,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Poorly written\\, bad characterisation and forced humour. So many plot holes and continuity errors that I can't believe Disney have passed this story especially when they've made such a big deal lately about the story group and everything being canon. The capital ship chase is an absolute farce with Johnson seeming to have forgotten (or just didn't care) that the multiple star destroyers chasing the resistance cruiser carry multitudes of faster tie fighters that could take down the cruisers shields in about 5 minutes. Or how about the fact that the Star destroyers weren't low on fuel and could micro jump ahead of the cruiser. These are not facts known only to experienced Star Wars fans but just common sense. Such idle or poor writing.\\nThe characterisation of Yoda (acting stoned) and especially Luke were terrible. I feel so sorry for Mark Hamill having to act out what was written and I 100% agree with the statement he made after reading the script saying \\\"I fundamentally disagree with every choice for Luke in The Last Jedi\\\". For an actor who loves the saga and has given so much time and effort for the fans it's a slap in the face. Disrespectful even.\\nEvery interesting plot point left over from the Force Awakens that fans have debated for two years has been callously discarded and wasted making the entire plot of the Force Awakens totally pointless. I can imagine JJ Abrams is less than pleased also and it'll be interesting to see what he does to rescue the trilogy with episode 9.\\nThis movie unlike any other previous Star Wars movie definitely had the feel of Disney executives all over it with the Mary Poppins flying Leia scene and an end scene that was only missing tinkerbell.\\nIt's not all bad. The special effects are great. John Williams soundtrack as usual is epic. The scene with Chewie cooking a Porg is hilarious. The force link between Kylo and Rey was fascinating and I'm keen to see where that leads. Sadly these few things don't save the movie and Disney had better listen to the majority on viewer reviews on this and similar sites because this just isn't good enough for a Star Wars movie.","true":true}