{"101487":196300,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where to begin? I've never written a movie review. My feelings about the film are conflicted. After reading countless reviews the conclusion I've come to is that it's okay to be conflicted. I'm sure many fans my age (46) have similar feelings. Many fans my age would like to strangle Rian Johnson. Although I don't particularly agree with many of his plot choices it was a decent movie. Far from the spectacle that I was eagerly expecting. though.\\n      It seems to me there are 3 generations of Star Wars fans. There are fans that were children during the original trilogy. Those fans ages range from 40-60. Then there are fans that were younger during episodes 1-3. Those fans ages range say 25-40. Nowadays the younger fans are the children and grandchildren of fans that grew up and into adulthood during the first 2 trilogy's. So one of the reasons for these record setting box-office draws is the generation spanning entertainment value of the franchise. How many films can you think of that grandpa\\, dad and junior can attend together and everyone actually enjoy the movie?? There aren't too many. Those previously stated facts have led me to draw the conclusion that each generation are going to have their own very different opinions of the film. That being said\\, my review comes from the perspective of someone that was a child and grew into a teen-ager as the original trilogy was released. Hit my mid-twenties as the second trilogy was released. If you're looking for a review from a person with that perspective? This review is for you.\\n      Long story short\\, \\\"The Last Jedi\\\" was disappointing. Numerous questions left from \\\"The Force Awakens\\\" were left conspicuously unanswered. Other parts of the storyline are awkward\\, choppy and sometimes completely uncalled for. I'm not sure if I'm supposed to be citing examples? I am going to omit what my opinions of examples are. A spoiler free review seems far more prudent in my opinion. The storyline was good\\, not great. My expectations were very high after the hype the film received. The main characters stories were interesting and engaging. Although slightly confusing at points. Mark Hammill gave a fantastic performance but Luke Skywalker's character arc was not one original trilogy fans hoped for. Carrie Fisher delivered a great performance as has come to be expected. Her character arc was another curious choice by Rian Johnson. Adam Driver was good as well. Although I never really liked the whole \\\"Emo Vader\\\" thing. There were other curious choices in my opinion. Film is subjective so I'll leave the viewer come to their own conclusions.\\n     In conclusion I'll say \\\"The Last Jedi\\\" is a movie worth attending. Although I understand the whole concept of moving on from the original trilogy. I don't have to like it. Especially if I feel as though the heroes of my childhood are being ceremoniously and unceremoniously killed off. \\\"The Force Awakens\\\" was essentially the same storyline as \\\"A New Hope\\\" and I loved it! I probably shouldn't have? But I did. \\\"The Last Jedi\\\" separates itself too much from the original trilogy for my liking. That being said it's still a really good movie. You'll certainly have an opinion about it. Depending on your age.","true":true}