{"94533":"94034","UD":"UD","2015-09-30":"2020-01-06","8":7.0,"História espetacular\\, ótimos gráficos\\, porém a movimentação dos personagens não é boa e o jogo é totalmente linear. Apesar dos problemas é um grande jogo.":"Two games for the price of one... that's both a good and bad sign. The gameplayis like watching a so-so quality Netflix horror-drama -combined with Telltale-like button prompts. It's fun\\, and you'll enjoy reaching the end\\, but there's some frustrations that will have you ready to throw away the controller along the way. A lot of praise has gone towards the 'cinematics' and the characterTwo games for the price of one... that's both a good and bad sign. The gameplayis like watching a so-so quality Netflix horror-drama -combined with Telltale-like button prompts. It's fun\\, and you'll enjoy reaching the end\\, but there's some frustrations that will have you ready to throw away the controller along the way. A lot of praise has gone towards the 'cinematics' and the character design... but I'd have chewed off my left arm for the ability to actually run around the game rather than shamble\\, zombie like\\, throughout the environment. Given the 'fear factor' of the story (especially the 2nd half) the almost leisurely pace of movement I found very immersion-breaking. The acting (from 'REAL' actors is a mixed bag... I found Rami Malik's character work particularly annoying (and surprisingly 'b grade') towards the end\\, and was really wanting to kill him off - no matter the cost. The one thing that annoys me however in these types of games is when you are given the choice where the outcome could not have been anticipated... 1 + 1 = 0. Randomness is fun when you can correct for it - not when it's in a turn-based experience with no repeats (other than starting the level again). It means you don't feel like the outcomes are earned - or deserved. Overall... very simple... enjoyable enough... but perhaps best played drunk with friends.… Expand","true":true}