{"101487":136300,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Imagine that you’ve waited twenty years for the return of your childhood hero. You finally get a guarantee that he will return (the ending of The Force Awakens). So you wait another two years to see how he reacts to being asked to answer the call one last time. When the moment finally comes - the moment you’ve been waiting for for over twenty years - the movie turns that moment into a joke by having him toss his weapon over his shoulder. Now you may begin to understand the frustration so many of us have. We’re not being trolls. It’s our childhood that Disney has essentially thrown out the window. It’s a metaphor for the entire movie. And that theme is heavily hammered home throughout the movie (“let the past die\\, kill it if you have to”) It’s essentially telling us that our stories don’t matter; that Star Wars isn’t for us anymore. And I get that this is for a new generation\\, but you can still make a Star Wars movie that appeals to all generations and doesn’t slap us in the face just for being loyal fans. The Luke in this movie is not who we know him to be. The man who turned himself in because he thought he could save the most evil man in the galaxy is going to try to kill his pupil as soon as he feels the same pull to the dark side he felt at the beginning of his training? This is supposed to be the same man who ended his Jedi training early because he knew his friends were in trouble? The Luke I know would have left exile the moment he heard about Han’s death. And to top it all off\\, we get a Shyamalan twist ending with Luke where he wasn’t really in the most important battle at all. That’s the biggest sin for me. There are other issues with the film (pointless Finn plot\\, nixing everything that was setup in The Force Awakens\\, jokes at inappropriate moments)\\, as well as some really good moments (Rey’s and Kylo’s storyline\/fight). However\\, those moments don’t nearly make up for the biggest sin of all: turning our childhood hero into a failed child killer who abandons his friends at the first sign of trouble.","true":true}