{"101487":115150,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Despite Force Awakens being recycled storylines\\, I enjoyed it. I really liked Rogue One too. But Last Jedi? I went in thinking there was no way it was going to be as remotely bad as everybody was saying. I was determined that I was going to enjoy it because for nothing else\\, it's Star Wars! Boy was I WRONG. It's so bad I have no idea where to start. It's like they decided to take everything good about Star Wars (and espeically Force Awakens) and destroy it for no reason. Two years of exciting speculation of who Snoke is... and well\\, he's just Snoke. Heck\\, I would have even liked the improbable \\\"Snoke is Mace Windu\\\" theory. But nope\\, Snoke was Snoke. Why was he so scarred? Why was he so powerful? Who trained him? WHO KNOWS! And it doesn't matter because Snoke was just Snoke and he's dead. Oh\\, but did he die in an amazing lightsaber battle with Luke\\, Rey or even Kylo? Nope. Just dead (although I will admit Kylo tricking him and killing him like that was kind of good). But what a wasted opportunity. And who is Rey? Was she Luke's daughter? Kylo's neice? Some daughter of a lost Jedi lineage? Why is she so powerful? WHO KNOWS! She's just Rey. Parents were nobodies. Oh\\, but certainly she had some cool Jedi training ala Luke and Yoda! NOPE. She's just a super powerful Jedi who for some reason needs no training. Okay\\, okay\\, but CERTAINLY Luke has some awesome moments! NOPE. He just broods on his mountain lamenting his past. At the end of the movie\\, when I thought all hope for this storyline was lost\\, and Luke comes out of the cave to face down all those lined up AT-ATs and Kylo's shuttle\\, I was certain that\\, \\\"Oh man\\, Luke is totally gonna bring it! He's going to use the force and knock those AT-AT's over like dominoes!!!\\\" NOPE. He just stands there. Why? Because he's not even really there!! Doesn't even have a cool lightsaber battle with Kylo. And then\\, after Kylo \\\"kills\\\" Luke's ghost\\, well\\, Luke is back on his mountain and just kind of dies. Wow. Just wow. Okay\\, but certainly Finn had some cool moments\\, right?? I mean\\, why could he wield a lightsaber? Is Finn a Jedi's son? Is he Lando's son?? NOPE. Finn is just Finn. Oh\\, but he meets Rose\\, a character with no development who means nothing to the story\\, and they go off to find a computer hacker which in he end means nothing because none of it matters to the story. But he does face down Phasma.... but not in some cool battle. Nope\\, she has about 2 minutes of screen time and just falls to her death. Oh\\, but you think then certainly Poe Dameron\\, the hero of the first movie must have some sort of cool role\\, right?!! NOPE. in fact\\, much of the movie is spent berrating him as some trigger happy bravado pilot because his plans all suck and kill practically the entire Rebellion. In fact\\, in the end\\, the Rebellion is left with about 10 people left alive. So much for the Rebels! GAWD did i HATE that movie. No cool lightsaber battles\\, no cool X-Wing vs. TIE battles. More than half the movie was just wasted storyline that didn't even need to be in the movie. Well\\, I've ranted enough. I could go on for another 15-minutes and wouldn't even be able to touch just how bad and dumb this movie was.","true":true}