{"101487":159152,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"OK\\, so I'm going to see this film again\\, for the record.  \\n\\nI say that up front because I felt very split after seeing it the first time.  I absolutely agree with many critics who praise Last Jedi for its bold choices.  Many of these twists helped to set a tone for some new and fresh to come and expanded upon the lore with gravitas and finesse.  However\\, in addition to several questionable plot points and a completely unnecessary storyline\\, Last Jedi suffers from some incredibly weak writing.\\n\\nThere were so many points when flat jokes and static dialogue had me squirming in my seat.  I feel like this new Star Wars trilogy calls into the same trap as so many other franchise films.  In an effort to draw audiences in by giving us what they think we want in various trailers and publicity\\, Hollywood these days has almost completely failed to see the importance of taking the time to find quality writers.  No offense to the team of Last Jedi...but ground your characters with dialogue that truly fits them rather than catering the dialogue to fit the plot.  Propelling the plot forward is necessary\\, but not at the expense of well-crafted characters.  There were so many moments tonight when I wanted to connect with these new characters\\, but all of it felt forced because the dialogue was so cheesy\\, and thus lost all authenticity.  \\n\\nI would recommend going to see this film because it will definitely surprise you.  At first...I was really nervous that they were trying to make Star Wars into something it's not.  Good vs evil is important to this story\\, and messing with that too much can make a story lose it's stakes.  However\\, I ended up enjoying the doubts and the questions and the conflict strewn throughout much more than I thought I would.\\n\\nOverall: 3.75\/5","true":true}