{"101487":193227,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"WARNING: I apologize for the grammatical errors im sure exists in this review it is lengthy and im no great author also SPOILERS AHEAD.To start i created an account to write this review and ill admit im a passionate Star Wars fan who has been spent many days with the extended canon and universe. But im going to put that aside to just examine the merits of this film as a film and ill include the Star Wars universe stuff in a paragraph of its own. Warning this will be a long review so if your gonna read this all the way buckle up cause this is gonna be longer than an apology from a dad who wasn't their for their kid who has know grown up and hes trying to renter their life.  \\n\\nCinematography 4\/5: Ill start with how the movie was shot and honestly this is the best part of the film. It has stunning locations both created and real and it is very well shot. This is the movie greatest strength by far. The scenes are crisp and space fights dont blur or become unwatchable the editing is well done and coherent. So well done here team.\\n\\nMusical Score 2.5\/5: This i put right in the middle not because it is terrible per say but that it is unremarkable in literally every way. The Star Wars franchise is known for brilliant orchestral scores with the main theme and duel of the fates being instant classics. Here its not that the music is bad but its just so boring and uneventful nothing in this soundtrack sticks or is even worth listening again and that is sad for a franchise with such a great history for film music. None of the music adds to the scenes either it doesn't raise the stacks for fight sides or make us sad for sad scenes it is utterly useless and that is inexcusable for these films.\\n\\nActing 2\/5: Now we start to get to the really just awful things about this film starting with the acting. Ill start with at least the good stuff or passable stuff. Ill give good grades for Poe\\, Snoke\\, and Rey for acting (Remember this is acting not there actual stories which will be covered dont you worry). All of these actors and actresses give more than passable performances. Poe retains the rough around edges playboy throughout film fairly well. Rey is what you would expect and well acted but Snoke by far i enjoyed seeing on screen even for how short it was. He was able to display a menacing presence even seeing him clearly wounded and not at hundred percent. Its sad that he was a CGI character with voice acting only and it is also sad that im saying the best performance on screen was by a computer and not a person but alas that is where we find ourselves. For everyone else its just sub-par at best unfortunately. The acting is unbeliavble or unemotional.The tone in many scenes is just awful and it seems at point that not even the actors or actresses knew exactly where they wanted to go with the scene. There are pints in the film where characters are displaying one emotion and the other either fail to match or just misses it entirely with a bad line of dialogue. The acting on a whole not terrible but not great by any stretch.\\n\\nStory 0.5\/5: And now to the reason why i will make the cardinal sin nd say that this film is the worst Star Wars film ever made. Yes\\, even worse the Jar-Jar and MTV Anakin and Padme love story. The story of this film IS ONE OF THE WORST IVE EVER SEEN FOR A MAJOR BUDGET FILM. This is a Sharknado worthy script and story. Star Wars's greatest strength was its story-telling the near endless possibilities one could take with subtle name drops to people\\, places\\, and events that have happened that opened whole new worlds of story telling. And while The Force Awakens isn't the best film by any stretch it opened endless possibilities for story telling with some very good questions to answer like Reys lineage? Who is Snoke? Who are the Knights of Ren? The history of the First Order and the New Republic? All those things to explore you ere actually excited to get the answers to these questions. \\nThis plot has so many holes it difficult to figure out which ones to spend the most time on so ill just tackle more of the glaring ones.\\n\\nGalactic Conquest: So in the beginning crawl we learn that in the span of a few week the First Order has literally conquered the WHOLE GALAXY\\, in a few weeks something the Empire couldn't in TWENTY YEARS is done in a few weeks with less ships\\, men\\, and Sith i guess.  \\n\\nThe OJ Slow Speed Space Chase: This is the entire main plot of the film by the way. Its the remnants of the Resistance fleet leading a First Order fleet on a OJ Simpson LA Freeway style slow speed chase through space. Can the First Order send a ship ahead of them to cut them off? Nope. Can they call in ships from other parts of the Galaxy that they just conquered to assist? Nope. Can they just launch all the fighters since they Resistance doesn't have any and they are low on fuel and cant really  get away? Nope. You get to watch this bullshit for the next borderline hour an half as the only solution is to literally follow through space apparently.\\n\\nBut that Training though: So Luke and Rey together is pretty awful. So that wonderful deep knowledge of the force the Luke has gained through years of studying and meditation apparently can be summed up in two philosophical lessons from Luke aaaaannnnndddd that it. Train some force powers? Nope. Train in light saber combat? Nope. Reveal some past history about the Galactic Civil War and maybe some interesting new interpretations of history? Nope. Nothing\\, we get two Facebook community college\\, philosophy 101\\, self introspective ideas that would best be placed over the top of some dumbass wolf picture. But dont worry even without formal training Rey still be able to do cool force stuff and duel with literally anyone because the plot demands it. \\n\\nAlmost anything set-up from the previous Film: Here a list of things that dont even get explored\\, touched or are just lazy terrible writing: Knights of Ren. Anything about Snoke or Phasma. Rey's Linage\\, explained but its just terrible shit writing. The further training of Kylo promised at the end of TFA dont get that either. What actually happened the night The Knights of Ren destroyed the Academy? How Maz got a hold of Luke's old Light saber? No real answers really to any of these things im sure there is more.\\n\\nTHE CASINO PLANET: This is by far the most useless thing about this film. What is the point of this quest besides social commentary on the current real world. I mean cant enjoy a movie if im not reminded that rich people are awful and only do bad terrible things and you should hate them\\, right. Animal cruelty is bad but i guess child slavery is okay because Rose and Finn rescue the space horses but leave the SLAVE CHILDREN BEHIND so that's good\\, i guess.\\n\\nThere is alot more i just cant get into more of this without literally pulling a Robin Williams and finding the nearest door frame so read other comments to get the ones i missed. Bottom line its the worst plot put o a Star Wars film ever and the main reason why its the worst Star Wars film ever made up until this date.\\n\\nStar Wars Canon: Whats that? Never heard of it were Disney remember? This is for Star Wars fans and i really dont need to explain the ways this Film destroys the mechanics and lore of the Star Wars universe we all know so in short it breaks most of it. \\n\\nCharacters 1\/5: This relates to character arcs and new characters. Besides Poe and a little Rey everyone either doesn't have a story line or its is recklessly stupid such as purple haired admiral who puts everyone's life's at risk to teach a lesson to Poe about following orders. Snoke and Phasma are two totally wasted characters that would have heed the movie greatly. Luke's character is destroyed beyond all recognition. Kylo continues his epic tryout to be the new front man of My Chemical Romance. Leia is ALIVE even though Carrie Fischer is DEAD setting up needless conflict for the next film. Rose is one of the most useless characters ever put onto film with no real purpose besides being a forced love interest for Finn. Chewie is not in the film except for comic relief. Finn ha potential to have  good arc with his death at the end of the film to save everyone else finally choosing to sacrifice himself for the greater good of others but instead that gets ruined by Rose over some philosophical nonsense which literally doesn't make any sense             .\\nOn a whole this film is by far the worst film in the Star Wars franchise. As a film without the Star Wars label it suffers from a horrendous story line with significant plot holes\\, awful writing\\, and uninterested performances. As a Star Wars film it breaks canon and destroys the entire foundation of the second trilogy. Its alright to be edgy with the first film of the franchise as long as you build on it in the other films. You cannot destroy your foundation in the second of a three part series because know nothing matters and you've have destroyed all emotional build up and excitement for the stories the first film set up. This film manages to destroy all of those moments we were looking for as a casual move viewer and is a giant middle finger to the Star Wars fan base. I can truly say ive also never seen a fan base treated as poorly as the Star Wars fan base has been in regards to these movies. Instead of taken these criticisms and learning from them Disney and the directors instead are doubling down on how the awesome the film was and it was just a conspiracy by the Alt-Right to sink this film. Read these comments and you will see that is not true this film was just awful by almost every measure. \\n\\nAnd with that i will bid you all a fine farewell\\, I wish you well after this experience and hope your day drinking goes well.","true":true}