{"101487":161752,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"People are disappointed about the reveal of Rey's parents. Did we really get a reveal on Rey's parents? We only have what she saw in the dark side cave and what Kylo Ren told her. Neither of those is a very reliable source. Kylo could have just said that to keep her off balance. He's been trying to manipulate her since he met her. How would he even know who they are?\\n\\nPeople are upset with how Luke is portrayed. I don't think these people caught some of the subtleties in his actions. Some of it was genuine reluctance\\, but some of it was pushing Rey to think for herself and figure out what's important and what isn't. He asked who she was and it could have been interpreted as though he literally had no idea who this girl is\\, but it also could have been interpreted as him getting her to figure this out about herself. There was quite a bit of Yoda on Dagobah in his method just without as much eccentricity.\\n\\nThis movie was very much about what we've been taught off and on throughout the 1st two trilogies: \\\"many of the truths we cling to depend greatly on our own point of view\\\". Kylo's version of Luke's attempt to kill him vs Luke's version of what happened is just one example of this.\\n\\nLuke spends so much of this movie telling us and Rey that if we are expecting certain things\\, that we are going to be disappointed and we're all like\\, \\\"Nah\\, it's going to be fine. It always works out in the end\\\" and then it didn't and now we're pissed.  \\n\\nI'll admit that I was angry at first about Luke's ending\\, but I've gotten over it with a few days to grieve.  It was almost like losing a family member.  That said\\, what he did was very Jedi of him.  He made 100's - 1000's of First Order troops and Kylo Ren believe that he was there fighting them and resisting countless shots and coming out unscathed and he did from millions of miles away. It took a great amount of power\\, control\\, and ability to do.  Ultimately\\, he sacrificed himself for the greater good.","true":true}