{"101487":118453,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Episode 8 The Copout Unleashed\\n\\nJJ laid out some fine ingredients for dinner and Rian Johnson just burnt the shit out of every one of them because ya know he's sooOOooo edgy maan.\\n\\nI know we humans are meaning making machines even when there is very little meaning to be made but really I have to admit I think I watched a hyperextended trailer that basically cut off any reason why I would want to find out what will happen next to our new Star Wars characters and why... Exposition times infinity. I don't even know where to begin explaining especially when so many others here read my mind. \\n\\nI really don't care who trashes me in the comment section\\, your entitled to your opinion. It really doesn't matter what was expected to be a great middle act by those who agree because apparently we have NO effect whatsoever on the future of this new trilogy... Character development? Screw it they said. Building an attachment to the story and it's heroes and villains? Not necessary they said. Plot holes within plot holes? Bring it they said! As long as we keep filling this story with loose ends and meaningless mystery it'll be edgy man! \\n.............................................................................................................Great........................................................................................................................................................Screw expectations to put in any effort or giving a worthy attempt to answer questions that should be answered after the 4 hours and 58 minutes into a trilogy...\\n\\nI will say I'm really concerned at how all the main Star Wars YouTube channels and sites have been \\\" seemingly \\\" hanging on a cliff trying to find substance in their reviews or maybe trying to turn the other cheek to put their fan boy blinders on what I think a lot of us are agreeing was just a filler cash grab cop out to what would've been a great chance.","true":true}