{"101487":198606,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star wars movie ever.\\nToo many plot holes.\\nToo many jokes. (Note that this is not a Marvel movie\\, this is Star Wars!)\\nEven Hamill himself hated what Rian Johnson made to Luke.\\nI love the mystery behind Snoke and Rey on TFA\\, but Rian just f*cking throw away every set up made by JJ on TFA.\\nThe Finn and Rose filler scenes were out of place. It should be deleted forever. I have lost every interest on Finn's character.\\nRey should \\\"at least be the daughter of a new legendary character(s)\\\" to at least explain her overpowered force and combat ability. I will even eat it up if Rey is like Anakin\/Vader.\\n\\\"Please revive SNOKE on Episode IX.\\\"\\nLuke is a piece of  trash in this movie. Hamill is right\\, this is not his Luke.\\nThe prequel trilogy are even decent than this movie.\\nGet rid of Hux. He's useless. Kylo should force choke him.\\nWe need a Vader-like villain\\, not a crybaby-emo-child. I would even prefer Darth Maul than Kylo. \\nHave more light-saber battles and less spaceship battles on Episode IX.\\nInsert a new group other than the First Order and the Resistance.\\nGet rid of Finn\\, or\\, make him a long battle scene against Captain Phasma. \\nGet rid of rose.\\nRedeem Luke.\\n\\nDo not give any Star Wars Movie or Trilogy to Rian Johnson. Kick him out of this franchise.\\n\\nand\\, MAKE A \\\"DARTH VADER SOLO MOVIE\\\"\\, AND GEORGE LUCAS TO DIRECT OR BE THE STORY ADVISOR. or make the director of rogue one to direct it.\\n\\n2\/10 (full movie rating)\\n(2 points for the Kylo\/Rey tag team battle against Snoke's Praetorian Guard)","true":true}