{"101487":141724,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It is unreal they could get away with this.\\n\\nMost of you don't get it. I was 11 when I saw the original Star Wars. Back then we had no cell phones or even VCR's. We had to wait for repeats on TV to see something again. The 6 million dollar man captured my mind for those of you that remember that show. So way way back then I saw Star Wars. Luke and Obi was integrated into my imagination. That was 1977. ESB and RTJ over 8 years was unreal.\\n\\nI am not good enough with writing skills to put a note here on bad this movie is. On every level I felt betrayed. I was stunned when I walked out of the theater. I so wish I did not see this movie so that I could have held onto my dreams as a child. \\n\\nWhat a complete slaughter of the franchise. Other reviews say it better than I can. \\n\\nLuke was so bad in the film not sure what to do with it. Force projection bs. He looked and acted like a homeless person in downtown LA. \\n\\nLeia floating in space.. Please people just kill her or accidentally lose her somewhere...  Why would you have her float through space ? Perhaps DC should put her in the next Justice League since she can fly in space.\\n\\nPoe wow take what should have been a mans man in Han and make he a total wimp\\n\\nSnoke - Why even bother\\n\\nRea - Please people this chick never earned the right to be a Jedi. Millennial bs. Everyone gets a trophy.\\n\\nLuke was suppose to bring balance. \\n\\n\\nAt 52 I am a grown man and realize a few things at my age. There is no real god. At least not on earth and never has been. Falling in love is for 15-25 year olds and our repressive government continues to grow every day as our freedoms shrink. \\n\\nI am in a mild depression about this but I will get over it. I will no longer see anymore SW movies. I am going to recreate in my mind what the movie should have been. It all I can do.\\n\\n\\nWhat a mess. No charm\\, No reason to see a 9th movie.","true":true}