{"101487":131973,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If I could give it zero I would. legacy fans where put on the chopping block in the name of welcoming new fans into the fold\\, which Disney failed to do in a big way. see all the Asian girl action figures at your local toy store... the entire movie was preachy to the point that I felt Hollywood is completely disconnected with half of America\\, if not more. let's be honest: they are trying to cater to a minority population of less than 1% most people still want strong heroes with high values or a conflict that they learn from (Think the original series episodes 4\\, 5\\, 6). the message of this movie is that no one is special\\, yet everyone is... the plot has more holes than swiss and the dialog is that of a 90's nickelodeon cartoon. this film has ended careers and killed an amazing franchise. everything that was set up in the force awakens was literally thrown out and characters openly mock that while saying history of the storyline doesn't;t matter.  \\n\\nI tried hard to find a redeeming quality in this film the only one was the scene with snoke's ship being cut in half via a selfless attack by a useless character\\, which this film abounds in. ruin (rian) Johnson can't even take the heat and to this day defends his film. Disney should be firing both him and Kathleen Kennedy\\, but as Hamill said\\, \\\"It doesn't have to be good\\, it just has to make money.\\\" the PC message of Hollywood has killed many a movie\\, until they stop catering to less than 1% of the population\\, legacy movies will continue to fail.\\n\\nTHIS IS NOT A BOT REVIEW lol sad that even has to be said.","true":true}