{"101487":182955,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the first time I've ever been compelled to write a movie review. First of all\\, I want to address the bantha in the room: How the hell did this movie receive a \\\"Certified Fresh\\\" rating over 90%?!!! Before I write why I hate this movie with every fibre of my being\\, I want to Rotten Tomatoes to grow a pair of fresh tomatoes and give this abomination a more accurate assessment and stop misleading people so Disney can set a new record for movie profits. Like many who's imagination was captured and defined as a child by Star Wars I was anxiously awaiting the return of Luke Skywalker in the Force Awakens. When I learned that I would actually have to wait two more years for the character that embodies everything that was awesome about the saga\\, I sat on my hands and bided my time in the hopes that someone with vision and wisdom would takeover  the helm. After all\\, in our age of social media\\, it should have been pretty easy to determine what true fans wanted. Instead\\, we got an incoherent half-comedy unnecessarily teeming with social commentary and ridiculous plot holes. In my opinion\\, Star Wars is irreparably damaged and no new director will be able to salvage it in Episode IX (which I have no interest in seeing)\\, While the  true consensus on this movie is being stifled to make sure it makes enough money in the box office\\, this movie will go down in history as the movie that retroactively crushed the dreams of millions of children. It is time for Star Wars to end.","true":true}