{"101487":127999,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Honestly\\, this movie felt like a fanfiction..\\n\\nThings I didn't like:\\n- Luke. why the heck was he acting like that.\\n\\n- Snoke. supposedly an allmighty villain with crazy powers\\, killed off in the second movie when we've barely seen what he can do. Question of \\\"who is snoke\\\" is answered poorly. literally not even answered. Snoke is snoke. no back story. hes just some evil dude that randomly wanted to take over i guess.\\n- Finn and Rose. Absolutely pointless\\, like their role in the movie just didnt even matter. probably could cut it all out and the movie would be better lol. only thing that was cool was the thief dude and his betrayal. the only twist i actually enjoyed and offered something to the story.\\n\\n- Leia. Apparently she can fly. and not die in space. Carrie Fischer is dead (rip)\\, why would you keep her around? what are you going to do in the next movie??\\n\\n- Admiral Holdo. wtf was the point of not telling the plan to the crew? why make everyone uneasy and scared for their lives and make it seem like you don't know whats going on? Poe almost launched a coup and ruined your plans! why would you risk that? it makes no sense!!\\n\\n-Rey. I hate how she can FaceTime Kylo Ren. Everyone's like \\\"oh\\, they must be related somehow.\\\" Nope\\, apparently she's a nobody thats just rlly good at using the force. Apparently\\, jedi are trained from when they're toddlers but Rey can use a lightsaber and use the force after literally no training. Also\\, her parents are nobodies. Like what? Daisy Ridley literally said that the question of who Rey's parents are was pretty clear after the Force awakens but was surprised when she saw that nobody actually knew the identity of her parents. Well. Did the force awakens ever suggest that her parents are nobodies? no. so wtf. i guess kylo was lying. who knows.\\n\\n-tracking through lightspeed. how? it was literally never explained. it just happened somehow.\\n\\n-Luke's hollogram. Ok. How did kylo not know it wasn't him?? Luke was holding and using the lightsaber he LITERALLY DESTROYED MINUTES EARLIER WHEN HE WAS WITH REY. HOW. DOES. THAT. WORK?\\n\\nPositives:\\nGreat acting by Adam Driver and Mark Hamill.\\nMovie looks great\\, especially the lightspeed destruction scene. \\n\\nOverall: the movie tries to hard to say \\\"oh\\, is this what you were expecting? well you were WRONG! this is what's happening instead!!\\\" it felt super long and after a while\\, i didnt even know if it was worth it to be sitting in that theater for that long. I watched it because it was star wars and now i don't even know if i wanna watch the next one. idk where they go from here. the villain is dead\\, carrie fisher is dead and they said they weren't gonna make her CGI so idk how shes gonna be in the next film\\, theres like 20 resistance members left\\, rey's parents are no one. there are no questions left for the next movie so its nearly impossible to be excited for it. honestly\\, Rian Johnson rlly fucked over JJ Abrams here because its literally impossible to continue this trilogy at this point. RIP star wars.","true":true}