{"101487":192688,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Very well done exploration of these characters. I'm not a huge Star Wars fan\\, mostly felt it was kid fodder and these newer entries into the series are trying to bridge the gap between satisfying the older generation while bringing a newer one into the story (both in terms of the characters and the audience watching). \\n\\nIt was cinematically an improvement over The Force Awakens\\, with beautiful imagery and solid storytelling. As with The Force Awakens (which was little more than a retelling of A New Hope)\\, The Last Jedi seems to delve back to the original series (here with Empire Strikes Back) a little too frequently. \\n\\nKylo Ren is the most interesting character here\\, and Adam Driver delves into his torn allegiances very well. Luke Skywalker's return hints to a lifetime of seeing things he can't shake\\, but the character has advanced 30 years and this is the best work Mark Hamill has done with the character. I missed the presence of Harrison Ford and his banter with Carrie Fisher\\, who is great as usual\\, but also casts a melancholy over the film. I don't know what the producers will do with her character now.\\n\\nSome plot holes and annoying scientific realities can mute the impact of certain scenes\\, but this is ultimately fantasy and suspension of disbelief comes in handy here. \\n\\nAll in all\\, it was very well done. Will it stand the test of time? Who can say. It doesn't have the impact of the originals which brought things to the screen people hadn't seen before\\, and now we've seen pretty much everything.","true":true}