{"101487":131330,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't want to spoil this for people who haven't seen it so without getting into specifics\\, I simply do not get the radiant reviews from professional critics. This film is so obviously flawed both in plot structure and writing quality. As far as I can tell\\, the purpose of this latest installment is to firmly let you know that Disney intends to burn to the ground a good deal of the structure that Lucas built before and (at least in this movie) is trying to reinterpret the Star Wars myth in ways that not only undermine the spiritual core foundation of the universe but also kicks sand in the face of Lucas's original vision for his characters and their legacy. Some people will be ok with that\\, others will not (of which I am one.)  But even without that\\, this is a mediocre movie\\, at best.. I wanted to like this film...I really did. But I can't. I wish George had not sold  the franchise. Maybe the prequels had serious problems but they were created with the intent to illuminate the motivations of his characters and add solidity. This latest installment seems to be about cashing in and setting up an entirely new 'thing' ....and ultimately\\, making as much money as possible for as long as possible. I'm sure a lot of people worked hard on this film and there are positive things to commend their efforts. I'm equally sure many people will find this film a satisfying entry and that's fine. But for me personally\\, this film seems more like bizarre fan fiction than Star Wars. It feels manipulative and forced\\, relying on emotionally charged scenes and images to carry it forward rather than well thought out narrative. It lacks logic and asks me to go along with whatever plot decide is thrown at me without question\\, which I can't do. The over the top positive reviews from critics have me stymied. I'm sure many people will have a different take than my own and that's certainly ok...but if this is the future of Star Wars I can honestly say it's one I will probably skip out on.","true":true}