{"101487":136223,"Last Jedi":"Last Jedi","2017-12-15":"2019-02-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I made an account just to rate this movie. I have always been a Star Wars fan but this movie was impossible to like. The moment Leia flew in space after being literally blown out of her ship I knew the film was in trouble. I hoped that things would get better but they didnï¿ 1\/2(TM)t. This film brought about the overuse of the term ï¿ 1\/2toxic masculinityï¿ 1\/2Â? by trying (and in my opinion failing) to demonize Poe. This was brought about because the new Rebel commander and Leia refused to keep him in the know after demoting him (which was also dumb). So Poe is running around the whole movie trying to save the Resistance because there is no clear plan from anyone else. Of course his desire to help is portrayed as reckless. If he had just been informed then the movie wouldnï¿ 1\/2(TM)t have happened because all the side plots would not have existed (the casino planet\\, also forgettable).\\n\\nRey...I understand that she is supposed to be the best thing since ever but she seems to stumble upon her amazing abilities with the force rather than having any proper training\\, if you recall how long it took Luke to raise that x-wing out of the swamp\\, she is able to move MASSIVE rocks with a look like ï¿ 1\/2hmmm what if I just move these with my mind\\, never done it before but Iï¿ 1\/2(TM)ll give it a goï¿ 1\/2Â? \\n\\nFinn should be dead and Lukeï¿ 1\/2(TM)s Legacy was demolished In a way that doesnï¿ 1\/2(TM)t fit his background at all. Youï¿ 1\/2(TM)re telling me that Luke\\, the guy that couldnï¿ 1\/2(TM)t kill his father after he tried killing him multiple times\\, just loses his mind after he sees a possible future and is now going to murder his nephew....NO just no. This movie ruined my expectations for Star Wars moving forward.","true":true}