{"101487":167572,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So bad so sad...\\n\\nIt was all said before so i will just skim:\\n1- Bombs in space.\\n2- Hyperspace kamikaze move that basiclly negates any reason to build big warships in star wars univers since they can be hyper rammed\\n3- Rey who can beat everyone Luke included without any training\\,\\n4- Yoda as force ghost bringing lighting.The old geezer must have been napping in all the battle times when his side could really use some lightinings.\\n5- Destoying  Luke Skywalker character\\n6 - Im normally far from SJW conspiracy theories\\, but here it was so blatant it smacked you in the face. Wise\\, heroic women and silly men.\\n7- The whole Empire ships pursuing Rebel ships in normal space and cant catch up.. What was that? So this huge empire fleet had not enough fighters\/bombers to oblitarate the rebels?\\nIt had no smaller escort ships to catch up?\\n9- The weird childish humour...\\n10- Snoke i barely knew you and you are already out..:). Seriously the super powerful evil mastermind killed that way?\\nthe list could go on and on...\\n\\nBasically there was a quote in the moive which said something like \\\"To build a new world you have to burn the old one\\\". I felt like it was what Rian And Kennedy vision for this movie:\\nDestroy all the symbols and continuity of the old serie so they can stuff their silliness.\\n\\nOh and also to  all poeple saying \\\" the old 30-40 years fan should stop  crtisising this is new Star Wars\\\".\\nWell done\\, mission partly accomplished in my case\\, im done with New Star Wars\\, Im not going to the next one.","true":true}