{"101487":139435,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I remember walking out of the theater of this move and thinking it was good but sad because SPOILERS Luke's death. While driving home I started to realize it had some flaws but still okay. By the time I got home I realized it had to many plot holes and flaws and started to hate it. So in the span of 20 minutes I went from liking it\\, to hating it. It took much longer for that to happen for me with the prequels. Before someone ask or thinks NO my expectations were not too high. I saw the movie a month or something after the movie. The advertisement didn't pull me in like before and planing it around friends and family schedules meant that the hype and expectations for this movie for me where very low. \\n\\nThis movie has some major flaws with its story and bad jokes. WORST of all is its treatment of Luke. Who in my eyes is the heart and soul of star wars. Without him its empty\\, void of the hope that star wars had. He does so many things outside of his character that you don't even recognize him! The story of Luke is the story of adulthood from a teenager stuck on a farm\\, too a grown adult. Rey doesn't have that same connection with me she just is a plot device. Everything just comes easy to her. \\n\\nThis movie is the complete opposite of a star wars film. Filled with nihilistic and on the nose politics\\, which bores and eye rolls the audience. Speaking of eye rolls there are so many scenes that make you eye roll with the amount of lack of logic. So many scenes with the new characters like rose who is just dumb and make her feel unnecessary for her to be there. The vice admiral holdo is the worse! So many things could have been avoided if she just tells poe her plan instead of acting all high and mighty. I also would have liked to Akbar to have replaced her would have been a better scene with the kamikaze scene. Both Snoke and Phasma have no reason to exist they offer nothing to the story. The gamble world was dumb and felt like filler.Which I think the most advat fan of this movie doesn't like that plot. PORGS\\, WHY DO WE HAVE PORGS!\\n\\nI'm still only scratching the surface of some major flaws but what are some good things? Well there isn't a lot for me. The effects and the action are very good worth the millions they spent of this movie.Kylo Ren character is that badly done in this one added some good layers. Throne room battle was really well done. Uh and um that's about it for me for positive things.....\\n\\nIf your you turn your brain off or your a new fan \\\"aka a kid\\\" You might like this movie for its effects and action. If your old time fan that watch the older movie since you where a little kid you probably not going to like it. The motto of this movie is \\\"Let the past die\\, Kill it if you have to\\\". They definitely lived up too that\\, probably going to be the only star wars movie i'll never buy. \\n\\nWell that's it\\, hope you got the message","true":true}