{"101487":117846,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"El comienza de la película esta bien. Luego vienen los chistesitos malos ponen muy mal al General Hux. La película se convierte en una pesadilla debido a que es demasiado larga y posee demasiado relleno casi una hora de relleno(Arco argumental de Finn\\, Rose y el Code Breaker) Cosa que provoca la casi total extinción de los rebeldes de casi 4000 mil rebeldes terminan sobreviviendo menos de 45.\\n\\nLa Princesa Leia se convierte en superman solo con esto se los digo todo. Luke Skywalker vaya forma de cagarse en el personaje y en el pobre actor Mark Hamill lo han dejado en un personaje cobarde\\, emo\\, negativo y fracasado donde antes era ese Luke capaz de convertir al legendario Darth Vader al lado de la luz. El Legendario Luke Skywalker donde su Credo Jedi era simbolo de esperanza y lleno de un espiritu positivo.\\n\\nSnoke el villano mas desperdiciado de la historia. Pobres y muy pocas peleas entre jedis y siths sobre todo toda la película no hay batalla espaciales ni nada solo una ridícula persecusion que pudo haberse fumado un épico combate como el de Endor en episodio 6.\\n\\nQuedan muchos agujeros argumentales que te cagas del miedo con la frescura que estos directores se pasan por los guevos. Rian Jhonson se cago en este Episodio 8. Donde mas me siento insultado con un trailer que te llenan de un hype e ilusión al final te revienta en la cara. Que Disney pague a la prensa especializada es peor todavía porque todos sabemos que esto es una mierda. Esta películas es otra películas con disfraces de Starwars.","true":false}