{"101487":130376,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I decided to take my time in writing this review because of how I honestly felt about the film. Should I write from the view of a regular movie viewer or should I write it from the view of a long time (35+ yrs) Star Wars fan (movies\\, cartoons\\, novels\\, comics & games). Quick disclosure I both hate and like what Disney has done with the franchise. Disliked TFA and really loved Rogue1. Yet I decided to go open minded when I went to go see TLJ. Here is might thoughts Star Wars the Last Jedi is an ok film but yet it is also the worst Star Wars film ever. While the story line is decent it draws most of its inspiration from the Empire Strikes Back using similar themes and even similar scenery. It’s originality lead by major female characters is both refreshing but also misses the mark by constantly having these characters state how important they are to cause that is never really explained in both the TFA or TLJ. Still I did enjoy their performance and the nuance these characters brought. The battle scenes are better than TFA and the locations are also more diverse with multiple locations and scenery. Yet this is not enough to make a good movie. The Last Jedi primary flaw its it disregard for the legacy that George Lucas built. I’ve heard from other reviewers\\, online sites and critics that the film is good because it’s something new. I would have to disagree. I don’t believe that you have disregard the past to bring something new. Rogue One is a good example of something new that also embraces the past. The story didn’t involve the Skywalker line or Jedi vs Sith. It evolved people without super power taking a stand and inspiring hope. Yet it also honored the past by not altering the original films but embracing them. Vader’s entrance at the end of the film is memorable for reminding fans why they love the Star Wars franchise without taking away from the story being told. Sadly TLJ does do this. This is why; Spoilers below ********************************** Below are some examples of where the film disregards and in some points spits on its SW legacy. 1). Luke almost tried to assassinate Ben: makes no sense that Luke would try to the point of death try to save his dad because of the conflict he felt in him\\, yet as an older man he easily wants to assassinate his nephew. He said it was temporary yet he went to his tent with a saber. 2). Luke hides front the force yet goes to a island associated with it. 3). Yoda is brought back to be a jokester for cheap laughs yet offers no meaning purpose. 4). Snock is suppose to be all knowing yet is easily killed without us knowing much of how he came to power. 5). Luke sacrifices himself for no reason at the end when he could have easily survived. 6). Pasma is brought back for a quick fight. Waste of a character. 7). Rey is powerful for reasons not explained yet their is no development of her character. 8). Del Torros character really should have been there from the beginning. Was just too short. 9). New order somehow can’t jump ahead of the rebel fleet. No micro jumps or call for reinforcement. Made no sense. 10). Worst of all Luke is shown to be weak and to forgo his legacy just because his nephew had bad thoughts. These are just a few examples. Of what made this movie hard to watch. George Lucas original trilogy is a masterpiece. His prequels were too ambitious and he assumed the audience was smarter than they were. Yet even those films where original and gave moviegoers things to marvel at. Yes there was issues with dialog and casting\\, but at least the stories were exiting and original. They also build on the trilogy legacy expanding the franchise. After all if you ask what people like about SW\\, they will bring up something George Lucas created in either the original or prequel trilogies. TFA and TLJ does the opposite. It dumps down the franchise and reuses elements if not the entire story line of the original films. It tries to show its original not with new original stories but by destroying the legacy the films are based on. My hope is that once the next episode is done there will be a new rethinking of the franchise and that they will bring it back to George Lucas original plans for it. ","true":true}