{"101487":169387,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers Ahead\\n\\n\\nThis movie was fantastic and I don't see how anyone would hate this movie which makes me really sad to see it have a score of 57%. I have loved star wars since the beginning of my life and to see one of the best star wars movies being hated upon is really sad. I've been reading a lot of the negative reviews and what I've found is that a lot of the people that hate this movie says Its bad just because It takes all the build from Force Awakens and throws this out the window\\, which is stupid because first off The Force Awakens isn't even that good its just a Disney reskin of A New Hope and these questions that the force awakens build. We should take a look at the question that is \\\"ruined\\\"\\, Who are Rey's parents? Well\\, people are saying that it was a disappointment that we learn that Rey's parents are just nobody\\, when actually we don't know if that is true at all\\, it could have just been Kylo Ren trying to break into her head and turn her. Another question that was ruined by the movie was\\,  Who was Snoke? Now that he's dead everyone is complaining that we won't get to know the answer to that question when in reality we still might get to learn about Snoke in the next movie (which might be bad because J.J. Abrams is making the next one). Also\\, these people say that they killed off the ultimate villain in the movie when how do we know that Kylo Ren might have been the big bad guy the whole time instead of the next Vader. They say there are no twists at all and the movie was very predictable but please tell me that when you walked into the theatre you were thinking to yourself that Snoke is going to die in this movie and Kylo Ren was the one to kill him then help Rey and still be evil at the end when we thought he successfully turned to the light side. Now there is a lot that I would love to talk about but I'm not the best writer so all I want to say to end this off was that This is a movie for folks who want a smart\\, emotional\\, original Star Wars film. Rian Johnson made all the best decisions for the movie and it felt like my Star Wars movie dreams came true.","true":true}