{"101487":178132,"Last Jedi":"Last Jedi","2017-12-15":"2019-11-11","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The ramming of the capital ships was the highlight of the film. Though\\, letting Admiral Ackbar perform this action instead of being unceremonialy  spaced earlier in the film would have given the fans an emotional impact that this flick seriously lacked. \\n\\nLiterally the first Star Wars I've never purchased a copy of (I even own a digital copy of Solo!).  So much could have been fixed in this movie with simple things.. oh Rey...she's been getting trained on that island with Luke (after his initial refusal) for the last 6 months. \\nedit out that whole \\\"your mama\\\" joke at the beginning. \\nthe Poe mutiny... have it authorized as a Plan B\\, in case Holdo's plan didn't work (seriously\\, he's a bloody high ranking member of the resistance and she's a freaking Admiral...his entire plotline makes no sense. He should have been with Finn and Rose on the side mission.)   \\n\\nMy birthday is around Christmas... I always see a big Christmas movie. Last year it was Into the Spider-verse (Miles rocks!!!!) \\n2017 was Last Jedi\\n2016 was Rogue One (awesome!)\\n2015 was The Force Awakens (and I was interested in the story of Rey\\, and was looking forward to learning more about her. I was actually ok with Han getting turfed by Ben. Though I was really confused why Leia was in a deep emotional hug with this perfect stranger that stepped off the Falcon. who does that?!)\\n\\nyou see a trend here??\\n2012-2014 was three hobbit movies (really should've been two...new line you greedy effs)\\n\\nGuess I'll be watching Jumanji this year.. fun...yay","true":true}