{"101487":159065,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"OK. I really don't know where to start\\, from the superman Leia to the addition of Rose to the cast\\, this movie is terrible. It felt like a last minute project put together by someone who barely understood the material. It pains me to say I disliked this movie so much I created an account here for the first time in years of visiting just so I could post this.\\nThings that are missing\/wrong that I think most people would agree with:\\n- How can Rei use the force so easily with no training?\\n- Who are Rei's parents? (for real\\, if its actually people of no importance I'm done)\\n- Who is Snoke?\\n- Where did Kylo get his Kyber Crystal?\\n- Why the addition of Rose to the cast? And why even the kiss at the end with Finn?\\n- Why the weird sexual tension between Kylo and Rei?\\n- What even are Rei's motivations to stay with the resistance?\\n\\nThings I hated:\\n- Superman Leia\\n- Light Speed ship as weapon (why not use the other ships you sacrificed instead??)\\n- Addition of Rose to the cast\\n- Casino Storyline\\n- Shortest fight ever with Captain Phasma\\n- Story started and ended in the same place really\\n- Bad\\, bad jokes.\\n\\nIts basically a dumbed-down version of Star Wars The Empire Strikes Back\\, a glorified remake for the general public. Could've been so much more\\, I even enjoyed the first one. This director is not very talented\\, or maybe he didn't know the material as much as he thought he did. \\n\\nEither way\\, Terrible. 0.5\/5\\, and the 0.5 is for the special effects those were on point.","true":true}