{"101487":129482,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-12","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am going to make my best attempt to break down the film.\\n\\nI think The Last Jedi\\, more so than any other film in the series\\, relies on parallel themes. First the theme of legends and how holding someone or yourself at a high standard only leads to disappointment and failure:\\n\\nKylo with Luke\\nPoe with Holdo\\nRose with Finn\\n\\nOr surpassing you former idol:\\n\\\"We are what they grow beyond\\\" as Yoda said.\\nFinn with Phasma\\nKylo with Snoke\\n\\nThe Luke complaints in my opinion are unrealistic. Do you think a human being is incapable of making a mistake like Luke did? The whole point of the film is that no one\\, even a legend\\, is incapable of mistakes. Someone as great as Obi Wan did with Anakin. Not a huge stretch of the imagination to me.\\n\\nThere have been a lot of complaints about Snoke as well. He gets no more or less a back story than Palpatine in Return of the Jedi. He is a victim of his own arrogance. Kylo\\, who couldn't win a fight with Snoke one on one defeats him the only way he can\\, by exploiting a character flaw. He thought he was so powerful and knew Kylo so well. He underestimated him because Snoke believed his own myth. He closed his eyes and looked into Kylo's mind but couldn't see what was happening right in front of him.\\n\\nPoe was so disappointed and distrusting of Holdo he refused to hear her reasoning before calling her a traitor and committing mutiny because she was famous and he held her to an unrealistic standard.\\n\\nFinn's ambivalence to the cause is reflected through his willingness to run away at the beginning in the escape pod scene. Rose as a result feels betrayed by her \\\"legend\\\" image of \\\"the Finn\\\". The hard truths of the moral ambivalence of Canto Bight and DJ's betrayal lead into Finn's defeat of Phasma and embrace of the name \\\"rebel scum\\\". These the beginnings of his embrace of the rebel cause ending with his willingness to sacrifice his life to save everyone.\\n\\nThe next is destroying the past and moving forward:\\n\\nKylo's mask\\nRey's parents\\nThe Jedi Tree\\nAnakin's Lightsaber\\n\\nKylo destroys his mask to move away from Vader idolotry and become his own person.\\n\\nRey thought her parent's identity would give her meaning or the fans thought being a Skywalker would give her a place in the Saga.\\n\\nThe destruction of the tree is a symbol of the end of the old Jedi order and a move away from the religious aspects of the black and white Jedi vs Sith. As Luke says why should a religion take ownership of something as universal as the force?\\n\\nThe final scene between Kylo and Luke is an act of pacifism. He has no intention of killing Kylo. Like Obi Wan in A New Hope he sacrifices his life against a failed apprentice to save the others and \\\"the last jedi\\\".\\n\\nThe two suns aren't merely a call back but an emotional parrallel. In A New Hope he was a farm boy ready for something greater and now he is a Jedi Master in the same place he was then\\, ready for something greater. \\\"Luminous beings are we. Not this crude matter\\\"\\n\\nI wrote this in a past post but I don't think anyone payed attention. A detail I caught at the beginning of the film is when Rey hands Luke the lightsaber he's wearing white robes. Luke then returns to his hut then puts them up in a box. We do not see him wearing this until near the end. It seems he was ready to die at the beginning of the film and Rey interrupted him.","true":true}