{"101487":119076,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Everything you ever loved about star wars is DEAD! Nothing makes sense. Imagine Dumb and Dumber scenario instead of Harry and Loyd Imagine rebels and empire. Save money and watch The Empire Strikes Back backwards. There are no intelligent people in this overly political agenda pushing movie. I would rather watch the first 3 episodes after drinking 2 gallons of water with no bathroom break than have to watch The last jedi and have my IQ drained. They can build a massive veteran Dreadnought ship that can't predict an attack from one X-Wing?  Luke creates maps to find him but then when they find him he's pissed off and says he doesn't want to be found completely invalidating the entire first movie.  Finn goes on a mission that was completely pointless and served no purpose to the plot line\\, Finn is a waste of a good character\\,  let me guess Disney NEEDS him  so they can sell toys to black families right before Christmas. Give him a purpose and use.. All powerful Snoke  can read people's minds but for some reason he is deaf to the loud rattling lightsaber that he places his right next to him and pulls a darth maul. Luke  is too lazy to travel to the planet to actually have an epic conclusion  and dies because he's tired.  SW fans watch it but dont expect much.  I would expect more intelligence and calculation from  an uncoordinated kindergartener coloring a book Outside the Lines then I would for the next movie.","true":true}