{"101487":192797,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-06","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Visually amazing in many ways but this has to be the worst attempt at telling a Star Wars story I've ever seenThis is coming from a die hard Star Wars fan who grew up with the movies\\, video games\\, books\\, comics\\, toys\\, etc. The whole movie takes place over a span of like 10 hours and does nothing to advance the story. They basically took all the possibilities that TFA set up and threw them out the window. Like is now a coward and useless\\, Rey is the exact same as before\\, Kylo is always about to cry\\, Hux is the least intemidating villian ever\\, we never find out anything at all about smoke and OH! He's dead now. The entire adventure of Finn and Rose is pointless and just takes away from what's going on with the story. Rose is a completely pointless character who adds nothing. LUKE DIES FOR NO REASON. Leia flies through space. Chewie does nothing. Why doesn't Admeral Halsey just tell Poe or anyone that they aren't all going to die so they don't get involved with the stupid side quest that ends in resistance fighters getting blown up. BB-9E got hyped up and does nothing in the movie. The whole force image of luke that fights kylo is dumb and they both stand really weird the whole time. Rose saves Finn in the speeders by hitting him from directly sideways after she had already turned back and Finn was like 1\\,000 yards farther along than her. Yoda is great. Ports are great. Nein Nub survives so that's cool. Akbar is dead :(. We still don't really know about Rey's parents or how luke's lightsaber was found. How did the top just rip off of the AT-ST that BB-8 rode on? Soooo what was the point of this movie?","true":true}