{"101487":127385,"Last Jedi":"Last Jedi","2017-12-15":"2019-09-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Having watched The Force Awakens when it was released and I recommended it. That film showed that there could be life after the Prequels.  It was something of a reboot. Now\\, comes The Last Jedi...\\n\\nThe extraordinary thing that this so-called Star Wars movie manages to achieve is to soil (putting politely) on the Original movies and make irrelevant anything that the Force Awakens was trying to set up. The character assassination of Luke Skywalker was by far the biggest letdown. However\\, into the mix are the most appalling character and story choices ever to be witnessed in Star Wars. Gone are intelligence\\, romance\\, and intrigue replaced by dumb\\, pointless generals\\, stupid meaningless subplots and extremely non-likeable characters. He even gets the new sequel characters wrong. Rey loses all sense of purpose and why she's central to it all. Poe becomes some guy to be fodder to Admiral Holdo (Laura Dern\\, a  talented actress but wasted in this role) while falling flat on the rogue-like-charm stakes. Leia becomes Mary Poppins Supergirl and Finn stays the same as before. \\n\\nDirector Rian Johnson so rightly gets flak from hardcore fans who actually spend money on merchandise\\, books and toys and like me carried on interest after Return of the Jedi in ‘83 to the 90s when the resurgence of interest started again with the Special Editions. A case in point was Admiral Akbar is a very much loved fan-favourite alien character from ROTJ but the sheer lack of understanding from Rian allows him to be dispatched so quickly and off-screen! Rian says he is a fan but that's not right. Fandom is about little details as much as the big. \\n\\nThe ever dull Kylo Ren at one point says something along the lines of ‘Let the past die' obviously referring to fans to let the original films and characters go. However\\, what exactly is Rian johnson and the production team at Lucasfilm are trying to replace it with? Well\\, here's what we get: Rose Tico - who cares about this character! Luke drinking from a space cow's udder; Leia surviving the vacuum of space; Gender politics\\, Canto Bight and animal rights (free the space lamas but not the slave children!); Shirtless one-tone Kylo; DJ - who is this guy! Capt. Phasma (now you see her\\, now you don't); cold-bloodied killer and later cowardly Luke Skywalker! The list goes on. Johnson has gone on record to say that he subverts expectations but surely it has to be done for a reason. The Empire Strikes Back subverted many expectations without sacrificing well-written characters and logical good storytelling!\\n\\nTo me\\, The Last Jedi killed the Disney Star Wars films and it is little wonder that Star Wars fans like me turned away from Solo a few months after TLJ's release. By far the biggest turn off was the treatment of Luke and it is a small wonder that the latest film is called \\\"The Rise of Skywalker\\\" which hints at some kind of call for Disney to try to redeem itself.  It is a testament that while The Phantom Menace was not widely popular but at least spawned arguably better sequels and did not sully the Original movies. The Last Jedi\\, to me\\, personally has had a more negative lasting effect and has actually exposed some of the limitations of the franchise as a whole. I clearly remember sitting in the cinema bewildered at first and then bored. For me\\, this film has not generated any anticipation to watch the next episode. It is\\, in fact\\, the worst film of the entire saga.   \\n","true":true}