{"101487":183003,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the most divisive star wars movie.  Star Wars fans are writing on twitter and many blogs and are hating it.  Casual fans are liking it.  The truth stands somewhere in the middle.  I give writer director Rian Johansson credit as he took a lot of serious risks in this movie and some of it does work.  There are some major problems in the movie that cannot be ignored however.  It is completely discontinued from the Force Awakens.  The last scene from the Force Awakens is a powerful scene between Rey and Luke as she is handing him his lightsaber.  Remember this is the lightsaber from Empire Strikes Back that was lost in his fight against Vader.  This was captured perfectly by JJ Abrams as the facial expression from Luke is surprised\\, happy angry .... You can feel all these emotions.  Well to turn this intense moment into a joke in The Last Jedi\\, just did not work for me.  What we always found in Star Wars is light humour but also sentimental caring for the characters.  Every moment were we get to a caring moment was quickly replaced with an impromptu joke.  This did not work for me.  Back to the discontinued portion.  You cannot do character placement and development in Force Awaken with Snoke and have him become so irrelevant to the story in The Last Jedi.  So many questions will go unexplained.  Where did he come from?  How did he go about contacting and turning Kylo to the dark side?   It doesn't really matter according to Rian Johansson because that is not where he is taking this story.  Luke is one of the most beloved Star Wars character.  Mark Hamill is great btw in this movie.  He really nailed the role as an older Luke.  However you have to give him more to do in the movie.  Yes in the final installment he plays an important role.  And the scene with the two suns is beautiful and moving and a great flashback to New Hope.  However this is Luke Skywalker.  I think it could have been written better.  Also the whole Lea flying scene .... Seriously!!!.  Finally in the things that did not work.  The whole 30 minutes trip to the casino was a complete waste of time.  It didn't even feel that it was part of the same movie.\\n\\nThere are things however that are extremely well done in this movie and they should be noted.  The cinematography is the best I have seen in any star wars movie.  As the trailer said \\\"this will not go the way you expect\\\".  That is absolutely true (I think btw this was overdone).  Clearly the feedback from Force Awakens is that it was too much like New Hope.  Here the director decides he will completely surprise the audience at every turn.  I liked the fact that I could not tell what was going to happen next (however you cannot completely forget what Force Awakens had setup).  The actors were really well directed in this movie.  Adam driver\\, Mark Hamill\\, Carrie Fisher etc ... You never felt that a certain scene could have been played better by the actor.  I give kudos to the director as he really did a nice job with this.  The fight scene in the Supreme Leader Chamber is one of the best I have ever seen in a star wars movie.  The final battle scene on the red salt planet is just magnificent. \\n\\nI think Disney has got to find a middle ground in this trilogy.  Find ways to surprise the audience but still cater to the Star Wars fans that require certain things from these movies.","true":true}