{"101487":129396,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a massive Star Wars fan. I have watched all the Star Wars films\\, as well as Clone Wars and Rebels. This is officially the WORST Star Wars movie I have ever seen! \\n\\nThe plot was just ridiculous for starters. There were so many pointless things that happened - people surviving being flown into space\\, a stupid mirror scene\\, a pointless death of a key character\\, the brief artificial addition of a romantic scene\\, and much more pointless nonsense! The villain was also weak and emotional. They also thought it fun to try to make good and evil less black and white\\, but it was done in such a way that it lessened the impact of the film. They also ruined Luke Skywalker and made him lame and uninteresting. The Vice Admiral character seemed simply condescending and ultimately uninspiring. Don't know why the writers had to add this secret plan\\, hold it back from the audience and then have it backfire anyway - pointless\\, pointless pointless. I cannot express how disappointing this movie was. The Star Wars universe would be better of it we all pretended this film never existed. In my opinion\\, anyone who likes this film is a noob who knows nothing about Star Wars. As for all the rave reviews from prominent critics - all it proves\\, to me\\, is how out of touch they are with the general audience. The fact that the audience reviews and the critics' reviews vary so widely makes me wonder if something is up. Is there something in it for them if they give this trash the right review? I just don't know how else to explain this huge divide in opinions. It should be noted that I created an account solely to express my disgust at this horrible horrible rubbish of a film. The script writer should be barred from ever writing anything ever again! The director should be sacked and made a pariah. The only thing I liked was the development of Rey's character and the opening space fight scene.","true":true}