{"101487":147668,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I would like to say that I am a huge Star Wars fan. I loved all the movies...yes even the prequels. So this is the first time I felt so strongly about something Star Wars that I had to write a review to get this stuff off my chest. So i go see it opening night and was so disappointed....... I left the theater trying to wrap my mind around what the heck just happened......Not in a juicy story kind of way but in a \\\"What the heck was that\\\" kind of way. So i went to see it again and was even more confused about the direction Rian Johnson decided to take in this film. I felt as if he has never seen a Star Wars movie or maybe he caught just bits and pieces   I mean how do you ignore almost everything that JJ did in The Force Awakens? All these things that we have been waiting to know the answers to. Who is this \\\"Snoke\\\" that had seen the rise and fall of the Empire? IDK... he dead now so it doesn't matter. Who is Rey\\\"s parents? Absolutely nobody. What Luke been doing on the island? Fishing and milking sea cows.  How about the big moment when Rey is holding out Luke's old lightsaber in TFA? Luke has watery eyes and you can tell there is a lot of raw emotion there in that moment. Rian Johnson decided to change that emotion completely and have Luke looking at her in an disgusted look just before he throws it over his shoulder in an almost slapstick fashion. This slapstick-ish humor is a recurring theme throughout the film. You get a good chuckle here and there but I think it was overdone and diminished the seriousness of a good portion of the movie not to mention just didn't fit.The way the Leia's \\\"only\\\" force moment was filmed make it look so ridiculous that it lost impact and didn't land with audience like it should have. (I actually heard people laughing and making comments about it both times I saw it). How about this exciting Canto Bight? Oh you mean the most boring part of the film. I could go on and on. Rian Johnson took a lot of risks (way too many in my opinion)\\, the ones that worked were really good and the ones didn't work were really bad. I will say the action in this movie was awesome but it didn't make up for all the other lackadaisical moments.","true":true}