{"101487":145246,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It was ok. I had a headache at about half way through\\, and that's around the time I started to wonder when it would be over. Here's the thing\\, when my brain picks up on a cliche every 2 minutes\\, when I notice the theatrical unrealistic setting of Stoke's 'throne'... him surrounded by these weird red samurai dudes... etc maybe Star Wars just isn't for me. Or take Luke Skywalker's character... The Jedi are supposed to be some type of galactic monk who are capable of controlling the energy of the universe - yet the things he does.. his emotional dilemma\\, the stuff he says.. none of the it makes sense to me. The movie just lacks depth. It's too much theater and action in place of substance emotionally\\, intellectually..etc If this movie had the depth of Interstellar\\, I'd give it 5 stars. But the best analogy I actually have for it is like a story line that was rushed and made for an energy crazy audience. It's just full of cheap jokes\\, plot twists\\, and cliches. But that's just me. Here's another example. He takes this girl who's apparently got Jedi abilities\\, sits her on a rock\\, and in about 15 seconds she's already tapping into the 'force'. The fuck? How can anyone appreciate the ability to tap into something like that if she's doing it so fast? See\\, if there were like 1 more minute of film-time showing how she spends a ton of time and effort through practice to get there\\, then sure. Sorta like Karate Kid. Maybe the Last Samurai. I can go on and on and on. Over all\\, I tried to like it. But I doubt anyone would want to watch this cheap thrill again. See... Interstellar I can watch 100 times. Even Wolf of Wallstreet I can watch 100 times. I call movies like this StarWars a 'sugar rush' because they're cheap on substance but taste kinda good until you realize that gulping a 2 liter bottle of coca-cola in one sitting doesn't feel too nourishing. It's like... they script writers were rushed to produce this story\\, so they hit all the criteria for a film that this market segment would like without really thinking the details through. With all that said\\, it's interesting to see how 58% of users's liked it but Rotten Tomatoes gives it a 93%. Based on what? I guess they like Cliche's and shallow plot twists.","true":true}