{"101487":183745,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie disrespects the entire Star Wars Universe built up for 40 years.  Rian Johnson should be ashamed of himself.  Snoke?  We hardly knew you.  What the hell happened?  You got totally played by Kylo Ren and we have no idea why you even existed to begin with.  How did you get to be so powerful?  How did you end up leading the First Order?  No idea.  The director certainly doesn't care.\\nHow about goodie two shoes Rey?  I liked her spunk in episode 7.  But now?  She's basically a Jedi Master and it took her all of 10 minutes to figure it out (Must have kept a book of Jedi Training for dummies under the seat in the Millennium Falcon).  What were all those losers like Luke\/Yoda\/Ben\/Anakin doing all that time training in a Temple?  Don't they realize you just feel the force and WHAMO!  Instant Jedi!  Glad that's all figured out.\\nHow about sea cow milk drinking Luke?  Look at ya... pathetic!  How the mighty have fallen.  Yes I know your Jedi Temple was wrecked and that sucks but you've been in worse spots than this right?  I mean you were all by yourself fighting Vader and he tells you he is your father and you know its True.  You got out of that jam right?  After all that Jedi training your gonna just piss all over the Jedi and the Force like that?  After all the time on the island and you come up with no grand conclusion about the Force?  I was expecting more from the guy who saved Vader from himself.\\nWhy does this director hate Star Wars so much?  Why does he spend SOOO much time on useless characters like Rose?  She should have died along with that general that flew the spaceship into the Star Destroyer (movie was way too long could have easily removed both of them completely).  That casino subplot was a complete waste of time.  Finn should have just stayed unconscious the entire movie.  I'd have more respect for him then.  Since we know Carrie Fisher is gone leaving Leia as a frozen block of ice in space would have been the right call instead of turning her into Marry fing Poppins.  She's force sensitive not a friggin Immortal... idiots.\\nWhy is Poe dissed at like every turn?  So that some women can show up and scold him because being heroic is bad?  Save the heroism is bad speech for another franchise.  I'll tell you what's bad putting a hater like Rian Johnson in charge of something 40 years in the making.  He had all the material in the world to build off of and this feels like such a betrayal.... Wait a minute...  I know who the TRUE Sith Lord is!  LOL","true":true}