{"101487":191163,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*Updating my score to 1 star because 0.5 stars apparently doesn't count\\, hence the lowly score of 49% is actually much higher than viewers have really rated this abomination.\\n\\nThis is such a uniquely unforgivable film that I'm writing my first RT review. This film is the most overt\\, aggressive propaganda I've seen for a long time. It's also the first time in history a popular franchise has decided to make a film explicitly attacking it's core fan base\\, while simultaneously mocking the franchise itself.\\n\\nThe writing and plot are appalling. The flying Leia was pitiful. The whole winks to camera feel was so misjudged. Luke is made a total loser. The humour is puerile and totally off\\, any tense scene is ruined with an appalling joke that totally ruins any immersion in the Star Wars world. \\n\\nThe Empire\\, sorry First Order\\, are just clowns in this film. Does Rian Johnson not understand that Star Wars only worked because the villains and the Empire were serious and intimidating? They are now comedy clowns and an angsty emo boy. No one will give a damn about watching episode 9. This film has cost Disney about £800m in lost money. Rian and Kathleen must be very proud. \\n\\nBut what is most fascinating is the politics of what Disney have done here. Virtually every baddy is a white male. Virtually every goody a woman or person of colour. The writers have admitted this was intentional - the First Order is 'white supremacist' and the rebels 'multicultural'. It is all so overt and over the top. The males are stupid\\, the women wise and wonderful. \\n\\nSo stamped in big letters across the whole film is \\\"Fk you white men\\, girl power!\\\". All very original and progressive... But it's also fascinating\\, to attack the core demographic of this historic franchise. \\n\\nDisney have completely killed Star Wars now\\, this is now just extremely blatant\\, poorly written political propaganda. Like most people I've spoken to I will not be watching episode 9. I hope the backlash Disney face is extremely severe.\\n\\n(Rogue One had similar over the top 'diversity' obsessions but there's an important difference - it's a great film!)","true":true}