{"101487":97082,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-21","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"3 stars for awesome special effects deduct half a star for Luke milking scene. If you're a star wars fan of the original trilogy esspecially you will be disappointed in this movie. It's really surprising that this script made it to production. This movie diminishes star wars aspirations from epic Saga to cheap SHE propaganda with mixed half developed themes. It really only succeeds in diminishing the original trilogy characters and destroy the New Hope fans had for the original force awakens film which in and of itself was average. \\n\\nAfter watching this film I think the only hope the star wars franchise has to bring itself back to life us to make EPIC films in the KNIGHTS OF THE OLD REPUBLIC timeline FORGET HAN SOLO MOVIE NOBODY CAN REPLACE HARRISON FORD.\\n\\nFilmmakers take notes for future Star Wars films:\\n\\n1. No SJW propaganda please Star Wars is in a galaxy far far away not USA\\n2. Lots of lightsaber battles and space battles\\n3. Lots of Aliens and interaction with them No milking scenes please \\n4. Feel free to make it PG13 OR FOR OLDER AUDIENCES \\n5. HIRE DIRECTORS AND SCRIPT WRITERS THAT ACTUALLY love your franchise \\n6. Always ask the question is this EPIC? \\n\\nFAILING TO DO THE ABOVE YOU RISK LOSING YOUR LONG TERM RETURN ON INVESTMENT ON LUCAS FILM PURCHASE. \\n\\nMAYBE TALK TO THE MARVEL GUYS THEY SEEM TO BE DOING PRETTY WELL BECAUSE THEIR MOVIES ARE ENTERTAINING AND SEEM TO BE MADE BY PEOPLE WHO REALLY LOVE THE CHARACTERS. \\n\\nUnfortuantely Star Wars the last Jedi is a disappointment that destroyed any interesting reasons to watch the 3rd movie. It's almost a certainty that Rey and Kylo are brother and sister and the grand finale of their standoff in the finale is nothing particularly interesting to look forward to. Sad.","true":true}