{"101487":176401,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie decided not to follow many plotlines that originated from the Force Awakens. It feels like a reboot of star wars within a middle of a trilogy. Husk's character was reduced to comedic relief rather than a badass Nazi. Prisma was set up to be some bad ass character but a huge disappointment. Finn's character and story looked like it was inserted last minute because they didn't know what to do with him. The whole Canto Blight scene was actually super out-of-place.  Rose-Finn-Rey love-triangle is weird. The rebel part of the movie was pointless and slow. There was also some unnecessary forced drama between Poe and Holdo. Snoke's \\\"development' was disappointing. BB8 is R2 on steroids and more Mary Sue than Rey. Chewie's scenes seemed even more brief than ever despite being a main character for the OT and TFA. There was a really weird scene with Leia in space. Although the idea of the scene is understandable\\, I feel like it was poorly created. The CGI was just super weird.\\n\\nPros: Porgs are cute. Crystal wolves are cute. Luke is badass. Yoda is cool. Rey-Kylo development was really interesting. The throne room fight is probably one of the best lightsaber fight. Chewie had some kick ass moments piloting the Falcon. The humor in this movie is really on point. Although some people may complain about the Marvel-esque humor\\, I find all the jokes to be on point and thus acceptable. \\n\\nI think if this movie was the first movie of a trilogy\\, it would've been great. However\\, it was a poor continuation from the Force Awaken. Johnson's decision to have a sudden change in direction mid-trilogy is definitely facing some backlashes.","true":true}