{"101487":108662,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Believe the bad reviews if you are a Star Wars fan. This is the worst Star Wars movie yet. Not because it's necessarily a bad movie (although\\, there were moments) but because it destroys everything that has been built in the last 40 years. This movie completes the nullification of the Original Trilogy and goes even further in taking everything that was great and interesting about the Force Awakens and trashing it while taking everything that was wrong with TFA and doubling down on it. If you want a thorough analysis\\, others have posted lengthy reviews. Luke's character ruined\\, Rey's still untrained and overpowered\\, other characters diminished. The only one that comes out of this cluster for the better is Kylo. There are numerous reviews detailing the horrors of the movie and others liking it. If you look closely\\, you'll notice that generally the positive reviews give no reasons for liking it other than that Rian Johnson \\\"took risks\\\" and then decline into attacking those who didn't. Since when does someone get credit just for taking risks? If they don't pay off then it's not a win. I will just say that they couldn't have done a better job of destroying the existing Star Wars universe if they had tried\\, which leads me to the inevitable conclusion that burning everything to the ground has been the intent from the outset of this trilogy. Lastly\\, I wish I didn't have to go here but it needs to be said\\, the blatant propaganda that hits you over the head like a club. From the vegetarian and PETA nonsense to the fact that every woman is smart\\, stoic\\, strategic and composed while every man is an emotional wreck while also being somewhat inept. And before you write me off as a sexist\\, this was my wife's first comment walking out of the theater. I wasn't even thinking about it (too busy thinking about how they destroyed Luke. Mark Hamill was right). There are actually a few cool scenes that were really enjoyable but are a small consolation to the rest of this train wreck. I walked out of TFA excited to see the next one as I have done with every Star Wars movie over the years but I honestly don't care what happens in IX at this point which really surprises me and is extremely sad. I think Rian Johnson may have just ruined Star Wars.","true":true}