{"101487":186478,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was everything i hoped it would be. I was afraid Rey would just be another skywalker. SHE WASNT. and not only wasnt she what i feared she'd be. but she was EXACTLY what i hoped she would be. A NOBODY. just like Taran from the chronicles of Prydain (yes i know im cross-nerding here). she like Taran\\, is special precisely because she is nobody. and can forge her own destiny. she is a sign that anybody can be a hero. \\n\\nI was afraid that  the message was going to be the death of the jedi order. or that there has to be both Jedi and Sith in the galaxy. they teased this the whole movie. but in the end it wasnt so!!! throughout the movie \\\"let the past die\\\" and \\\"the jedi must end\\\" and \\\"light and darkness together\\\" but in the end\\, \\\"I will not be the last jedi!\\\" and Rey saves the books. and Yoda totally knew she did. and Light is undoubtedly the best! \\n\\ni dont understand why everyone hates this. yea i get it\\, Luke wasnt the plucky protagonist you remember him being. but news flash. he isnt the protagonist. Mark Hamill didnt like the character initially. but i read that the direcotr worked with him to make it better for him. he still isnt totally satisfied because he wants Luke to still be that hero. but he simply cant be and even though he doesnt like it he fully knows it has to be that way. he praised the director and the film. dispite not liking what luke became. \\n\\nhe has personal reasons for this dillema. but for the rest of us really? its not hard to believe Luke became this way.he almost made one tiny mistake and Ben caught him almost making that mistake and it blew up in his face. after that he was so ashamed at himself for almost doing something that was so fundamentally against his character\\, something that caused the downfall of everything he'd worked towards and created a new villain like the one he once defeated --- defeated through conversion as he should have done here ---- that he left. ashamed and hopeless. this Luke\\, feels about the character exactly the same way Hamill himself feels about the character. He knows this isnt who he is and he hates it. But for the story this makes sense. he is in a new roll. he isnt the hero. Rey is. and Rey is all that Luke was an more. she is brave\\, optimistic\\, hopefull\\, impulsive. She will always choose to protect her friends just like Luke did and she searches for the good in others just as he did. but more than luke she is childlike. Yoda was right when he looked upon Luke and said he was \\\"too old\\\" --- and they made it work for sure. but in truth Luke was never young at heart. from the beginnning he was smoebody who wanted to grow up. to go make something of himself. and he had to LEARN belief in the Jedi order. learn it he did. But Rey didnt. Rey believed from the beginning with childlike wonder and awe. maybe thats why she learns to use the force so well. Luke had just as much power and onnection to the force yet it was hard for him because he didnt easily believe. But REY DOES. and it is her belief (and some assistance from Master Yoda) that restores Luke. when the film ends we HAVE THE OLD LUKE BACK. no more \\\"let the past die\\\" mentality embraced by Kylo Ren. but he looks upon him and says \\\"everything you aid was wrong. .... i will NOT be the Last Jedi!'\\nThe Film had to go really dark. i didnt even mind that the plot was the resistence going from bad to worse over and over and over again. with every last \\\"plan\\\" failing. ending with NOBODY save a force Luke coming to save them. this would be  a poor choice in any other movie but the message here was that sometimes things do go from bad to worse. repeatadly. it is monotonous and terrible. and we delve into the pit of darkness. and in that darkness hope shines all the brighter. and that is what happened. the movie ends with a child\\, force sensitive and wielding a rebel ring. that was the whole point of the Finn side story. to not only add to the message of \\\"sometimes all our plans fail\\\" but also to set that up. there is Hope in the galaxy . \\n\\none last thing. the message of this movie was NOT the death of religion. but its renewal and restoration. Yoda's words were about shedding all the false practicces the jedi had aquired that were so against their nature. he may have burned that tree and supposedly the books luke thought\\, but the jedi order was already passed on to Rey. and she is more of a Jedi than any of the Jedi we have yet seen in these films. full of Love and Hope. ready to sacrifice for others. brave and a defender of Life at every turn. one who knows how to commune with the force and relate to others. one who loves the past and looks to the future. this was not meant to kill the past. this was meant to save it. and dont you tell me yoda didnt know Rey had the books when he burned the tree. When he said \\\"there was othing in that tree rey doesnt already have.\\\" he meant both that she possesses in herself all that those books teach but he also meant it literally. she took the books. \\n\\nThis movie was amazing.","true":true}