{"101487":133909,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I haven't read any reviews\\, amateur or professional.\\nJust trying to form my own opinion of it.\\nAnd the further away from it I get the more I absolutely despise everything - almost everything.  Not quite everything not quite everyone. Most of it\\, most of them.\\nKylo's character development was rich\\, dark\\, surprising and terrifying.  It was most of the show.\\nHux is ok...  The acting was bad.\\nSnoke... looks like Al Davis\\nRose was annoying and too young. Too outspoken with corny proclamations and actually kissed a guy on the ground who was immobilized and clearly wasn't into her.  That kind of confidence in a girl who isn't a supermodel or a genius screams SHELTERED.\\nEvery cgi creature was reliving the prequel nightmares.\\nThe entire gambling planet was a wasted scene with kids straight off the set of Oliver Twist.\\nIt was all boring and corny\\, especially those little creatures.\\nLuke being a whiny crabby old bitch MADE NO SENSE.\\nRei and Finn were good\\, likable characters. But Pau was an idiot who should have been executed for mutiny and literally got the whole rebellion annihilated while disobeying his superiors.\\nWealthy old liberals are admirals now.\\nOnly Yoda's scene was flawless.\\nWHY DIDN'T THEY REALIZE THAT LITTLE GREMLIN DANCING IN POKER CHIPS WAS NOT FUNNY?\\nWHY was the casino a carbon copy of Monte Carlo?\\nRemember the hookah bar on Tatooine? With weird music\\, dingy dark \\ncorners? Where was that inspiration?\\n\\nDisgusted","true":true}