{"101487":199141,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow\\, I can’t believe I’m about to write a negative review for a film that I have been so hopeful for and ultimately for a franchise that I have loved so much. Just to put things into perspective before anyone reads my review\\, I took the trouble to download this app\\, create an account and write this review from my phone because I felt that strongly about it. I am not a “hater” or an “Original Trilogy purist”. I have watched\\, read and played every bit of Star Wars I could get my hands on since I was a child. I love this universe\\, the good and bad. Unfortunately\\, I must admit that I’ve never felt so disappointed in a Star Wars movie\\, and yes that includes the prequels... So here goes nothing... SPOILERS AHEAD: If Episode 7 was criticized for anything\\, it was paying too much homage to the original film. It was a “safe” film but mostly enjoyable nonetheless. It also created a lot of new mystery that you are left feeling eager to learn more about... But you can forget about that happening in Episode 8\\, nothing is revealed\\, and when something does have more light shed on it\\, it feels hurried and superficial. Episode 8\\, in what feels like a wild attempt to differentiate itself\\, steers completely off course almost to the point of unfamiliarity to the franchise. The comedy was too frequent and felt like cheap fan service from the opening scene until the very end. There were some fun moments but they were ultimately undermined by a barrage of shallow attempts at humor that remove the viewer from the universe and quickly reminded you that you’re watching a Disney film\\, in case you forgot. Plot holes and terribly lazy writing litter the landscape of this film. Luke is a whiney nobody that quit on everyone and the galaxy as a whole because he failed Kylo and his young Jedi in training. The film does not pair Rey and Luke together well and they should have spent much more time together. Any connection between Rey and Fin is quickly forgotten about and their reunion at the end of the film brought forth little emotion. Fin’s escapade to the gambling town was a cheap excuse to find a way for him to end up on the First Order ship to face off in an extremely anti climactic “FN2187 vs Phasma” showdown. Leia’s miraculous flying moment through space was patently absurd and almost made me laugh out loud but I was too stunned to respond. It not only looked ridiculous but was completely unnecessary to move the story forward. The tension between Kylo and Snoke was rushed and lacked substance. Snokes death by Kylo came way too soon\\, was very unrealistic\\, and left a huge vacuum in the film for the great evil to help drive conflict. Not to mention\\, it completely cuts the viewer off from any character development with Snoke. He’s a hologram in Episode 7 and a dead man after a few scenes in Episode 8. That’s it\\, he’s gone. Instead of finding a way to be edgy and let the evil stir they simply axe Snoke and let the conflicted Kylo half heartedly fill the void. That whole turn of events and handling of Snoke was terribly\\, terribly disappointing and weakened the film. Luke’s great “force projection” at the end was clever\\, but quickly ruined by the stupid shoulder “dust off” moment that yanks the viewer right out of one of the most critical moments of the film. Oh and by the way\\, he never helps the remaining rebels find a way out of the cave he just snuck in to. No\\, he goes off to cause a distraction and leaves them with a riddle to figure out for themselves. Terrible writing. The chemistry between Finn and the other girl (name escapes me) was non existent. They took up way too much screen time and felt like an annoyance that had to be endured before returning to the action. Luke’s disappearance at the end was also a terrible way to finish the character off. It felt lazy and reeked of desperation to move the story forward with the new characters. The “running on fumes” \/ “space chase” was a terrible plot device that somehow was chosen to be the main focus point of the narrative. Oh and how could I forget\\, Poe’s entire character is basically reduced to one giant lesson in why he shouldn’t be such a stupid aggressive man and that he needs to listen to these strong and unique women. He felt like a bad dog who was constantly getting swatted with a magazine. The movie was full of preachy moments that sought to capitalize on current trends and failed miserably to inspire whatsoever and instead worked together with the cheap fan service humor to rip the viewer right out of the universe and remind them that this is Disney and there are messages they want you to hear as you watch this film! There is so much more that I could write but my thumbs are tired. I haven’t touched on half the plot holes and other fluff that was hanging around but I’m sure someone who is a much better and more succinct writer will do it for me. Was there anything good about this film? Sure. Adam Driver did his part. Rey was mostly spot on and the tension between the two characters as they interacted was a bright spot that actually engrossed me in the film for a moment\\, even if it was brief. The action scene in the throne room with Kylo and Rey was pretty cool. Benecio Del Toro was a lot of fun to watch and played the part of the opportunistic thief\/hacker perfectly. Despite the ridiculous force moments from Carrie Fisher she held her role together pretty well. You could tell Mark Hamil really tried hard to nail the role and I think he actually did a great job but he ultimately couldn’t overcome the terrible writing and abrupt fate they gave him. The rest of the characters were mostly forgettable. The action scenes were pretty well shot and had great special effects. Too long? Didn’t read? I’ll sum it up like this. Sitting here right now\\, I would rather watch any of the prequels again\\, any of them\\, before I sat through this film again. Those at least felt somewhat like Star Wars. This film was barely recognizable\\, took zero risks\\, and will be the first Star Wars film released in my lifetime that I will not see more than once in theaters. I am perfectly content waiting until BluRay release. None of this makes me happy to say\\, I wish badly that it wasn’t true\\, but alas\\, it is. At least for me\\, and for other fans as well as I see the negative reviews pour in. I never thought I’d say this but I really wish Lucas was still in control. I mean\\, he created JarJar Binks and I’m still saying that after watching this film! I’ve never felt so indifferent to Star Wars in my life after watching this film. I think a big part of it is because I’m not confident in Disney at all to do this right going forward. Oh well\\, it was fun while it lasted... ","true":true}