{"101487":138629,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I paid to see this movie in 1980 when it was better and cheaper.\\n\\nIs Rey looking for her parents while escaping the First Order or is she trying to become a jedi or get Luke to come out of hiding - and to do what?-  With the Rebellion in imminent danger\\, how is the audience expected to care? The writing is just plain bad. It doesn't ask any questions or give any answers. Even Snoke (a key character and unexplained phenomenon from The Force Awakens) ends up being a meaningless nobody. These \\\"character motivations\\\" cause the plot to meander in multiple directions and takes away from the drive that keeps an audience in their seats.\\n\\nFYI this means that the only important thing that happened in The Force Awakens is that Rey pulled a Skywalker and left her planet to break an Imperial death ray. \\n\\nEven original characters are unnecessarily diluted with trite\\, cartoon like shtick. For example the story also seems to needlessly demean Luke's character in unnecessary scenes. Luke Skywalker used to be a poster boy protagonist. He had simple motivations like; get the plans to the rebels\\, and shoot a torpedo into the reactor core. I couldn't tell you who the protagonist is in The Last Jedi\\, I think the writers wanted it to be Rey but it's not clear and that's a problem. Plus\\, every other scene in The Last Jedi is a rip off from the original trilogy. I felt a little like I was watching Spaceballs (a spoof.) Rey's scenes are practically a carbon copy of Luke's in Empire Strikes back making them predictable and boring. I'm not sure if it counts as a spoiler but Rey just does everything that Luke did\\, visit a master on a watery planet with a sunken x-wing where she meditates\\, lifts some rocks\\, goes into a cave and sees herself. She then goes on to face the emperor and the sith who takes her there has a change of character. It's the SAME thing.","true":true}