{"101487":106573,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A two and a half hour chase through space. Answers none of the questions in a satisfying way people have been urging for the last two years. Rey is better than everyone else at anything she sets her mind to do. Shes stronger than Kylo\\, shes stronger than Luke but she have no training with the force or any training with a light saber what so ever. Shes actually been in touch with the force for a couple of hours and kicks everybody elses ass. Rememver that Anakin\\, who pretty much was the strongest Jedi in the galaxy had to train in a Jedi academy for years and Luke also had to train on Dagobah after being inrtoduced to the force by Obi-Wan. Rey makes no sense what so ever. Still Luke is portrayed as an idiot in this movie and after being redicilously portrayed as a weak character he is being defeated by the \\\"all Mighty Rey\\\". He dies a stupid Death at the end of the Movie without satisfying the long lost wait for a returning Child hood hero. The Movie pretty much puts down all leading male characters and makes fun of them while Leia all of the sudden a Jedi goddess who can fly through space like Mary Poppins. Luke is a weak\\, scared asshole that doesn't care for his friends and milking space animals on his planet destroying the entire reson for trying to find him during the entire episode 7. \\\"Why did he even bother to leave a map puzzle in ep7 if he doesnt want to be found\\\"? It just doesnt make any sense??  The Movie alson kills of built up and interessting characters like  Snoke and Phasma without any regards to earlier set-ups made by JJ Abrams. It shits on Luke and it shits on all earlier Star Wars Movies. The Last Jedi is full of plot holes that makes no sense what so ever\\, pretty much destroying everything that has been built up for 40 years. I hate this fucking Movie and Rian Johnsson is a stupid egomaniac and will Always be known as the guy who killed Star Wars.","true":true}