{"101487":174130,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The film feels a bit like a start to a new season of a TV series in which there is a lot of work setting up the next story\\, but little gets resolved in an emotionally satisfying way. Overall\\, there wasn't enough emotional connection on this film\\, despite lots of opportunity for high jinks and or true mourning instead we got a lot of grim warlike melodrama as the story worked toward something else. I felt the film was actually too packed with cameos and plots to really allow me to settle on anything or anyone deeply. \\n\\nWe enjoyed the mindless fun but a couple led things really bothered me. First was the dialogue-was not at the amusing and warm Star Wars level. It was too ponderous in places. I wonder who wrote the script? I found myself missing Lucas-style quirkiness and imagination. This felt like a TV show at times. The cameos felt forced-like R2D2 comes back but has almost nothing to do but play an old recording of Princess Leia that even Luke says is corny. And the too-long scenes in the red room with Snoke seemed like a Dr Who episode by which I mean that for having such a big budget those scenes looked like a TV show. \\n\\nMy 11-year-old liked it though. And our theater has replaced the regular seats with ones that are like Laz-e-Boy loungers so it's now insanely comfortable. \\n\\nSo that's my review. Also tickets were $7.50 for the matinee and one large popcorn and one large drink for which we asked for little Dixie cups so we could split it up cost $13. So it was a $35 movie outing\\, even being cheapskates. But I saw that movie tickets at the Edwards Cinema cost $20 in California when we visited this summer\\, so maybe our cost of living is lower here?","true":true}