{"101487":199246,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow... Just wow. What a heaping pile of burning trash. I don't think that there is much to say that anyone else has already mentioned\\, but this movie completely missed the mark. I was itching the entire time to get out of my seat and leave but kept convincing myself that it had time to get better\\, I was sadly mistaken. Super Leia? really? My biggest qualm was the underdevelopment of those characters that we came to love and adore in the Force Awakens. Fin\\, a character that has (or well had) so much potential for further development and importance\\,  became nothing more than the subject of slap stick humor and Mel Brooks esq (if Mel Brooks was on mad drugs) jokes. Poe\\, another character that had incredible potential\\, turned into (getting really nerdy here) Seamus Finnegan from Harry Potter\\, a kid who wants to do nothing but blow things up. And Rey.... I love Rey and they Rian Johnson didn't put any thought to her character development... she was almost boring. \\nThis film was outright disappointing... Even the opening scene\\, I honestly thought I was watching Space Balls (which to be clear\\, I love Space Balls\\, but I paid for Star Wars). I was ready for Darth Helmet to pop out from behind a wall. \\nTo be clear this is not a \\\"trolling\\\" comment. Nothing is above scrutiny and this film doesn't even miss the mark.... it's not even in the same universe. Please JJ Abrams FIX THIS! I vote for a redo! Ugh...","true":true}