{"101487":130316,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I created an account to post this review only. I am giving this movie 1 star because apparently giving it less than that excludes it from the ratings. Which is the point of this review. I am not going to comment on how atrociously god awful this movie was. It's not just what they did to major characters like Luke Skywalker\\, which is not only unforgivable but just flat-out stupid and shows that the director and producers understand nothing about how personality and character traits work in the real world. Given how Luke was established in the first 3 original films\\, there is NOTHING that would have turned him into the ridiculous caricature that apparently Rian Johnson thinks is a reasonable interpretation of this person's development over time. If you can't understand that\\, you are basically just a flat-out idiot. \\n\\nIt's not about the boring plotline\\, or the and pointless and jarring SJW side-journey on Canto Bight. Or the fact that half of the things from Episode VII were left unexplained or tossed away. Or the bad jokes. Or the grade 5 level understanding of physics (bombs dropping in space\\, lasers \\\"arcing\\\" like gravity can affect them). Or the terrible editing (Hey stupid\\, when the airlock opens to let in Leia after her Mary Poppins adventure everyone should have been sucked into space... if there was an intervening point where another door closed behind her first that should have been edited in as a shot. High school level film-making\\, seriously.). Or the fact that these morons just threw out all logic and sanity and just decided to make the force something that people just naturally \\\"have\\\" with no training at all\\, completely contradicting everything Lucas set up in the first 6 films\\, with no explanation whatsoever. This movie basically shows that the producers and director think that you are morons\\, that they can do whatever they want and that just because it says \\\"Star Wars\\\" on it you will lap it up. It's an insult. \\n\\nBut that's not what this review is about.\\n\\nNo\\, this is about the completely obvious corruption that exists here. Rotten Tomatoes and the spineless professional critics have been bought and sold by Disney\\, pure and simple. Look at the audience reviews. They are ALL saying that the movie is garbage. And yet it gets 91% from the critics? Riiiiiight. Does anyone with half a brain actually believe that these professional movie critics are that stupid? Really? And the fact that the meter is 47% for the audience reviews is also FAKE. Look with your own eyes at all these reviews. Does it look like a 50\/50 split to you? Why should 1\/2 star reviews be excluded\\, exactly? What is the rationale behind this decision? Are 5 stars also being excluded? (I doubt it.) Take a look at the audience reviews listed here\\, and compare them to the 4 sample reviews from audience members being shown on the main page for this film. Look at how they took the very few\\, most positive audience reviews they could find and showed those. It's pathetic. Purely\\, totally\\, blatantly pathetic. \\n\\nTo RT and the professional critics: You can sell out and get away with it when a film is marginally bad. When it is this unbelievably\\, shockingly\\, amateurishly god awful\\, it exposes you for the absolutely spineless sellout wimps that you are. Your integrity should be more important to you in the long run than whatever pathetic amount of money Disney is paying you\\, or whatever they are threatening you with. By doing what you have done here\\, you have SHOT your credibility to shreds\\, and it cannot be repaired. Nobody with a brain is going to ever believe that you are impartial ever again. In the long run\\, that's a bad business move. Good luck to you.","true":true}