{"101487":101463,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A lot of potential\\, a big fat lame burger.  I'm a huge fan of the original trilogy.  I watch the prequels but think they were nowhere close to as good as the original.  The prequels were at least entertaining with all their shortcomings (JarJar\\, bad acting\\, overly CGI).  Each prequel left me interested for the next episode.  The Force Awakens to me was not as good as Empire or ANH but darn close.  TFA was definitely better than ROTJ.  TFA provided lots of questions that were interesting. The new characters were well done.  I really cared what happens to them and how they fit into the Star Wars mystique.  Super props for showing a stormtrooper's point of view.  Leia\\, Han and Chewy brought back a sense of nostalgia that felt like the original.  Loved the way they killed off Han - perfect way to die and move the story forward just like Obi Wan and Qui Gon.  I had more anticipation for Episode 8 than any other movie since Phantom Menace - even the TLOTR trilogy.  What a big disappointment TLJ was.  It was cool they tried to repeat Episode 5 and 6 with a few twist in Episode 8.  I caught all the parallels and twist.  Like ROTJ - Rey in throne room watching rebellion get decimated and man handled by the evil leader similar to Luke.  Kylo double-crossing the evil leader as Darth did with Palpatine.  ESB - Rey trained by Luke doing his Yoda hermit act.  Yoda saying there was more hope referring to Rey like he did for Leia.  Hoth redone in salt.  Luke floating like a fart in death like Yoda.  But the huge plot holes\\, a boring trip to a casino planet and a pointless chase steaming at school zone speeds killed this for me.  I spent 90 minutes of the movie wishing I was not watching this movie.  The humor throughout the movie was extremely poorly placed and fell flat. I re-watched all previous 7 episodes and Rogue One.  I got them all on DVD or BluRay.  With exception of most things JarJar\\, none of those had flat humor moments.  I couldn't find many scenes that didn't push the story forward or build for a plot that was interesting in the previous Star Wars films.  Many of the jokes and plot holes in TLJ left my eyes rolling to the back of my head and sideways.  This is Star Wars not a comic book movie.  I just watched Justice League and TLJ felt like Justice League.  The new characters in this movie were centered on plots that made no sense.  None of the new characters had much depth.  To me the Rose character was JarJar.  She saves the day or really didn't.  She actually made things worse but had the major line the movie - \\\"Not fighting what we hate\\, saving what we love\\\" left most around me with a gag me look.   Uhm I think that's what Finn was trying to do.  And thank you for not saving but killing all the other rebellions by bringing DJ's backstabbing ways to the mix.  I also did not like most of the movie being one twist after the other just to throw twists at the audience.   70 minutes into the movie it got old.  And to change how characters act or making them do stupid things just to setup a twist is just disrespecting the audience.  We're not idiots mindlessly watching a Transformer movie.   The images of Leia flying in space or Luke milking a walrus left me ill at how low the movie got.  There are other ways more believable to humanize Luke and show Leia had some force powers.  I did watch this movie twice but I just got more nauseated the second time around.  I won't watch this movie again.  I won't buy the DVD or BluRay.  I won't watch it when it's free on Netflix.  I am seriously doubting I will watch the next movie Episode 9 at the theater.  I feel much less interested in Star Wars now.  The mystique is lost on me.  I give it one star.  If I was not so invested in The Force Awakens\\, I'd probably give it two stars for special effects but I'm taking a star a way for ignoring The Force Awaken.","true":true}