{"101487":96867,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"1. Luke throws sacred lightsaber over his should at the beginning of the movie like its no big deal. (This is ridiculous as lightsaber was instrumental throughout most of saga).\\n\\n2. Luke never really trains Rey\\, just sits on island...for the ENTIRE MOVIE.\\n\\n3. Director attempted Marvel comics style humor in places of the movie where it was not congruent with story line. (ie Poe at the beginning of movie with seriousness of situation thrown out window\\, lightsaber throw\\, Kylo walking around without a shirt\\, Rey making fun of the force etc\\n\\n4. Rey's darkside \/ parents reveal in the island cave. Over-hype about learning Rey's identity along with her possible flirting with the darkside was a huge lie by the director. Plus the cave scene was a huge waste of time-- we didn't learn anything new.\\n\\n5. Chewbacca and Luke never really grieve about Han's death at any point in the movie. - Crazy as they were both technically Han's best friends. There is even source material in books where Chewbacca becomes depressed and paints the Millenium Falcon black for awhile due to the passing of his friend. NONE of this was conveyed in the movie- Chewbacca only eats some chickens...lame sauce.\\n\\n6. Luke doesn't back up his family\/friends. In the original movies there is an underlying theme that Luke will do anything for his family and friends\\, even risking the loss of the galaxy to do this. This is exemplified when he quits training to save Leia and Han in Empire Strikes Back and when he takes on Jabba in Return of the Jedi to save Han. He also takes on Vader and the Emperor in Return of the Jedi to save his dad and his friends. - Fast forward and it seems asinine that now his sister and basically everyone he knows is being killed off and he wont leave his stupid island. Its even crazier that he doesn't sense any of this through the force.\\n\\n7. Alien milking scene - weird and gross...enough said. \\n\\n8. Supreme Leader Snoke - After getting people interested and finally buying into the idea of Snoke and just how powerful he is- the director kills him off in the stupidest way imaginable. The director even bothered to go to extremes to show off all the force tricks Snoke can do- only to be killed by turning a lightsaber like 20 degrees to the right...LAME and again MISLEADING.\\n\\n9. General Hux - This guy was supposed to be a psychotic killer and general for the First Order. Instead he has been reduced to a groveling wimp who gets literally tossed around by both Snoke and Kylo. He also gets verbally t-bagged by Poe Dameron...not very terrifying.\\n\\n10. Captain Phasma - Another pointless character that is supposed to be a badass. Clear Disney social justice at play with this one - you know what I mean. The character as a whole is lame as she never does anything unless Finn shows up and gets her fired up. The whole dynamic just feels so synthetic and fabricated.\\n\\n11. First Order is not terrifying- As shown in the last three examples. The empire used to have some real bad guys\\, now they're nothing. Clearly toning it down Disney style for the kiddies.\\n\\n12. Kylo Ren - Wasn't even going to list him because its obvious--he blows. \\n\\n13. Back story to Luke \/ Kylo - The whole explanation for their split was rushed and very weird. They never show Kylo's turn to the darkside and to simply say Luke pushed him into it is ridiculous. It also again shows Luke not helping his family which is not congruent with his character.\\n\\n14. Knights of Ren - WHERE ARE THEY?!...They had visions about it in Force Awakens and then just forget about them?!..WTF People wanted answers along with why and how the Jedi Temple was attacked. People- and myself included were thinking they along with Kylo would attack Luke on the island while Rey was there \\\"training\\\" with him - aka awesome lightsaber fight would ensue. This would have been way cooler and would have helped answer questions and fill plot holes. But again we got nothing.\\n\\n15. Whole dire plot of film - The fact that the whole movie is based around the empire battle cruiser chasing the faster rebel dreadnaught until they run out of fuel is pathetic for a plot writing. It has lit up convo boards since the movie's release. These vessels in ALL of the movies have run on Fission power aka nuclear type of power. The only things that run on fuel are smaller vessels aka A-Wing\\, Y-Wing\\, X-wings\\, tie fighters. Even the Millenium Falcon runs on Fission power (I think). To make the whole fuel issue central to the plot was saddening. Furthermore you CANNOT track vessels through light speed. This was another stupid change to existing universe rules that the director decided to make. He devised a ludicrous chase when he had plenty of material and back story to focus on.\\n\\n16. Leia's sort of Death - The whole fact that Leia is sucked out into space only to Mary-Poppins it back to the air-lock by way of the force was hokey and laughable at best. I seriously almost laughed during the whole sequence. She has never used the force anywhere near that extent and she has not trained with it at all - as Luke has been too busy milking aliens and shitting in an outhouse on a deserted island in the middle of no-where. (This pissed me off too because there is source material in past books that were written after the first trilogy in which Luke actually does secretly train up Leia to be strong with psychic abilities in the force for her protection and negotiating skills - he also does this so she can sense danger better and call out to him when needed.)\\n\\n17. Battle at the end Part 1 - The battle at the end could have been way better and actually involved ships fighting the new and revolutionary AT-AT Walkers. Instead they had some hi-tech battering ram thing blow the door...sigh.\\n\\n18. Battle at the end Part 2 - Kylo and Luke should have actually battled. The whole fact that Luke finally wielded a lightsaber in one of the new movies was awesome and started to get the crowd hyped up. Furthermore we all wanted to see just how much of a swordsman bad ass he would have been after all his years studying. Instead we saw him do the limbo with quick jumps and side steps. Then we got an even better twist when come to find out he isn't even there to save his sister or friends\\, but is astral projecting from his fucking island. Add ANOTHER twist and he DIES becoming one with the force after looking like he took a major dump due to him placing a long distance force call to say \\\"hey\\\" to Kylo--extremely disappointing end to a legend.","true":true}