{"101487":176586,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie is absolutly terrible.\\nDisney brutally murdered my most beloved childhood memories and had a laugh while doing so.\\n(1) Our favourite heroes act totally out-of-character. Watch Rotj (Epsiode 6) before and you will see what I mean. It is just terrible to see what Disney has done to the #1 hero of my childhood (Luke Skywalker). I know understand why Mark Hamill said he fundamentally disagrees with everything Rian Johnson (the director) has done to the character and I think it is an understatement.\\n(2) The movie is spammed by over commercialized stupid humor. What might work in Marvel movies (of which i like most) has no place in Star Wars.\\n(3) The story doesn't close any loose ends but creates even more.\\n(4) The movie often shocks for the sake of shoking instead of going along with the story.\\n(5) Star Wars was always conceived to be based on a steoretypical hero-saga and as a movie to teach moral ideals. This is simply not the case anymore.\\n(6) The Soundtrack is still John Williams\\, but we certainly know better from the Maestro.\\n(7) The story is written in a way as to devalue and annihilate everything the protagonists of the first 6 movies have fought for. Like Disney would want to make people forget that there were even SW movies pre-Disney.\\n(8) Disney\/Kathleen Kennedy\/LucasFilm promised for the last 3years that the whole point of rebooting the Canon (except for the 6 movies) is to make them more coherent which is a blatant LIE after this movie.\\n\\nEpisode 9 would have to put so many things right and retcon so much to leave me with even the slightest interest in the franchise that it is almost impossible.\\n\\nFor me there is now only the true Canon\\, consisting of 1-6 and everything now called Legends (the pre-Disney expanded universe)\\, where Luke Skywalker has a wife called Mara Jade and becomes the Jedi Grandmaster\\, and the recent Disney heresy I still hope to just be a fever induced nightmare.\\nIf I stand alone with this\\, so be it.\\nI will take any future SW release with strongly reserved cautioness if at all. The half-star instead of zero stars is for good acting.","true":true}