{"101487":132648,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If you know nothing of Star Wars and watch this movie from that perspective\\, then I would rate it between 2 1\/2 - 3 stars as it is visually appealing and mildly entertaining even with its woefully poor story arc...or complete lack there of.\\n\\nNow as a Star Wars movie this was the worse steaming pile of rancid donkey excrement that I have ever had the displeasure of viewing.  The people responsible of the story need to hang their heads in shame\\, as they were past the torch and threw it over their shoulder into to ocean to never have that light shine again.  This bombastic approach to Star Wars has completely succeeded in its goal as I could give a flying monkey fart as to what happens to any of the characters or the remainder of series.  This is the first time I have ever felt that there is no need to see the next movie in the once grand Star Wars saga.\\n I truly feel that the very wrong but ever increasing need to push opinionated social and political agendas have ruined entertainment as it has relegated good story telling to dust bin of history\\, making it take the back seat as it were.  Please understand that not everyone shares your point of view and even those that do agree with it become very tired of having it ram into every aspect of our lives.  Movies and games are to be a great escape from the social and economic stresses of everyday life...that's why it's called entertainment and not reality. \\n \\n  This is the first time I have ever felt the need to leave a review and created an account just for this...\\\" You have FAILED!\\\" I would finish this quote but the only highness here is the state of mind of Hollywood\\, not the self imposed royalty they believe themselves to be.","true":true}