{"101487":132959,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I generally don't review movies because I believe people are different and should decide on their own whether they like it or not. For example I don't care for musicals but I understand that some people love them so a review from me would not be helpful. I will start by saying I am a star wars fan but was very displeased with episode 7 The Force Awakens because it was a bad rip off of episode 4 and 5 and didn't offer a good base to differentiate from the original trilogy. But during the months leading up to the release of The Last Jedi I heard positive things coming from the director's approach of the movie and watched some previous works that made me think I would like it more than episode 7. After thinking about it for several days the only thing that I liked was the sound track matched the scenes well giving off that traditional star wars vibe. The acting could have been great but it was stifled by the weak plot\\, character development\\, and dialogue.\\n\\nThe plot had unexplainable scenes that did not fit the established backgrounds of both the characters and the star wars universe itself. Both important and emotional scenes were ruined the poorly timed comedic efforts. Even worse was the random pointless plot lines that misused important characters. The movie establishes a time line that conflicts with the timeline of characters in different locations.\\n\\nThis movie takes place right at the same point where the last one leaves off allowing for some real opportunities for characters to grow with each other in front of the audience. But instead everyone from the previous film knows each other implicitly. Only three characters actually have story lines with growth and you probably wouldn't guess two of them.\\n\\nLastly the dialogue was the most lazy I've seen in years. The film recycles much of it's dialogue from canned lines of the previous 7 episodes. By the end of the movie you begin to loathe the phrase \\\"may the force be with you\\\" because the movie uses this important line to rob the audience of any creative and heartfelt goodbyes. Also the movie over plays the Droid and aliens that speak a different language to get out of creating jokes\\, insults\\, and emotional lines of dialogue. There are no subtitles for these interactions but only strange sounds which works if used sparingly but the movie litters these through out the movie.\\n\\nLike I said earlier usually I do not rate movies but felt compelled to rate this one. Overall I could not in good conscience recommend this movie to anyone unless they want to see good costume\/makeup and CGI or listen to that iconic star wars sound.","true":true}