{"101487":169752,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars episode 8\\, the star wars trilogy where princess Leia unfortunately\\, died right after the filming. It was\\, all right\\, it felt more like a really good Rick and Morty episode rather than a actual movie though. If I were to say whether star wars 7 or star wars 8 was better I would say the 7th episode. The reason for that is the of star wars 7 ending felt like it resolved something big and for that it was much more satisfying. Rei was able to find the second part of the map and find luke skywalker. This episode still resolved something but the thing that they resolved didn't really feel like the end of anything. The rebels are going to rebel for another day\\, great! But it just feels like it's probably going to happen again sometime in the future. It just feels the ending wasn't satisfying enough for a two hour long movie. \\n\\nOkay\\, sorry\\, the good stuff. It was eye opening\\, while the movie lacked in being able to give a satisfying enough ending what it exceeded at was breaking down the existing characters from within. We finally get to see bad guys not being so evil as we think. Good guys that are not as benevolent as we might think. The most obvious example of this is Luke Skywalker. In the movie we were able to see his weaknesses\\, flaws and times when he screwed up and these moments give the character that much more relatable. The next is Kylo Ren or to be precise Ben Solo. I liked how the movie used snokes character faw out the character and reveal his inner emotions. Ben was revealed to still have that lngerance on the past despite his catchphrase\\, \\\"Forget the past\\, burn it if you have to.\\\" Almost making you think he might actually turn to the light.... Side.\\n\\nCertain things I get in this movie\\, the giant scrolling text at the start and the kind of poorly CGed animals\\, it's kind of like a tradition that every star wars film has to have. But what I don't get is why the transitions suck and that most of the story lines only loosely tie together. First theres of course rey and luke on paradise island with the porgs and little bits of drama here and there with kylo ren. Then there's the guys on the rebel ship fleet as they try to escape the grasp of the first order. I feel that honestly\\, the second story line was just there so there could be a big finally as honestly it was just a big mess leading to nothing if that wasn't there to wrap things up.\\n\\nIn conclusion\\, it was a mess. A good mess but I felt that the story could have been a lot more tightly knit together story and all together. It could have been much better.","true":true}