{"101487":102888,"Last Jedi":"Last Jedi","2017-12-15":"2019-08-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A movie that doesn't even know what it's own MAIN focus should be. Because half of the movie is wasted by following the side characters Finn and Rose on their mediocre adventure that has NOTHING to do with the plot and feels like it belongs on some bad TV show. Meanwhile these Finn and Rose don't even have ANY character development and Finn is transformed from the interesting mysteries ex-storm trooper in the first movie to some sort of comic relief which is just sad. Meanwhile the plot between Rey and Kylo feels like a weak remake of the plot of the empire strikes back. But for me the most important thing that director Rian Johnson did to totally abolish not just the trilogy but the whole feel of the Star Wars universe is that he takes away one of the CORE principles of the Star Wars univers and all the movies and that is that it feels like the dark and the light side aren't fighting for the fate universe. Kylo's first order is basically just 3 star destroyers and the mysteries Snoke is just killed of in a couple of seconds and Rey easily defeats Kylo again just like the the first movie of this trilogy making the first order seem like a joke and no real threat like the villains in all other Star Wars movies which leads to the audience being left with no suspense for any other movie and this will lead to way less viewers for the next sequel.\\n\\nIn summary a movie that is so bad that it makes a whole trilogy that promised so much in the first movie irralivant all because director Rian Johnson can't make any good movies.","true":true}