{"101487":151030,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Lots of spoilers ahead don't read if u haven't seen the film. I didn't dislike this movie. The arching theme - the first order taking out the last bit of the resistance - was ok. However\\, it was kinda ineptly written in a lot of ways. The luke\/Rey drama was fine. Best part of the movie. The whole scenario where the fleet is outrunning the empire was dumb that's not how space and physics work\\, Not to mention the first order star destroyers are insanely powerful and fast but they just sat there during both battles. The resistance could have just jumped twice very fast to lose the tail (before the fleet caught them to scan them). Look I get that it's just a movie but it felt lazy they could have come up with something better than this perfect scenario where poor Jurassic Park lady kills herself bc their ships are out of gas... out of gas? WHAT???? WTF capital ships in star wars all go years without needing fuel but all run out at the same time..... after being in orbit of a resupply base. How dumb are these ppl? Not to mention that hyperspace is another dimension so the cruiser would have gone through that fleet. or just smashed against shields (there are scenarios where an executer class have had multiple ships of that size do exactly this to them and the shields didn't fall). Snokes ship is about thirty times the size of an executer... That Mon cal cruiser would have gone 'pink'. do love dark solo though his casual force throws are very funny. Disney\\, you need to have a vast array of script writers\\, maybe some that have tactical experience... the ppl writing the feels don't know shit about fleet mechanics\\, obviously.","true":true}