{"101487":154049,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Minor Spoiler warning:\\n\\n\\nI've been a Star Wars fan all my life\\, but The Last Jedi ruined that for me. I have been waiting 2 years for this. The film itself would be fine if it was not a Star Wars movie. The music is incredible. The effects are great except for one scene. The plot is seriously ripped off from the early 2000s Battlestar Galactica show\\, except Battlestar Galactica was good. Last survivors from a great devastation try to escape but the cylons\\, I mean First Order\\, are able to track them even when they travel at light speed like in the BSG episode \\\"33\\\". Rey and Kylo's story is ripped off from Six and Gaius\\, with the psychic bond halucinations and everything. Poe is a poor man's Starbuck\\, recklessly disregarding orders. Rose could be the daughter of Chief and Boomer. Her character started off ok\\, but later became annoying. DJ is an excellently acted unlovable character that didn't need to be in the film. Snoke is an empty primadonna of a villian\\, and his story is never fleshed out. Hux has evolved from a menacing\\, ruthless villain to a laughingstock. The Luke in this movie is barely watchable. Carrie Fisher did a good job as Leia\\, but the plot didn't truly allow her to shine. I've been a lifelong Star Wars fan and have seen every film on opening night since Return of the Jedi\\, but for the last film in this trilogy I will probably wait until it is on Netflix. I'm done buying all the novels and comics. The only plus is although it snuffed out a lifelong passion\\, it made me want to rewatch the excellent BSG series it tried to emulate.","true":true}