{"101487":146381,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I want to love this film. I really do. And at certain moments I absolutely adored it... But at the same time... No. I went in to watch it with a friend\\, who rarely watches movies at all. At the end of it his exact words were \\\"This was a soap opera in space.\\\" And... he wasn't that far off. The biggest problem I have with this movie is it dragged on forever. At 5 different points I told to myself \\\"This is the end right?\\\". And the actual ending made me think:  There's no way that's the ending\\, right? Some of the plot points were so predictable it was physically painful. In the critic consensus they said \\\"adding some surprising twists\\\". Name one twist that was surprising. The revelation that Rey's parents are nobody was the most surprising revelation\\, because this movie Had so many melodramatic\\, cliched turns and twist I expected her to be Han Solo's child or Luke's or something. Finding out about Snoke was the thing I looked forward to the most in this movie and what we got was so... underwhelming. Plus he got replaced by the far worse Kylo Ren\\, who I just can't bring myself to take seriously. I have no idea who made the decision to cast Adam Driver as the main bad guy\\, but they dd not think this one through. He looks like a brooding boy-band reject. Why is he the main bad guy? How am I supposed to take any of this seriously. Also\\, if half of the characters get saved by a Deus ex Machina\\, it undercuts any and all kind of tension. I expected after Rogue One the company would be brave enough to kill someone actually meaningful of the good guys but NOPE. After the first 2 times I started thinking \\\"Gee\\, I wonder how they'll get away from this one\\\". And by the middle the pacing screeches to a halt. The casino scene drags on and on and on quite unnecessarily. \\nIt has all this \\\"Let the past die\\\" theme and hell\\, dark and brooding basically spells it out\\, but they don't actually go through with it. All jedi must die\\, but not really. Luke was about to die but PLOT TWIST- he was a hologram\\, BUT PLOT TWIST he died anyway. Destruction of the ancient books and the jedi dogma\\, but not really because they were save. \\\"This is a new movie with different story and structure\\\"\\, but not really. Self sacrifies\\, but not really\\, because Rose. \\nAnd please don't go spewing about \\\"Subverting expectations\\\". That's a pretentious way of saying it's unpredictable\\, which is in no way inherently good and after the first 2 \\\"plot twists\\\" you see most coming a kilometers away.","true":true}