{"101487":196123,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-28","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"When it comes to multi-generational entertainment franchises\\, four come immediately to mind: Star Trek\\, James Bond\\, Mission: Impossible and Star Wars.\\n\\nOver the years Star Trek has seen six TV series\\, two movie series and an animated series.  I haven't seen an episode of Discovery\\, but all the other entries have remained consistent in terms of vision and character development.\\n\\nThe James bond films have been the longest continually running film series of all time with 24 entries.  The 007 personalities have been quite different over the years\\, but the overall theme again has remained consistent.\\n\\nMission: Impossible has seen two TV series and five feature films starring Tom Cruise.  The first film attempted to \\\"throw away the past\\\" just like The Last Jedi.  Throughout the television series Mr. Phelps was thoroughly committed to the IMF cause and his reputation was without blemish.  Then the first movie came along and Mr. Phelps was suddenly disillusioned and became an anti-hero.  Can anyone say Luke Skywalker?  When the original MI cast previewed the first installment they were asked about the movie.  They responded\\, \\\"Yes\\, it was a movie.\\\"  Can anyone say Mark Hamill?  Fortunately the film series returned to the original formula and brought us four enjoyable movies.\\n\\nThe Star Wars franchise has brought us ten movies\\, an animated series\\, TV specials and many other projects.  The timeline\\, characters and the Force itself has remained consistent since 1977.  Along comes The Last Jedi and once again writers\/producers think it's a great idea to \\\"throw away the past.\\\" Heroic Luke is transformed into disillusioned anti-hero.  Beloved characters are either unceremoniously killed off or reduced to cameo role status.  By the movie's end there are no heroes to be found\\, only flawed heroines.  Hopefully the Star Wars galaxy braintrust will learn the lesson of the first Mission: Impossible movie and return the franchise back to its glorious past.\\n\\nMy 23 year old son saw the movie first and was anxious to hear what I thought of it.  I told him the more I think about The Last Jedi the more I dislike it.  My son laughed and said he had the same sentiments.  When he left the theater he gave it a B-\\, but three weeks later the grade is down to a D+.\\n\\nOne last thought:  Part of the reason people go to movies is to escape the world of political correctness and polarizing governmental thought.  The Last Jedi removed the charm of the galaxy far\\, far away and replaced it with the reality of our own Milky Way galaxy.  In the future\\, please don't do that again.","true":true}