{"101487":130693,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'd like to say upfront that I only joined on her to review this movie. \\nI went in to this movie so excited. I've been a SW fan since 1977 when I was five.  I could not have been more disappointed! In fact I'm struggling to find things I liked about the movie. \\n  I didn't have any theories or anything. I just wanted a story that cared about the characters. They are in it.. is the best I can say. I think that Luke's story of the old master that lost his way until a new student arrives and he through reluctant teaching of her\\, finds enlightenment\\, could have been really cool. That not what happened. Luke got enlightenment but it was givin to him by Yoda. Not earned by the narrative. The same as Leia's \\\"powers\\\" weren't earned they just happen. \\n I guess I expected a space fantasy and a heroes journey. I feel like what I got was \\\"don't you feel disgusted about eating meat and drinking milk!\\\"  also.. Morality meh...stay out of it. Make some money and let someone else fight for you.\\n Beyond these things it was just bad. Bad writing\\, HUGE plot holes. Terrible editing. There is some character development but it doesn't make sense. There is no light saber duel!\\n I felt like the Kennedy and Johnston just didn't care about the characters. They just wanted to do what THEY wanted to do. \\nI'm sick of reading how if I didn't like it Then I didn't \\\"get\\\" it. Don't insult my intelligence. It was bad...like ScyFiy  Channel bad","true":true}