{"101487":121734,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Forget everything about Star Wars for a minute and this is just a bad film. Remember all the rich history of Star Wars and this is crushing travesty. \\n\\nAll dramatic tension is removed and replaced in this film with cheap comedy\\, it was like the film was constantly parodying itself. Everything that The Force Awakens sets up was dismantled and discarded that contributing to the lack of dramatic tension and intrigue riddled in this film that left wondering what was the actual story. There's a lot of action\\, some beautifully made others deeply flawed and contrived but nowhere exists a storyline with coherence. \\n\\nI am advised that people love the unexpected turns made in this film. The Star Wars fan in me is repelled by many of these as it destroys and not lovingly so the very fabric of what Star Wars is. Ok so we need new films with new ideas\\, great\\, but why include fragments of the old which were only to be used as background furniture or to be fundamentally ripped apart and become unrecognisable. \\n\\nFundamentally the film is boring. The central plot taking up the whole middle of the film is the least excited and least plausible chase in the history of cinema. Resulting in a subplot to casino planet that leads to exactly to advancement to the story or character development. We also get to enjoy the quickest and least tense mutiny ever seen which seems completely avoidable and entirely contrived to give Poe something to do while waiting for Finn to come back from his completely pointless mission. \\n\\nLuke Skywalker never shows up in this film. Instead we saw a doppelganger that somewhat resembles him but simply is not Luke. A fact that Mark Hamil confirms. A great injustice not only to fans but also to the legacy to a great fictional hero. Disney is hell bent in destroying the old to make way for the new. Good storytelling and character development are also victims in this process. To do the unexpected is now applauded over coherent transition between films. \\n\\nThe dark side has won. Disney pulled a Palpatine on us and took Star Wars down from the inside\\, while the critics apluade and the money rolls in\\, Star Wars died and only a few people noticed.","true":true}