{"101487":179194,"Last Jedi":"Last Jedi","2017-12-15":"2019-09-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The storyline of this poorly written movie selfishly disrupted the entire trajectory of the sequel trilogy. All viewers should be bummed by how they chose to tell this story\\, wasting years of built up excitement. \\\"Luke\\\" Skywalker was totally thrown under the bus and I have taken great offense to this choice. \\n\\nYou just don't change a core character like this and you CERTAINLY do not scold fans for not liking the direction. This is clearly the result of a rushed job\\, with no accountability at all coming down from the top. This movie had so much anticipation and it frankly wasted all of the potentials. The fact that Phasma dies so easily and the lack of character development leaves me wanting for me. Maybe in another dimension\\, this movie works\\, but in this one\\, it fails. \\n\\nI think the big takeaway is\\, when a director comes in and literally throws away all recommendations on how to make a sequel to one of the most anticipated movies of modern cinema history\\, you don't let them go off the rails. I believe there are more qualified directors out there that can work within the Star Wars universe. The studios are a good ole' boys club and talent is being overlooked. \\n\\nWhy was Rian Johnson given another opportunity to make another trilogy? This is pure privilege and I'm upset Disney haven't given this opportunity to a director more deserving. With all this talk of diversity\\, it would be nice to see Disney actually walk the walk and explore granting other directors the opportunity. How about Taika Waititi or Peter Ramsey? Ryan Coogler? Ava Duvernay\\, Barry Moore Jenkins? Antoine Fuqua?!?!Steve McQueen?! Alejandro González Iñárritu\\, Alfonso Cuarón Orozco?!*\\n\\nWhiteness has protected him and made him edgier\\, even going as far to insult the fan base. Hollywood proves itself once again as the good ole boys club and it's painful to see great cultures like Star Wars being destroyed. This has set back the franchise generations-- the youth don't love Star Wars like youth of past. ","true":true}