{"101487":129557,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am not reviewing this as a standalone movie\\, rather I am reviewing it as a Star Wars film. This is because as a movie it's well made. However\\, I have never been so disappointed as a fan of the series. Here is why. \\n\\nThis movie is predictable. I think that one word sums it up. While it may take artistic risks\\, the film takes zero chances as far as its plot or characters go. Spoilers ahead. \\n\\nIt starts off well by setting an interesting premise. But very soon we begin to discover the invincibility factor of our main characters. The moment I was taken out of the movie was when Leia survived being shot into space. From that moment\\, I knew it was evident that no main characters would die. Other than Luke. And I think we all saw it coming. \\n\\nAll sense of urgency was lost because of the aforementioned point. There was not a single scene where I was concerned for the characters because I simply knew they would be okay. Is Finn gonna be executed??? Of course not! Is Rose gonna die because she sacrificed her life in an explosion??? Nope! Just like how Disney handled Marvel's Civil War\\, they will not let these characters die. Because in doing so they eliminate future installments that involve them. \\n\\nSo\\, I didn't feel worried for any character at any point\\, except for Rey. I thought that the connection between her and Kylo was BRILLIANT. It should've gone more places and having Rey join him would've been a twist that filled the void of Snoke being killed off so easily. Honestly\\, what a horrible way for a character to die who had been built up so much. Of Rey had joined Kylo afterwards\\, it would've redeemed the whole movie. But no! Rey is too \\\"good\\\" for that and the film takes the predictable route of her saying no to him. \\n\\nNow that Snoke is gone\\, I feel like Kylo is a very underwhelming villain. We know he can barely hold his own against Rey (who is apparently God incarnate in this series). Where do we go from here? Some plot twists or meaningful character deaths would've given this movie such a greater weight to it. I am not excited for episode 9 and for the first time I will not be seeing a Star Wars movie when it comes out. \\n\\nI feel as if this movie suffers from the opposite problems that the prequels did. While the prequels had a great premise and lore behind them\\, the execution was awful (in terms of acting and dialogue). Here\\, the plot seems forced\\, there's too many Deus Ex Machina moments\\, and the way certain characters are portrayed seems downright forced. But the execution was excellent. That's why I hate to hate this movie. It's a decent film. But this is NOT Star Wars. Sorry Disney. Disappointing.","true":true}