{"101487":180774,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This episode was the most conflicting among all the other Star Wars film ever produced. The movie can be described as both excellent and a travesty. It was visually stunning but also dull. Characters were both so rich and yet so poor and unnecessary. The plot was solid but then again so fragile and the ironic thing is that this movie has the longest run time among the Star Wars franchise and yet it feels so lacking and inadequate. I left the cinema unsure of what to feel\\, I did not sleep for over two days thinking why it felt this way. I feel so lost in my thoughts that I found the focus I needed to do proper work on my on the job training. But then today\\, it hit me. In a sea of unknown and conflicting variables I found the one constant that made this movie so horrendously beautiful...\\n\\nConflict.\\n\\nIt was\\, after all\\, the theme of Episode VIII. It was made to create conflict not just with the visuals or the plot or it's characters or the overall whirlwind of emotions within the movie or even between the critics and fans of the Star Wars franchise but also within ourselves. And I believe this is what makes the movie a brilliant piece of cinema masterpiece and a sure classic in the coming century. A film with the capacity to reach out unto the audiences' emotion and create confusion and apprehension. Not even hate or love but pure conflict it's as if we've been Jedi mind tricked by Old Ben Kenobi into leaving the alien pub and rethinking our lives.\\n\\nI would've given 'Star Wars Episode VIII: The Last Jedi' a full five stars if it wasn't for Rose. She's just too much of a nuisance. She's like the Jar Jar Binks of today's Star Wars generation. Seriously\\, she's one annoying rebel scum.","true":true}