{"101487":189767,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To say that I was disappointed by this movie is an understatement.  I wanted so badly to like...no to LOVE it\\, but I left the theater really disliking it.  And\\, as time goes on and the more I think of it\\, the more I grew to actually HATE it.\\n\\nCaution: Spoilers ahead...\\nQuestions raised in TFA are completey ignored or glossed over.  Who is Rey?  A nobody.  Who is Snoke?  No idea.  Why did Luke's lightsaber call to Rey?  Doesn't matter.   Why did Luke leave a map to his hiding place if he didn't want to be found?  Good question.  Why is Luke in hiding? Ummm\\, how about he tried to kill his nephew?\\n\\nInstead of working on developing Rey\\, Finn and Poe we are given some new characters in Holdo\\, DJ and Rose. \\n\\nI really liked DJ\\, but he was barely in it.  Holdo was ok\\, but just ok.  \\n\\nRose on the other hand\\, made me yearn for Jar Jar Binks.  She was a poorly acted new character that I grew to despise as the movie went on.  She served no purpose and it may be said that she is even the reason Luke is dead.  Rose was irritating and pompous\\, lecturing Finn about all kinds of social issues and then gives him a cringy kiss at the end of what should have been his shining moment\\, but she ruined that too.\\n\\nThe SJW was really heavy handed in this movie.  I didn't care for the preachy tone it set and I cared even less for the messages of income inequality\\, capitalism and feminism throughout.  This is a Star Wars movie\\, not a campaign speech.  Save it Disney.\\n\\nI cannot imagine that I'll change my opinion of this movie over time.  I really have no interest in any other so-called \\\"Star Wars\\\" movie coming from Rian Johnson or Disney.","true":true}