{"101487":170333,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star wars the last jedi should have been called The last star wars- \\nto me this was the worst starwars of them all lets break it down- we hear that episodes 7\\,8 & 9 are bing made- wait 2 years only to see luke for 5 seconds and then wait another 2 years to see a depressing luke who has zero relationship with his past self. he is a guy who turned vader back to the light but in this case he decides to kill his nephew who has not turned- thats poor directing- thats not luke. The force projection was made up just for this movie-\\n\\nSnoke- an amazing potential with this character only for him to die so early with no back story- we are left with poorly trained Kylo who isn't that powerful\\n\\nthe fin gambling area- why didn't Lando have a cameo here but more importantly why was this even in the film- should have killed Finn off he was boring\\nRey: after we see in the lead up to episode 7 we have luke saying the force is strong in my family- My father had it- I had it my sister has it- you have that power to- he was speaking to rey he wasn't speaking to kylo- but now it appears theat rey is a nobody. the past 7 episodes were about family and the skywalkers- it seems that the director has gone through all the fan theories and write a story that made them all wrong- the problem is fan theories are from people who are fans - this show was no service to the star wars fan\\n\\nI walked out of this starwars stunned\\, depressed and sad. I waited 2 years for this pile of steaming Sh!t.\\n\\nno lightsaber duels- I mean what the hell\\nno knights of ren story\\nLeia did a mary poppins \\nR2D2 was almost non existent\\nthere was no team- all the characters are individuals - in the original you had han\\, luke\\, and chewie- in the prequals you had master and apprentice- in this they all do their own thing- theres no friendships\\, no togetherness - no adventure and connection to the past 7 episodes- all the mysteries of episode 7 were basically chewed up and spat in our face.\\n\\nso disappointed. a half star because it would not let me give zero. the worst starwars film to date (including caravan of courage) \\nI feel I was conned into buying sa ticket from reading the reviews from so called critics- they don't know what they are talking about","true":true}