{"101487":196983,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Why didn't Luke know how he was found if he left a map to his location? Why did he leave a map if he didn't want to be found? Why would he go to the most force-concentrated place in the galaxy if he was shutting himself off from the force? What's the point of that shot where he guzzles milk and give Rey that look of \\\"See how much my life sucks\\\" if he never rises above that terrible existence? Why would Luke say \\\"I've seen this power before\\, in Ben Solo\\, it didn't scare me enough then\\\" if he was literally about to murder a child out of fear? Why does Kylo have a fully functioning lightsaber in the flashback if he has a crappy one now? Did he lose the instructions or something? Why did Luke give Leia disappearing dice? If they were so she could remember Han by\\, why did she leave them on the floor? And why did they disappear? Why did they wait until Kylo Ren had a chance to pick them up before they disappeared? Why would Luke project himself using a lightsaber he hadn't used in over 30 years\\, and just recently tossed off a cliff? Why doesn't every fleet have a small army of hyperspace kamikazes? Why didn't Laura Dern immediate turn around and fly into the bad guy ship if she was already going to go down with the rebel flagship? Why didn't any of the Rebels tell each other their plans? Poe Dameron should be in jail\\, or at least in a military tribunal. Why did Finn and Rose feel good about what they did on the casino planet\\, when more likely than not they just made sure that the next day all the stable kids and the horse aliens were put under even more brutal restraint? Why did Luke give up so quickly on Kylo Ren when his whole arc in the OT was about redeeming someone everyone else said was irredeemable? Why was Kylo Ren constantly telling Rey to let go of the past when his entire character is boiled down to being mad about the past? Why does projection-Luke do that shoulder-brush after walking out the laser fire? There couldn't have been any dirt on him\\, he was a projection. Was it just to look cool? Did he see that in a movie somewhere? The more I think about this movie the more my brain hurts","true":true}