{"101487":174322,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The film was visually impressive and the music was was very well done. However the music and the visual spectacles cannot redeem this film's plot. There were several holes in the plot\\, which I intend to discuss concisely.\\n1. C 3PO no longer has a red arm like he did in TFA.\\n2. The First Order conquered the galaxy in a few hours.\\n3. Rey received very little training from Luke and fought off several Praetorian Guards.\\n4. The First Order ships didn't light speed their way closer to the Resistance ships that were running out of fuel.\\n5. Vice Admiral Holdo refused to tell Poe her plans without cause which lead to a mutiny.\\n6. Leia is shown to be a powerful force user without any explanation.\\n7. Finn somehow beat Captain Phasma in a duel.\\n8. Kylo Ren was able to kill Snoke without Snoke sensing anything.\\n9. Kylo decided to destroy the Resistance without an explanation after he killed Snoke.\\nThese are just a few of the many glaring plot holes in the story. Another gripe I have with the film is that Luke Skywalker is totally out of character without any good explanations. There was also a great deal of misplaced and quite cringy humour in the film. The film seemed to go out of its way to completely ruin mysteries from the TFA with unsatisfying answers or no answers. There were also several moments in the film where political agendas were obviously being pushed in annoying and obnoxious ways. There was incredibly little development of any of the new characters from TFA. While I am not a serious Star Wars fan I do watch the films quite often and this one feels totally out of place and weird. I don't know what Disney execs thought was so amazing about it and I don't particularly care\\, because I don't have to watch this film ever again.","true":true}