{"101487":170308,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi (Non-Spoiler Movie Review) What can I say about Star Wars that hasn’t been said a thousand times? It’s a wondrous ever expanding galaxy of adventure that’s captivated generations the world over. I myself am what most would consider a “new age” Star Wars fan. I had seen the prequels as well as the original trilogy; but was never that big on the series to be honest. That all changed two years ago with the premier of The Force Awakens. It sparked a new love for this franchise and everything about it. After that I was hooked and couldn’t wait for the next chapter of this epic saga. Fast forward to today and it’s finally here\\, The Last Jedi. We take our seats\\, the lights go out\\, everything is silent\\, and then BAM! Star Wars flashes across the screen with the score we all know and love. I got chills as I began to read the open crawl in anticipation of what was to come. From then on it was a never ending adrenaline pumping\\, emotion filled thrill ride that kept you on the edge of your seat. There was so much to love about this film. From it’s use of characters\\, both new and old. The multiple story arch’s that played out in the movie. As well as the nail biting tension that built up over time. Of course there was also levity sprinkled throughout\\, just like most Star Wars films. A lot of really funny moments that reminded you that there’s still fun to be had. No movie is perfect\\, as with all film there are good parts and not so good parts. There were certain choices made in scenes here or there that I may not have necessarily agreed with. But at the same time I can appreciate what they were trying to do and the risks they were taking. I can confidently say however that the good tremendously out weights any bad. This is definitely a bold step in the series and I’m very interested to see where they go from here. A lot of this storyline is hard to dive into without getting into spoiler territory. So I’ll leave you with a couple last notes. This movie was great\\, I had a fantastic time\\, and I can’t wait to see it again. Mark Hamill’s return as Luke Skywalker was well worth the wait. And I truly believe that wether you’re a die hard or even casual fan. You will walk out with smile on your face looking to the future of this saga. Rating: 8.5\/10 Thanks for reading! Comment your thoughts below.","true":true}