{"101487":104996,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a fan of Episodes 3.5\\, 4\\, 5\\, and 6 this was a severe disappointment.  All the build up from Episode 7 was thrown over the shoulder and discarded.  Snoke\\, Rey's Lineage\\, Phasma\\, et al.  It was as if Rian had a personal grudge against JJ Abrams and wanted to discredit many of the story elements that he surfaced.  Now JJ will direct episode 9???  What is he left to work with?  Does he follow through on the mess Rian has left\\, or does he try and bring back some of those plot threads.  Disney firing the Episode 9 director was probably in reaction to how bad this movie departed from the SW legacy and they knew that they couldn't upset the fans too much with another disaster.  At least JJ respected the source material.  \\n\\nAs a story\\, this had some good potential\\, but the execution was horrible.  Plot devices were created to move the story along that had no logic or prior reference\\,  Case in point transport ships can now cloak...until it becomes inconvenient and they can't anymore.  WTH???  This is a mild example of the head scratching moments through out the film.  Very lazy writing to get from Story element A to B and then C in my opinion.  There were some interesting ideas\\, but the execution was so poor as to make one second guess all the poor choices.\\n\\nFinally if you are a fan of Luke Skywalker\\, check out what Mark Hamill's reaction to the story and know that I agree with him 100% in how his character was handled.   \\n\\nUnlike many of the 5 star reviewers who created accounts in Dec 2017\\, I am a real persson -  check out my history.  Disney is trying very hard to make it appear as if most fans think this movie is great.  And I understand that there will be those who do like it.  Not this fan.","true":true}