{"101487":140116,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It a watchable film but clearly all the reviews have been paid to say good things. The effects are really good\\, action sequences are well crafted\\, and general the artists have done an amazing job\\, whilst also giving this the feel of the original Star Wars\\n\\nBut the writing and direction is terrible.\\n\\nList of annoying things (spoilers but who cares)\\n\\nCheesy dumb villain phone not working joke at beginning.\\nLeia flying through space like Marry Poppings.\\nkilling off beloved admiral Ackbar and replacing him with purple hair lady for no reason.\\nPurple hair lady refused to tell anyone the plan\\, they're about to died\\, why is it a secret?\\nPlot being that big ships are too slow to catch the smaller ships\\nLuke milking from space walrus.\\nLuke drinking space walrus milk and looking at the camera like a sex pervert.\\nLuke being bested by girl with no training.\\nLuke being a miserable cry baby.\\nYoda showing up as ghost and telling Luke all the Jedi knowledge is pointless\\, then burns the building with lightning.\\nJedi knowledge books existence and the fact they're stored in an old hut guarded by space nuns.\\nFurry penguins turning chewy into a vegetarian.\\nOverly long casino scene\\, with f**k capitalism undertones.\\nPicking up random guy from casino prison who just happens to be a \\\"coder\\\".\\nMary Sue (google it) Jedi girl\\nSith villain killed off in a dumb way\\nRey and Kylo fight kylie Minogue music video extras","true":true}