{"101487":120863,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"fifth attempt now trying to get a half star review bogus activity on here.\\nCongratulations on Disney with another extremely thought out parody. You're imagination and out of this world creative story has the world in tears. Where do you find these magicians who write this stuff. Please give a raise to Whoever thinks up that many plot holes in one outing. You're jokes dialogue and comedy is spot on. I'm glad This epic movie explained the last 35 years to us all. We are so thankful that you turned Arm socket pulling chewie into a vegetarian and slotted a 6 inch penguin in as his falcon co pilot. I have to applaud you lot on the revealing of super snoke before slicing him in half like a melon. You're villains were presented so effectively that I thought I was watching a old scooby doo cartoon. Did you cast the x wing pilots from the local McDonald's? I was so chuffed at the returning yoda from the mental asylum. His bolts of lightning made proper sense. I'm so glad you listened to mark Hamill about Luke he looked like the same man. You made him disappear in the hour of need that was thoughtful. I have to hand it to You. You had the cinema banging with astronaut Leia. That was top stuff right there. You made us care for the characters so much. We owe so much gratitude for leaving a twist or reason at the end to draw me back and interested for the next movie. Is the story written on the back of a matchstick box? I liked the pro woman movement\\, mixed race characters\\, political correctness\\, animal cruelty and you're mixed array of exotic animals. I'm cherished you gave us one of the best moments in cinematic history with the half blasted bunny hopping atst. We are wondering why you finished the biggest blockbuster of the year movie with some random boy who we don't have any idea of who he is. Anyway best parody I've seen ever. Hats of to Disney","true":true}