{"101487":199245,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow. Just Wow. This was a horrible horrible Star Wars movie. The good reviews from the critics were obviously paid off by the real \\\"Evil Empire\\\" Disney. \\nFirst EVERYTHING from the Force Awakens that left you on edge was all for naught.  Therefore\\, if you watched YouTube videos or read fan theory it was pointless. Who is Snoke?  Some great Dark Side user who Palpatine was seeking out? The Dark Side itself? Means nothing\\, he dies in a cheap shot from Emo Kylo Ren. Who is Rey? Is she a Skywalker? A Kenobi? A Palpatine? Nope she is the daughter of drunks who sold her to get their kicks. Even Kylo mockingly said\\, \\\"You mean nothing in this...\\\" almost as a big FU to the fans. How about Luke? He has to do something cool right? Nope nuttin. He does not even swing a lightsaber (in fact\\, there is no lightsaber on lightsaber action). \\nThe First Order always knows what the Resistance is doing to the point of ridiculousness. There are weird Force powers we have never seen in any other movies by characters far more powerful than Ray\\, Luke or Leia. Leia floated through space\\, huh?? Ray and Kylo teleconnectely communicate between each other in ways far superior to Luke and Vader. Oh and Luke walks around as a Force Ghost before dying and then dies from exhaustion. \\nFor all the hate for the Prequels\\, at least they had a story. At least they were believable. At least they went somewhere with their story.  At least they were a good story. This combines all the terrible aspects of the prequels with the worst aspects of both the sequels and  originals into a big pile of crap.","true":true}