{"101487":166359,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Saw this on Tuesday and absolutely loved it. Some random thoughts:\\n\\nIt was definitely a fresh and invigorating take on what had become a little stale and predictable.\\n\\nLoved the new characters of Holdo and Rose. Rose's line about fighting for what you love will resonate into the next movie.\\n\\nLoved that Rey is a nobody and I don't believe that Kylo was lying to her. He is brutally honest and they have a force bond now. She accepts it and the vision she has in the Dark Side cave reflects it back to her. She has denied it her whole life but she knows.\\n\\nLoved the fight scenes\\, loved Rey\/Kylo teaming up--they fought like a well-oiled machine and I hope we see more of that in the next film. \\n\\nLoved how Holdo was a hero and a visionary leader. That light speed attack deserved the moment of silence because it was truly breath taking.\\n\\nHated Poe. Hated how he fucked up twice and was a mutineer but everybody made excuses for him. He is directly responsible for the decimation of the Resistance forces. His character is dead to me.\\n\\nI think the Canto Bight sequence did slow down the movie a little but the message was clear. The rich don't care who wins as long as they are removed from it all and they profit. Rose is instrumental in showing Finn what he is missing and giving him a reason to fight.\\n\\nI'm holding out for the return of Ben Solo in IX. Now that the evil\\, manipulative voice in his head is gone and his uncle's death is no longer a goal\\, what is going to happen? Let the past die\\, indeed. As Luke says\\, \\\"No one is ever really gone.\\\"","true":true}