{"101487":184770,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is gross\\, you'll want a shower after seeing it.  The feel is off\\, nothing about the delicate sensibility or heart remains here.  The best thing I can say about this mess is that it has put Episode(s) 1-3  in proper perspective. This is without a doubt THE WORST EVER Star Wars story and film. What it lacks in story and feel it more than makes up for with complete incoherence.  I have waited to write this after sleeping on it\\, for fear that I might be overly critical\\, but as I have woke up I am only more upset by this \\\"complete abomination\\\" and \\\"thoughtless mess\\\".  Everything seems forced\\, from the humor to the storyline.  Absolutely incongruent.  As sorry as I am for the fans I am equally sorry for the cast that were likely forced to perform this terrible story under contract.  Seems like you can see the shame on their faces.  As for Rian Johnson\\, he's a complete amateur filmmaker.  Not sure if he's a terrible writer\\, director\\, or both. I am leaning toward both.  I have seem many films where it's obvious the story was lost in editing but this isn't the case for the \\\"Last Jedi\\\"\\, it's just junk.   Seems as though he purposely took a dump on everything and every character that the \\\"Force Awakens\\\" set up. Looks like JJ Abrams has his work cut out for him to clean this mess up!  If Disney moves forward with letting Johnson helm the next trilogy Star Wars will be DOA after Abram's Episode 9.  What a shame that these new caretakers have not been true to this epic brand.  If you are a Star Wars fan I know that you will see this movie but I only hope that you will take a moment to rate it on as many platforms as you can.  The irresponsible    people who made this huge mistake must be made aware that ticket sales do not equal satisfaction.  Simply horrible.","true":true}