{"101487":180138,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The writer\/director Rian Johnson should perhaps have consulted the following references prior to embarking on his dismal attempt:\\n\\n1) Screenwriting 101: Mastering the Art of Story\\, by Angus Fletcher\\n2) Star Wars Episode 7 Screenplay\\, By JJ Abrams and Lawrence Kasdan\\n3) Star Wars Episodes 4-6\\n\\nIn the above references he would have discovered a few important facts about screenwriting\\, and Star Wars in particular:\\n\\n1) A movie needs a plot.  The Last Jedi's plot can be summarised as \\\"a really slow chase in space\\\".  What occurs in the first minutes of the film is actually drawn out over the entire movie.  It is such a bad plot that one wonders whether Disney checked the script before shooting it.\\n\\n2) A movie needs a central character.  This movie does not have an identifiable central character that the audience cares about.  The only interesting character is killed in what can only be described as one the crappiest written scenes in history.\\n\\n3) Respect the world in which the characters live.  Apparently Rian Johnson thinks that throwing away pretty much everything that has come before is a good move.  Forget characters that the audience knows - let's just rewrite them entirely.  In addition\\, new abilities suddenly emerge for no apparent reason such as holographic projection using the force and lightspeed ramming ships.  These were totally unnecessary\\, and were used because the \\\"writer\\\" had gotten himself into a hole.\\n\\n4) Complete hanging threads.  Nothing pisses people off more than incomplete threads.  There were many interesting threads setup in episode 7\\, and these were in fact the only reason why I felt a need to come and watch this quagmire of a film.  These were either not even referenced or the thread was so dramatically destroyed by the crap writing that it genuinely makes you angry.\\n\\n5) Subplots should have some relevance to the movie.  Subplots that add absolutely zero to the film are added to this mess\\, and they take up a crapload of screen time.  At the end of the movie you are left wondering if you actually got the point of them or not.... Well let me tell you now\\, there was no point.\\n\\nApparently the \\\"critics\\\" see fit to praise the crap out of this turd burger.  I wonder if there are two versions of the movie and I happened to get the April fool's version (you know the one with all the rubbish jokes and hilarious plot twists)?  That could be the only possible explanation for their high scores.  Well\\, that and utter ignorance of why people want to go and watch movies.\\n\\nIf this film was stripped of the title \\\"Star Wars\\\" it would have absolutely bombed at the box office.  It is insulting to the audience's intelligence.\\n\\nI took my daughter to watch this movie\\, thinking it would be great. Less than halfway through she said\\, \\\"Daddy\\, I don't like it - I want to go home\\\".  How apt.","true":true}