{"101487":130946,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't know what can i say\\,for me this movie is a copy of Empire strike back and Return of the jedi put together.If it was a solo movie can be a great movie but with all the story of Star Wars in background\\,i can say is nothing special\\,i liked most Justice League...The movie start like in Empire even the scroll at the beginning is similar!Rey go to Luke for the training and like Luke leave to go to rescue Kylo and finish in a trap\\,Snoke died like the most powerful\/stupid being in the galaxy!!But if 2 seconds before you are \\\"playing\\\" with Rey with the luke sword\\,can you forget it was at your right?? And he want to rule the galaxy??Another point why Rey didn't kill Kylo on the star destroyer instead of escape\\,he was unconouscious!You don't want to kill him?Capture him!(The war is finished!).Too many gags\\,the Star Wars movies are full of funny moments but this time are too many\\,it seem to see a comedy movie!AH!The best part is for Luke!I waited 30 years to see luke again in action and what they do?Kill him for the effort??!!Yoda was 300 years old luke can't arrive to 66years?I understand they want to introduce the movie to a new generation\\,but ia a necessity you have to kill the original characters!They can't live together??three years ago I read that jj abrams was invidious because he wanted to direct him for how beautiful was the screenplay ... think if it was bad!It don't deserve all the money\\,Justice League was butchered and for me is a better movie","true":true}