{"101487":149321,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Last Jedi 2nd viewing review (no spoilers)  :   I liked the movie in the same way I like fast food...  I enjoy eating it but that does not mean is good nor healthy to eat it.  Is this what we are suposed to expect from the Disney cinema experience?  From big budget movies?  Not worth the money.    \\n\\nRegarding the Hero´s Journey\\, this movie fails every single aspect of it and that is why people won´t care for it.   The hype won´t last more than a few months. Pure marketing stunt based on nostalgia and special effects.\\n\\nI liked the movie but I also like Macdonalds (specially after so much time without having it ) but even so... after 30 minutes you are hungry again... it does not fulfill you\\, because it does not have real nutrients.  Our pleasure comes from nostalgia alone.\\n\\nStar Wars went from universal themes and an epic mythological story to politics and fake feminism.  \\n\\nIf what you like is action\\, special effects and cheap comedy than this is the movie for you.\\n\\nKathleen Kennedy pissed on the fan base\\, Mark Hamill and the entire world with her distorted view on feminism. For the love of God fire this woman!\\n\\nClearly this is a producer film and not an art film.   Money is the name of this game and artistic integrity is thrown out the window.   I simply cannot believe Rian was in control of this movie.\\n\\nMy major complaints:   ( SPOILER WARNING )\\n\\nDid Luke hit Yoda when Yoda refused to train him? Is that what feminism is all about? Women beating men? Telling men what to do? Isn´t the master´s choice of whom he is willing to teach? Physicaly beating your own teacher because you disagree makes you surpass him? I sense the Dark Side in this movie.\\n\\nI support real feminism by the way and Mary Sues are the antithesis of feminism.   Just to name a few\\, here are some great female fictional characters:\\n\\nEllen - Gone with the Wind\\nRipley - Alien franchise\\nElizabeth - Pride and Prejudice\\nSarah Connor - Terminator\\nImperator Furiosa - Madmax Fury Road\\nAlice in Wonderland\\nWonder Woman - 2017\\nBeauty and the Beast - 2017\\nPocahontas\\nTombraider\\nPrincess Leia\\nMary Poppins\\nPrinces Fiona - Shrek\\netc\\, etc\\n\\nKylo Ren:   Space Columbine Emo.  There isn't much else to say about it.\\n\\nRey ( Mary Sue or Space Jesus ):\\n\\nIndependent woman who lives by herself  in a dessert planet\\nNo parenting needed (how was she brought up as a scavenger?  Force Awakens is also included in this list)\\nNo friends arround\\nProfessional scavenger\\nCan fight 2 men easily with no help required\\nSpeaks fluent Robot\\nSpeaks fluent Wookie\\nKnows how to pilot a ship .\\nKnows mechanic more than Han and Chewie\\nKnows how to use the Force WITHOUT ANY TRAINNING.\\nInstant best friends with ALL OF THE CHARACTERS including Kylo and Snoke (everybody likes her instantly)\\nKnows how to use a lightsaber\\nBeats Kylo Ren in a physical fight\\nBeats Kylo Ren in a moral fight\\nIs disrespectful to Luke\\nBeats Luke in a physical fight\\nBeats Luke in a moral fight\\nBeats Snoke guards \\nGives orders to Chewbacca\\nGets to keep the millenium falcon ( #wookielivesmatter guys )\\nYoda kisses her ass for no reason\\nKnows everything that was on the sacrate Jedi books ( THAT SHE JUST FOUND OUT ABOUT IT  ) .\\nNo temptation to go to the Dark Side\\nLoves a Space Columbine Emo \\nAll of this abilities except that she is extremely fragile\\, naive and imature.... THAT DOESN'T MAKE ANY SENSE !!!\\n\\nActually\\, come to think of it... even Jesus had temptations and moments of despair... She is the worst character ever created.\\n\\n------------------------------------\\n\\nFin: The only one following the Hero´s Journey is put aside as a secondary character... a black man as a comic relief ?   How original !   Waysted character (should be main lead) .\\n\\nPoe:  How a stupid feminist (not all of them are )  sees all straight man. Arrogant\\, impulsive\\, stupid and way over his head. \\n\\nHoldo: Arrogant feminist textbook.  If there wasn´t an archetype for arrogant feminism\\, now there is.\\n\\nRose:   \\\"Save what you love\\\". Fuck the resistance I guess.\\n\\nRian Johnson:   To be fair\\, JJ gave him a mess to follow up.   How to make Rey interesting if she was a Mary Sue?  How to make Kylo interesting if he was a space Emo?  He didn't have much to work with.  Both directors lacked balls to face Kathleen Kennedy and her capitalist and political agenda.   Anyways\\, ALL of them are making tons of money... so FUCK THEM and their excuses!!!   This movie is the new Batman and Robin.   My only hope is that Disney will come arround and reboot the series Christopher Nolan's style.  Before its too late.\\n\\nKathleen Kennedy´s expectation: \\\"Ok\\, so on episode 7 we make them wonder about the origins of several stuff in the movie and then on episode 8 we just throw these questions out the window\\, don´t answer any of it and say it´s time to let go of the past... brilliant! \\\"\\n\\nChewbacca:   Rey's employee and barbeque man.\\n\\nLeia:   Space Mary Poppins\\n\\nLuke:  winning bitter old fart.\\n\\n5 minutes training and then she gives Luke a moral lesson and beats a FULLY TRAINED JEDI.   If you think that time fades training then I sugest you go to a 70 year old black belt martial arts teacher and see how well you do in a fight... trust me you are going to get your ass kicked.\\n\\nKathleen Kennedy and The Power of Marketing \\n\\nor\\n\\nKathleen Kennedy and the Power of Fake Feminism.","true":true}