{"101487":170322,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star wars: the last jedi review I have been going to this special bakery since I was a child\\, they make new cakes every few years. They are delicious! I can still remember the first cake I ate there\\, it was so good! I think the second one was even better. They are always a bit different but they use the same main ingredients in all of them. Anyway I hadn't been there in a while and two years ago I went to the special bakery to try their new cake. I thought it was good\\, it had those same ingredients I love. When i finished eating my cake the baker said to me \\, come back in two years ill have a new cake you are going to love! I'll put some chocolate bits\\, caramel bits and a few surprises in there. I left the special bakery thinking mmm I can't wait for this new cake. Last week I go to my special bakery to try the new cake\\, everybody was talking about it. I just couldn't wait. The baker brings the cake\\, it looks amazing! One of the most beautiful cake I have ever seen! Then I cut a slice and I find out that the chocolate bits and caramel bits that the baker promised are not in there !? I try a bite and at first it tasted ok but then I realized that the main ingredients that I loved from these cakes since I was a child were missing!? I remember thinking\\, well I'll give it a try anyway\\, I'm always up for something new ! I continue eating my cake and find some gummy bears in there\\, the sour kind! It doesn't really go in there! I have a bad feeling about this\\, but I eat it all anyway. I left the special bakery and remember thinking that I was feeling very unsatisfied by this new cake. It had none of the ingredients I loved and new ones that really didn't like. As soon as I got home I started to feel sick\\, I think it had salmonella in it because I've had diarrhea since. I am not going to eat anymore of this cake that's for sure and I even wonder if I'll return to the special bakery. I think I'll wait and see if people get sick first before I try the new cake in two years.","true":true}