{"101487":193975,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Watched the movie opening day. Can't bring myself to watch it a second time. This is the first time I've ever watched a Star Wars movie only once. It will also be the first movie I don't buy. I'm seriously considering cancelling my pre-ordered audio book. I generally like goofing around with Star Wars as an occasional escape from reality. After reflecting on my reaction to the movie for 45 days\\, I have decided I wish they had not brought the original trilogy characters back. What bothers me the most is that I can't seem to let this go and not be bothered by it. I know there are much more serious concerns in the world and it's petty to complain about something so small. I'm writing a review with hopes I can put this behind me and not waste energy thinking about it anymore. I don't want to turn into someone who complains about the movie every time someone brings it up. I just want to not care. I'm sure I will watch future Star Wars movies\\, but I won't worry about being spoiler free\\, it won't be on opening night and I won't expect it to feel special. I understand that someone who watched the original movie at the age of 7 in a drive-thru is not today's target audience. I'm assuming my kids are. BTW\\, my kids seemed to enjoy watching it. However\\, I would like to point out that they seem to have forgotten about it almost immediately afterwards. For what it's worth\\, this is my opinion and I'm really okay if you disagree. Part of me sincerely hopes that I just didn't get it and someday it will click. But I'm taking a break from trying to figure it out.","true":true}