{"101487":143241,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Its not that the Last Jedi is bad. Its that its soo bad...I really don't understand what move the critics were watching with this or if they are just so afraid of Disney at this point that they dare not give it a bad rating? The biggest disappointment for me on this is that after that massive success of Rogue One (I'm not talking about number of toys sold here but more to the fact that it was such a good movie) for someone not to sit back at Disney and say 'Well we've cracked it! This is the formula to make Star Wars great again.' instead they sat back and said 'Well lets not make another one of those!' There is honestly so much wrong with this film I don't know where to start. I think it may actually (whisper it) be worse than Phantom Menace. Phantom Menace had some glaring issues that if fixed would have made for a decent film. There is nothing that would redeem this. Luke hams it up\\, Leia (bless her) dials it in and Chewie is on steroids. I'll not bore you all with the problems with the film but simply choose one of my personal worst moments. The scenes with Snoke in are probably the worst CGI I have seen in any star wars movie. His throne room looks like something out of an original series star trek set design and the cgi for snoke himself is just awful and thats before I even start on the characters role in the movie. So disappointed and the only light at the end of the tunnel is a JJ (I'll do whatever Disney tell me to) Abrahams shaped train heading the way of the Star Wars franchise. Sad times.","true":true}