{"101487":170000,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star wars last Jedi was a fun movie. I did enjoy it even though the story makes no sense what so ever. So many missed opportunity for a really great star wars movie that would have Left a meaningful impressions with fans of the film. To be honest  Rian Johnson really killed a lot of the magic of the whole star wars mythology in this film. The special effects were great some very cool fight scenes. But really and truly the story arks were meaningless.\\nLuke Sky walker was ripped off of the Chance to pass the torch to the next Jedi. Gone are the days of the wise old Master passing on there wisdom to the next generations. Because the next generations know it all already. \\nWhen I was young those scene's between Luke and Yoda and the original film's them selves really had something deep and meaningful to say to the audience. This film had little to say at all. What a surprise that the master story tellers of Disney missed the true essence of what made star wars so great.\\n George Lucas got some flack over jar jar and yes his last 3 movies were not as good as the original\\, but i would take those over this film any day. Clearly  Rian Johnson dId not understand star wars or Have love for Characters or the fans i am not even sure he knows how to write a script how it was even approved is a mystery. \\n\\nMany of the critics on this page have ripped apart movies that had better plots and stories than this one and yet some how this movie gets all there praise Mark Hamill was noticeably upset about the  portrayal of Luke Skywalker\\, and i am not surprised.  \\nSure it was full of beautiful eye candy but who care's for 40 years i have been going back to those original films because at its core the story was powerful  it was moving and thought provoking those movies were rooted in philosophy spiritualism mythology\\,  those movies spoke to people they changed people lives. \\n\\nwhen Obi wan and Yoda were guiding Luke in the films they were also guiding a whole generation of kids and youth at the same time. Special effect were the icing on a very deep cake. And to think that Disney DISNEY some how forgot about  how to tell a good story is mind boggling. I am only focusing on one point one missed opportunity\\, over all this movie had so many problems and they all come down to the Basic  plot\\, story\\, and character continuity in this film and  how they relate to each other not only in the last Jedi itself\\, but with the entire franchise in its entirety. \\nAt least J.J. Abrams. captured the heart and soul  of what star wars is in force awakens.\\nLets just hope he can some how fix this Careless disaster.\\n\\nThank You George Lucas for inspiring a whole Generation with inspiration and hope.\\ni went back to your films to watch them again after this film\\nto relive there magic. and fantastic story telling.","true":true}