{"101487":170450,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars TLJ...was the most painful travesty in Star Wars history and possibly the most nonsensical plot of a movie ever\\, making the ‘phantom menace’ look good. This even made the legitimate worst movie in history ‘The Room’ look like it had a plot of pure gold. I knew Disney had the potential to harm the franchise\\, but never did I imagine they would completely destroy it. The hiring of Rian Johnson was the worst decision ever made and by allowing this absolute mess of a movie come out this way just boggles my mind. I have no idea who the hell would sign off on this being ok to release to the public. Nothing made sense and every single issue that needed answers were non existent or handle so poorly and incredibly lazy! Cop out after cop out. There were two matters that needed to be handled extremely delicately in Luke and Leia and both were just piled on by a steamy dump. Ending the Skywalker legacy in THE WORST possible way imaginable. So many other huge let downs\\, but don’t want to spoil the horrible plot points for those poor souls that still have to see this POS. So hurt and disappointed. The force awakens gave so many alley oops for this movie to be great and after a 2 year highly anticipated dunk fest they just got so savagely rejected. I have never been so upset and genuinely angry over an outcome of a movie before\\, but this movie has glitched my brain. Not ONE single solitary thing to go into episode VIIII looking forward to and has set up it up to fail....hard. J.J. Abram has such an impossible task on his hands to try and clean up this disaster\\, which I honestly do not have the slightest clue how it can be done. Too many things that need to be undone and I wish they could just re-do episode VIII\\, but that would never happen. Special effects are cool and all\\, but cannot mask the stupidity of this BS. Dammit!!!","true":true}