{"101487":143597,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"It's the longest one\\\"\\nI agree Mr. Hamill\\, I agree. The movie drags\\, and considering the side plot with Po goes absolutely nowhere\\, the length feels unnecessary. I could go on all day about why this movie was a mess. Instead of fixing and explaining the weaker parts of the Force Awakens\\, they abandoned everything and replaced it with something far worse. \\n\\nThe map is never explained\\, especially since Luke never wanted to be found in the first place. Characters like Snoke and Hux have their roles sent veering in directions that weren't set up by the previous movie. They were both reduced to a bad joke\\, to put it simply. Rey is still a Mary Sue. Finn is somehow more mediocre in this film than the last. Rose was a bizarre and unnecessary addition\\, who ruins what could have been Finn's most triumphant moment. Her falling in love with him is the cherry on top for that scene. Kylo Ren\\, although more interesting and likable overall in this film\\, had his backstory discarded. Where are the Knights of Ren? What happened to Vader's helmet? Why did Kylo even join Snoke in the first place? Luke Skywalker... Well\\, Luke is an insulting character. His legacy was stripped away. He is reduced to a pathetic cowardly old man who gave up on the entire galaxy. His nephew\\, his family\\, his friends... Everyone. The same man who turned Vader back to the light and faced the Emperor without fear...\\n\\nI could go on\\, but I'm sure you've heard it all a thousand times by now. This movie is the first nail in the coffin for Star Wars. It is an insult to long time fans of the story\\, and too confusing and drawn out a movie for the children the movie is aimed at. I marathoned the Star Wars movies with my girlfriend prior to seeing this movie with her. Believe it or not\\, she had not watched these movies before. You know what happened? She fell in love. She loved the Original Trilogy characters\\, and she loved the Prequels World building and overall story of the rise of Palpatine\\, despite some of the glaring mistakes like Jar-Jar. She even cried after Watching Episode 3. Why? Because she cared about this world and everything within it. Then we saw The Last Jedi... And just like that\\, her love of Star Wars came to a veering halt. I got her into Star Wars just in time to watch Disney snatch that  love away from her. I cannot express in words how empty that makes me feel. \\n\\nThe original Trilogy had the best Characters. The Pre-quels had great world building\\, even though the characters were mixed bag. The Sequel Trilogy has poorly written characters\\, and an empty and poorly established world. \\\"Let the past die. Kill it\\, if you have to\\\" is Kylo's most famous line. It is also Disney's new stance with Star Wars in this movie. as of the Last Jedi. Unfortunately\\, like everything else in this movie\\, they had to flip-flop and could not commit to even that. Why? Right after \\\"Let the past die\\\"\\, we're running right back to the past with the Solo movie a few months later. Which is it Disney? Let the past die? Or cash in nostalgia with the Solo movie and the Force Awakens? You can't have both.\\n\\nI hate to say this. Truly\\, I do. Rian Johnson\\, you have made one of the worst Star Wars movies of all time. One might go as far as to say that the story is now redeemable. I never thought I'd live to see this day.","true":true}