{"101487":146602,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was extremely disappointed in this movie. I remember standing in line with my dad in 1977 with people lined up around the block at an old school single screen theater. What made Star Wars great was the mythological component\\, the forces of good versus evil\\, and the mysterious force that ran strong in the Skywalker family. Episodes 5 and 6 continued fleshing out that mythos with the ultimate redemption of Darth Vader. What disappoints me most is that this movie abandons that storyline altogether and instead is used as a bully pulpit for Rian Johnson to preach his socio-political leanings. Star Wars has always been escapist fun. This movie\\, while technically beautiful\\, abandoned the \\\"fun\\\" of the original trilogy. The director tried to be \\\"funny\\\" but the movie was not fun because the socio-political brow-beating was too blatant. The take home messages of this movie are: 1. Men are stupid. Especially \\\"white\\\" looking men. 2. Women are always superior to men and are the good guys. 3. We need to be vegan and animal rights (even imaginary animals) are more important than human rights. 4. The force isn't good or bad. In fact there is no such thing as good or bad. Except when it comes to men (always bad) and women\/vegans (always good.) Can we please go back to a galaxy far\\, far away where movies were fun and didn't need to beat us over the head with SJW preaching? Also\\, I never\\, ever needed to see my childhood hero milking a space cow. My memories of Luke Skywalker are now tainted forever.","true":true}