{"101487":106278,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"At first sight\\, the film is stunning cinematographically and confusing in terms of characterization and narration. Upon the second viewing\\, you can start discovering so much nuance and so many layers to it. You are beginning to see a beautiful interplay of the characterization with how the story develops. You understand the choices the characters make and empathize with their failures. Everything in the jigsaw puzzle is starting to fall into the right places starting with trivialities such as Holdo's outfilt and hairstyle ending with the pieces of such gravity as Luke's entire arc on both emotional and logical levels. I also enjoyed the metatextuality of this movie with the remaining seven parts of the saga and numerous \\\"quotations\\\" from other cinematographic inspirations. There are still a few parts of the movie I'm struggling to put into the right places in this jigsaw puzzle of a movie but I'm gladly accepting the challenge (the much-baffling Leia's space walk? space pull? - apart from her using the Force finally\\, perhaps we should remember that her birth surname is Skywalker?). Overall\\, I believe the movie is so multilayered that anyone can find it enjoyable: the casual viewer who just seeks entertainment and escapism as well as a hardcore fan giving himself or herself time to find the balance between the extremely strong emotions. To the TLJ naysayers following the formulaic online hate and labels: \\\"You must unlearn what you have learned!!! You will know good from bad when you are calm!!!\\\".","true":true}