{"101487":199065,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow. As a Star Wars fan who was hesitant about Episode VII my faith was restored in the franchise with J.J. Abrams. Especially after the wreck that was the prequels. Even though Abrams' movie was a rehash of some things from A New Hope it still felt fresh and well-executed. The Last Jedi is a different story. *Spoilers ahead*\\n\\nPLOT: The plot is a weird mish-mash of two things. \\n\\n1)The rebel alliance is caught in the slowest cop chase of all time. \\n\\n2)Rey finds Luke and wants to train to become a Jedi\\, which she does rather quickly. \\n\\nKylo struggles with being good or bad and talks to Rey through Jedi Skype. Luke struggles with wanting to kill of the Jedi because of what Kylo has become. \\n\\nSUBPLOT: Meanwhile\\, Finn and Rose go out to make a prequels-esque subplot to help the main plot even though no one knows about it. \\n\\nDIALOGUE: Every character had some form of exposition baked into their lines. You could literally watch this with your eyes closed because the characters explain what's happening\\, why the other character did something\\, and what's going to happen. The dialogue is corny at times\\, which is Star Wars\\, but it usually it's corny and charming. Here it's just corny.\\n\\nCHARACTERS: New characters fall flat. There's too many of them and they don't give the new characters from The Force Awakens enough room to explore. Rose adds a love interest that is not interesting\\, the penguin seals are the new Ewoks? Nah they're just kinda there to be cute. Those horse humans on casino island? How am I supposed to feel bad for CGI characters we met two minutes ago? Benecio Del Torro was a weird edition as well as Laura Dern. They felt out of place and weren't very likeable. Also Yoda shows up as a puppet which was dope but felt out of place. \\n\\nAll-in-all this movie was too long\\, misused the characters and was paced as slow as the starships were going. This did not feel like Star Wars\\, not because they didn't echo similar plot points from previous movies but because the characters didn't feel true to themselves.","true":true}