{"101487":102774,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A missed opportunity with a movie that could have been so much better. Right from the early going I was left very disappointed because literally the entire first movie was building up to the moment between Rey and Luke and Rian Johnson completely sold out for just a cheap quick laugh on what could have been such a powerful and memorable moment. People had been waiting for years to see Luke again and that scene was handled very poorly. The humor overall felt tacked on and misplaced. Star Wars has always had fun quirky humor but this was mostly poorly timed and written\\, detracting from a lot of otherwise emotional or tense moments. There were definitely some genuinely funny moments in the film\\, however. The overall tone felt off as a Star Wars movie. Looking back it felt more like a Marvel movie with Star Wars characters in it (which I wouldn't be surprised if that was Disney's intention). Then Snoke\\, who a lot of people\\, myself included\\, were looking forward to learning more about and seeing him play a bigger role\\, but he barely moves from his throne and there's zero additional story added to him. All the Sith had been killed by the end of The Return of the Jedi\\, yet somehow he has powerful force abilities and they decide to just never explain that. For this being the longest Star Wars yet\\, it felt like there was not much accomplish over the course of the movie\\, with too many unimportant subplots. \\nOverall I was severely disappointed and feel that this has tarnished the future of the series. There were no doubt some good moments in the film\\, but is by far my least favorite of the series.","true":true}