{"101487":99925,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After seeing the headline top box office grossing\\, and 91% critics score\\, was happily surprised not many in the audience 51%\\, like this person were so entertained.  A good trend that could give Hollywood reason to change.  I've always been a lukewarm Star Wars fan as am not much a fan of fantasy scifi\\, superhero comic book movies\\, and weapon\\, battle\\, and explosion\\, heavy CGI action.  The early movies were fine but that kind of stuff soon bores me without a good plot\\, screenplay and character development.    Of recent 2017 scifi films\\, Arrival and Bladerunner 2049 were immensely more entertaining.  \\n\\nI did not like what they did with Luke Skywalker because whatever brought him to that behavior was not adequately explained.  Instead much \\\"The Force\\\" mumbo jumbo magic jargon as Star Wars moves closer to superhero comic and Lord of the Rings scifi fantasy movies.  I thought the movie wasn't well focused with too disorganized with characters and sub plots.\\n\\nConsider how only the space ship the rebels had were protected by some kind of force shield?   Something bored from Star Trek but immediately creates huge imbalances in reality of that genre universe as everything else is readily blastable.   The whole chapter at the casino planet with the master key person was like incoherent versus the rest of the film and that person ended up having unconvincing super hero powers.  And then Princess Leah surviving the destruction of the spaceship flying back through vacuum space apparently because \\\"The Force\\\" was with her?","true":true}