{"101487":149011,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Kylo Rant\\n\\nDid I hate The Last Jedi? No! Did I like it? No!\\nThere is a lot I found was done without regard and respect for the earlier episodes.\\nKylo Ren's helmet was part of him and It probably will never be seen again after he destroyed it single handedly. That epic last scene in The Force Awakens is made a mockery of when Luke flicks the lightsaber over the cliffs edge. I almost see Rian Johnson laughing writing these scenes. Talk about laughing... is this a space opera or a space comedy? There were so many supposedly 'funny' moments it could almost be called: Spaceballs 2: The Last Jedi. \\nIt brings me to those Porgs... not funny and in too many scenes. It was great to see Yoda but why oh why\\, when he is laughing\\, does he have to tramle his feet like a kid? That's not jedi master like and again... not funny! BB-8 driving an AT-ST? Hilarious! Not! The movie starts with a 'joke' as well. Poe having Hux on the line and pretending he can't hear him. \\nThe story... what story? A group of ships is hold captive and only a hack of the hyper space tracker can save them. Seen it before? Sort of... the Falcon was held at the Death Star and someone had to get the tractor beam out of commission before they could escape. More familiar looking scenes? What about the trenches and AT-AT's on Crait? With that salt layer looking like snow? It looked okay though\\, better than\\, prequel looking\\, Canto Bight. \\n\\nThen there was all that barely used rebel talent. Poe? Almost invisible! Chewie? Waiting around for Rey to convince Luke to join her. \\nThen there is all the dying. One of my childhood heroes is disposed of much like the saber Luke tosses away. Admiral Ackbar dies\\, is mentioned once and that's it. Snoke\\, the guy who had people guessing 'is he vader? Palpatine? Windu?' Never mind\\, he's dead now. Move along! All he ever did was sit in a chair anyway.\\nSo easy to be a writer and with one stroke of the pen kill an interesing premise. Johnson does it again with Rey's parents. Is she a Palpatine? A Kenobi? A Skywalker? No\\, her parents were nobodies. Move along! \\nBut the biggest cock up is the fact that Luke dies\\, alone\\, on Ahch-To. He's not starting an academy\\, no he's dead! After a completely awesome lightsaber battle with Ren? No\\, nothing. They stand around for a bit just to stall. And then he dies elsewhere. Move along!\\nWas it all bad? No! I love the new generation (Poe\\, Finn\\, Kylo and Rey). But give them a more important role! Give them depth. I loved Williams' score\\, always giving me goose bumps. But to be honest... that's about it. J.J is coming back for Episode IX\\, let's hope for an ass kicking final.","true":true}