{"101487":196142,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"When I watched The Phantom Menace on opening night the massive let down changed how I watch movies. For years afterward I'd only watch something after critics I trusted gave the thumbs up. The second and third prequel I only watched on fast-forward between light saber battles. I was still a Star Wars fan\\, but not a prequels fan.\\n\\nThe Force Awakens was an overly safe retread of A New Hope\\, practically a fanfic reboot of ANH\\, but I enjoyed the characters\\, pacing\\, and setting enough that I was excited to see Rogue One which in turn exceeded expectations and is in my top 3 SW movies easily. Thus I was once again eager to see a SW movie before TLJ. But The Last Jedi was the worst Star Wars movie I've ever seen. Worse than the Ewok spinoffs even. I am dumbfounded as to how professional movie critics were able to give positive reviews for this drek. It failed as a stand alone movie and if failed even harder as a component to a franchise.\\n\\nThe plot points of TFA are discarded. Everything you cared about in TFA is tossed aside. \\nThe setting canon is shat upon in such a way that Midichlorians seem like a forgivable quirk compared to hyperdrive kill engines that invalidate every single space battle and super weapon ever. \\nThe pacing is awful. The space chase was in competition with the casino planet as the most boring and pointless thing to sit through.\\n\\nI'm not watching Solo\\, or Ep 9\\, because of Rian Johnson. He wrote TLJ. He directed it. And that's where all the failure lies. He betrayed trust in that the setting had any sort of continuity. If there's no trust in that the stories will make a lick of sense or be coherent from movie to movie\\, then it isn't franchise anymore. It is just a pile of special effects. There's no future in being a Star Wars fan anymore thanks to Rian Johnson.\\n\\nIt's ridiculous to blame the scorn TLJ receives on backlash against social justice warriors. I love seeing a diverse cast\\, but this was just a bad movie. If it wasn't a Star Wars movie I'd just say\\, yuck\\, what a stinker. But as a part of a beloved and powerful franchise\\, it is the Highlander 2 of Star Wars. The only way forward is to ignore it and joke about it never happening.","true":true}