{"101487":183288,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is what the most beloved example of the archetypal struggle between good and evil we have has been reduced to? \\n\\nThe people saying that they liked how they 'humanised' Luke in this movie don't understand the power of the Hero's Journey story arc that Luke travelled on throughout the OT. He already was severely tested\\, learned important lessons and overcame the temptations of the Dark Side\\, whilst also never giving up on the hope that his Father could be redeemed and be turned back to the light. They may have deliberately butchered this beloved character to diminish his story's power in comparison to Rey's\\, or they simply needed some way of explaining Kylo's fall to the dark side. Another explanation would've been to blame his parents somehow and maybe they didn't want to go there. Either way\\, its totally out of character how Luke dealt with Ben. Fitting well known established characters into a nonsensical plot\\, rather then basing the script on how these characters would think and act does not make good film making. \\n\\nI could talk about the plot holes and pacing and humour and tone but it's all been said by others. The editing is way too fast (like all modern movies)\\, presumably because they don't want to give the audience time to think too much. \\n\\nYes it's only a movie but people are so pissed about this because its shitting on something they love so much. I've been compelled to write my first ever comment on this website. If Disney had made their dumb Marvel-like movies without the disrespect shown to Luke in particular I wouldn't have minded nearly as much. However\\, their treatment of that character is unforgivable.","true":true}