{"101487":200033,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"You have to hand it to Rian Johnson. He’s a brave\\, brave man to take Star Wars in such a different direction. There’s a lot to process here\\, which is why I’m reserving a full five stars. Rey’s parents being nobody. That works for me. Everyone who’s everyone in Star Wars doesn’t have to come from someone significant? Rey is great on her own\\, as she’s always been\\, and I think there’s some poignant significance to that. Snoke unanswered questions don’t bother me either. We’ll likely find out someday\\, but this movie’s focus is more interesting when it’s centered around the conflict Rey and Kylo are having with their respective mentors. Where Snoke comes from honestly doesn’t concern me. I think this will be more appreciated on repeat watches. I know I missed some fun details foreshadowing Luke’s Force projection because I was so caught up in the moment. Sure\\, the humor falls more often than not\\, and SuperLeia was just awful. But I would’ve been a helluva lot more upset if Leia died and we didn’t get a moment between her and Luke\\, even if Luke technically wasn’t “there.” First thing I said walking out of the theater was “this sure is going to be a polarizing film for fans.” But if you complained that TFA was “too similar” to the originals\\, you absolutely cannot complain that TLJ is “too different.” Some people just can’t be pleased. ","true":true}