{"101487":108297,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-12","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Barring all the storyline problems established in The Force Awakens\\, the story for The Last Jedi was sub pare for a Star Wars movie.  The plot crisis in the last Jedi was the rebel fleet running out of fuel during a high-speed chase.  The entire movie outside of the Jedi Sith storyline was the characters attempting to resolve that problem.  When that crisis was finally resolved near the end of the movie I was left wondering why it took Laura Dern's character so long (and so many destroyed rebel ships) to decide to crash her sip into the First Order's\\, when we know she was already planning to sacrifice herself.  From there the movie ends the way The Empire Strikes Back begins.  A battle on an ice planet\\, with the rebels backs against a wall.  AT-AT's face off against a meager fleet of unique rebel craft's that we've never seen before nor will we ever see again.  And as the imperial force takes the base the millennium falcon flees with the last of the survivors.  \\n\\nEven more disappointing was the Jedi storyline.  In which a disappointing rendition of an older Luke Skywalker Consistently refuses to teach Ray the force.  The back story reviled to us about Luke and Kylo Ren was no more involved than what was hinted at in The Force Awakens.  Although the filmography attempts to mislead the audience briefly perhaps with the vain hopes of a plot twist in mind.  The growing bond between Kylo and Ray had the buddings of proper intrigue but will requires the 3rd movie in order to be fully flushed out.  Then there was Ray's communion with the dark side which was very reminiscent of the cave on Dagobah.  It was almost interesting\\, but seemed designed exclusively to do just that.  Pique the interest of the viewers...  And perhaps set us up for yet another plot twist in the 3rd movie?  All of this is still over shadowed by the question on everybody's lips after the movie was over.  \\\"Who is supreme leader Snoke?\\\"  A good question since as far as we know all the Sith were destroyed before the prequels.  With the exception of Palpatine's master of course.  While there is plenty of room for a justification\\, a justification is necessary.  \\n\\nOh well still better than the prequels I guess.","true":true}