{"101487":117926,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Empire Strikes Back received bad reviews on it's initial release. Now it's considered one of the greatest films ever made. We'll have to wait and see what history makes of the last Jedi.\\nSeriously though the negativity here is really bringing me down. Go and make a better star wars film yourselves.\\n Rey can be predictably related to a main character\\, in a place as big as the universe\\, maybe we could have another death star to blow up with x wings\\, akbar can have a dramatic death scene where he slowly closes his eyes and whispers may the force be with you and blows himself up with half of the first order. Luke can be exactly the same as he was 30 years ago\\, forget that in every version of the expanded universe he turned to the dark side if only for a brief moment. He's invincible and anything that makes him more human is terrible. Snoke should be the emperors force body swap \\, or darth plagueis\\, and they should have saved him for episode 9 for the attack on starkiller base 2. Then finally rey should save kylo ren her long lost twin brother as kylo throws Snoke to his doom. Doesn't that sound better?\\nOr maybe\\, just maybe\\, we could try something new? No? Nevermind I'm sure all this negativity will inevitably change the way episode 9 is made. And we'll end up with a crappy lukewarm nostalgic fuzz fest that'll please everyone and accomplish nothing. Thanks everyone\\, you definitely know what's best","true":true}