{"40636":"39872","TLOU2":"TLOU2","2020-08-05":"2020-07-07","10":2.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"1편 안해도 전 아마 점수 낮게 줬을거 같아요. 그만큼 스토리가 쓰래기 같았기 때문이죠. 게임 플레이도 점점 하다보면 지루해지더라고요. 전투가 다들 비슷하고\\, 질질 끌어가니까 귀찮아서 그냥 easy 로 끝냈어요. 그래픽은 진짜 환상적이였는데\\, 전 좀 나이가 있어서 인지\\, 그래픽 같은건 뭐 별로 신경 안쓰고 게임하는 사람이라\\, 처음 들어가는 곳에 \\\"와아 멋지네\\\" 하고 나서는 그냥 뭐 다 그게 그거 같더라고요. 스토리 불평은 워낙 많은 사람들이 말해온지라 제가 안말해도 아마 다들 아실거예요. 전작을 한 사람이라면 이게 그냥 우릴 먹칠한게 아니예요. 진짜 조엘리 팬들에 똥칠한격이예요. 전작 진짜 잘 만들어서\\, 내가 조엘이게끔 감정이입 시켰으면서\\, 이 게임에서는 뭐 거의 내 손으로 조엘을 죽이게 하질1편 안해도 전 아마 점수 낮게 줬을거 같아요. 그만큼 스토리가 쓰래기 같았기 때문이죠. 게임 플레이도 점점 하다보면 지루해지더라고요. 전투가 다들 비슷하고\\, 질질 끌어가니까 귀찮아서 그냥 easy 로 끝냈어요. 그래픽은 진짜 환상적이였는데\\, 전 좀 나이가 있어서 인지\\, 그래픽 같은건 뭐 별로 신경 안쓰고 게임하는 사람이라\\, 처음 들어가는 곳에 \\\"와아 멋지네\\\" 하고 나서는 그냥 뭐 다 그게 그거 같더라고요. 스토리 불평은 워낙 많은 사람들이 말해온지라 제가 안말해도 아마 다들 아실거예요. 전작을 한 사람이라면 이게 그냥 우릴 먹칠한게 아니예요. 진짜 조엘리 팬들에 똥칠한격이예요. 전작 진짜 잘 만들어서\\, 내가 조엘이게끔 감정이입 시켰으면서\\, 이 게임에서는 뭐 거의 내 손으로 조엘을 죽이게 하질 안나. 조엘리 둘다 4년간 뭐가 있었는지 설명도 없는채 플레이어 한테는 개똥 같은 성격으로 나오질 안나. 그런데 그냥 그 이외에도\\, 만약에 내가 조엘리 상관을 안했다면\\, 진짜 스토리에 뭔 의미가 없게 느끼는거 있죠? 내가 조엘을 안좋아하면\\, 복수는 왜해? 막 복수를 하겠끔 시켰으면서\\, 복수는 나쁘다고 나중에 말하는 꼴을 보면\\, 막 그냥 짜증나고 게임을 하기 싫은 거 있죠? 전작에서는 막 사랑과 희망\\, 뭐 그런 테마가 많았잖아요. 인간으로서 그런걸 추구하는게 보통인데\\, 뭐 갑자기 \\\"아냐 이 게임에 테마는 복수야.\\\" 하고 복수를 하겠끔 팬들을 말아먹었으면서\\, 하란 데로 게임하니까\\, \\\"아냐\\, 복수는 나쁜거야\\\"라고 하면\\, 그 의미가 전혀 부여되지가 안찮아요. 우리에게 선택권이라도 주던가. 아니 진짜\\, 만약에 엘리랑 디나가 같이 살고 있을때 \\\"복수하러 안가겠다\\\"라는 선택권이라도 있으면\\, 한 사람들 진짜 많았을 걸요? 복수가 무의미 한다는 걸 모르는 병따구리는 애들 밖에 없어요. 다들 의미적인 영화나 책 읽고 다 아는 걸\\, 스토리랑 캐릭 말아먹으면서 설교하려 드니까\\, 아우\\, 그냥 짜증나는 게임이였어요.… Expand","true":false}