{"101487":129792,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I bought tickets for myself and three other people for opening day of this film because I had such high hopes for it.  I wanted it to be good.  I left the theater very frustrated\\, confused\\, and angry.  \\nThe Force Awakens went a direction I never anticipated but I was willing to roll with it and accept the new direction for the series.  For example\\, at the end of Return of the Jedi we have our heroes finally victorious and the empire is vanquished along with the sith.  It's the dawn of a new day and there is a whole new world of possibilities as the heroes reestablish peace and order.\\nEpisode 7 starts out right were Ep. 4 does:  there is a huge evil government in power and only a small band of rebels to counter it.  How did this happen?  Where did they get the funding and the leadership?  If the First Order is truly different from the Empire then why do they have nearly identical ships and soldiers (stormtroopers)?  Congratulations Disney.  Now all the blood\\, sweat\\, and tears of the original characters was fruitless.  It made no lasting impact.  Everyone\\, including the Republic\\, just sat around and let another regime rise to power.  \\nBut I tried to set that aside with the hopes that Last Jedi would begin to answer the many questions that Force Awakens created.\\nWho are Rey's parents?\\nWhy is she so powerful in the force?\\nWhy did Luke abandon all of the people he loved to go the that island?\\nWho is Snoke?\\nWhat power did Snoke have over Kylo and how did they form a partnership?\\nWhy is Kylo trying to be like Vader?  What inspired him to turn on his family and go down this murderous path?\\n\\nAnd those questions are just the tip of the iceberg.  I really believed that Last Jedi would give us a wealth of back story.  Here is what we learned:\\nKylo tells Rey that her parents were nobodies.  She has no special parentage. From what we can divine in the film we have no reason not to believe him.  She just happens to be the most naturally powerful force user to ever touch a lightsaber without a single lesson in swordsmanship.  It's like the writers saw that everyone was speculating about here parents for two full years and they decided to say\\, \\\"Surprise! You're all wrong.  Her parents are of no consequence.\\\"  \\nThat brings us to her powers.  I invite you to guess for a moment just how much training did Kylo receive at the hand of Jedi Master Luke Skywalker?  Several months?  A couple years?  Considering that most Jedi Knights were trained for over a decade let's presume that he had at least one year of training with Luke if not several before they had a fallout.  Now tell me how much training Rey has had from any force user.  In Ep 7 she has had no training whatsoever.  She was an orphan\\, left to fend for herself and whatever fighting skills she had were with primitive weapons against other primitive thugs.  And yet\\, in Rey's first battle with Kylo she overcomes his own force power to draw the lightsaber to herself and pull it away from him. Remember how long it took Luke to learn how to successfully move things with the force?  Well Rey is a pro on her first attempt.  Three cheers for girl power. Next we are meant to believe that she can take this burning saber which is nothing like the staff that we have seen her fight with and fend off and then beat Kylo\\, \\\"Master of the Knights of Ren.\\\"  And she does this all the while not even singeing her own garments by mistake.  Next in Last Jedi she finally gets some quality time with Luke.  Exactly how many minutes did Luke spend actually training her in the force?  I just gave that away.  You can combine all of Rey's training from Luke to a matter of minutes.  The rest of the time he's yelling at her and running away.  And he never spends any time at all on the art of wielding a lightsaber.  \\nWhen she and Kylo fight the red guards in Snoke's chamber she not only holds her own but fights better than Kylo does and save him in the process.  Then they again have a force fight over who gets the lightsaber as they both try to pull it away from the other.  And Rey matches Kylo's prowess ounce for ounce.  Rey\\, with her few minutes of training\\, matches Kylo with his years of tutoring at the feet of a master.\\nIn Force Awakens the whole film is based on finding Luke.  Everyone believes he is the solution to help the predicament of the good guys.  The opening writing talks about finding him.  Lor San Tekka talks about him.  Po talks about him.  Leia talks about him.  Han Solo say's\\, \\\"Ever since Luke disappeared people have been looking for him.  He was training a new generation of Jedi. One boy\\, an apprentice turned against him\\, destroyed it all. Luke felt responsible.  He just walked away from everything.\\\"  \\nFinn then asks\\, \\\"Do you know what happened to him?\\\"\\nNo what comes next is the biggest most convincing clue we have that Luke actually went to accomplish something.  He had a purpose in mind.\\nSolo\\, \\\"A lot of rumors\\, stories.  The people that knew him best think he went looking for the first jedi temple.\\\"  \\nHan is one of those people that knew him best.  And he then joins the cause to search for him because Luke is a viable solution.\\nIn Rey's vision of Luke we see him putting his hand on R2D2.  We are led to believe that in that moment he gave R2D2 the greater portion of the map that would conceal his location and lead his trusted friend to him.  After all\\, where did the R2 get the map if not from Luke?  So now that begs the question\\, why would Luke lead his friends through peril\\, risk\\, and death so that they would find him eventually just so he could yell at them and say\\, \\\"I came here to die!\\\"  We are left to surmise that Luke set foot on that island with the full intention of abandoning his friends\\, family\\, and the galaxy.  So why did he make the map?  Evidently so his friends could have fun on the treasure hunt and then join him in his pity party. \\nWho was Snoke?  We never knew in Ep 7.  We don't know how he found Kylo Ren.  We don't know why they formed a partnership.  And so they wouldn't have to answer any of the bothersome questions they just killed Snoke and removed him from the story.  Apparently Kylo is capable of becoming the go-to villain all on his own.  \\nIn Ep 7 we see that Kylo has an obsession with Vader.  Where did he get this from?  How was it developed?  What made Kylo think that Vader's rampage through the galaxy was to be emulated?  Ep 8 tells us nothing.\\nI could go on and on but the point is I was horrified when I walked out of that theater on opening night.  I guess Star Wars just became a kids film that isn't supposed to make sense to intelligent adults.  \\nNearly every male in the film is humiliated and belittled.  It seems Disney is trying to prove that women are better than men.\\nThe biggest crime of all was that they tore the character of Luke to shreds.  The once brave\\, caring\\, smart\\, and talented defender of the common good is now a selfish coward.\\nIf you want a really good look at the pathetic writing of this movie check out a video series on youtube called \\\"A Critique of Star Wars: The Last Jedi.\\\"\\nI hope someone in Lucasfilm is paying attention to post like this from the loyal fans.  You screwed up on this movie.  But it isn't to late for the rest of them.  Please give us a Star Wars with a compelling story and characters we can love again.","true":true}