{"101487":96801,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"1 \/ 10 for me after 2nd viewing. Much worse than first viewing. First time I saw it I was relieved it was not a verbatim copycat like TFA. I loved the play on myths and legends and subverting audience expectations. It seemed clever\\, fresh. \\n\\nThen I just saw it second time an last night. Now I think it is Rubbish. Cardboard characters\\, inchaote plot\\, lazy scriptwriting. And was boring to boot. I left the cinema 1 hour in and played with my phone and got a drink and almost didn't feel like coming back. Never happened before with ANY star wars. \\n\\nHave little interest in what happens to the new characters - they often do random things anyway and are not developed. No consistency\\, no proper motivation\\, not persuasive. And furthermore the hammy humour was often worse than the prequels. \\n\\nAnd Leia Space walking? Luke chucking his saber away right away after being so earnest in TFA. Omniscient' Snoke's laughable demise? A lot of WTF moments that don't fully hit you the first time fully\\, strike you as terrible the second time. For me at least. \\n\\nThe entire film felt like a cartoon like Dragonball or Akira with zany and ever expanding force powers that blow buildings apart. Not star wars in tone..I'm no traditionalist\\,but consistency is important or you lose the cinematic illusion. \\n\\nOnly good moments for me - the touching Yoda scene and Artoo and luke hologram scene which moved me the first time (but had little impact the second time). Everything else I can forget. Hugely disappointing. \\n\\nProbably the only star wars where I won't bother to watch again\\, nor buy the blu ray","true":true}