{"101487":140280,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It feels bit like the producers have enacted their own \\\"Order 66\\\" mandating that all remaining characters and connections relating to the original trilogy get wiped clean so that the franchise can essentially be reset to zero.\\nWhile it wasn't necessarily a bad movie\\, the overwhelming amount of 4 & 5 star reviews by top critics seems suspicious.  I understand someone who does this as a profession won't be romanticizing the originals as much as perhaps I was\\, but this was far a technically sound movie.  Main characters like Rey & Finn were written considerably weaker and with less personality than in the Force Awakens.  The editing was herky-jerky and often confusing.  \\n\\nMaybe many of the reveals were a result of trying to still provide some sort of twist amongst the millions of fan theories out there; but basically everything that seemed to be building towards some large revelation fell completely flat once the cover was pulled off.   While I understood what Rian Johnson was trying to do with some of it within the context of the larger social commentary he was trying to make\\, it didn't make for good sci-fi fantasy in my opinion.  \\n::SPOILERS::\\nNever learning anything about Snoke\\, Rey's parents being junk-dealin' nobodies\\, Luke never leaving the island and essentially committing Jedi-suicide....very anti-climatic in a movie that's supposed to let you escape into a fantasy world\\, no?\\nI know i'm mainly harping on the what were the low points to me.  There were some highlights and fun to be had.  Rey and Kylo Ren fighting together was unexpected and really enjoyable.  Kylo's character in general and his progression in the story was keeping me interested.  Newcomer Rose was extremely likable and impressively played by Kelly Marie Tran.  She and Finn had great chemistry despite Finn's character not being written with the same charm as in episode VII.\\n\\nI guess in the end i'm just sad\\, most of what I loved about Star Wars is now dead or fading fast.  I guess I'll have opening scene in episode IX to look forward to when the Millennium Falcon piloted by Chewy & Leia gets blown up by Star Destroyer firing R2-D2 out of ion cannon at them...","true":true}