{"101487":175463,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is right up there as being one of the worst Star Wars films to date.\\n\\nLet's get the positive out of the way first as that won't take long. It's visual a very beautiful film. There you go\\, that's out of the way now.\\n\\nThe story seems to have been written by someone who truly disliked The Force Awakens and somebody who doesn't get Star Wars. So for new and old fans alike\\, prepare to be disappointed.\\n\\nThe story telling and character development in this film is extremely poor. So much is rammed in at no great purpose that it just falls flat. Fin is relegated to nothing more no 'whooping' around on CGI creatures or machines that make you feel like you're back in the dreaded prequels.\\n\\nPrinces Leia's new ability requires you to even further suspend your disbelief (which is a a big ask) before becoming rather pointlessly sidelined.\\n\\nAny problem can be fixed by BB8\\, no matter what which just makes for lazy writing.\\n\\nAny answers provided to the big questions asked by JJ Abrams are done so in the most flippant way which smacks of not caring.\\n\\nThe Casino scenes are rather pointless to the whole film as is Benicio del Toro's DJ. The whole story arc feels badly wedged into the film just to give Fin and Phasma are rather poor and badly edited fight scene.\\n\\nThe Porgs serve no purpose other than to sell merchandise just like most of the creatures in the prequels.\\n\\nThere is no fitting ending for any character. Rian Johnson has certainly done his best to ruin the great work of the Force Awakens and you can only hope\\, he has noting to do with it again. JJ Abrams has his work cut out to pull this trilogy back around as the Last Jedi was truly garbage.","true":true}