{"101487":149991,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Like many many others\\, I created an account just to counter the many fake and highly dubious movie critics who keep giving Disney related movies great reviews. First and foremost\\, I'm not a Star Wars fan. I can suspend disbelief in a sci-fi fantasy. But in terms of plot contrivances and conveniences\\, this film borders on ridiculousness and veers towards cliffhanging moment after cliffhanging moment like a cheap TV movie ploy. Incidentally\\, this was what Luke told Artoo when he innocuously replayed Leia's classic SOS message from A New Hope. \\n\\nThe plot is a mess. Disjointed. Out of focus. Red herrings. Waste of time asking audience members to invest in two non-consequential characters in a meandering wild goose (more like human-faced horse-camel) chase. Many reviewers are right\\, the Casino subplot looks like something out of Harry Potter. \\n\\nThe worst offender is still Leia's Superman-cum-Mary Poppin's scene in space. That one makes no sense. There is of course the subtle theme which is liberal in nature akin to 'Everyone gets a trophy' participation medal mentality. Rey is a commoner\\, she has the force. The boy at the end also shows that he is force sensitive. Leia shows great force potential. So now Social Justice Warriors has seeped into the franchise. Not to mention the forced romance between Finn and Rose\\, the latter of whom\\, is unattractive. I was hoping her more attractive sister would be one of the protagonists. I was so disappointed when she perished in the bombing sequence.\\n\\nIn a nutshell\\, the film is less awe and more about Disney pushing its diversity and SJW agenda. I pay good money to see attractive people not unattractive plump actors strutting about. Ditto for that fat dude from Spiderman: Homecoming. I am sure nutritionists and dietitians can attest to the fact that being fat is unhealthy. Don't tell me about self-acceptance\\, it's about taking care of oneself and these actors are certainly not the right role models.","true":true}