{"101487":151070,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Loved A New Hope and Empire\\, Liked Return of the Jedi but not as good as the ANH and ESB. The Prequels had issues and some really bad dialog\\, but I like\/dislike them. The Force Awakens had some issues definitely\\, but I grew to like it\\, and there were parts I really liked. The last 10 min of Rogue One was awesome\\, overall I liked it. BUT>>>>\\n\\nWhat a horrible movie the Last Jedi was. I've been reading the other reviews and other people (not the critics) have done a very good job of reviewing its problems so I don't feel any need to add to it. I've heard people say the negative reviews are bots. But after reading over 20+ reviews all the negative reviews seem genuine but a few (there are not many) positive reviews remind me of paid for Amazon positive reviews. Things like \\\"Best Star Wars movie ever made!\\\".\\n\\n(also by my count... how does this movie have 51% positive reviews. Any page you go to\\, if you count any 10 views. There or 2-3 positive (3 stars or higher) and 7-8 negative (2.5 or lower) The audience score should be 30% AT BEST. \\n\\nMy biggest problems with the movie are (I can't list them all so \\\"ll give my top 3: \\n\\n1. They turned Luke into a sniveling\\, suicidal\\, coward. That was NOT LUKE SKYWALKER in the LAST JEDI! \\n2. I don't appreciate paying for a movie just to find it was a trap to have someone's personal political beliefs shoved down my throat. I don't care if I agree with the beliefs or not. I paid to see Star Wars\\, not to watch a cable news opinion show. \\n3. This movie will make over a billion dollars in profit easily. Honestly\\, they could not find and pay the best writers in Hollywood to write a decent script? This script seemed like it was written by some kid that thought he could be a screenwriter so he wrote a script. But he has not talent. He just owns screenwriting software. \\n\\nThis was simply a very bad movie. If it had not been a Star Wars movie\\, I would have walked out.\\n\\nI wont see it again\\, wont buy the DVD (the only Star Wars Film DVD I will never own). And I'm turned off from buys anything saying Star Wars on it because I know the money will go to fund more crap like this. I have NO desire to see Episode 9. \\n\\nI'm just waiting for the announcement that JJ Abrams will be dropping out of directing Episode 9. He's crazy if he even tries to fix this mess.","true":true}