{"101487":134083,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I heard great reviews from critics about Last Jedi and have watched all 8 previous Star Wars films.  Obviously\\, I was stoked to see Last Jedi.  And even after I first watched the film\\, I kind of enjoyed it -- mildly.\\n\\nBut after thinking about it more and more\\, I liked it less and less.  There were so many plot holes that I couldn't ignore.  \\n\\n[SPOILER ALERT]\\n\\nWhy did Leia not die in Space like any other normal human being would?  Is she semi-immortal?  She has no actual Jedi training so what exactly made her \\\"float\\\" across space while seemingly FROZEN back into the ship?  \\n\\nDon't even get me started on the last battle scene.  Is Kylo Ren retarded?  After blasting Luke with like a billion laser blasts\\, he doesn't have a scratch on him.  Duh\\, maybe he's a hologram?  Then he fights Luke in a duel and they never touch each other?  And only after everyone has escaped -- DUH\\, he's figured it out!  WOW!  Smartest villain of all time right???  I guess Kylo's just not too bright even though he's suppose to be a badass villain.  But the big plot hole in this scene is the lack of an explanation of how Luke can somehow project his image across planets and galaxies using the \\\"Force\\\"?  I wished they explained this power in the previous 8 films -- would have come in handy in many scenarios.  And how does this \\\"holo-projection\\\" force power work anyways?  How is he able to target where his projection shows up?  Are there any distance limitations?  Seems like they're just making up this crap as they go...\\n\\nAnd the last scene where the Republic ships were picking off all the transports one by one.  Did she really have to wait till there were literally like 2 ships left before the light-bulb went off?  Gee\\, let's turn around the ship and help the transports escape!  Wow\\, what a \\\"legendary\\\" admiral this lady is...duh.\\n\\nBut the worst part of the film wasn't even all the huge plot holes.  It's that they completely rewrote the character of Luke.  Luke was the hero -- the legend -- the hero -- the greatest Jedi alive -- and he always believed in his friends and his family -- he never gave up on them.  Even when the odds were against him\\, he still risked everything to try to save them.  He always sensed goodness in people -- even in his father.  But in Last Jedi\\, they made it seem like he was thinking about killing his nephew because he \\\"sensed\\\" the dark side in him?  Come on!!!  Give me a break man....  That was the last straw.","true":true}