{"101487":136701,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm not a ROBOT & posting only once.  I'm disgusted that shills are trying to say the negative reviews are fake.  Well I signed up to RT just now to share how much I hated this movie.  ** SPOILERS AHEAD**  \\n\\nI saw Star Wars in 1977 with my dad and I was 10 years old\\, so I have loved Star Wars for 40 years of my life.   \\n\\nWhat I liked:\\nThe battle with Kylo and Rey in Snoke's thrown room.   I like how Snoke was assassinated sort of like what would happen in Ancient Rome.   The problem is that Kylo is not a fully developed character toward total evil to lead the First Order.  Perhaps Ep. IX will save this movie.  \\n\\nI hated the following:\\n1.  Luke:  Disney ruined the legacy of Luke and what Lucas set up. Luke deserved better.   Luke was a grumpy old man who has trashed the Jedi order.   Then he becomes a coward and does a force astral projection and dies of exhaustion.  Wow what a waste.   Why not let Luke go out with a more epic way (i.e\\, have Luke in the flesh and Rey be ambushed by the Knights of Ren).  \\n2.  Plot-holes:  Rey is a \\\"Mary-Sue\\\" who can do everything with no training.   Finn -- a sanitation worker -- can take on Captain Phasma who is a trained soldier.   Bombs in space; Light speed ships as weapons;  force ghosts (Yoda) using lightning (why not have all the force ghosts take on the First Order?)  \\n3.  Casino story line:  Waste of time and went know where except to introduce Rian's new trilogy in the future.  Self-serving.   Disney had to go all political with animal cruelty.  I'm on the side against animal cruelty but it just didn't fit and I felt like I was watching the Disney channel sitcom.  \\n4.  Bad\/Forced Humor:  I felt like I was watching Guardians of the Galaxy or Avengers.  They work in those films\\, but not in Star Wars.  Luke throwing his dad's light saber over his shoulder was a huge slap in the face to everyone who loves Star Wars.  It was not funny.  \\n\\nThese criticism only scratch the surface how bad this movie is.  I'm sad to see Disney trounce on the legacy of Star Wars like this.  Again\\, I'm a true fan and not a robot writing this review.  Go see this movie form your own opinion.   But I hated this film and I feel like Disney has just trashed everything to start over with their own thing.  I'm open-minded to go in new directions.  That's cool\\, but this just seemed so much in my face.  \\n\\nMy only hope is that JJ Abrams can rescue this pile of trash.  Give some background to Snoke.  Have it so that Kylo lied about Rey's parents and that she is truly the daughter of a legacy character.  Redeem Luke!!!  Have him so he only teleported away-- not died-- near the end  in TLJ.  Let Luke in the flesh take on the First Order and then die in an epic way.  Have Kylo full evil and not conflicted as he rules the First Order in a heavy handed way.  Have Rey get training by Luke.","true":true}