{"101487":140598,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I think it is unfair to say that either side is 100% on this. To say it is polarizing\\, at best is probably the most accurate. I left the movie just feeling it was ok. I liked Rogue One quite a bit and left The Force Awakens buzzed for the next films. This one left me without much left of that excitement. I will list some of the pros and the cons as I feel I have a pretty unbiased lean.\\n\\n\\n\\nPros:\\n\\n-The Cinematography was great. There was never a point where a scene seemed too light or dark\\, and the scenes were fluid and sets were immaculate. I have kind of grown to expect that level of quality from Disney studios\\, but it should still be listed as a pro. You will not leave it feeling like you watched something jumbled and shake. \\n\\n-Sound track. See the points above\\, but when the score is John Williams you will never question it really. This time is not an exception.\\n\\n-The acting was phenomenal. I would say everyone acted phenomenally. There was no gross over acting or just bland portrayals given on the part of the actors themselves. The actors themselves spruced up some poor writing and direction choices.\\n\\n-The direction the new actors were taken\\, and the way they portrayed it was amazing. The break out of Poe in this movie was something fun to watch. Hux had me rooting for him to usurp control of the First Order with Phasma (more on her later). Finn\\, while having a step back characterization in the beginning took a leap forward later on. Rey and Kylo's dialogues and scenes were acted well and built up their characters a lot and gave both of them clear\\, finite paths. We also got a new intriguing character in the form of a thief. He has a air of mystery about him and left on some intriguing parting remarks. I hope to see more of him in the next film. Rose\\, however while well acted needed to have more characterization. She was given some back story and a sob story attached to it... but we did not get to know HER. The shoe horned in a romantic attachment to Finn which felt... strange.\\n\\n-The droids\\, ships\\, and critters. The technology makes star wars. I loved seeing the return of the A-wing and the addition of the new bombers. They may be a little silly looking but it was nice to see some originality in the ships. The dreadnought was also really cool\\, even if it was punked right away. The crystal critters were beautiful and genuinely cool to look at. The Porgs were not shoved down our throats as badly as ewoks\\, nor were the fish headed caretakers of the island. They were just peppered in here and there to remind you this is an alternate galaxy. The part I liked the most\\, and what some may disagree with me on is the Droids. BB8 is great droid\\, and it was great watching him do everything from repair ships\\, pilot other vessels and act on his own. An upgrade to the R2 unit for sure ( but on par in my heart. ) His moments always left me smiling - not laughing which I feel should be separated. \\nC3P0 got some nice moments\\, including getting his arm back and not having to mention it and shove it down our throats. The most important and best Droid moment belongs to R2. R2 shared the screen with Luke in what was the best scene for Luke Skywalker. He also made real time repairs subtlety to the falcon while Chewie piloted. He did not steal the show but was still the background hero.\\n\\n-Chewbacca got his hug\\n\\n\\nNow for the Cons:\\n\\n-Luke Skywalker. \\\"I am a Jedi\\, like my father before me.\\\" It is hard to believe this is the same character that uttered those words. That character was brave\\, stood up for his beliefs and cared for those he considered compatriots and family. You can immediately tell that will not be the case when he is given his old light saber and tosses it casually over his shoulder. The one in this movie\\, upon hearing that Leia needed him did not want to lift a finger. He was surly\\, broken and more disturbingly cut off from the force. The reasoning behind this mental shift did not make a lot of sense. If when training Ben he had truly sensed Snoke's hold on him why did not try to break it? Why did he not tell Ben's family? He was presumably still close to them. It seemed like a writing hole that Hamill used his amazing acting skills to try and cover. The character did not start acting more of himself until after a FORCE GHOST OF YODA showed up and R2 guilted him with his past. And even then it was only for a brief moment. I personally loved the way he became one with the force in peace and finally reaching out to help Leia... but I can also respect those who wish he had taken after his mentor and stood like Obi-wan before Vader. I guess that would negate Yoda's messages about learning from mistakes. But it seems improbable that someone who had been that cut off from the force could project their being that far across the galaxy or into other's collective consciousness\\, whichever the case may be. If it is even possible. This is new universe so I guess it could be?\\n\\nSpeaking of...\\n\\n-The Force Ghost of Yoda. If someone had to visit him why was that not Vader? If they needed a catalyst to jump start Luke's moral decision making why not Vader. He had grown to respect his father for the redemption and decisions he made. He gave him a Jedi's funeral. A person that more perfectly exemplified duality like this movie was portraying was not Yoda. Especially since Kylo Ren has had an obsession with him. It would have made more sense. The special editions already had Anakin's force ghost there\\, it was not unheard of. Or better yet... have nothing there at all. It felt very shoe horned in and like a fan nod. It took me out of the scene. Self realization would have worked just as well. Or Leia reaching out with her new found super force sensitivity. \\n\\n-Leia Organa. This breaks my heart over and over. Carrie acted SO WELL. But there were no less than three times in this movie I felt that her character could and should have been killed to be an impact but the movie was afraid to take risk. The first\\, is the most obvious. In the beginning when the flagship is shot. We see her body exploded into space. During this scene we lose some important characters to the series including Admiral Ackbar. Leia is also sucked into the Vacuum of space. Rather than immediately dying she is suddenly super in tune with the force-- more so than she has shown the capability to possess in any of the preceding movies. She keeps herself from decompressing\\, dying of asphyxiation \\,or freezing immediately and floats like an angel or religious figure back to the ship with eyes open. It immediately makes everyone gasp and not in a good way. She comes back but is weak and wounded from the blast and is in recovery. This was the second chance to make an impact. Silently allow Leia to pass\\, maybe use the last of these intuned force powers to reach out to Luke\\, Ben\\, Rey someone for a plot impact and then fade. It would have been shocking seeing what she just survived but it would have been surprising at least. Especially when they tried to shuttle her onto a transport and realized what happened while they were fighting over what to do. Third... she should have gone down with the carrier not the Vice Admiral. Died a symbol or hope for those in the transports. Her death could have also been kept a secret while they sought out allies on Crait. This could have served to help Luke's character along too without needing the aforementioned force ghost. It would have been a risk though and I feel like this movie was afraid to take those. \\n\\n-Too many jokes that negated serious scenes: Let me state clearly. I don't care about jokes. I am fine with them. I hated that every time there was a serious moment or something that had implications...it was followed up by Chewbacca with a Porg or a stupid shot of an iron meant to mislead as a joke. Following the near death of Leia\\, a joke. Timing maters. The director did not understand that\\, or maybe it was the editor I am unsure. Either way it needed less or to time these jokes more appropriately so that it did not take you away from the story.\\n\\n-Chewbacca: I wish Chewbacca got more than just pilot of the Falcon and dumb comedy in this movie. This is his first movie without his BEST FRIEND. That had the potential to be interesting character depth and building a bond with Rey... and we got none of it but him picking up a pet. I don't know if it was the director\/writer or all that was edited out... but that is piss poor decision making making. That omission is worse betrayal than some of the unneeded add-ons. They were together for years. Rey clearly projected paternal feelings onto him. It just seems bad. \\n\\n-Snoke: Now this could come back as a positive if he is still alive. ( I have a small hope that he was pulling a Luke and projecting his form there and will return. Otherwise...) But the fact that he was clearly as powerful as he was and could not sense Kylo-Ren turning on that Light Saber is comical. Like I laughed. He just did all this visual displays of pure raw power and then is immediately taken down but a little slight of force...\\n\\nPhasma: Why is she there? To be another \\\"powerful woman\\\" in this series? She keeps getting eliminated in less than 6-10 minutes of screen time. This time with Hux clearly being a semi competent general I was kind of hoping for amazing storm trooper scenes. We got nothing. I hope in the next movie\\, if Finn didn't finish the job this time around... that we get characterization on screen and not just in novels. I want to see her being a leader. Not always trying to gun out in front until she HAS to. \\n\\n-The Casino: Added so little to the story and chewed up screen time. Also had some of the worse CGI moments. It was a cool setting but it went on too long.","true":true}