{"101487":169496,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"**SPOILERS**  \\n\\n:( Parts of this movie were great: The John Williams score is a work of art\\, as usual. Carrie Fisher seemed much more at home in this film.  Adam Driver's performance was excellent.\\n\\nBut overall\\, we walked away disappointed and pissed off.  We were so excited to see this movie because 7 did such a great job of setting up all of these mysteries and plot arcs that we couldn't wait to learn more about. Yet\\, Rain Johnson seemingly found them uninteresting\\, as he basically just threw them all out the door.\\n\\nThe casino story arc was boring\\, out-of-character\\, and unnecessary. Rose seemed unfinished.  Leia flying through space was just terrible. Not enough Chewie.  No lightsaber fights. WHY DID THEY CGI YODA - HE'S A PUPPET THAT DOESN'T AGE. There were countless plot holes and just tons of lazy writing.  The \\\"space chase\\\" premise was laughable. I also found it strange that Rain elected to have so many important moments appear off-screen (ex: killing off Ackbar\\, a fan favorite).\\n\\nThey should have ended the movie with Rey's daring escape from the ship (something else we didn't get to see). Luke's final scene was set up pretty well\\, but then we just get 30 seconds of the Matrix and a terribly lame and disrespectful end to his character. \\n\\nI felt like this was a pretty easy movie to make with the setup from 7 (JJ literally ended it with the passing of the torch)\\, but Disney let Rain run wild and do things to the franchise that even Lucas knows better to not do.  Rain could have made a great spin-off movie\\, but this was one of the most important movies in the franchise.  \\n\\nThere is no mystery left. We all know exactly what will happen in 9.  We were all scared that Disney would do something like this to Star Wars and here you go.  In sum: It's the first '\\\"big\\\" movie I have seen on opening night in which the audience didn't clap at the end.","true":true}