{"101487":158889,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Oh\\, no. What did Rian Johnson just do to Star Wars? \\n\\nHe ruined it\\, perhaps by his own narcissism by implanting his own vision of what the Star Wars franchise should be\\, not what it is. He changed the entire story\\, and not only that but managed to create a 2 1\/2 hour movie that barely advances what should have been a compelling story. Instead he created a different\\, new angle on what he believes Star Wars should be -- and it was awful and confusing. \\n\\nThe Last Jedi felt very little like Star Wars and very much like something else. As the lowest Audience Rated Star Wars movie yet\\, I know I'm not alone in this thinking. \\n\\nThis movie lacked the sense of fun from The Force Awakens without Harrison Ford's humor. The jokes presented in this movie felt forced and uninviting. Most of the jokes fell flat on a silent audience. \\n\\nYes\\, there are some good things in this movie. I loved the return of Yoda -- it makes sense as Obi-Wan and others also have become a hologram with the Force. And what a fun surprise to see Yoda return! But then his cameo was simply to tell Luke that everything we all thought we knew about the Force was not true. No old texts needed\\, things are different now. But why? What?? \\n\\nThere are so many things that went horrible wrong and one of them is Luke's \\\"teaching\\\" Rey of the Force. He didn't do any real teaching or training! He moped around a lot. She went off on her own and swung a light saber around to figure it out herself\\, sorta. \\n\\nThen there's Kylo Ren. Personally\\, I think he's a fantastic actor but the script made him... weak... just not intimidating like Darth Vader. And worse\\, even after killing his father in The Force Awakens\\, Han Solo\\, Kyle Ren still manages to waffle between the light and dark side\\, and waaaaay too easily kills off the big bad Snoke. I thought Snoke was going to be a major bad guy\\, but he was defeated so easily! By Kyle Ren! Noooooo. Just no. \\n\\nAnd perhaps the worst part of all was Luke become a hologram -- without even dying! Or did he die? What the heck happened? Now apparently the Force allows you to appear like you're anywhere and fight people without actually being there. Luke can become invisible or disappear on command. His final scene makes NO SENSE. Waaaaat? Nooooo! That's just lazy script writing. What is Rian Johnson doing to Star Wars? \\n\\nAnd finally\\, we're left to wonder how they can continue this story for another 4 movies. All the interesting characters are either dead or were never interesting. Are they really going to add another trilogy following episode 9? How? \\n\\nI wanted to LOVE this movie so bad but I was so disappointed. If this is what Star Wars is becoming\\, then it's doomed. \\n\\nCan we just pretend The Last Jedi never happened?","true":true}