{"101487":189789,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To sum the movie up in one word\\, Disappointing. Now come the spoilers.\\n\\n\\n\\nI was looking forward to the followup of TFA\\, which I quite enjoyed\\, since it left so many mysteries behind the characters. But no. Ditch the interest about Rey's parents. Ditch the mystery of \\\"Who is Snoke.\\\" Bring in a random character who literally didn't need to exist (Rose)\\, only to push an unnecessary story arc which does not progress the plot at all and to be a ridiculous shoehorned love interest. SOME of the comedy was good but it too felt forced in and it got stale.\\n\\nI really liked what they were doing between Rey and Kylo\\, in how they connected and conversed\\, and to finally fight together UNTIL they ruined it by saying \\\"Haha you thought they'd be interesting characters and might do something unexpected but no!\\\"\\, when Kylo decided to do exactly what Anakin did in Episode 3. \\n\\nI also liked the fighter battles\\, when they were actually battles. The opening was great and so was the Millennium Falcon part on the crystal planet. But having the whole movie be \\\"We're gonna try to run from the enemy until we run out of fuel.\\\" was extremely boring and had nothing to do with the plot of these characters at all. They may as well have made the movie one whole proper space battle\\, with each side having soldiers infiltrate the enemy ships and it would've been much better while moving the story along at the same pace.\\n\\nLeia I think should have met her fate when she went into bloody space. Or if not then\\, she should have stayed behind on the ship to let the others get away. It would have been better for her to die than Luke\\, since clearly the late great Carrie Fisher won't be able to reprise her role\\, unless they do the whole Rogue One CGI thing. \\n\\nYoda didn't need to be there.\\n\\nThere wasn't a single Lightsaber fight. By that I mean both opponents using their weapon. Kylo and Rey vs Guards doesn't count (though that was a great scene) and neither does Kylo vs Luke (since they don't even clash). \\n\\nMark Hamill acted his part well (no surprise there)\\, but Luke's writing was terrible. Why is he exactly how he was at the start of 4? It's as if there's been 0 development since 1977 for his character. \\n\\nI'm sure there are many points I missed out\\, but it just makes me sad to bring them all up. Went in having watched 0 trailers. Wasn't hyped up at all\\, yet I was still utterly disappointed. It get's 1 1\/2 stars because the acting was good by a majority of the actors and visually  the movie was stunning (no surprise there).\\n\\nOh and the hyperspace kamikaze was amazing.","true":true}