{"101487":99960,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After seeing TLJ\\, it took a few days to process because there’s so much going on. People are freaking out over on rotten tomatoes. I think folks may need to breathe & take some time to take it all in. Pure escapism in this maddening time in history. From a certain point of view that is :D This was an emotional ride for me as it was Carrie Fisher’s last film since her passing. I didn’t mind her Mary Poppins flight scene as it was fool to see her use the force. It was so nice to see Mark Hamill back as Luke. It certainly was not what I initially expected as his character was surprisingly curmudgeon. His performance was great with depth & breadth as the story progresses. Incidentally\\, Some folks who read the past novels etc\\, which Disney flushed from the timeline\\, are quite upset by this as Luke’s story was quite different. However\\, for me this rendition was artistic and poetic in its thematic presentation plus evolving interesting character progression. I thought the film was magical and had elements written for a more modern audience. I always take these films for their themes and mythic allegories. This was a tale of failure - consequences of hubris\\, choices (notice how most decisions weren’t always the greatest by the way ;) Symbolically\\, the force is about spirituality\\, the fight between the light + darkness - where actions of decisions lead thus effecting course of our life. Destiny versus freewill. Cause & effect. Some of the story elements were contrived to propel the story. Such as Canto Bight & the slow burn drama picking off the remaining resistance fleet. All a drawn out plot element to create more drama 🙄 Interestingly\\, things could have been different by choices characters chose & action they take - these scenes seem to be made to show consequences & hopefully character growth. Rose says\\,”We're going to win this war not by fighting what we hate\\, but saving what we love.” She gets it\\, this seems a core value of the movie. After that Luke appears things go differently. It’s here responsibility is taken for his actions as he learns\\, leading to one of his great teachings as a master. Perhaps he becomes one with the force as this is his great lesson\\, plus one of the major themes of the film. I’d imagine it would take a lot of mojo to astral project across the universe\\, maybe he drained his chi 😆Way to use a character for thematic purpose. Good to see we can learn even when we are older and can make things right. Looks like Rey\\, took the Jedi Texts in the Falcon! How Very cool is that her character is the heart of doing the right thing. This is our new hope! Loved the nuances & throwbacks. I’m just excited they are making these movies again. It seems they may be trying to return the mythos to a unifying force that all can have special gifts and you don’t need to be from a certain bloodline or have special chemistry to have special powers. That magic is in us all. Thanks for opportunity to share\\, it challenging holding in spoilers 🤭Happy holidays! ","true":true}