{"101487":170460,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars used to take itself seriously. There were characters within the Universe that were funny\\, because that’s just who they were (C3PO for example). That’s all out the window with this movie. The tone has changed to more of a comedic Guardians of the Galaxy feel. The movie opens with a “prank phone call” and a “your mom” joke. There’s gross out humor now (Luke Skywalker milking\/jerking off an alien) and all the rules and story installments previously set up within the universe are thrown out the window with this film’s “The Old Star Wars is dead\\, this is the NEW Star Wars - get over it!” themes. There’s literally nothing I can say about this movie that is good other than the special effects. Story-wise\\, everything falls flat and is full of more head scratching moments and plot holes than I care to recount here. What makes Star Wars so great is the wonderful characters we’ve all grown up with\\, and this film shits all over those people and tries to force you to bond with new one-dimensional characters that are as unappealing as they are useless in moving the story forward. This movie is like the legendary blue lightsaber that started it all - built up to be the biggest and greatest thing of all time\\, only to be thrown away like a piece of garbage. I love the original trilogy more than anything\\, but this film was so bad that it makes me want to disown my SW fandom... which I think was the entire point of this film. It wants to slap all the die hard fans in the face and say\\, “These movies aren’t for you anymore. They’re for kids now. Move on.” Well\\, message received. I won’t be investing my time in this universe anymore. Bye-bye Luke. RIP Star Wars. ","true":true}