{"101487":175082,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi has left a bad tast in my mouth since I saw it a few days ago.  As a lifelong fan I've been looking forward to seeing Luke and Leia in the same movie again together.  My biggest disappointment prior to seeing this movie is that Han wouldn't be in it.  My biggest disappointment since I've seen the movie is that I actually paid $12 to see the steamiest pile of crap in years.\\n\\nI am not sure who Disney is trying to cater to here.  None of my kids liked it and they did not ask for Porgs for Christmas.  My husband didn't like it and has stated that he is not interested in seeing the next one.  There was too many political statements here and an obvious attempt at minority casting.  I have no problem with a diverse cast (I'm Asian!) it just seemed obvious that there was an agenda here that was anti-male and very PC.\\n\\nWe were all hoping to have some of our burning questions from The Force Awakens answered here.  That didn't happen.  I don't want to spoil the movie for anyone who hasn't seen it\\, I'll just say that this movie doesn't seem to follow any type of flow from TFA and that is too bad.  \\n\\nI liked Rey and Finn together and Finn and Poe together\\, I thought there was chemistry between those actors in TFA.  Rey and Finn were obviously leading to a relationship(?) and Finn and Poe were a good team.  Instead Finn is paired up with a new person (Rose) and these are the worst scenes in the movie.  I feel that Finn was wasted in this movie.  As was Poe.  He seemed more like an aggressive hothead than anyone who could lead the Resistance.  \\n\\nI'd like to see some progression with Kylo Ren as well.  He still doesn't seem to be fleshed out yet.  What are his motivations?  How was he lured to the darkside?  Still no answers there.\\n\\nI will probably watch Episode 9\\, but not at the theater.  I'll wait until it comes out at Redbox.","true":true}