{"101487":180406,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"They need to get JJ Abrams in immediately to remake this disaster.\\n\\n\\n[Spoilers]\\n\\nThis is the worst movie I have seen in the Star Wars universe since episode II\\, and possibly trump's even that because of the damage that it does to all the characters we have invested in for the last 40 years of our lives.\\n\\n\\nThe movies biggest crime is in presenting a weak\\, evil\\, emasculated and bipolar caricature of Luke Skywalker that utterly destroys his legacy.\\n\\n\\nIn fact it is as if the director deliberately sets out to castrate all male members of the cast.\\n\\n\\nLuke has utterly lost the force\\, his association with the light side\\, and any purpose for existing\\, and needs saving by a woman before evaporating for no reason.\\n\\n\\nFinn bumbles comically from one scene to another as if suffering from dementia\\, and needs saving by a woman.\\n\\n\\nPoe commits mutiny not once\\, but twice while all the women look on sympathetically like he is some kind of unfortunate dunce. And he gets rescued by several women.\\n\\n\\nKylo Ren keeps phoning Rey to ask if she'll be his girlfriend\\, then gets sad when she says no.\\n\\n\\nAdmiral Ackbar gets blown into space\\, and until a bit later and an offhand comment\\, I hadn't even realised they'd killed him off.\\n\\n\\nGeneral Hux - a fearsome presence in the first movie - gets slapped around and bounced off things like he's one of the three Stooges.\\n\\nThe movie grasps hold of all the burning questions we had from The Force Awakens and craps on them:\\n\\nQ. Who are Rey's parents?? \\nA.  Um. Nobody.\\n\\nQ. Who is Supreme Leader Snoke? What is his background? Where did he come from? Why is he so powerful? What are his plans for the universe??\\n\\nA. We changed our minds about Snoke and just killed him instead\\, move along.\\n\\nQ. How long will Finn stay in his coma?\\nA. About one minute.\\n\\nQ. What happened to the legendary protagonist of the most popular movie trilogies of all time?\\nA. Luke turned to the dark side for no reason\\, tried to kill his teenage nephew (who easily beat him up)\\, then moved to a small island to milk sea-cows.\\n\\nQ. But surely Like Skywalker is one of the most powerful Jedi ever??\\nA. No. He milks sea-cows now.\\n\\nQ. What incredible secrets does the fabled First Jedi Temple hold??\\nA. 8 books and 2 rocks. And it's not a temple\\, it's a tree. The First Jedi Tree.\\n\\nQ. Okay\\, well what was Rey's vision in the first movie about? How is she connected to Luke Skywalker? Why did his light saber call to her?\\nA. We're fairly sure that didn't happen. At least we are going to pretend it didn't. Move along.\\n\\nQ. Who are the Knights of Ren?\\nA. Nooooo... don't remember them. Think you're making them up.\\n\\n\\nQ. How will episode VIII build the 9 movie story arc to its final\\, inevitably perfect conclusion?\\n\\nA. It doesn't. It leaves the series at its lowest ebb\\, with nowhere to go.\\n\\n\\nThey need to get JJ Abrams in immediately to remake this disaster.\\n\\nOr they should just change the name from The Last Jedi to The Last Star Wars Movie\\, and stop making us suffer.","true":true}