{"101487":145969,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never left a review on here\\, but been processing this movie and wanted to add my thoughts to what everyone is saying. \\n\\nI think this is a decent stand-alone film. It was fun\\, had its great moments - but I think it failed miserably as a sequel to the new trilogy. It honestly feels as though Abrams and Kasdan set up new characters with seed plots and thematic ideas for their successor to take in whatever direction they wanted. TFA was a safe movie\\, but from a business perspective made sense. They had bought the intellectual property for 4.5 billion from George Lucas and wanted to created a nostalgic film to bring in the fan base. The sequel to TFA is where they could have done something new\\, but something congruent with the thematic elements of the initial movie. \\n\\nRather than developing those thematic ideas the Last Jedi did an abrupt about face and essentially killed them. The mystery of Rey's parentage\\, why Luke is on Ach-to\\, why the saber called to Rey and the images in her vision - it all got abruptly brought to an end. \\n\\nNot only that\\, but the character arc made no sense. Why is Luke on the island? Because he cannot live with the guilt of seeing fear in Ben's eyes? Really?! A man who had the resolve to stand-down his murderous father and the Emperor abandons his entire mission because of his nephew's puppy dog eyes? \\n\\nBen\/Kylo struggles with the pull of the light side of the Force ... resolves to save Rey only to then re-commit to the dark side and try to murder his uncle? So why the character arc at all? He essentially ends where he started so we take us there at all? \\n\\nEven more so\\, where is the world building? \\n\\nLuke went to the first Jedi Temple ...  but none of it is developed or fleshed out. Instead it is burned to the ground by a pathetic version of Yoda.\\n\\nWho is Snoke and how does his not being a Sith play in to the Force ... doesn't matter. He's killed. Despite the fact that he is an apparently powerful force user\\, yet a snarky\\, emerging Force user can trick him and murder him?\\n\\nAgain\\, as a stand-alone film\\, I would have enjoyed it\\, but as a continuation of a story in the \\\"Skywalker saga\\\" - it was abysmal. \\n\\nOn almost every level as a continuation of the new trilogy\\, I think it failed. It genuinely has killed my interest in these new characters - where do you go from here? It also makes me feel cheated. Why lay thematic ground work only to figuratively and literally kill or burn it to the ground? I had hope in a new\\, exciting trilogy after the train wreck that was the prequels\\, but this just solidifies that we were are in store for more garbage.","true":true}