{"101487":159272,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Omg this movie was so bad I can't even star wars the last Jedi more like star wars the last movie you'll see for how god  awful it is shit I was ok with force awakens but it did annoy me just a bit actually it bother me fucking non stop from watching like it's was basically fucking new hope 2.0 with its new r2 and darth Vader and death star war ok enough with force awakens back to last Jedi it wasn't all that bad it was funny because of some of its humor but that's when the positives end like wtf jj did you seriously kill off one of your most important and fucking the face and the i of star wars the wtf happend moment like shit wtf are you thinking ok but the funniest of all you made Kylo ren look like a unstable mental child that's havinf a  tantrum lmao but ok one more thing the end where Luke was suppose to be fighting kylo the beginning was awesome  ilike hell I bet it would I bet It would have save the franchise even more If you revealed that it wasn't no ghost shit I don't know then he'll that shit would have been lit but no just no the scene that would have probably have saved everything you turn to shit thank you jj fuck off and you too Disney just give it back to George will u and also one more that was shittes way to kill off snoke end fuck you last Jedi but I did love the acting another plus three in a half star bye now fuck u give it back to George aleast the shitty  Indiana  Jones movie was better then this","true":true}