{"101487":135781,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-11","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I LOVED THIS MOVIE. \\n\\nI didn't love TFA\\, for reasons which I won't belabor again here. With this movie I felt more as if I'd seen a Star Wars movie- not as tight a story as the OT\\, but with the same genuine feeling of camaraderie and mystery that was missing from VII. I teared up several times during this movie. Maybe it was because I didn't know much about it and was genuinely surprised\\, who knows. I had no- actually low- expectations going in. \\n\\nA few highlights\\, I'm sure I'll have more to say later after I've had time to see it a few more times;\\n\\n-Nothing\\, and I mean nothing\\, makes me grin like seeing that classic SW logo and hearing the SW theme song play. \\n-Leia was magnificent. And clearly war-weary\\, but no one has suffered like she has and that's pretty clear. I'mill not sure if that moment of truth with Kylo's finger on the button was a blessing or a curse for her. It clearly gave me hope for him\\, but prolonged her suffering in several different ways. It may have been hokey but I did love seeing Leia defy the vacuum of space. Had a little training in the Force after all\\, I guess.\\n-Laura Dern as Admiral Holdo was superb. I remember seeing her in Jurassic Park and wishing I looked like that- &I had the same thoughts again!\\n-Kylo continues to fascinate me. He's still a boy but he's growing up. I can't figure him out\\, but I can see that there's more to him than the simple Dark Side bad seed.\\n-THe part in the cave where Rey asks to see her parents was genius. Not just the reflection back at herself- but the different Reys at slightly different points in time. It made me about time & perspective. Which is the real Rey? Did we just see time split? Which path will she choose? Is she really Rey Rando? \\n-Kylo & Rey fighting together- I don't know what to say except it seemed right. Despite the violence it was more like ballet. They're two of a matched set.\\n-I'm not normally much for battle scenes but there were some brilliant bits here with Poe\\, Holdo and Finn.\\n-Rose Tico \\\"We fight to protect those we love\\, not just against those we hate.\\\" That just about sums up the difference between the Dark & Light sides of the force..\\n-When Luke walked out to meet Kylo. The look on the faces of the few remaining rebels was awe-struck\\, as it should be.\\n-The ending with the little proto-padawan and the broom that jumped the last inch or to into his hand- what a beautiful set-up for the next film. And a sweet little Easter egg\\, too. There were many great little moments like that in this film. \\n\\nI could go on but these are the parts that come to mind right now. The story was a bit complicated but seemed to hold together very well. The characters hit all the right notes\\, the acting much improved and there was less perfect-Rey and more uncertain-Rey\\, especially in the beginning.","true":true}