{"101487":184786,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is horrifyingly awful.  Below is a synopsis of the movie.  I am including spoilers so that anyone who doesn't want to line Disney's pockets anymore can skip the movie and catch it later on Netflix.\\n\\nThere's a painfully slow sub-light space chase where we must believe that an Imperial  fleet that can exceed the speed of light can't think of a way to catch a single ever-so-slightly-faster rebel cruiser; In space where there's no gravity\\, bombs fall out of ships as though they were WW2 bombers; Leia gets ejected into space and comes back to life and travels\\, Mary Poppins-like to knock on the door to be let back in; Kylo Ren hates his helmet now; The Empire needs a huge\\, complicated device to track ships across the galaxy but Leia and Rey can use a wristwatch to do the same thing; there's an entire sub-plot to locate a mysterious code-breaker which was completely pointless; Jedi can now make their visage appear anywhere in the universe and scare people; Wookies live forever;  Rey's parents were worthless drunks; Jedi masters can come back to life any time they want;  Adam Driver has nipples; Poe Dameron is personally responsible\\, in 2 separate incidents\\, for the deaths of thousands of his fellow rebels but is still a hero; Benicio Del Toro's stuttering character is unsympathetic because he immediately sells out the entire resistance; Rose sets the casino horses free but leaves the casino human children imprisoned; Snoke dies but we get no explanation for who he was or how he got here; The guy who could freeze laser blasts in mid-air while simultaneously putting force chokes on people in Episode 7 gets put in a physical chokehold by a red-suit dude and has to be rescued; Laura Dern drives her spaceship at light speed through a bad guy ship and kills thousands of bad guys but the 3 good guys are all uninjured; Rey can now force lift gigantic boulders even though she has had only one 5-minute Jedi lesson; Luke dies (or does he?); the end.","true":true}