{"101487":164771,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Regarding this Last Jedi...\\n\\nNothing in this movie makes sense.\\n\\nTerrible Writing. Disney loves to kill off the parents (Luke\\, Han) in order to promote alienation and consumption of merchandise. Insulting character assassination of Luke. Subverting Mythology. \\n\\nThe Hero's Journey without the journey. No stakes. Rey is a Disney Princess\\, she doesn't need Jedi training to master the Force. I guess Millennials can just download a Jedi Master app and beat up Luke Fucking Skywalker\\, Are you kidding me? \\n\\nJoseph Campbell talked about the conflict between the transcendent (archetypal) and the didactic (political\/mundane) in art. That is the difference between the OG trilogy and the Disney reboot. Sad. \\n\\nBoyega was awesome in Attack the Block\\, then they turned Finn into Steppin Fetchit. Ridiculous. \\n\\nEmo Ren has no motivation. Fucking Twilight in Space. \\n\\nThey turned Princess Leiah into Mary Poppins? Why\\n\\nDisney doesn't have a true SJW agenda. They are simply using a fake liberal marketing strategy like Benetton in order to expand market perfusion and cross market profitability into \\\"new markets.\\\" Disney is a corporate capitalist company that uses slave labor. Like Idiocracy & Brave New World\\, Disney's culture shaping agenda is to disconnect story from meaning. Thereby increasing the level of anomie and anxiety in society which stimulates consumerism and impulse shopping. $$$\\n\\nI prefer the feminism of Riane Eisler in The Chalice and the Blade to Disney's fake feminism.\\n\\nWhy not free the slave kids? Oh right\\, because Disney uses slave labor. Fuck Disney.\\n\\nThe only point I appreciated was DJ's criticism of weapons contractors.\\n\\nFantasia Sorcerer's Apprentice ending was nauseating.\\n\\nI want an apology from Disney.","true":true}