{"101487":184031,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie has a poorly thought out story that does nothing to connect the previous film to the current film. It takes important characters\\, established early on\\, and egregiously dismisses them or kills them off in the hope you won't care about the importance of basic story telling. It falls into the same trap as many other hero or action films. Their philosphy is this: Serve them up enough flashy special effects and they'll forget about the story or continuity. Barrage their senses with enough sensory stimulation and they will forgive the fact that there's a story that's supposed to be told. Well\\, this lifelong Star Wars fan is not that forgiving. Disney and Rian Johnson have literally turned the Star Wars franchise into a joke. They have effectively destroyed the Star Wars legacy that we've all come to revere and love. You will no longer get one more penny from me. The Force Awakens\\, although flawed in some areas\\, laid the groundwork for character development and broader plot lines to be connected. It's as if Rian Johnson didn't even bother to watch The Force Awakens and didn't even attempt to address the importance of any further character development or expansion of the existing story\\, especially the protagonist Rey. This movie\\, though it has moments that make you harken back to the magic of earlier episodes\\, does everything it can to destroy any sense of tradition or continuity established in previous films\\, with the sole intention of trying to be unique and edgy. It's in this attempt that the film fails miserably at being surprising or unique. It just looks like a lazy attempt not to tell a story or fill in the gaps because all of that can be covered up by explosions and fast cuts. Audience's aren't stupid. The only thing this movie did for me was make me not want to watch the next one!","true":true}