{"101487":180241,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"They could have done so much more. Give the people what they want\\, not some totally unexpected thing that leaves the audience starving for more. Spoiler Alert: We start with Luke being exposed as someone who ran away\\, not because he’s waiting for the right time or making it so the New Order can’t track him\\, but because he can’t handle how he turned his nephew to the dark side. Instead of doing the Luke thing\\, and trying to fix it — he runs away from his problems and leaves his mess to everyone else. We have to watch a totally uncharacteristic Luke as he mills an alien? Why does Luke milk an alien?! Next we have to see another guy who runs away from everything (or at least tries to) in Fin. Once again he’s trying to run away and leave the problems to everyone else. As he does he finds a girl who doesn’t have any big jobs\\, but is at least staying through the problems and is stopping others from escaping. As she’s trying to stop Fin from leaving they come up with some silly solution that they then tell Poe about. Fin & the girl proceed to go on a completely unnecessary adventure which ends up not mattering at all because they end up going with the original plan. While all of this is going on we are watching everyone’s questions from the 1st movie being answered in the most dismal way. Who’s snoke? Nobody. It doesn’t matter because he dies 2 minutes after we get to finally see him. Who’s Rey? Nobody. She’s the daughter of 2 nobodies. Great Disney. Thanks for making me wait 2 years to find out that I was wrong to question these things for 2 years. At the end when Luke arrived on the planet to fight Kyle Ren I was relieved to see that we would at least get a big boss battle at the end. WRONG! No battle\\, just a hologram of Luke which causes him to die right after. Nice going Disney. You completely ruined the character of Luke Skywalker\\, and then killed him in the most uneventful way. This whole movie put Princess Leia in an early grave. Nice going.","true":true}