{"101487":130667,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I disagree with every single person who says this was epic.  It was \\\"ok\\\".  There are some really good parts.  The cast is great.  But there is a lot that shouldn't be.  Rian Johnson apparently does not understand these characters\\, or editing or pacing.  There are characters that could have been cut from this movie entirely and nothing changes.  They are on screen because they were in the last movie\\, and needed something do.  Except they accomplish nothing.  And leave a bad taste in your mouth.  They have no role.  And they add new characters with just as much purpose.  I will be terrified to see what they actually did cut.  \\n\\nThe special effects are actually poor in some places\\, which is so confusing because this is STAR WARS.  The story lags for a bit\\, but then admittedly picks up.  And there was some really good sequences.  But even buried in them\\, there are things that just feel wrong.  A director's hubris\\, perhaps.  Then it doesn't end.  It continues for 20 minutes longer than it should have.  Remember in The Force Awakens\\, when Rey goes to find Luke\\, and even though you love that scene\\, you feel a little weird?  It's because its not a natural ending.  It feels like its an add-on.  Well this movie does that.  But 20 minutes worth.\\n\\nI have 'The Phantom Menace' levels of hesitation and confusion after seeing this movie\\, and I put it squarely on Rian Johnson\\, the writers\\, and editor.  It was as if they were just so in love with the fact that they were making a Star Wars movie that they did not pay attention to the fact that they were making a movie.  Now I have to feel bad for a few years and hope these mistakes do not get repeated in Episode 9.","true":true}