{"101487":108584,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Before everyone talks about plots not going anywhere\\, understand the main message of this movies is that not all rebellions are fruitful\\, especially when you are working for same cause. Sometimes those in charge have a clear course and your rebellion could screw it up. Definitely\\, not the message people want to hear today\\, but that doens't make it any less relevant. The Last Jedi shows us that heroes can fail which make their triumph even more special. I can't give too much away\\, but none of this plot went in the direction I thought it would. ONe thing you can say about the evil giant Disney\\, is they have a better understanding of what made Star Wars specially then even the original creator could grasp. We are creating new characters that are not the Skywalkers and the same archetypes. Don't look for those. This revolves around more human characters and expands the universe. You may find this too humorous\\, if your movie is Empire\\, but the original was packed with humor that can be lost in our memories when we think about the heaviness of the subject matter. To say there is no character development is to miss the purpose of the genre and to not see the forest from the trees. These are a trilogy\\, the character development will be seen over time. There are things learned in this movie that will be motivation for the next one to move forward. Let the franchise grow from a whiney brat and wise cracking smuggler to a something more. To a wider universe that is beyond \\\"rescuing a princess form an evil dictator.\\\"","true":true}