{"101487":175642,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi retells The story of Empire Strikes Back but puts the Hoth scene at the end of the movie instead of leading with it.\\nStar Wars fans are very disappointed because they waited two years only to get a rehash story....nothing original.\\nESB has four parts to it;\\nPart 1:White covered planet that is under attack by the Empire At-At walkers and the Rebels use land speeders to delay the Empire long enough for the Heroes to get away in the falcon.\\nPart 2: The Heroes minus the jedi learner are being pursued in a space chase but they can't lose them since they can't go light speed.\\nPart 3: The jedi learner goes to find the Jedi master to get taught the force but leaves before completing training.\\nPart 4: The heroes being chased by the Empire come up with a plan to reach out to a shady scoundrel type that can't be trusted but has no other choice and end up getting back stabbed for it.\\nI've just described all the plot points of The Empire Strikes Back which are the exact same thing that happens in The Last Jedi minus one additional plot which is taken from Return of the Jedi and is almost an exact copy of the Throne Room scene with red guards\\, very similar dialog and both The Emperor and Snoke are defeated.\\nRian Johnson managed to troll the audience with a plot rip off of ESB and added Space Balls comedy that Mel Brooks would be proud of. This was Rian's way of giving the middle finger to the fanboys and adding real world political nonsense to the movie.","true":true}