{"101487":166955,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Sigh... I didn't think I'd live to see a Star Wars movie worse than The Phantom Menace. The Force Awakens and tha trailers showed so much potential for this movie.\\n\\nThere are so many plotholes\\, which I'm not going to talk about as they've been mentioned over and over again already. What I'm going to say about the plot is that most of it was pretty pointless and made the movie feel very long-drawn. \\n\\nAfter seeing the movie the second time\\, it's clear why. All the dumb pointless parts of the plot were there just to spread ideologies of liberal extremists. The movie has it all\\, anti-meat eating scenes\\, anti-man feminist scenes (this has even been admitted in interviews)\\, forced ethnic diversity... Can you see the symbolism of this plot? \\\"Good guys\\\" consisting of white females\\, black people and Asian people are working together to try to bring down the violent \\\"bad people\\\" consisting mainly of men in white armors. I like the fact they're bringing more black and Asian people\\, but they should have done it in a way that doesn't feel forced. You don't need to have a character of every single ethnicity as main characters in the same 2-hour movie.\\n\\nI wish they would've kept Star Wars free of ideological propaganda and focused on the plot and characters instead. The characters were totally out of place in this movie. Rey was mostly just whining\\, Snoke was easily taken care of\\, Luke was so out of character it almost made me cry. They forcefully brought in the old actors just to do this?\\n\\nThink of this movie as a mix between The Phantom Menace\\, Rogue One an Ghostbusters 2016. This movie destroyed the Star Wars franchise and everything it stood for. I wouldn't have high expectations for episode 9 even if they brought in a proper director. This movie left too many wounds in the franchise for anyone to patch up.","true":true}