{"101487":135727,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I loved this movie. It had a different pacing to it that was a little strange on the first watch\\, but when I saw it again I liked it even more. The character progression of Luke is an amazing reminder that idolization of someone is unfair -- viewing Luke as a hero is unfair to him\\, because he is only human after all\\, and all humans make mistakes. I am glad he got to grow throughout the movie and left on a good note\\, also reminding the audience that you don't have to let yourself be reduced by your own mistakes\\, and instead can learn and grow past them.\\n \\nI loved Finn and Rose's story\\, but I didn't really care for DJ's character. Poe's arc seemed too drawn out and took away from other storylines\\, in my opinion. I loved Holdo\\, but I think it would have been better storytelling if Leia was in her place. \\n\\nMy favorite aspect of this story by far was the dynamic between Kylo\/Ben and Rey. I loved their chemistry and how Kylo didn't even seem mad at Rey for trying to kill him twice\\, but was in awe and gentle instead. Their scene together in the throne room may be one of my favorite movie scenes of all time. I loved how they were set up as the yin and yang and how the will of the force seems to be them working together to bring balance. \\n\\nI enjoyed Hux's scenes and like the idea of him being set up as the big bad for the final movie of the trilogy. \\n\\nThis movie was incredible overall and did an amazing job of getting us excited for the final movie in the trilogy. Thanks Rian & JJ!","true":true}