{"101487":134515,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left the movie theater Friday night depressed at what Disney and Rian Johnson have done to Star Wars.  They decided to take everything fans loved about Star Wars piss on it\\, mock it\\, then destroy it.  Rian seemed to go out of his way to tear down the heroic legacy of Luke Skywalker and the Jedi order.  He trivialized everything about the Jedi before stating outright they were as arrogant and evil as the Sith.  Once this was done he started in on making a terrible movie.  Leia flies through space like Space Mary Poppins\\, the dice from the Falcon just disappear with no reason from Kylo Ren's hands\\, Rey once again is more powerful than Yoda\/Anakin\/and Luke rolled into one with no training.  Snoke was on screen for 2 minutes before he was killed in a way that would have made the Three Stooges proud\\, and the dialogue included jokes so bad the nine year olds in the audience groaned.  Oh and in the middle of the movie for no apparent reason we get a 15 minute PSA about how the First Order and the Rebellion are both equally evil because they buy weapons.   I do not believe anyone who actually loved Star Wars could have looked at the final cut of this movie and approved it.  So I have to believe that whomever approved the release of this movie actually hates what the Star Wars franchise has become and is hell bent on destroying it.  Well if the ultimate goal was to shed old Star Wars fans then Disney accomplished their mission with me.  To see the character of Luke Skywalker treated this way was painful.  For me Star Wars will always be episodes 1-6 and Rogue One.  Even though The Force Awakens was good it is too joined to this abomination called The Last Jedi and should be erased from Star Wars canon along with whatever comes next.  See this steaming turd if you like but don't say you weren't warned about how putrid it is.","true":true}