{"101487":100067,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After waiting two years for the Last Jedi and buying my ticket on the day it came out\\, it is incredibly hard to write this review because I am honestly still in shock of how bad it was. The movie started out great but it soon came crashing down. I completely understand that Disney was trying to basically say that the old Star Wars universe and story are dead and that a new generation and story are born\\, but why would they do that in the MIDDLE of the trilogy and without answering any of the questions we've had for two years?! How in the world is JJ going to do Episode 9? Besides not answering any questions that die hard fans have been waiting to have answered for 2 years\\, there are tons of other things that make this movie cringe worthy. For one\\, the dialogue seemed like it was written with a crayon. I don't think most characters ever had sentences that were made up of more than 5 words. Also\\, I had no idea that the Star Wars universe was part of the Pokemon universe as well. Oh and Leia can magically fly through space and then come back to life? And we're just not gonna address that at all? It was a 2.5 hour long movie and literally nothing happened. A ship slowly being chased and running out of fuel for an hour and a half is not a plot. If I were an 8 year old kid who had never seen any Star Wars movie before it would have been great. But as a die hard Star Wars fan who has spent years of my life loving these characters\\, watching the movies hundreds of times\\, and buying merchandise\\, I am just plain sad. And now I don't even have faith in the Han Solo story\\, Episode 9\\, or any future Star Wars movie. Congrats\\, Disney... you killed my childhood.","true":true}