{"101487":100115,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After watching this new version of Star Wars I was so incredibly distraught and sad.  I literally went into a depression for a few days\\, I was that kid that would try to move a pencil with my mind because I was sure the force existed and because of  my childhood hero Luke Skywalker I believed that good could always overcome evil and I believe in redemption.   I was so excited to see the last Jedi after watching the force awakens\\, for nearly 2 years I sat and envisioned that scene where the light saber that belonged to his father before him as a Jedi was handed to Luke.  When he threw that  light saber over his shoulder I knew I was in for something terrible.   There were so many things wrong\\, the begetting with the humor that whole used on hux.  Could you imagine that happening in the original Star Wars or someone trying to pull that on Darth Vader?   After my depression started to fade I re-watched the original trilogy and I will tell anyone that watch the last Jedi to go back and watch the original trilogy.  You will see and incredible story of good versus evil and redemption.   Scroll down these reviews and you will see four out of five are either neutral or negative\\, you tell me how the rating as of now is sitting at 49%.   Disney has so much money they can buy off anyone they want\\, look at the guy that started the petition to ban the last Jedi from official cannon\\, he came out in the media and said it was a mistake... I wonder how much Disney paid him?","true":true}