{"101487":169216,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"** SPOILER ALERT:  DO NOT READ ANY FURTHER IF YOU HAVE NOT SEEN THIS MOVIE!!!!!  **  I'm afraid to say that I actually didn't like it as much as I wanted to.  I don't like that they killed off Luke that way.  I would have preferred that he actually fought and wasn't just there as a vision. Also\\, I don't get why that experience would have killed him. And now\\, with Carrie Fisher dead\\, none of the original characters are still alive. What are they going to do in the next movie? Just be the new people fighting kylo Ren? They should not have killed off snoke like that. You need a bigger villain than kylo Ren to fight in the third movie to make it more interesting. He is so flawed in my opinion to be the only remaining big bad guy.  I don't know. I did like it. But\\, not as much as I hoped to.  I fear a passing mention in the opening crawl of Episode 9 that says\\, \\\"Princess Leia has died...\\\"  And\\, then Rey\\, Finn\\,  and Poe fight Kylo Ren and some stormtroopers for 2 hours.  Stupid.  And\\, I feel like the whole thing with Luke being so jaded was totally against the character of Luke Skywalker. I view him as sort of a Superman\\, where he is the eternal optimist and remains every bit positive throughout his life. I didn't think it matched up well with the established character. But who am I?  Mark Hamill actually did a GREAT acting job.  He made the most of this script and story.  But\\, the Luke Skywalker I know is the eternal optimist and doesn't give up.  That's where they lost me\\, I suppose.  And\\, his shining moment deserved better than a force hologram while people snuck out the back door.","true":true}