{"101487":169233,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILER ALERT: I've never reviewed or rated a movie online before because honestly\\, they're just movies. And while I am a HUGE Star Wars fan\\, it's still just a bunch of fiction. But\\, this movie was so bad that it compels me to spend 10 minutes to create an RT account and write a review.\\n\\nA day later\\, I'm still a bit taken aback that Disney and Rian Johnson would let this shameful piece of work be released. Put aside the really weak plot that is mostly taken from TESB and ROTJ. It just plainly dishonors the audience. I'm not talking about Lucas or the franchise. I'm not talking about the hardcore Star Wars fanatics who are sticking to canon. I'm also not talking about the realists who would kindly point out that slow flying ships \\\"dropping\\\" bombs in space is nonsense. I'm just talking about fans who love a character - Luke Skywalker.\\n\\nMy wife is a good example. She's not crazy about Star Wars. She's watched the movies once or twice. But\\, even she looked at me after the movie and said\\, \\\"I don't get what they did with Luke\\\". It's totally OK to make Luke old and grumpy. But\\, you really need to work hard to explain to your audience WHY Luke would kill Ben Solo? This is the guy who faced his father (the most evil henchman in the universe) and still saw good in him. Am I supposed to believe based on three brief flashbacks that this guy would murder his own nephew in his sleep? Don't forget that's not just any nephew\\, that's the son of his sister\\, Leia and friend Han Solo. What? Rian? What? What!? We love Luke. You know we do. And yet\\, you failed to make us question our own belief in this character which we've loved for over 40 years.\\n\\nAll told\\, some bad decisions were made early in the creative process that have left all of us feeling like we're now living in an alternate dimension with grump\\, evil Luke. In some alternate reality must exist the right movie\\, made by the right people\\, with the right vision that I wish Mark Hamill I could visit one day (even if just for 152min).\\n\\nP.S. - the campy 2017 slapstick humor - this isn't Guardians of the Galaxy\\, guys. C'mon.","true":true}