{"101487":153372,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Maybe the most poorly written franchise film of all time. The writing equivalent of an MLB player striking out in a tee ball game. With such a rich history and an amazing world\/setting to draw from  I was dumbfounded by the plot holes and lack of character depth \/ development in this movie. \\n\\nIt is a shame because there is so much opportunity to create value in the hearts of true fans and new comers to the SW Galaxy.  Visually great but it was always the characters\\, story and the world that made Star Wars a classic to me.\\n\\nYou can not take established characters who have defined traits and 180 their whole being with out proper story telling. This movie does just that all most to mock its fans. The story spends so much time on irrational sub plots it fails to ever create character depth or add content to the amazing Star Wars Universe. In fact it almost seems to run from the assets the brand has built. What is even worst is that it does this while throwing logic out the window. You maybe able to \\\"Mary Poppins\\\" a character back from the void of space but you can not do the same to logical sci\/fi fans once you have lost them to the void of poor writing.  \\n\\nThe established character of Luke SkyWalker personifies the hero journey and against all odds never compromised his idealistic view that he could save his father and does in the original films. Yet in a few poorly written lines we are told he tired to kill his nephew when he sleeps because he is strong..... Just one of many things that does not pass the logic test.\\n\\nIn the end we are shown \\\"anyone\\\" can have the force\\, this must of been Rians ego speaking as he tries to justify that anyone can be a screen writer.  Sorry kid you aint got it! \\n\\nIf you want your kids to see a great universe with compelling uncompromising heros that do right\\, maybe have them get into One piece or Naruto. Disney just doesn't deliver I guess.","true":true}