{"101487":129363,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a life long fan who was appalled at the prequels. I had very low expectations for Episode 7 and it was good\\, but I felt it was lacking. Rogue One was my favorite movie since the originals\\, and now Disney has delivered a work I believe deserves a place in my top three. This is the first movie that I feel actually scores on par with the original three movies. Do not listen to the naysayers. Frankly\\, I've read the bad user reviews and I cannot find any coherency in the outrage\\, nor do I share any of their opinions.\\n\\nThis movie does something that Star Wars has been lacking since the original 3 movies. It stands alone\\, yet is part of a greater story.\\n\\nSPOILERS TO FOLLOW:\\n\\nI have heard people complain about the casino planet. I found it refreshing that Star Wars would take on something as cerebral as arms manufacturers and point out that wars are always armed by the same people who are just exploiting division.\\n\\nI have heard people complain that Snoke was wasted....... Snoke was never necessary in the first place. We didn't need another emperor. They could have just brought back clones of the true emperor. There was so much emotion in the scene with Snokes death. It was the perfect end.\\n\\nI've heard people complain about Luke\\, but these people have obviously never explored any of the written works that were once cannon and are not now. Luke was always going to be tempted by the dark side and haunted by it well for he removed all the instruments of the dark from the universe (except for Snoke\\, whom I believe was a terrible character to begin with and one of my pet peeves from Episode 7. However\\, we could have used a little more back story\\, but I digress). There must be balance\\, and without balance Luke starts seeing the dark in Kylo Ren. He almost strikes Kylo down in anger. Brilliant. Luke was never perfect. I wanted to see his flaws\\, and this installment did not disappoint.\\n\\nI've heard people complain that Luke didn't show off his power. What do you call him appearing from across the galaxy as he meditates on the ocean world of Ahch-To. I mean come on\\, not even Yoda pulled off a stunt like that. I'm glad they didn't have him bouncing around like a buffoon the way they did with Yoda in the prequels. I love the fact that they refocused the Force as a religion\\, and that Luke becomes a proponent of the death of the old religion. There has to be balance. The Jedi were not balance. The Jedi lead to the Sith. There answer is somewhere in between\\, and I hope that Episode 9 expands upon this.\\n\\nAll in all\\, Episode 8 is now top 3 Star Wars movies of all time.","true":true}