{"101487":99948,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After seeing this movie I felt really disappointed. It feels like the director made his priority to prove the audience wrong rather than make a good film. So many problems where to start. We know nothing and will probably never know anything about who Snoke was or where he came from. Lukes entire character was simply wrong\\, he didn't feel like Luke\\, Mark Hamill is a brilliant actor\\, the problem was with Lukes writing. Suddenly Rey cares about Ben despite calling him a monster before. Bombs in space? How does that work? There is no gravity! The entire casino plotline was a waste of time and Rose as a character felt forced and annoying. Finn is a good character and actor but he isn't given anything important to do; feels like a waste. Leia survives by flying as Superman\\, that entire sequence was an embarrassment. I like the idea of using the puppet version of Yoda but it just felt off\\, like it needed more work. There are too many moments of comedy that aren't necessary\\, the jokes fell flat most of the time except for a few exceptions. Now for some positives. The choreography was amazing and the battle in the throne room looked great. A lot of scenes are epic and well made like the space battles (and while the lightspeed jump through the ship was cool I feel that opens plotholes and raises questions I suspect can't be answered. You shouldn't tarnish the rules of your universe for a \\\"cool scene\\\" it's just not worth it.) Sadly that's all the positives that I can say for this film. I seriously question Rian Johnsons ability to direct a Star Wars film and I am worried for the future of the franchise.","true":true}