{"101487":147514,"Last Jedi":"Last Jedi","2017-12-15":"2018-12-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wish I could give this a zero. No other movie that I've seen has evoked this response in me. This film not only shits on every other Star Wars film up to this point\\, but also leaves it in a place where it is impossible to recover. Critical heroes (primarily Luke) seem to have regressed to embarrassing lows for no purpose except to inflate already completely over the top characters (mainly Rey). Not only is the character writing extremely poor\\, its also completely incoherent. More times than I can count\\, a character will act in a way that makes no sense and goes against everything already established in their background.\\n\\nThere are several painfully awkward attempts at humor that honestly FEEL bad. It physically pained me to witness these flat jokes get delivered at the worst times in the worst ways. Since when is Star Wars a comedy anyway (excluding Jar Jar)?\\n\\nThe villains in this trilogy are hopelessly inept. There isn't even an iota of tension when the good guys have to overcome them. I'm confident that an ordinary child from every day life would have a fighting chance to defeat the First Order with no outside help.\\n\\nThe political agendas of this film are so in your face its offensive even if you agree with them. Feminist and Anti-Capitalism themes are bursting through every scene.\\n\\nI can't recall watching any other movie and realizing afterwards that a full 30 minute portion of the movie could have been removed with absolutely no impact to the story-line. That's right. There is a 30 minute chunk of this movie that is so irrelevant that if gone\\, the plot would remain 100% unchanged...\\n\\nTo be frank\\, I am blown away by the staggering lack of quality such a large studio has produced in The Last Jedi. I didn't think it was possible to spend so much money on a movie that makes every other movie associated worse merely by its existence.\\n\\nMy final complaint is that the Critics of this film were so clearly paid off. The disparity in Critic\/Viewer ratings is nigh unprecedented. To the point that its not clear whether they were watching the same movie. This really hurts the credibility of both Rotten Tomatoes and IMDB. My expectations were set high after reading glowing critic reviews. Even going in with low expectations would have disappointed grievously.","true":true}