{"101487":169826,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars has always been politically correct. From the beginning there were strong female characters and people of color. What made those original movies so good however were the writing\\, acting\\, and revolutionary production. I felt like Force Awakens had that as well\\, and although stylized and sleek to the point where it seems to lose some magic\\, it still managed to bridge all the worlds together and still be interesting. This movie seemed like it was written by 10 people who were not communicating with one another\\, the movie then taped together and white-washed with random lessons about meat being wrong\\, capitalism being bad\\, males being weak and awful\\, and something about horse racing? This would have been completely OK if there were also a plot to go with it. But there wasn't. Instead we saw a slow speed chase throughout the film that  made no sense and could have been avoided by warping in front of the target or sending tie fighters around the target. Luke Skywalker is Mel Gibson now. Finn exists only to be saved by Rey\\, who without training is magically the most powerful person in the galaxy\\, and Kylo is a confused teenager who can't stop losing at everything. And who was Snoak? No one knows and it doesn't matter because he never learned about how to safely point a light saber away from you. I always thought light saber safety was like force 101 but Snoak slept through that lesson. Also a physically dead character is still alive. So good luck with all of that JJ. I think Rian Johnson really screwed you here. You're Lukeless and Snoakless and somehow you have to figure out what to do with a dead actor that is still somehow alive in your movie. Also\\, unless you one-up Johnson and make the new god-emperor of the rebellion ultra diverse you're going to get hash-tagged. I gave this movie two stars\\, because there were\\,sort of\\, light sabers in it.","true":true}