{"101487":139705,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw yesterday this movie before read any spoilers or bad audience reviews. I have to say that there were a lot of problems with TLJ but its not so awful as people mentioned. Yes the mission of Fin and Rose maybe was irrelevant to the plot as a whole  and some things were unanswered but there were some good stuff too\\, that maybe are worthy to discuss:\\n\\n1. Rey is coming from ...nobody. Why not?\\n2. Missions even in a movie like star wars can have a bad outcome. Why must everything come with a win?\\n3. Snoke died without explanation of who he is and what his story is all about. Who cares really? He was a sith lord\\, from another sith lore...So maybe he had a backstory and we would have another Palpatine with a stupid apprentice. No\\, here is all about the apprentice and  how he manipulates the outcome to his benefit.\\n4. The whole sequence with Fin\/Rose mission could be seen in another way of view. It is not in the film to add something to the plot but to say how some people make money - by war\\, that even in this galaxy far far away- everywhere\\, the rich and poor differences and class conflict are what define the way our society is... Every Snoke vilain is a place of power not because he is sooo Evil but because there are these problems in our society. For a Disney blockbuster and Hollywood in general to go ...so political is truly very rare and when I was watching the film I was wondering if this was intentional or not. Not too mention the last sequence with the army and the red smoke around that to me it seemed to much a reference to a specific red colored army in our planet... Im sure Disney would not like for even one viewer to thing this thing...\\n\\nNow. that Luke's character is destroyed I am completely agree but what we were expected? If you take a character story that ended before 20 years and you have to force a new movie and a new story for him...it will not end well.\\nNow for Leia? She can use the force and do brilliant stuff with it. Why not? After all\\, she is skywalker...and if there was no Luke \\, there would be Leia (there is another...as Yoda said ones). Im happy that finally we got to see Leia usinf the force as a badass...!\\n\\nTO end this\\, what  Im saying is that maybe this film is actually worth of seeing and for me for sure begins a conversation...","true":true}