{"101487":106358,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"At long last it is here! The Last Jedi is a fantastic new addition to the franchise. I am inclined to say it is my favorite however I just finished my first viewing an hour ago and am still high on the fact that a new Star Wars movie is out. I cannot adequately rank it until I've had time to think on it. With all that said\\, The Last Jedi was exquisitely made. Director Rian Johnson has earned his place as a Star Wars director and I look forward to the new trilogy he will be working on in the future.\\n\\nThe film answers a lot of our questions and brings up many more. The overall plot is intricate but not overly complex. I admit that some of the timeline was confusing and didn't make sense which was a slight distraction. Without getting into spoilers\\, the film has different stories as with many Star Wars films. Like The Empire Strikes Back where Luke goes to train and Han and Leia go to Hoth\\, The Last Jedi sees different members of the cast go in different directions to help accomplish their goals.\\n\\nWe get our first real interaction with Snoke and it was fun to see this character fleshed out a bit as well as seeing his power. The relationship between Snoke and Kylo Ren is further understood however it was not quite what I expected. In many different ways\\, the film went directions I didn't expect and I was extremely happy with that. Unlike The Force Awakens\\, it was not a carbon copy of another Star Wars film. It had elements of other films in the franchise but it most definitely stands on its own. In fact\\, I personally feel that The Last Jedi feels more \\\"Star Wars\\\" than The Force Awakens ever did.\\n\\nDaisy Ridley's Rey shines again and we get to see her relationship with other characters take a different path. Rey and Luke\\, for instance\\, are fun to see on screen. It took me back to the days of Luke and Yoda. While the relationship between the two is not the same\\, it reminded me of that original trilogy feeling of master and apprentice. There is so much depth and story to be told between these two characters that you must see it for yourself.\\n\\nThere were a couple story moments that made me raise an eyebrow and question the logic behind them. There was one particular moment that the story only seemed to go a certain way out of convenience rather than how it would play out realistically. On the positive side\\, we got to see far more Poe Dameron and General Organa in this film than the previous entry in the franchise. I'd argue that Poe is more of a main character in this than even Finn but I also like Poe a bit better.\\n\\nThe Last Jedi engages in humor in just the right way. There were laughs to be had all throughout the film and they were well placed with about one exception. There is a moment near the beginning of the film where a joke is played. Unfortunately the joke is extremely out of character and ruins an otherwise epic moment. I was highly disappointed with the decision to make a joke in this particular situation in the film.\\n\\nOverall\\, Star Wars: The Last Jedi is strong with the force. Despite a bad joke and one bad plot point it was phenomenal. It was even better than I expected it to be and I cannot wait to watch it for a second time. I look forward to dissecting the new information we get\\, the lore we learn about the force and much more. With incredible acting\\, a solid story\\, great humor and an extremely Star Wars feel\\, The Last Jedi is easily one of the best in a franchise of exceptional films.","true":true}