{"101487":190339,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Trying to sort out where this movie went so wrong.  First\\, the director Rian whoever openly admits to thinking Annie Hall is among the greatest movies ever. Regardless of one's opinion of Annie Hall\\, Rian would have been a child when Annie Hall was out\\, so his interpretation of Annie Hall is that of a child and he seems never to have moved past his childish interpretation. Second\\, it worked a lot better when Diana recently came back from New Zealand with somebody  to save the world as Wonder Woman than when Luke does the exact same thing in this movie. Third\\, the Family Guy guy is doing way better with his spaceship based TV drama with the drawn out humor bits.  Sitting and watching Orville is far more satisfying than The Last Jedi\\, and also requires 2 fewer hours.  This Star Wars attempt at doing spaceship based TV drama with drawn out humor bits seems amateurish in comparison with Orville despite the Family Guy guy himself being an amateur at spaceship shows.  Finally\\, I read how Disney is rehashing sections of their parks or maybe opening new parks based on Star Wars and this movie felt an awful lot like going to Disney where you are on queue doing absolutely nothing for an hour per 90 seconds of glee on the rides that this movie seemed to be made to sell.  I give one full star for not having Jar Jar Bink and keeping the cutesy CGI characters to a minimum\\, and the other half star they earned with the single \\\"ooooh\\\" provided in 2.5 hours of movie. Thought tempting to retract the \\\"ooooh\\\" based half star for the stupidity of the other attempt at an \\\"oooh\\\" I'll let them keep the half star as I am feeling quite generous this morning!","true":true}