{"101487":156440,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"No No No No No !!!  Half way through this movie I wanted to scream. I should have screamed. I should have stood up and shouted and walked out. But I was transfixed by the car crash. I could nt believe what I was witnessing\\, I wanted to make sure i was nt having a nightmare\\, surely I d wake up and this garbage would nt be real. Luke Skywalker would not act like this. Luke Skywalker is not a coward. Why is Luke Skywalker running around on an island like a pathetic coward\\, lost and confused? Why does this plank of an actor called Daisy Ridley constantly have the best of him? Beats him up\\, tells him whats what\\, knows more than all the Jedi texts\\, that Luke has nt even apparently read? What the hell is going on? Forget the car crash that the rest of this movie is. Mark Hamill should be suing for defamation of fictional character. This is all wrong. Half a star is for people turning up to work who did nt have anything to do with the script or major decisions. How this movie has even got fifty percent is beyond me. God damn it. God damn Rian Johnson\\, Kathleen Kennedy and Disney. I feel for Mark Hamill\\, i really do. Goodbye Admiral Acbar\\, they screwed you too. I could write a better Star Wars movie while sitting on the loo with food poisoning on the back of a toilet roll. Who was that purple haired feminist? Ah\\, who cares\/ The other fifty percent who thought this movie was great need brain transplants.","true":true}