{"101487":175964,"Last Jedi":"Last Jedi","2017-12-15":"2020-07-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The least bad out of the sequels\\, in my opinion. At least this one takes a certain amount of risk rather than simply relying on nostalgia towards the originals. Still\\, for those who call this a \\\"bold movie\\\"\\, I should tell you that this movie is not really that bold and risky. It copies off many elements from Empire Strikes Back and Return of the Jedi (especially the former). The movie could have gotten good if Rey and Kylo Ren teamed up to rule the galaxy\\, but Rian Johnson wasn't willing to be that risky and take the story in a completely new direction. \\n\\nI have many issues with the movie. The Finn\/Rose subplot on a casino planet was a waste of time and served only to insert a out-of-place political message about animal cruelty. The Poe subplot makes no sense since Holdo could have just told him her plan (or at least assure him that she had a plan if it's such a secret). I don't like what was done to Luke's character since his character arc towards a wise\\, powerful Jedi was so beautifully done in the original trilogy. If Luke is going to be cynical when Rey meets him\\, at should at least turn back into the hero we love by the end of the movie and join the Resistance. Instead\\, he just helps them escape a momentary difficult situation and then dies. His death\\, by the way\\, makes Rey's mission to find him a complete failure. Also\\, the humor in this movie was really bad and out-of-place.\\n\\nThe dynamic between Rey and Kylo Ren was the best part of the movie. The force connection between them was a cool idea. I just wish it was used to take the story in a new direction. I think this is still a well-made movie and Rian Johnson is a good director. My issues are mainly with the choices in the plot and the lack of originality.","true":true}