{"101487":165375,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson's The Last Jedi finally gave us an entirely new film inspired from the original Star Wars without trying to copy it scene by scene as JJ Abrams did in The Force Awakens. I loved the main storyline about Luke coming back\\, what happened with Kylo Ren and his connection to Rae. I also loved the Resistance moments with Oscar Isaacs\\, Carrie Fisher and Laure Dern as the Vice Admiral. There were epic spaceship fights\\, Yoda\\, a new planet\\, the little owl like creatures and who can forget about those Swarovski crystal dogs? Too cool for words. Overall this was such a well executed film and narrative that makes me excited to see the next film. Definitely go see it!\\n\\nHaving said that\\, here are my criticisms:\\nI really did not like was the return of Finn. I did not understand the purpose of a formerly bumbling and inept stormtrooper turned hero without a real purpose. His introduction to the The Last Jedi was so fake after we thought he died in the last one. I could not even watch his fight scenes\\, it was so ridiculous. IMO\\, they should have let that character die and introduced a new one\\, perhaps from another planet who was also part of the resistance but with a connection to Rae or Kylo Ren somehow. \\n\\nThe addition of Rose (Asian-inclusive\\, trying to be diverse) in theory is a good one. However\\, the character looks like a 12 year old boy. There was absolutely ZERO chemistry between Rose and Finn because it's hard to envision it when the actress looks and dresses like a kid. Both Finn and Rose were superfluous additions even if they added to the story of The Last Jedi. These were missed opportunities to introduce more compelling characters. i.e. one of the jedi classmates of Kylo Ren who also trained under Luke Skywalker but escaped and did not get killed. Finn and Rose are the Jar Jar Binks of this new trilogy to be sure. I am all for inclusive non-traditional heroes but they have to be believable. Rose and Finn just did not sell me on any level. It broke my heart that Gwendolyn Christie had to go but not these two.\\n\\nFinally\\, I want to see Poe's character finally get his due. He needs a stronger storyline than just the lackey they make him out to be. Oscar Isaacs has so much potential and lumping him in with Finn and Rose just diminishes his purpose to rise and lead the resistance. And he could use a love story too.\\n\\nWhen I look at Luke\\, Leia\\, Han Solo and Darth Vader it just does not come close in terms of strong characters with the mish mash of protagonists introduced so far. The only two that stand out are Rae and Kylo Ren. JJ Abrams better not flub it up with his next film\\, though I am skeptical. We'll have to wait and see.","true":true}