{"101487":116429,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disney just put the last nail in the coffin of the greatness that was Star Wars.\\n\\nI have MANY problems with it.\\n\\n1) Kylo sucks\\, he's already been defeated. He's a cry baby of a villain not intimidating or respectable. He was defeated by the new Goddess of the saga\\, Rey. \\n\\n2) Snoke sucks too\\, he got killed off by the cry boy Kylo Ren... So there are no respectable bad guys...\\n\\n3) Leia can now f***ing fly?!?! Since when? She haz ZERO training... and not even Anakin (the most genetically gifted force-user) could fly...\\n\\n4) Literally ALL male characters suck. They even shit on Luke f****ing Skywalker because he didn't fit the SJW Femenist fantasy. I'm fine with Luke dying\\, but the way in which they did it and the way in which his character was represented is nothing short of DISGRACEFUL. A weak\\, coward too afraid to leave his cave = Luke... He didn't even get his own Yoda moment when we were like WOW! This guy is actually a great warrior or anything.. Instead\\, we just saw him create an illusion and then dying off.. \\n\\n5) Luke got beat up by Rey?!?! Seriously?! If Star Wars would've been respected at all Rey would've stood a snowball's chance in hell to even hit Luke at all\\, but then again she is the new God in the Saga b\/c she's female... SMFH. Not even Anakin as a Padawan would've been able to even touch many Jedi Masters\\, let alone the most powerful Jedi in History.. How is it that Rey with ZERO training can defeat Kylo Ren AND beat up Luke\\, AND use the force (Jedi mind trick and force push) with ZERO training?\\n\\n6) Luke saying the Jedi books are crap and you can't learn much from them? REALLY?!?!?!? THOUSANDS of YEARS of knowledge and now all of the sudden they don't know anything? Riiiiiight. \\n\\n7) This whole \\\"Kylo and Rey\\\" story is literally a copy\/paste and modify of the Knights of the Old Republic Saga with Revan and Bastilla. The game had a MUCH better and deeper plot and wayyy better than these movies. How TF can you not come up with something ORIGINAL with a Universe as VAST as SW?!?! Leave Revan and Bastilla for a TV show or something\\, don't destroy it with this BS\\n\\n7) \\\"All rich people are evil\\\" ... SMFH!!!!! What is this a Bernie Sanders socialist rally? Leave your leftist politics out of SW... Maybe it should be renamed Social Justice Wars.\\n\\n8) I'm not sure wtf this movie is\\, but it sure as s**t aint George Lucas' SW. I'm 100% DONE with SW and 100% DONE with Disney. They have to make it ALL about political correctness and politics rather than entertaining the actual fans. They will pay for this you'll see. They worried more about hiring a 'diverse' cast than actually making their characters have meaning and using the FULL potential of the SW Universe.\\n\\n\\nF*** Disney and F*** this movie. I'm OUT.","true":true}