{"101487":138571,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"In truth I would like to give the new Star Wars movies made by Disney a legitimate chance at impressing me. And in reality\\, I will say that Rogue I certainly does the aforementioned. (I rate it at the level of The Empire Strikes Back if not higher). However\\, in the case of The Last Jedi\\, while not the knock-off that was the previous installment\\, exhibits many of the same problems and traits that plague many Disney films: shallow characters that use pathetic jokes in place of substantive character dialogue; expansive sets that 'woo the eye' in place of mood setting interpersonal scenes; and gross adjustments of native source material in order to lighten or idealize the uncomfortable confrontational subject.\\n\\nThe Last Jedi (and by extension The Force Awakens)\\, tries to lighten the depths and retread the source material that Lucas underscored frequently in his six films. Johnson's take is defined by lightening the characteristics of each individual through the use of somewhat trivial and oftentimes uncomfortable jokes. Or at other times it is by trivializing traits of original characters via modern analogs - the emo impertinent and shallow tendencies of Kylo Ren. In pursuing these actions Johnson defines just how poorly he understood the motivating tropes that George Lucas was trying to evoke. \\n\\nWhat Lucas defined was a fall of a society\\, a collapse and subsequent rise of few individuals through personal sacrifice to bring \\\"Hope\\\" back to the galaxy. It was far from being a hollow deus ex machina that Johnson unabashedly utilizes. Rather\\, it hearkens back to The Seven Samurai by Akira Kurosawa that one wonders if Johnson-or Disney itself-is even aware of. In that film\\, the protagonists each had defining characteristics that were underscored by altruism. The outside influences were uncomfortable tragedy\\, despairing bandits\\, and the tragedy that is the fall of individual mores in the face of adversity. In the first Lucas films these things were often alluded to\\, defined\\, or outright thrown in your face. Lucas may not have always been effective at achieving their representation\\, especially in the prequels\\, but they were displayed. \\n\\nIn contrast\\, Johnson and Disney take liberty at making things family friendly-or like this film-as equal opportunity as possible. The original Star Wars was not Star Trek. It was conceived as a Space Opera only because allusions to old Japanese films would have been uncomfortable. In this sense\\, the substance of reason-and by extension-the suspension of disbelief is trodden on. I have raised my eyebrows at far more moments in these films than I ever did at the prequels. \\n\\nThe desire to utilize more 'real sets' was a wise move from the inception of these new movies. But they do not take the place of real 'mood setting' and design. In part my criticism of this facet has a great deal to do with the tragedy that is the new series of actors that have been chosen to helm the franchise. Daisy Ridley shows more triviality and woodeness than one of her predecessors\\, Hayden Christensen. The Fool in the World and the Flyingman is a trope that only works so often and only if the actor in question is approachable. In her defense\\, she tries her best....but like Christensen its not good enough. \\n\\nIn relation\\, the antagonists are beyond hollow - with the most substantive Andy Serkis - being the most illusory and short lived....'drum roll'\\, the award for Best Bad Guy goes to Supreme Leader Snoke. In contrast\\, male bashing at its finest goes to Adam Driver who displays spoiled effete with the best of them: a pathetic unimposing unthreatening bad guy that real men just want to slap upside the head. No amount of dazzling sets will ever make up for the poor choice of actor for that roll. I suppose in that sense it is perfect since he can't upstage the choice for lead in Ridley. \\n\\nThe remaining cast are just as subject to the shallowness of the leads and without exception are bound by it-whether through the inevitable write off of the original cast or through the need to play below the measure of the leads.  At least one though\\, Mark Hamill deserves credit for displaying a significant measure in an otherwise gutted film. Like Alec Guinness before him he goes off to the sunset a valued hero - but a very diminished one given Johnson's view. \\n\\nAs it stands the gross adjustment of original source material is a Disney hallmark with numerous ethnic myths and legends trodden over in order to ameliorate the darkness that defines us. The Last Jedi is no exception as it trivializes the darker tones and losses with the extraordinary - through deus ex machinas like Skywalker's Force Projection or through the use of 'chrome dome' jokes that are poorly paced or timed. At its core Star Wars is about the collapse and fall of man in the face of adversity. And it was originally conceived as an effects movie. By working together a synergy of these facets occurred that hinged on the part of the actors in convincing the audience to disbelieve. The truth of Vader was that he was a raving child-murderer. His son\\, never fell to that\\, even for the best of intentions. \\n\\nNevertheless\\, that defining moment in the movie results in what feels very shallow and forced. To assume that a Jedi Master of Luke's level would have failed so miserably at training or understanding the traits of his students is hard to fathom. It also significantly defeats the overall pacing of the original masterscore that Lucas himself set out and is a jarring offset. The only perception one receives is that is done for more capitalistic purposes than storytelling ones as one perceives that there is no real way to end the story nicely now with only one movie to go. The inevitable assumption is that it is being set up for a completely new idealized trilogy.\\n\\nAt its base this is a flawed forced moneymaking assumption\\, but one that Disney has had a habit of going with through the years. ?\\n\\nPlease note I am not a \\\"Bot\\\" arguing the ideals or merits of equal opportunity. I think Padme was perfectly strong and far more substantive as an actor than the current emo protagonist \/ antagonist.","true":true}