{"101487":169271,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoiler Alerts Throughout: You might come out the other end feeling like a rotten banana.  \\n\\nI've now had a day to ponder what exactly it was I witnessed yesterday in the theatre.  I reserved seats with my family and prepared for a sumptuous Christmas treat.  My step daughter had previously seen it and I had asked for absolutely no opinions which she obliged to admirably.  For all intents and purposes\\, I entered the theatre bathed in a fresh wash of midi-chlorians: I was free from media bias and friendly opinions\\, a 'Last Jedi' virgin!\\n\\nMy first grimace came after an intergalactic version of call waiting remorse.  The brilliant strategy of the rebel fleet (most notably Poe as Leia tried to distance herself from such a childish stunt) was to delay the amassed First Order by playing clueless with General Hux via ship to ship communications?  Yes\\, I admit I laughed; with a little cringe\\,  but inside my nerve endings were tensing.  Was this how it was going to be for the rest of the movie??? \\n\\nAnd to a certain degree it was...  Without splaying out the guts of the entire movie I can say it was slathered with cheap gags\\, political correctness\\, terrible ineffectual subplots\\, ridiculous strategies and outcomes and a complete trouncing of the force; BB8 became a slot machine\\, mansplaining Poe got a slap down\\, a whole quarter or third of the movie resulted in nothing furthering the plot\\, miraculous rebel bases appearing and surprise hyperspace rebel ship ballistics (really???) interspersed with notions of messing with the most important aspect of Star Wars: the Force....  Let me explain...\\n\\nHan Solo died in the last instalment and with him the embodiment of the Star Wars I liked.  He was tongue in cheek\\, daring and courageous.  But most importantly\\, he tapped into that gut intuition\\, that fly by your pants recklessness\\, that last minute brilliant insight that is part genius and part insane.  This is what makes great drama and fun adventure.  To me this is the non-Jedi use of the force.  \\\"Never tell me the odds!\\\"  Instead we are presented with the best rebel pilot being beaten down for his instinct?!?  He is denied and kicked out of the inner decision making circle.  Let's face it - the rebellion is practically a non-existent ragtag fleet by this point.  They need to be reckless and take daring risks.  (Remember this is drama not reality.  IMO real world politics have no place in a 2.5 hour space adventure movie). I know many will say that there is still plenty of daring to be had but in my mind the writers really took a cheap political shot at pissing on Han Solo's grave.  It made me feel ill.  And it stuck with me throughout the entire movie.\\n\\nLastly\\, I believe Luke Skywalker got the short end of the stick.  His little screw up created a Sith Lord???  Oh really??  And what now\\, he's having an edge of the galaxy 'woe is me' temper tantrum?  In my mind\\, highly trained Jedi Masters don't have little screw ups.  Its just not in their nature.  Their midi-chlorians wouldn't allow it.  Any person who can fish with a 200 ft fishing spear without using the force is not going to have little galactic altering screw ups.  Seriously ridiculous...\\n\\nIf only this movie could be erased from the Star Wars canon.  Go away Disney and take your space faring Mary Poppins with you!\\n\\nI could go on and on.  I wanted to walk out in the last 15 minutes.  \\n\\nIn the car ride home I discovered that I was the only one so damning of the 'Last Jedi'.  For the most part\\, the millennial teens in my car liked it.  Polarizing?  No doubt!  Empire Strikes Back it is not!  I had high hopes after loving Rogue One.  The Last Jedi has sunk far to the bottom for me in a galaxy not so far away it seems.  I'll end on a positive note. I really liked DJ (the slinky code cracker character played by Benicio Del Torro).  He had my favourite line in the movie.  I can't quite remember it but it was something like \\\"flibidy floop\\\" or maybe it was \\\"blibidiy blop\\\"?","true":true}