{"101487":134844,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I liked this movie because I am such a huge Star Wars fan\\, but even I have to admit that it was riddled with dumb sub-plots that did not have any bearing whatsoever on the overall plot of the movie.  Here are some of the things I liked and disliked about the movie.\\nLikes:\\n\\n-  The opening sequence with Rose's sister opening the bomber hatch was awesome.  It was directed in a way that creates a lot of real world tension and suspense that isn't very common in the more 'fantasy' world of Star Wars.\\n\\n-  Kylo Ren and Rey's light saber battle versus Snoke's red guards was pretty bad-ass.  Also liked that Kylo killed Snoke; helping to set up Kylo as the true antagonist of this new trilogy of Star Wars films.\\n\\n-  Finn vs Captain Phasma was pretty cool and helps to kind of set up Finn as a capable warrior; as opposed to the bumbling buffoon that he appears to be in the majority of both films.\\n\\n-  The reveal that Rey's parents were nobodies was a pretty cool revelation about the Force.  I like that anybody can use the Force powers; and not just the Skywalker 'related' bloodline.\\n\\n-  Laura Dern's character sending the Rebel ship into light speed directly into the First Order command ship was awesome; probably the best part of the whole movie.\\n\\nDislikes:\\n\\n-  Leia floating back to the ship after being blown into space was pretty dumb.  It was just a convenient way to undo a very risky decision regarding her character.  I just don't buy it.\\n\\n-  The whole Finn and Rose trip to Canto Bight was a waste of time.  Totally unnecessary since the 'code breaker' they were seeking did not factor into the rest of the movie one bit.  It was just a dumb narrative decision.\\n\\n-  Poe's mutiny against Laura Dern's character Holdo was so stupid and just a complete waste of time\\, since she had a secret plan that made his whole mutiny moot.  What's the point of Holdo withholding this information in the first place?\\n\\n-  Rey's entire time on the Jedi temple island was a complete waste of time.  She didn't gain anything from being there.  The only real revelation she got the whole movie was regarding her parentage\\, and that was given to her by Kylo Ren.  More fluff that bloated the movies runtime.\\n\\n-  The whole entire movie the First Order's ship is chasing down the Rebel ship\\, really?  Could they both fly any slower?\\n\\n-  Rose 'romantic' relationship and love towards Finn was stupid and unnecessary; totally forced.\\n\\n-  Luke Skywalker senses darkness in Kylo Ren\\, and his first inclination is to try to kill him as he sleeps?  That's so sneaky and weasily if you ask me.  Not the Luke Skywalker I know (who risked everything to try and save Darth Vader from the dark side).\\n\\n-  The Rebels get cornered by the First Order into a cave and have no way out.... only\\, there is a way out.  They just needed to look a little harder.  It made all the tension of them actually being trapped into a corner seem stupid and wasted.\\n\\nMaybe I'm being a bit harsh with my nitpicking\\, but this is Star Wars; we expect better.  Overall\\, I enjoyed the move.  I'll give it a 6.5\/10.","true":true}