{"101487":135981,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I love Star Wars.  I grew up watching an original one every night with my brother.  I grew up with toys and birthday parties.  When my son was born he had to be induced and we could pick either May 4th or May 5th.  I choose May 4th because I can picture the perfect future Star Wars themed birthday party someday.  This film is far from bad but its not good.  It is average.  \\n\\nI was so excited to see how TFA brought new life to the Star Wars saga.   I left the theater with excitement and mystery for what the future holds.  I and every other fan were excited to see how things would play out.  What the director did here was give the answers but left me feeling flat.  This film answers the questions asked but does not generate excitement.  There is no \\\"Luke I am your father\\\" moment.  Sadly\\, it is a big disappointment the emotional pay off one gets after viewing it.  I do hope that Disney looks at what Johnson did.  I feel he took every question TFA asked and just wrote out those aspects of the story to gear the Star Wars ship in the direction he wanted.  I hope that \\\"new trilogy\\\" Disney wants him to direct is taken away. \\n\\nSo unlike TFA when I left the theater wanting more\\, I left the theater feeling \\\"is that it?\\\"  I only home that JJ Abrams can repair the mess this one created and give a conclusion that is great.  I will be waiting.  Again this is not a terrible movie but its far from good.","true":true}