{"101487":172839,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The absolute worst Star wars film I have ever seen. I use to be down on the prequels too\\, but I read a funny comment last night that I have to agree with\\, the prequels look like Citizen Cain next to this travesty of a Star Wars movie. The list of all the issues with this movie is long. Supper man \/ Marry Poppins Leia\\, first Star Wars with no lightsaber on lightsaber fight\\, too much humor added when scenes are meant to have some weight\\, the terrible out of place admiral dressed like she is going to a formal dance \\, the entire useless Canton Bight scene (animal cruelty message\\, rich people are evil\\, and finding another person who can also hack the First Order ship just waiting in a prison cell that he could have broken out anytime but only does so now out of plot convenience)\\, the fact that they pretty much gave the middle finger to the fans about any backstory to Snoke the Emperor replacement and now Rey's parents are unimportant and some drunk junk traders that gave her away for a drink and are dead in a shallow grave ok Jakku is just terrible writing. I realize Kylo could have been lying about that but after making such a big deal that her parents left her and that her lineage would answer questions about why she is so strong in the force to just handle it that way is so disappointing. The First order is a joke. The entire move is based of the slowest space chase scene with all these convenient plot points that just don't work. The absolute worst\\, the hardest thing I can't forgive\\, and am still coming to terms with is what they have done to Luke\\, his character and legacy. Everything they did for his character was wrong and even Mark Hamill told the director that and both him and Disney ignored him. This is a character who against all odds tried to turn one of the biggest villains in the galaxy to the good side. He would not fight him\\, threw down his lightsaber and was willing to die for his father. Now because he feels some of the darkness in Ben Solo he decides to try to kill him in his sleep. Give me a break. That is so out of character for Luke. Not only that\\, but then he is so embarrassed that he runs away and hides closing himself off from the force willing to let the galaxy suffer and die while he throws himself a pity party. He has always been a character willing to go to great lengths to save people and the galaxy even when he was young and still learning his skills. None of his character actions are true to his past development. Luke always fought for his friends and looked for the good in people. So in the movie he finally he decides to astral projects himself only to dance around matrix style with Kylo to allow the others to escape rather than going to the planet to face him. They even showed his X-wing before this but never do anything with it. It would have been so legendary for him to have lifted it out of the water like he couldn't do in Empire and fly to face Kylo Ren. Instead we have him force project his likeness across the galaxy to have him just dies anyway of exhaustion. I am so utterly disappointed in this movie.","true":true}