{"101487":96878,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"1. Plot holes \\n2. Again changing how the force works to coincide with Rey being the almighty MAREY SUEEEEEe I mean the force is being treated with anime levels of fuckery here.  \\n3. Completely destroying luke's character\\, ignoring the entire arc he went through in the OT to the point that even Mark Hamill said \\\"I completely disagree with what you've done with this character\\\" \\n4.GlorifiedChaseSequence.mp4 \\n\\nOther shit that's wrong with it is SPOILERS REEEEEEEEE \\n\\n\\n\\n\\n5.  Snoke is completely wasted as a potential villain\\, we learn nothing about him other than that he can use the force like an anime power \\n6.  The knights of Ren are completely disregarded as a potential plot point and barely possibly mentioned once \\n7.  Daisy ridley continues to be unable to act her way out of a paper bag \\n8.  Leia acting like superman with the force \\n9.  Terrible writing which coincides with that most if not all of the characters are pants on head retarded in their motivations. \\n10.  no lightsaber duel and that stupid AF astral projection shit does not fucking count \\n11.  Lukes death is the dumbest shit ever\\, and is just a sign of how disney doesn't want to shill out the money for the high profile actors\\, and if Carrie fisher hadn't died\\, then she would have been killed in this movie or the next. \\n12.  Choreography is a fucking joke yet again. \\n13. Daisy ridley again because I hate her.","true":true}