{"101487":190221,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"True STAR WARS fans will be divided but overall delighted with this latest episode in that galaxy far\\, far away. What writer \/ director Rian Johnson does beautifully is connect the dots within his story and to everything that has come before. I've seen the film 3 times so far (more viewings to come over the next few weeks) and each time I notice more details and appreciate the twists and surprises. Without giving any of those secrets away\\, I will say that there is so much humor\\, heart and depth to this new adventure. The necessary confrontations occur but with unexpected results. There is plenty of foreshadowing and endless possibilities for where this saga goes next. The actors delivered in spades. Daisy Ridley's Rey possesses more confidence and strength. Mark Hamill's Luke is a fearful\\, jaded hermit with the heart of a warrior buried deep inside. Oscar Issac's Poe Dameron is arrogant and reckless\\, but brave to the core and he learns a valuable lesson about sacrifice. Adam Driver is a marvel as Kylo-Ren \/ Ben Solo and this fine actor conveys more with his eyes than most actors reveal in a lengthy monologue. The new sets\\, creatures and weapons are imaginative and yet consistent with what we've seen previously in this galaxy. The special effects support the story and are at times eye-popping and beautiful. John Williams' score delivers all of the beloved themes plus some new ones. This is top-notch film making where all of the elements come together to form something truly special. 41 years later\\, the Force is still strong with this franchise!","true":true}