{"101487":169510,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-05","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers: \\n\\nWhat I liked- The homage to old star wars such as yoda being a puppet... and the whole tie to Buddhism \/ nature while training on the island with Luke.\\n\\nWhat I disliked: The overall plot because of the unfulfilling questions and actions characters took.\\n\\nWhat was the point of killing the new Sith Lord Snoke without any build up or reason for why he was the sith lord now? You have a whole universe to work with... give me STORY!\\n\\nAlso Kylo Ren became Sith Lord to do things his way right? Then why did he continue the exact thing Snoke did? he is trapped in the whole idea.\\n\\nA soft reboot of Empire Strikes back ... i hate rehashed movies.\\n\\nAlso when Rey went to understand her dark side\\, unlike the empire strike back where Luke realizes he has the potential in himself to become like his father\/Darth Vader and wants to fight that ideal- Rey just realizes nothing is there and nothing ever will be there because her parents abandoned her because... well the plot needs bad parents i guess. If I was Rey I would just stick that light-saber in my gut and give up lol. But no\\, the main character must be a robot and continue forth a life of meaningless heroism because the movie demands it!\\n\\nI wish they made Flynn a more useful character... he seems to mainly get in the way or act recklessly and has to be saved. by others. Sure he had a big bad ass battle with his teacher\\, but to what point besides \\\"The student becomes the master\\\" trope.\\n\\nPlot twists don't make the movie better\\, just make it unpredictable... which is nice. Till you sit back after that moment and ask... \\\"So how did this make any difference again?\\\"","true":true}