{"101487":113583,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Complete disappointment - coming from a fan who loves all things Star Wars.\\n\\nMeandering\\, boring plot that succeeds at discounting or destroying anything interesting that was set up in The Force Awakes or that has existed for decades in the original trilogy.\\n\\n**Minor\/Major Spoilers Below**\\n\\nA film that starts mildly interesting for the first 10 minutes then goes boring for the next 90 minutes before picking up the pace\\, but not the excitement in the last 45 minutes.\\n\\nLuke: Not given a fitting or interesting send off. Throwing his lightsaber over his should for a cheap laugh was a major disappointment.\\nLeia:  Almost had an impactful moment - the entire theatre was in quiet reverence... then she turned into a laughable Marvel hero.\\nRey: Still lots of potential for this character\\, but man... the she picked up this Force thing no problem. No training required.\\nFinn: Goes to casino planet. Parks illegally on a beach and gets arrested (seriously).  Almost has a hero moment at the end\\, but it was thwarted. And that's about it.\\nPoe: Big on snark. Small on seriousness. Sits on a ship while it runs out of gas for 80% of the movie. Zzzzzzzzzz.\\nKylo Ren: I guess he's going to be the big bad guy in the next Episode. Potential\\, but they need to get him out of whiney brat mode.\\nPhasma: Total waste of a character. Nothing to confirm she should be in charge of legions of troops - or a leader. A joke.\\nHux: Belongs in Spaceballs\\, not Star Wars. Once upon a time Imperial Officers were played as cold\\, evil men to fear - now they are played as slapstick clowns.\\nRose: Went to casino planet. Freed space horses. Failed at her sole mission. And that's it. \\nHoldo: Pointless character. We don't know anything about her so her end had zero impact.\\n\\nRian Johnson did his best to casually brush off certain characters (Chewbacca\\, Akbar\\, C-3PO\\, unnamed cameo) and make the remaining characters into shallow characters. It's almost as if Rian Johnson hated everything JJ Abrams did and mocked TFA by destroying anything interesting in it.\\n\\nI wanted to love this film but it plays like a TV episode and lacks any emotional pull.\\n\\nThe fight in Snoke's throne room was enjoyable\\, but not enough to make up for the rest of it. Sad.","true":true}