{"101487":111994,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Can we please talk about a few things about this movie?  \\n\\n1.  Rose - she was awful and in it a lot.  I really found her cringy at best\\,  Jar Jar Binks annoying at worst.\\n\\n2.  Luke - standard performance by Mark Hammill but wow.  Did whoever write Luke's part see the original 3 movies?  They besmirched his character in so many ways.  Tossing his lightsaber\\, drinking walrus milk\\, cranky old fart\\, tries to kill a child.  Nope.  So\\, so wrong.\\n\\n3.  Snoke - Why was he just a hologram in the Force Awakens\\, but is now fully fleshed?  Who is (was) he really?  How did he not see his demise coming?  Total nonsense.\\n\\n4.  Poe - why was he running around without a clue?  Oh yeah\\, because he is a man and wasn't privy to the wise women's plan.  Why didn't they fill him in?  Oh yeah\\, because he is a man and therefore\\, not worthy.\\n\\n5.  Rey - very solid performance by Daisy Ridley\\, but if Rey is a nobody (not of Skywalker bloodline)\\, how is she suddenly so powerful with the force?  I don't think she literally misstepped once in this movie\\, so how is she suddenly so perfect?  Mary Sue.\\n\\n6.  Kylo Ren - good performance by Adam Driver\\, I rather enjoyed his scenes with Rey.  I am just having a hard time believing that he is as powerful as we are led to believe.  How?  Why?\\n\\n7.  The humor - it was not Star Wars humor.  More Guardians of the Galaxy.  It was in the wrong vein and at the wrong times.  It just didn't fit with the humor that we say in the other movies.  And\\, it wasn't funny.\\n\\nI loved most of the movies in this series.  Even the prequels\\, whilst not the best scripts\\, still made me feel like I was watching Star Wars.  The Last Jedi didn't give me the \\\"feels\\\" that I was expecting.  Instead\\, all I felt was bored and disappointed.","true":true}