{"101487":103938,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Another attempt at a soft-reboot of the Original Trilogy by cannibalizing and recycling bits of  The Empires Strikes Back and Return of the Jedi.  The scenes and plot were disjointed and confusing\\, the tone was all over the place\\, and the new characters remain as boring and uncharismatic as ever.  The movie also seems to want to preach a particular type of feminist message in which the female characters can only be built up by tearing down and belittling the male characters.  (As opposed to the feminism in the Original Trilogy where the female characters were shown to be the equals of the male characters fighting together with them side-by-side.)  But the worst and most unforgivable aspect of this movie is the way in which they destroy the character and legacy of Luke Skywalker by turning him into a bitter\\, and failed old coward for no justifiable reason.  This was an utterly cynical move to ruin a hero just to subvert fan expectations.  As one commentator put it\\, this movie watches like a hate mail to Star Wars fans.  After seeing where this trilogy is going\\, I have no interest in seeing any more of this disgraceful contempt the Disney creators are showing for a story and characters fans have kept alive in their hearts for over thirty years.  You'd better believe that thirty years from now nobody is going to care about a garbage mess of a movie like The Last Jedi the way long-time fans still care about the originals.","true":true}