{"101487":155464,"Last Jedi":"Last Jedi","2017-12-15":"2019-06-10","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My mother and I eagerly anticipated this move\\, but thought it was Meh. Despite the fact that most of the movie was action\/fighting scenes\\, we were bored. Why? Because we mostly didn't care much about what was happening. Why? Because there was not much character development and not enough humor\\, other than Rey upsetting the monk-like inhabitants of the island by destroying things and BB-8 scenes. There were those cute little bird things with Chewie and crystal foxes\\, which seem to be in the movie more for toy-value than anything else.  Not much story-telling aside from Luke Skywalker\\, Rey\\, and Kylo Ren's story. Mostly action. If you're 13\\, that's probably fine. The plot was pretty lame. There was nothing original- just the same regurgitated Star Wars tropes. It was great to see Carrie Fisher back as Leia\\, but she was not given much of a part\\, and she was in a coma  for a while. No explanation of how she managed to not get blown up\\, survive space exposure intact\\, and then awaken from her coma. The whole scene of going to find the master code breaker was lame. They tried to reproduce the exotic famous cantina scene from original Star Wars\\, but this time in a luxury environment that didn't work for the film. They find a cell mate who just happens to be able to get them out of the jail cell just after they arrive- well why was he there in the first place if he could leave anytime? Anyway..the characters of Rey and Kylo Ren were well-acted- but the story was missing something-it seemed hollow. Mark Hamill-'s performance made watching the movie worth it- he gives a powerful last performance for the only plot that has real teeth in this movie-his part in the turning of Kylo Ren to evil. Then he disappears at the end of the movie- too bad because I can't imagine the next movie without him. But it was a fantastic farewell for him- the best part of the movie\\, with the sunset echoing the original sunset in Star Wars episode IV on Tatooine\\, where he gazed out on the horizon as a naive teenager wondering where his future lay ahead of him. Why did he have to die\/disappear when he clearly is not old? Given his fundamental importance of emotionally carrying this movie\\, giving it some real weight\\, his disappearance for no clear reason does not bode well for the franchise. But I think he was given the farewell that he deserved. Ultimately this story was really about him with the rest of the movie being more of a distraction. ","true":true}