{"101487":165682,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"RT is filtering out 1\/2 stars and not counting to the total so I'm leaving a 1 star review so that it counts. BTW\\, the short five star reviews are the real bots.  \\n\\nThis was a propaganda film in a star wars wrapper. TFA and TLJ are back to back. Why would Rey care about Kylo and try to save him after he beat\\, tortured\\, and tried to kill her in the same week? So lets tell young girls that abuse is OK. The rebellion has no support after the win against the emperor and destroying the first order base? So then they must be terrorists and the galaxy really sided with the emperor\/first order. Terrorism must be OK. Let's save animals but not child slaves on the casino planet? Child labor must be OK. Luke closed off the force and wants to end the jedi but still wears the robes and is freeloading at their shrine like a homeless person? He must be upset that he didn't join his father darth vader to rule the galaxy to make a better life for his nephew (instead of making a mistake with him) and now he lives isolated in shame. The emperor was right when he said he would pay for his lack of vision. He didn't take his parents advise\\, then shut everyone else off because he made a mistake. So don't get up and try again when you fail\\, just fail and be a freeloader\\, as that is OK. Oh\\, and you don't need any training to use the force now even though Anakin\/Obi-Wan\/Yoda\/Luke spent most of their lives training. So go apply to that job you want with no skills and have the expectation that you will get it because of your diversity entitlement. It also comes with a free ship because someone died\\, free stolen jedi books (stealing must be OK)\\, and a loyal subservient crew. Force facetime is now available. The emperor could have killed yoda\/obi-wan a long time ago but chose not to I guess. Ships now run on gas\\, so how must per gallon does light speed get? With all the politcal propaganda in this movie\\, how can they not care about the environment and not use alternative fuel sources? Absolutely shocking. Now that the series has comedy\\, is Spaceballs really episode 5.5? This is how a franchise ends\\, to thunderous applause by critics. \\n\\nSolo comes out soon. Let's have a prequel (even though we should \\\"let the past die\\, kill it if you have to\\\" in TLJ) for a white male (being white and male means you are evil and stupid in TLJ) character that was killed off in 2015. You are shooting for billions in revenue but don't have an overall grand plan to not have one movie shoot another movie in the foot? \\n\\nSo it is said online through interviews that Rian (correct spelling doesn't matter anymore) Johnson will have his own trilogy that won't use any plot points from star wars history in movies\\, books\\, comics\\, canon. His ideas must be far superior. Way to go. It's as if a million fan voices all cried out in horror at once\\, and where then suddenly silenced.","true":true}