{"101487":111675,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"By far\\, the most ambitious star wars film made in a long time. If you are a star wars fan\\, you come in with certain expectations and theories that you have built up for the last 2 years. But Rian Johnson made it clear through Kylo Ren: let the past die!!! This is not a retro movie like Force Awakens. This is a movie that is concerned with the new characters and not fulfilling our expectations. This is different from all the star wars movies in its storytelling and style. Many will not like that\\, but the movie is still very good. You will need to see it more than once to appreciate it. Rian Johnson basically seems to undermine Force Awakens questions: What happens to Finn? He's o.k Who is Snoke? Doesn't matter. Who are Rey's parents? Nobody. Is Luke going to be the new Yoda? Not really. Knights of Ren? Not important now.\\n\\nHe takes big risk. Its the antitheses of FA. Where FA was about nostalgia\\, Last Jedi is about killing nostalgia  and establishing the new characters as as well as new ideas about the use of the FORCE.. If you wanted one of your theories to come true or you wanted the familiar\\, this movie will crush you. If you allow for the unexpected and can appreciate risktaking while making a good movie\\, you will love it. Star Wars fans are hard to please. They complain about everything. Rian Johnson seemed to not be interested in pleasing those hardcore fans. He is letting the past die. It's time for Star Wars fans to realize the future goes on. The original trilogy was 30 years ago and life just does not remain how it was for long. Times change\\, people change..people die\\, the unexpected happens. Over time\\, the last Jedi will be more appreciated. The gut check will make you hate it\\, but when you process it\\, you will like it more. Sort of like \\\" A New Hope\\\" gained more appreciation after the \\\"Force Awakens and Rogue One\\\"\\, so will last Jedi. Now its up to J.J to close the show. The past is dead for now. But the future is bright...","true":true}