{"101487":182298,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"THIS IS NOT A BOT REVIEW PEOPLE! REAL USERS ARE RATING THIS MOVIE LOWLY FOR A REASON!\\n- Rose is a terrible character and there was more mystique around Donnie yens character in Rogue one if we are playing the asian (diversoty)  card. Finn is an awesome character but her chemistry with him was terrible\\, the kiss between them about hope was sterile and felt extremely forced.\\n- The casino scene felt like it was trying to be the new Cantina and it was so cringy and terribly done. It felt forced like it needed to send a political message of profiteering and evil. Maz Kanatas bar was much more subtle in giving us an idea of the civersity of star wars and its interesting races and characters.\\n- Rose and Finns plot felt out of place as in the end the hacker betrayed them and got tons of people killed when if they got rid of it and launched the pods from the main ship in the first place the outcome might have been better as the first order didnt know about them in the first place and was only tracking the large ship. There was no payoff for the hard work Finn put in. Even phasma barely got 3 minutes on screen after basically coming back from the dead before. Was not satisfying.\\n- The reveal that Rey was a child of no one in particular was extremely underwhelming. I do think kylo could have been lying to her but from the director\\, he said that was not the case. I like the idea of not every force user being someone special but the tease of the force awakens of her possibly being someone interesting then slapping you across with HAHA gotcha! shes really no one\\, was jarring and disjointed with the feeling of TFA and the wonder.\\n- The expansion of the force powers in this movie felt really over the top and campy. Superman Leia was awkward and out of place. The once interesting moment of Leia force sensing Kylo ren not being able to kill her and dying in that moment of knowing her son still had some good in him was wasted. That moment didnt pay off in the end either as Kylo became more predictably evil over the course of the movie and still wanted to kill all the rebels on Crait.\\n- Snoke being this mysterious character to being dead within 2 scenes of him actually showing up was really not satisfying. I get that sith apprentice usually betray their masters to then become the sith master themselves but Snoke didnt feel like a threat. Palpatine was always looming\\, controlling and manipulative. It always felt like in this movie Kylo ren was in control and snoke was an afterthought. We saw a glimpse of his power but it was only for a moment. His character wasnt developed enough.\\n- Having the main cast split up was not a wise choice as the chemistry between Rey\\, Finn and Poe was completely gone as they play very well off each other. Instead we got disjointed side stories for each that made it feel like the story was always spinning off into tangents that didnt pay off in any meaningful way.\\n-Things I did enjoy were luke and rey training\\, Luke bringing her to reality and telling her the warning of the jedi becoming too haughty and prideful of their own selves and thats not how the force really works. I could have watched a whole movie or rey\\, finn and poe training with luke to become better fighters and kylo ren confronting him like in the end and using force powers that are established.\\n- The fight between Luke and kylo ren was great imagery and shows how strong Luke was but Luke himself said that he hasnt studied the force in a long time because it got him into trouble. I did like that he went out like yoda and obi wan.\\n- Puppet form yoda was a huge point for me. He looked great and was typical yoda with metaphors and helping Luke learn from his mistakes.\\n- Besides the first scene with Poe\\, he was useless and felt like he could have done a lot more in the movie. He is one of my favorite character and he was sidelined.\\n-The forced humor was not great. The only funny moments were chewie eating the porg and when they say that the empire hates the millenium falcon.\\n- We never really got any explanation of who or what Snoke is. His body and face tell a story and why he has his powers. He is just some random dude. Obviously he is powerful but it didnt feel like to me that he was intimidating.\\n- The visuals and sound design were simply amazing. Always have been for ILM and star wars but the artists truly killed it in this movie. Both were impactful and felt well done.\\n- This is the one star wars I dont want to see in theaters a second time. I've watched every star wars show and movie and it is disappointing to feel this way. Ive played many star wars games and media. I hope JJ abrams can make episode 9 back whole as I thoroughly enjoyed TFA.\\n- If this is a sign of how Rian Johnsons trilogy will be\\, I might not even bother to go see the new movies he makes as this was the worst star wars Ive seen. Even lower than episode 1 for me. I just didnt get that same feeling as I do with other star wars materials. At no point did I get goosebumps.","true":true}