{"101487":111464,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Bring back George Lucus. I am sure he learnt from his prequel mistakes to make something better than this illogical beyond belief episode.  Keep the technical\\, graphic and sound personnel which did an outstanding job and sack all the other incompetents including the Disney executives that gave the thumbs up to this rubbish.  Watch The Force awakens then this pile of rubbish straight after it and see the complete mess episode 8 delivers. Carrie Fisher carries the movie with the visual graphics but the script is woeful and the \\\"lets surprise the audience with another not seen before force power (the flying resurrection) defies belief.  Everyone's IQ drops over the course of the 2 movies.  Poe\\, Fin and especially Hux are transformed into stupid and annoying characters. Finn did have a kamikaze character redemption scene stolen by one of the worst star wars characters I have ever seen in the Asian girl\/engineer. The constant inconsistencies in the science of the star wars universe is another poison chalice Abrams and the writers drink from. Shields\\, hyper drives\\, tracking\\, cloaking devices\\, blasters\\, light sabres\\, etc. etc. constantly change to the whim of some out of touch script writer. Just let the physics remain the same and use episode IV as the template. The film is still epic because of the momentum of the star wars franchise but Disney need to completely rethink who is on episode 9s production crew.","true":true}