{"101487":169810,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars. For many the title symbolizes an epic story filled with epic battles and epic characters. This was not the case with The Last Jedi. For one\\, the humor was laid on too heavy. In the original trilogy--and the prequels for that matter--there were subtle moments of humor that worked. Whether it's Han and CP30 going at it or Obi-Wan and Anakin. The humor was there\\, but subtle\\, like a generous spread of butter on an English muffin. I'm sad to say that they dumped the entire humor butter container on The Last Jedi. Not only was the humor cringe enducing\\, but they were placed in the wrong scenes\\, which only served to take me out of the movie. Also\\, the movie was just plain boring! Which seems to be a running theme with these new movies. The middle dragged and dragged. I was so bored that I got up to use the bathroom\\, waited ten minutes\\, muttering to myself in front of the mirror how this was a big mistake\\, only to come back to more boredom. What was the entire purpose of that casino scene again? I still have no clue. Then we get to the characters. It's obvious Disney had no kind of brainstorming done on any of the character arcs. Do we learn how Rey gets her powers? No. Do we learn how Snoke and Ben hooked up? Nope. The best part of the movie is Luke Skywalker\\, yet they kill him off! Who decided that was a good idea? Not only that but they do it in the most chicken shit way possible. A ghost\\, really? The entire movie is a complete FU to the real fans. This is more a Disney movie than a Star Wars movie. The only reason I'm giving it two stars is because of the Yoda scene\\, and even there the CGI was abysmal. It's Yoda for crying out loud! How is it even possible that this rendition manages to decline in quality from the prequels? Suffice it to say that I won't be watching anymore Star Wars as long as Disney is in control.","true":true}