{"101487":174467,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The first time I saw this movie I couldn't really review it properly\\, I needed more time\\, I needed to see it again. Truth be told I disliked it on my first viewing...but there were elements I liked. Surely this couldn't be strike two for the new Star Wars trilogy? (I disliked 'The Force Awakens' also). Well this was my second viewing and I now feel I can get into this fully. Thing is\\, there is literally so much I could say about this movie it could possibly go on and on. So this time I'm gonna go with a slightly new layout. I'm simply gonna list my thoughts in sections and try to keep them as tight as possible.\\n\\nGeneral Hux and the beginning: Twas this opening sequence that really bemused and worried me right away (as it did with many). Hux was a relatively solid slimy character introduced in the previous movie. All the trappings of a weaselly baddie. Alas here he has seemingly been reduced to an actual jokey comedic character that could so easily have been torn from the pages of a spoof. The first real dialog we get is an absolutely horrendous back and forth between Hux and Poe. Poe mocking Hux with his communications tomfoolery\\, or as we in reality call it\\, a lame mobile (cell) phone gag.\\n\\nPoe bravely tries to bring down a First Order (Empire) dreadnought during the first space battle. Unfortunately things aren't going too well and the Resistance (Rebels) are being slaughtered. The rebels have one last bomber and one chance to hit their target. In the nick of time the rebel pilot is able to drop the bombs\\, but how can bombs 'drop' when in space? What about TIE Bombers you say? Well I always thought TIE Bombers fired their bombs downward\\, like torpedoes essentially\\, but straight down. That's just me. Also\\, if you look closely the bomber hangar doors are already open when the pilot triggers the bombs. How was she not sucked out into space?\\n\\nPrincess Leia: Oh boy! Oh boy\\, oh boy\\, oh boy! We've all heard about this now but I can't just ignore it. Yes we know Leia has force abilities (as we saw in Bespin)\\, and we know its entirely possible she has grown stronger with the force since then. That aside\\, its still almost impossible to get past how stupid this entire sequence looked and felt. To make matters even worse\\, when she flies\/floats back to the ship\\, there was no airlock. The rebels simply open the flippin' door! Everyone would have been sucked out into space in a matter of seconds for flips sake. Oh and while we're at it\\, she suffered absolutely no injuries whilst getting blown out of the exploding ships bridge. No burns\\, cuts\\, broken bones\\, nothing. I'm not even sure how those TIE torpedoes got through the ships shields\\, I guess they were special torpedoes?\\n\\nThen there is of course the flip side to this stupid scene. Unfortunately Carrie Fisher died in 2016 which naturally caused issues for the film. This scene was the perfect ending for Princess Leia under these circumstances. The fact that Fisher is no longer with us surely cemented that. But apparently not\\, apparently Johnson thought it better to bring her back and give the next director a real headache. The only thing I can think of is they have a large amount of pre-shot footage which they know they can flesh out into the next story. But if that's the case it sure as hell limits things drastically. Oh and they also killed Admiral Ackbar off-screen here too\\, you bastards!\\n\\nAnch-To and Luke: Adrift in a cold sea on an oceanic planet\\, this small windswept circular rocky island houses the first Jedi temple and the tree library of the sacred Jedi texts. The inhabitants of this small island? Small cutesy flightless (I think) bird-like creatures that get everywhere. And 'the caretakers'\\, dwarf sized toad-like creatures that appear to dress like century old nuns. Both races are completely unexplained and are completely useless to the plot. The Porgs merely serve as fluffy comedic relief\\, whilst the caretakers look like they belong in a 'Labyrinth' sequel. The only creature we briefly see that grabbed my attention was the sea monster breaking the surface in the background.\\n\\nAs with the Leia controversy I'm sure everyone now knows about the Luke controversy. Apart from milking large alien sea mammals for blue milk and generally being a grouch\\, there was also the lightsaber tossing moment. I'm not gonna dwell on it...but yes it was totally a 'fuck you' to the fanbase from director Rian Johnson. It was also a pathetic Disneyfied attempt at light humour. They basically used a powerful emotional moment in the plot for a quick laugh. Oh it was a plot twist you say? Keep em'.\\n\\nCanto Bight: Ugh! Sorry just raising my head outta my hands. Well I guess if anyone wanted something more akin to a Lucas movie this was it. Alas more akin to the worst of the Lucas prequels. Yep this entire subplot was completely unnecessary and really ugly looking. A super rich casino city located on planet Cantonica\\, its packed with super rich alien lifeforms and humans (most of whom appeared to be white? Even all the city police were white men\\, interesting). Anyway this was the segment where Johnson (under orders of Disney I assume) added the core liberal commentary on our present day society. War profiteering\\, animal cruelty\\, slavery etc...its all here\\, all the juicy stuff. Unfortunately most average people don't wanna  see this kind of stuff crowbarred into a Star Wars movie\\, not so blatantly for no real reason anyway. At least try with some flippin' subtly. It was really no surprise that this subplot surrounded the new character of Rose (Kelly Marie Tran) who herself was the epitome of a token politically correct character.\\n\\nDJ (Benicio del Toro): Another very pointless character if you ask me. Stupid name\\, stupid way of talking. I suppose he's the Lando of the movie\\, I wouldn't be surprised if he pops up again. Main question surrounding him\\, I wonder just who did that ship he pinched belong to. The owner of which was selling ships to both the Resistance and First Order. A possible set up for later on?\\n\\nSnoke: So he dies\\, yeah that went nowhere or so we think. I didn't mind that he died (a decent twist for me) but the way it happened seemed silly to me. This bloke is all powerful with the dark side but couldn't detect Kylo Ren moving a lightsaber that was inches from his person?? I guess Kylo could have clouded his mind or whatever but wouldn't he detect that too? I dunno. Plus his personal guards seemed to be useless. Rey showing her invincibility again...despite being revealed as a nobody. Oh and neither Rey nor Kylo actually use any force powers in that fight\\, eh?\\n\\nVice Admiral Holdo (Laura Dern): In short\\, a very unlikeable character who looked like a middle aged woman having a midlife crisis (the purple hair). At first it literally seemed like she was just there to put the men (the flyboys) in their place with a show of Disney backed feminism (anyone else notice that both the Resistance and First Order seem to have had a major female recruitment campaigns? I'm fine with the ladies in here but Jesus talk about beyond obvious). Amazingly it turns out that Poe's plans were the wrong route after all and Holdo was in fact correct (another decent twist). The problem is\\, by the time this happens I was so against Holdo that it just didn't matter anymore. They made her so unlikeable that it was too late to turn that around. Oh and all this technology but a major ship doesn't have autopilot? Really?\\n\\nYoda: Very cool (hehe) but why not Ben? Or Anakin? Or Qui-Gon? And force ghosts can now do stuff? They can make things happen in the realms of the living? And again another case of Johnson trying to throw out Star Wars lore and legend by having Yoda destroy the Jedi texts (although we see later they weren't...somehow).\\n\\nCrait: Ah the Hoth battle bit. I guess it was too hard for Johnson and co not to copy the original trilogy. Seeing as before this we had a copy of the Emperor's throne room with Luke from 'Return of the Jedi' (Kylo\\, Rey and Snoke). And a copy of the asteroid sequence with the Falcon from 'Empire Strikes Back' (Falcon in the Crait caves). Anyway this time the Resistance have about 15 people left (although in the next shot we see dozens more soldiers outta nowhere)\\, and they're up against an even bigger force from the First Order. Same layout as before\\, the Resistance base door behind a long trench with a few gun turrets. \\n\\nSalt!: Yes that's right\\, random Resistance fighter #5 luckily points out for us that the surface of Crait (or that area) is covered in salt. Just in case you mistook it for snow. You know\\, just in case you thought they were trying to copy the Hoth battle (insert eye roll here). Thing is\\, why did he do that? He could of killed himself\\, its an alien planet\\, you don't just stick random things in your mouth for Pete's sake. Is this the new Ridley Scott method of alien world exploration?\\n\\nThe First Order use around 10 brand new AT-M6 walkers (with a few older AT-AT's for some reason)\\, TIE's\\, Kylo's shuttle\\, and superlaser siege cannon. The Resistance use these old speeders (V-4X-D) which required a sort of rudder that stabilised them. I guess they must have been very old designs? The battle is indeed a fun highlight but is utterly stupid as the goodies should of been wiped out in minutes. In fact its so stupid I'm not even sure what they were attempting to do with those speeders. They certainly didn't have firepower to take on the walkers and they couldn't shoot at the TIE's. Its also here where Finn should of died in an emotional sacrificial moment of heroism...but he's saved by that idiot Rose which in turn gave the First Order the victory. Obviously Disney weren't ever gonna kill off their main minority actors\\, pish posh!\\n\\nLuke (again): So Luke dies...but why? It is shown Luke is using force projection to confront Kylo (a controversial aspect in itself). Are we to presume he was exhausted after using this power? So much so that he died? Maybe this ability is so powerful that it drains the users life force. Maybe that's why we've never seen it before? Maybe only the strongest most force sensitive Jedi can do it? Kinda makes you wonder why no one has ever used it before. Ben Kenobi could have used it against Vader when confronting him on the Death Star (if strong enough). Ditto Yoda against Count Dooku etc...Also have to ask why he projected himself looking younger\\, for Leia's sake?\\n\\nTo sum up\\, looking closer this is really 'Empire Strikes Back'\\, its just not as obvious. Rebels discovered\\, Rebels run away\\, Rebels pursued\\, Rebels lose in the end. What's funny is most of this movie is in fact a very slow chase between two very slow moving ships. And this is the first time we've heard about fuel issues in Star Wars also. A few other final little things. Phasma\\, what was the point? (and why don't all troopers wear her laser proof armour yet?). Nien Nunb's mask still doesn't look as good as the 83 version\\, how???!!! What the hell was all that crap with multiple Rey's in that hole? And what was that hole suppose to be? (other than another scene copied from EST. Luke in the cave on Dagobah). And the final sequence with that kid and his broom\\, kinda felt like another prequel-esque moment. Is this kid gonna be important?\\n\\nDid I like this new Star Wars movie? No\\, I liked bits\\, and when I say bits I mean bits. I liked the visuals\\, they were generally a massive improvement over 'The Force Awakens'. I genuinely loved the small chase sequence inside a huge Crait cave with TIE's hot on the Falcon's tail. Not only did this look great\\, it had some classic Chewie piloting moments plus some actual amusing interactions with the Porgs (dunno why Chewie would allow them to stay on the ship but whatever). The fact this sequence also had some John Williams classic Star Wars score along with it almost brought me to tears. I liked Snoke and his death (yup). Twas cool to see a big baddie go down so quickly and easily\\, unique. I also liked the First Order presence on Crait as it looked badass\\, alas nothing much happens with it. \\n\\nBut overall I was again disappointed with the final product [b]although[\/b] I will say I did enjoy it just that little more than 'The Force Awakens'. I'm really not so sure what they're gonna do going forward and the fact Abrams is back doesn't fill me with confidence.","true":true}