{"101487":121524,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Flat out disgraceful.\\n\\nSPOILER ALERT**\\n\\nThe makers of this addition to the Star Wars franchise prioritized pushing their SJW narratives (plural because there were more than I can count) over honoring the Star Wars universe. The writing was careless\\, drawing many previously understood elements in the universe into question. From the light speed kamakazi run's surprising effectiveness (leading us to wonder why in the world no one tried this earlier)\\, to the out of place killing off of the only true villain in the trilogy\\, this movie simply didn't leave enough time\\, attention\\, and devotion to producing a good Star Wars movie. \\n\\nFor a high budget production\\, where did all that time and effort for a high budget production go? Into what felt like very forced and unnatural SJW political themes. It's almost as though Disney gave the director a list of narratives to push and then said \\\"write a Star Wars story around these political themes.\\n\\nWe give these space movies a pass on firey explosions and sound in space because it's visually and audibly appealing\\, but this movie blatantly ignores the laws of space. Leia was unconscious and would have died when exposed to the vacuum of space. The space bombers somehow drop dummy bombs in zero G\\, and the girl releasing the bombs is somehow laying down on a platform while exposed to the vacuum. Purple haired feminazi admiral holdo doesn't fill anyone in on her plan for no apparent reason. She just keeps it a secret lol. What!?\\nThen\\, because apparently light speed was invented before cruise control\\, she HAS to man the ship on her suicide run to the mothership. Just... soooo many plot holes. I'm shocked no one brought any of this up to the writer. All of these things BREAK the viewers suspension of disbelief. Disney has written this movie for children to enjoy and for adults to be mentally reconfigured towards THEIR political ideologies. \\n\\nDisney has ripped the beating heart of Star Wars right out of its chest and we watch it slowly beat to a halt for the entirety of the 2 hour film. Other reviews will bring up the individual inconsistencies\\, but I don't even know where to begin.\\n\\n\\n\\nPeople go to a movie like this to escape for a few hours. This movie provides no escape\\, and destroys a highly anticipated movie in the process. The entire stupid space vegas story ark was pointless.  I don't think there  tIf they could retcon this movie and try again in two years\\,","true":true}