{"101487":119885,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Extremely disappointed in this movie. I've never wrote a review for this website but I had to..here are some of the parts I disliked (most of the movie).\\n\\nCONS:\\n\\n- Portraying Luke Skywalker\\, someone full of hope\\, as a nephew murderer. Luke\\, in the original trilogy\\, saw that tiny little bit of light in Darth Vader and tried to turn him back to the light. In this movie he sees a some darkness in Ben and immediately thinks that he needs to be destroyed. On top of that\\, his humor and pessimistic behavior is just not him.\\n\\n- Leia flying\\, what was that? RIP Carrie but why is she still alive in the movie? They so many chances to have her go off in a good way: tie fighters taking her out to show that Kylo couldn't bring himself to do it or having her stay on the ship instead of the pink-haired character. If they announce her death in the opening crawl in Ep. 9\\, I will walk out of the theater.\\n\\n- The completely pointless hour of subplot with Finn and Rose.. If the pink-haired admiral would have told Poe and the rest of the the Resistance that they were planning to escape to an abandoned rebel base to flee from the Empire\\, this would have happened. Finn\\, Rose\\, and Poe would have never tried to break into Snoke's ship meaning they would not have gone to Canto Bight\\, met the hacker who betrayed them and got a bunch of Rebel transports blown up on the way to Crait. They would have just stuck with the escape plan all along.\\n\\n- Unnecessary humor and scenes..Why did they have to add in a scene where Kylo was shirtless and Rey acknowledges it? like cmon...some of the humor was god awful. \\n\\n- Killing Snoke off with no explanation of who he is or how he came into power. They literally copy and pasted Emperor Palpatine into this movie despite the fact in the canon novelization of Force Awakens\\, they claim he has \\\"been around for the rise and fall of the Empire\\\". This would mean that he would have existed during Sidious' reign but someone wasn't sensed. If he was so powerful to hide himself from the most powerful Sith lord\\, how did he get killed by the oldest trick in the book? He was able to connect the minds of two force users but couldn't sense a lightsaber to his side. Waste of a potentially great character.\\n\\n- No true lightsaber duel.\\n\\n- Setting up the next movie to be extremely predictable: Rey fights Kylo and Rey wins\\, Resistance builds up from nothing and beats the First Order.\\n\\n- Trying to develop new characters before fleshing out characters from the 7th movie. That scene at the end of the movie with the force-sensitive kid and the broom...that should have been at the end of the 9th movie to set up a new trilogy. Instead those kids will probably be huge parts of the 9th movie. \\n\\nPROS:\\n\\n- Looks good. (Expected)\\n- Rey is a great character. I love that her parents are nobodies\\, much like other Jedi\\, she is without force-sensitive parents.\\n- Kylo developed better than I expected him to. I didn't like him in the 7th movie very much.\\n- Snoke scenes were awesome and the battle against the guard was great.","true":true}