{"101487":168339,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Some completely false claims were made about what we were going to see in The Last Jedi. Among these:\\n\\n\\\"Star Wars is being taken in a new and unexpected direction!\\\" But there was nothing new or unexpected about it. Mostly\\, it was boring and full of references and callbacks to earlier SW films. Tons of boring exposition\\, a make-it-up-as-you-go-along plot and endless hanging around a deserted island. I was frequently reminded of the prequels\\, which is not a good thing. The basic premise - that the Imperial Superstar Destroyer has to chase the rebel fleet for the whole movie until they run out of fuel - was stupid beyond belief\\, and made it impossible to buy into anything that happened.\\n\\n\\\"There are shocking twists\\\"\\, people were claiming. I was looking forward to this. All through the movie I kept thinking \\\"Any moment now\\, they'll reveal the twists...\\\" But it never happened. No twists. No shocks. No surprises. Just uninteresting stuff happening. Then more uninteresting stuff. Then the movie ends.\\n\\n\\\"Full of humorous moments\\,\\\" we were told. The Force Awakens had some humour\\, even the terrible prequels made some attempts. But I could detect no humour in The Last Jedi. It only occurred to me afterwards that it was supposed to have funny moments.\\n\\n\\\"Major characters die!\\\" I read in one review. I was waiting to see which ones. Answer: none of them. Snoke\\, who's  pretty much an anonymous CGI character we never got to meet\\, gets snuffed in his first significant scene. No loss. Luke fades away at the end\\, which seems like a personal choice and means he can return as a ghost if he likes. So no big deal.\\n\\nOverall\\, The Last Jedi is a very boring film that doesn't justify its excessive running time. It makes me think that The Force Awakens had more heart and was more entertaining.","true":true}