{"101487":194526,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well I'm done with Star Wars. Never would have thought a single movie could ruin my interest in it forever. Don't even get me started\\, awful on so many levels. Can't tell if I watched the sequel to Spaceballs or Star Wars. I was super excited to see this movie and walked out wildly disappointed with the beyond poor storytelling\\, terrible character development\/backstory\\, misplaced awkward humor and overall plot. Characters Poe\\, Finn\\, Rose\\, Phasma\\, DJ\\, Hux and more... dumb and pathetic. Actually\\, was there even a plot to begin with or did Rian and Disney just enjoy ruining Star Wars and calling it a twist? Rian is no fan of Star Wars and it is clear in his embarrassing take on the Skywalker saga. \\\"This is not going to go the way you think\\\" WOW was that the most accurate statement I have ever heard about this movie. Mark Hamill and Carrie Fisher were amazing and are legends\\, but Rian Johnson\\, Disney and the writers have an embarrassing view of Luke's character post Return of the Jedi. Disgraceful! Snoke was absolute garbage\\, a laughable character. This movie was slightly worse then the god awful Force Awakens\\, and the entire trilogy is falling flat on its face. Not to mention what a joke the lightsaber fight scenes were\\, did they even train the cast to swing a lightsaber? Not to mention I guess you can now drop bombs in space through bomb bay doors\\, while a person is literally in the same room with an open door to space like its nothing without getting sucked into space? But when Leia is exposed to open space she gets sucked out\\, turns into a popsicle\\, and proceeds to fly around like Bette Midler in Hocus Pocus. When she makes it back to the ship and they open the door to let her in no one else gets sucked into space? OK! So stupid\\, what an embarrassment to this entire franchise. Just a mess of a movie and a disgrace to the entire Star Wars saga. Rian Johnson should be ashamed of this pump and dump movie only meant to make money\\, by luring in fans with go fish marketing under the guise and possibility of greatness that never arrives. Only to dump a trash rendition of a once great franchise right on our laps like a stain. We deserved better and I haven't felt this duped since the last M Night Shyamalan movie. Wish I could get my money back for this disgraceful TRASH! How many of these \\\"critics\\\" were paid by Disney to give raving reviews? The critic reviews are beyond suspect and some of the audience reviews sound like Disney employees trying to keep the rating up so they can cash in. Either that or they have no clue what they are talking about and their opinions have now become completely devalued\\, lacking any form of credibility. 93%!! Rotten Tomatoes is almost losing credibility on this one. The authentic audience reviews have spoken. Thank you Rian Johnson for ruining Star Wars and single handedly destroying one of the best sci-fi sagas of all time. If I could rate this movie lower then 1\/2 star I would. I literally had to join this site to share my immense displeasure with this movie. Save your money\\, and wait till this D movie is on sci-fi channel. I waited over 30 years to see Luke milk an alien? TERRIBLE! The movie was so bad that even Yoda at the end of the movie was ready to burn everything down. The only way I will watch the next episode is if Luke returns to put a green lightsaber right through Bob Iger and Rian Johnson. #RIPStarWars","true":true}