{"101487":132827,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If you take this movie completely by itself without taking into account all the other saga movies or Star Wars lore as a whole\\, it's a thrilling movie and just a fun and overall good theater experience. But if you take into account all that you love about Star Wars\\, the mythology\\, the hero's journey\\, etc.\\, you will be severely disappointed and feel betrayed. I went into this movie fully expecting the hair-raising chills I get from watching Star Wars movies but I did not get a single moment like that. It immediately felt like I was watching a spoof of a Star Wars movie with the over the top humor and the general silliness of what's supposed to be a serious plot line. SPOILERS AHEAD WARNING \\n\\n\\nI did not like the humor throughout the movie except for maybe one or two instances. The beginning immediately put out my fire and brought me down from my excited state once Poe starts cracking jokes. I didn't enjoy the treatment of Phasma\\, once again. I understand she's a minor character but honestly her character gets crapped on in the worst way. I don't like the agenda Disney is putting forward. It's ever present in this movie and it's only going to get worse. Rey has no hero's journey. She has no flaws. No weaknesses. She is the perfect embodiment of a Jedi character without doing a single thing to become a Jedi. The Force apparently just wants her to be one so she is. I understand that Luke didn't have much training but Rey has had NONE. And to watch her treatment of Luke and how she thinks of him made me cringe. Phasma wasn't the only character destroyed in this movie either. Snoke was a real letdown. I expected better. But the treatment of Luke was the final straw that broke my back. I know the movie wasn't going to be what I thought it was. I didn't want it to be. But I did want it to fit into the Star Wars mythology that all the rest fit into. But now we have an odd movie out and it feels like I've been duped into thinking this was a Star Wars movie. I'm done with the new trilogy. I'll stick with the OT and the prequels because I like them so much better than this waste of an amazing opportunity.","true":true}