{"101487":186219,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was an absolute travesty. Everything they setup in the Force Awakens was squandered in this sequel. Iconic characters deviated completely from what we've come to know and love. The new characters have weak stories and are now forgettable.\\n\\n1. Dropping bombs in zero gravity? How is that even possible. I know this is fantasy but that is just a hilarious oversight.\\n\\n2. Leia\\, a person we've never seen used the force once\\, was able to shield a direct blast to the face\\, float into space\\, die\\, come back to life and then force pull herself 5 miles back to her ship? That whole scene was cringe worthy. A whisper of \\\"what the fuck\\\" was uttered by the crowd during the whole thing. You're telling me that Leia is now the most powerful Jedi in the universe? Why doesn't she just go fight Kylo.\\n\\n3. Luke was a man who took on Vader and the Emperor all by himself. He was fearless. Now you're telling me he was going to assassinate his nephew while he slept? What kind of coward did they make him? You're telling my Kylo is more powerful than Vader and the Emperor and that made Luke that scared? Also\\, Luke has dedicated his whole life to the Jedi but he still wanders around like a clueless idiot? Even as a Jedi master he still needs Yoda to guide him\\, what kind of master is he really if he's never learned anything on his own. Didn't even read the texts....laughable.\\n\\n4. Rey\\, with zero training\\, was able to take on the most powerful bodyguards in the universe and handle herself fine. Meanwhile\\, Kylo who's been training most of his life was struggling. You're telling me that this nobody\\, street rat Rey who's parents were drunks is the most powerful Jedi in history? \\n\\n5. Snoke\\, a one and done character. No background\\, no story\\, nothing. Just killed in a blink. He was reading Kylo's mind yet couldn't see his plan to turn that lightsaber on him? \\n\\nI could do this all day\\, the movie is completely flawed. Questioned they asked in the first movie were never answered.","true":true}