{"101487":188005,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was awful!  The director ignored Star Wars canon books about the character\\, so much could have been reference there.  We haven't seen Luke for 30 years and he is now a hermit?!  What's up with that?  Yoda was used as a comedy relief and Chewbaca barely even had a role.   The character Finn is back to being a coward and apparently learned nothing from his past.  \\n\\nWhat was great about the Empire Strikes Back is that you never see a time reference there.  It is up to the audience to interpret Luke's training while Han and Leia are running fro the empire.   In this movie they only have so many hours to stay at a certain speed before the new order catches up to destroy them.  During this BORING chase scene Rey is training with Luke\\, for only a few hours!  Nothing to play with here.  Suddenly she's mastering her skills faster that any Jedi in history.  We see time played in this manner in various movies\\, a non-Star Wars move was Lord of the Rings.\\n\\nThere so much wrong.  Where Luke tosses his old light saber without asking questions just throws it over his shoulder while the previous movie built up to this ONE scene!  Another horrible area is the Canto Bight scene - a total waste of time where we could have used this time to build up Rey's character with Luke\\, referencing his past. \\n\\nI watched the DVD Bluray release and the behind the scene's are nothing like JJ Abrams. \\n The director needs to stay far away from this franchise.  Rian Johnson is full of himself trying to sell this movie in his vision of Star Wars.  He cared little of its history and of the fans.","true":true}