{"101487":105456,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a Star Wars movie I would actually give this 3 stars.\\nAs a film I would give it 2 stars.\\nBut because I am sick to death of people making excuses for all of its shortcomings I am giving it 1 star.\\n\\nAs weak as the film was the worst thing about it is the people who defend it.\\nEven now\\, over a year later\\, I still constantly ran into people who have clearly spent a lot of hours reading up on how to defend this mediocre sci-fantasy movie - they remind me of Flat Earthers.\\nThere is no excuse for Star Wars products being so woefully sub-par.\\nPeople who claim its OK for Last Jedi to suck & be cheezy & have plot holes & bad acting & bad writing etc because \\\"its in the spirit of the series\\\" need to get a grip.\\nGuess what?\\nYou go back to the 80's and most TV shows and films sucked.\\nPoint in case: Disney - their 80's films are some of the worst they ever made.\\nNowadays they do their best to make every single release flawless.\\nI just want the Star Wars brand to do the same.\\nThere is absolutely no excuse for:\\n- totally ignoring science when dealing with things that relate directly to real science such as: gravity & the vacuum of space (I don't care if lightsabres & the Force violate the laws of physics\\, that doesn't invalidate gravity).\\n- using smash cuts\\, Mary Sues\\, and Sonic Screwdrivers to resolve every single challenge\\n- deliberately casting inferior actors & actresses when you obviously could have chosen more capable people\\n- ramming Porgs down out throats far too much - if they had appeared 3 times I would have liked them\\, but every time after the 3rd I hated them more and by the end I wished extinction upon them.\\nI could go on but this is already too long.\\nIts almost as if they deliberately made this movie suck as much as possible in so many ways that people would be too busy shitting on it to even get around to all the identity politics based criticisms - and in that respect they succeeded!","true":true}