{"101487":131003,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't know where all these good reviews came from. I'm wondering if they were either bribed or didn't see the same movie I saw. I've always enjoyed the Star Wars series.. but this draws the line. The story was so poorly constructed that it seemed a twelve year old wrote it. There were so many plot holes and pieces that didn't add up. For example\\, how was the First Order (the most powerful and dangerous force in the galaxy) so ridiculously gullible and easily fooled. How does making the villains so incompetent that a five year old could undermine them make the protagonists in any way triumphant. Let's not forget the characterization. Not one character seems to follow their personality\\, behavior\\, and charisma that we've learned to love. What's with Finn helping to destroy the most powerful weapon in the galaxy to save Rey\\, then in this movie completely forgetting his loyalty to the resistance\\, and having no character development whatsoever except for learning a lesson he already learned. Let's not forget he spent this entire time following this new character Rose\\, in order to create a forced and poorly developed romantic relationship to dispose of any future relationship for Finn and Rey. Why would they do this except for creating and even more poorly developed romance between Rey and Kylo. And who could forget Poe Dameron from TFA\\, the strong and charismatic pilot we all loved\\, doesn't like Leia's substitute pilot enough to cause a mutiny and can't seem to follow a single order he's given. We can't forget Luke Skywalker: one of the most iconic and loved characters of the entire series\\, becoming a complete hermit who is too scared to do the right thing and help his sister defeat the first order. He also had the horrid urge to kill his own nephew just because he saw darkness in him. Shouldn't Luke know better than anyone after saving Vader from darkness that Ben could also be saved and taught the ways of the light side? I guess not. Last but not least\\, the villains. Not only are the first order officers completely dumbed down to make the messy resistance task force an easy escape\\, but the ominous supreme leader snoke was killed off instead of answering fan's questions of who or what he even is by none other than Kylo Ren himself. I guess I'm order to save Rey? Why didn't he do this earlier in TFA to save Han? Maybe because this movie is a poorly written disaster. So this movie ends with barely any resistance members escaping to some run down planet and fighting off the best weapons in the galaxy with the worst machines I had ever seen. Only for Luke to come in as a hologram to distract his newly elected supreme leader nephew\\, who is clearly too unstable and incompetent for the job\\, so the Resistance can escape once again. This movie was a huge disappointment because it had so much potential. Only for the new director to create his own mess of a story for who knows what. Unless you want to see all your favorite characters be dumbed down and act nothing like the the fighters you've come to admire\\, I can't recommend this movie to anyone at all.","true":true}