{"101487":178363,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There is a lot of hate on here for this film. I am not a hater\\, in  fact i loved every overloaded second of this film! After a few days and some reading director and analyst's opinions and take on this film I have finally decided that this may actually be the most important film in the rebirth of the franchise. The Force Awakens brought us back to the familiar universe we all know and love. The Last Jedi says \\\"okay now that you have returned you need to see that things just aren't right\\\" 30 years have passed since the fall of the Empire at the end of Return of the Jedi and somehow all is not well. The presumably ended conflict somehow rages on. It is made obvious that all the old ways have not worked. The Jedi Order was not reborn and were not there to save the universe from the darkness in the galaxy. The movie makes it very clear that things need to change. The young and new would be heroes are consistently stopped from trying new approaches by the old heroes and Villains. This movie shows us how things need to be changed and the old ways need to be overhauled. The whole point of this movie is shaking things up so that the franchise can continue well into the future. I not only loved this movie\\, but I feel it is the Star Wars movie we need! To all the haters \\\"you can't a;ways get what you want...\\\" If you go into this film knowing it is a game changer I feel you can take much more enjoyment out of it!","true":true}