{"101487":99119,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A decent movie but not a good Star Wars movie. There are too many unnecessary story elements\\, pointless characters\\, and plot devices that make no sense. Overall it felt more like a generic space flick with a style more akin to Doctor Who than Star Wars. SPOILERS BELOW** \\n\\nLuke was the biggest disappointment of the movie. Mark Hamill did a great job but the way the character was written and his actions just did not feel like Luke to me. Luke was always kinda whiney and impatient but most importantly\\, he was very compassionate -which makes his decisions that led to the creation of Kylo Ren extremely uncharacteristic.  This is extremely relevant to the franchise as his compassion was the basis for his decisions in the original trilogy\\, namely that Luke disobeys his masters in order to save his father. See the similarities? Another problem is that there really needed to be more training scenes that would at least warrant Rey becoming the next- last Jedi. I know Luke's training was a bit rushed but at least he passed Jedi kindergarten. Luke eventually dies at the end without completing Rey's training  his death felt kinda stupid the way it was done. Oh\\, he was projecting himself there to trick Kylo? Sweet\\, he stalled Kylo without having to sacrifice himself... oh  wait\\, he died anyways. What's the point of that? Why not just go there in person? I understand they wanted to him to become the \\\"legend\\\" but you can become a \\\"legend\\\" by doing what Darth Vader did in Rogue One- BY WRECKING FACES WITH A LIGHTSABER! Nobody woulda cared if you made Luke overpowered for one last battle\\, I mean they already made up new Force rules in the movie anyways.\\n\\nAs to the rest of the movie. Some areas of the movie felt out of place and completely unnecessary (pretty much all of Rose's\/Finn's scenes). It also felt like there were too many joke and cutesy scenes\\, which I'm fine with ~ in moderation but they had several species of cute aliens pervade the entire movie. Some scenes felt like they were placed in there by completely different people and at times it felt like I was watching several different movies. It felt like the Chinese girl (Rose) was simply added to make the movie appeal more to Chinese audiences- like they did with the 2 Chinese characters in Rogue One. I'd honestly be fine with that but what was the point of her? All of her scenes with Finn were completely unnecessary. At least the Chinese Rogue One characters were cool\/impactful to the story.\\n\\nSome other let downs of the movie were the reveals of Snoke and who Rey's parents were. Those two things were built up so much and both pretty much amounted to nothing of consequence. I'm still holding out that it was all just a trick and maybe Snoke is still alive (if he really was Plagueis he can avoid death) and Rey's parents are still unknown but nothing in the movie suggested that either of those will end up being true. Also\\, WHY KILL ADMIRAL ACKBAR AFTER 3 secs OF SCREEN TIME ONLY TO REPLACE HIM WITH SOME RANDOM PURPLE HAIRED WOMAN 5 MINUTES LATER!! Why not give Admiral Ackbar the heroic scene where he saves the rebellion by crashing the ship into the star destroyers? Alsooooooooo\\, I see Nien Nunb but where's Lando? Wouldn't it have been awesome to see Lando pop in to save the rebellion? What the movie amounts to is the destruction of what was left of Star Wars and it was all for no real reason. I can understand burning the franchise to the ground but not if there is very little\\, cinematically\\, to gain from it. Very disappointing.\\n\\nSorry for the ranting\\, I hope you enjoyed the movie!","true":true}