{"101487":199517,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"wow what a steaming pile of S#$t who the hell is Rain Johnson.  FIRE HIM NOW do not let him touch another Star wars property.  I cant believe i prebought tickets to take my kids and have to sit through this mess again. I was a little worried it was going to be alot like empire\\, but it wasnt\\, they left the best parts of empire out\\, kept all the crap. He took weak plot points from A new hope\\, phantom menace\\, and return of the jedi and jammed them into one movie.   And then lifted the some of the worst dialogue from all the movies.  Lets talk about WOW moments.   WOW snoke sure is powerful but is killed instantly with zero explanation of backstory\\, what a freaking waste thanks for the two years of net nerd speculation\\, maybe you should have read it they had some really good ideas\\, would have made a great movie. Who is Rey\\, she is nobody!   I am guessing JJ is going to fix that but who knows. Oh and we have to kill a old character (cause its obvious people dont like the original characters\\, just incase disney reads these and i know none of you have any idea what your doing people like the old better then the new)   Maybe Mark Hamil begged to be killed off because it doesn't make sense in any fashion that he dies.  \\nDisney you need to get your act together.  New speculations.  - JJ is going to shoot Episode 8 over and pretend this movie never happened.   Maybe  George Lucus will buyout Disney and take control of the whole thing and claim new Canon.  I can tell you one thing for sure I will never prebuy tickets again.  What a huge disappointment.  Can we sue Rain Johnson for butchering a national treasure. Rain Johnson you suck.  I am shocked someone did not stop this\\, I don't know how you got your 93% maybe Disney paid for that.  I really dont know how they figure that rating\\,","true":true}