{"101487":132003,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-14","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If I could make a title to this review\\, it would be called. Knights of the Oh dear\\, woe is me.\\nThere are SPOILERS in this review.\\nLet's go back to a long time ago in a place on earth not that far away. Loma Linda CA where I saw firs Star Wars. I became an instant fan ever since I laid eyes on New Hope and Empire Strikes back continuously played on regular T.V. You got a chance to not only change your life but young Skywalker you can change the Galaxy. That rang true to me as a kid. You can do great things young padawan. It happen no matter what challenge you just need a  blue light saber and a Millennium Falcon. Funny thing is I kinda compare young Mark Hamill to Toby Maguire the much loved Spiderman. They are technically orphans of sorts and have suffered loss and they accept great responsibility and of course they are white. Which if anyone wants to make a genuine likeable white character that people can't get enough of follow that Luke Skywalker\/Toby Maguire pattern. The CW's Flash did. I digress.\\n The Star Wars Empire Strikes Back made me okay to like Darth Vader a little even though he was clearly the bad guy. Now we have Kylo Ren who should put his mask back on and stop crying because he reminds me of my roomates spoiled 5-year old kid. I can't take Ben\/Kylo seriously because it seems like he is crying all the time. Firstly you killed your dad. I mean we may not have close ties with our folks but I'm not gonna act like I'm gonna do a bear hug and gut him with a red light saber. Dude I get you are conflicted between the light and the darkside of the force but get some space balls(no pun intended)((Sike! I intended that)). I like how the audience differs dramatically from the top critics that get paid to rate movies and the audience score. It's a whopping 43% which is virtually almost half. Can a consensus of views be that far apart? I wonder if the critics got paid to give this an amazingly high rating. Nah that's silly nobody would ever do that. Did the critics just rate this movie on visual fx alone? I wasn't sure if they watched the same movie but the story sucked. That's right Rian Johnson you couldn't ruin this movie any worst. It was a big chase scene with a reveal that yes of course Princess Leia Luke's twin sister has Force Powers even though she was not trained by Yoda\\, Obi-Wan or anybody. General Organa could have read a digital e-book that was archived in the Rebel Alliance database but I just made that up so no. Laura Dern a new character is this gala dressed badass that to me doesn't seem like she knows what she is doing. I actually side with Poe. Even when she does her kamikaze effort she seems she doesn't know what she is doing. So you introduce a new character give her weight then killer her in such a courageous manner. I thought Finn was gonna die. I was like dude that is a valiant yet unnecessary death. Then Rose who is also a new character that I don't really care for because she doesn't do anything special. What about the characters that we fell in love with in the Force Awakens Episode 7? We just get new character after new character and Rian Johnson doesn't know to kill people or to introduce people because Snoke who should have seen his death coming using his powers could be still alive and he had a non-climactic death. \\nLuke. Member that likeable character you met in Episode IV all the way to Return of the Jedi? Well he was an asshole in this movie. Like we see him trying to lay down the law with Rey and just comes across as a grumpy old Hermit. Sure just like real life people can drastically change and that artistic choice didn't sit well with too many fans including me.\\nThe 2nd biggest upset or letdown was when Finn who has good chemistry with Rey is never with her in the movie until the end.\\nThe first biggest upset or letdown is the reason why. Finn goes on a scenic casino mission for NO REASON. Sure they mean well but apparently Vice Admiral Holdo(Laura Dern) has everything under control. Why can't she just tell everyone the plan and then they wouldn't of had to go on that mission for no reason.  Member when the Rebel alliance is getting away in the escape pods? I'm wondering why the laser artillery dudes of the First Order didn't just pick them apart. The distraction wasn't that big of a deal. And how about a subtle non-important role of Justin Theroux. But the other non importantness(I made up another word) of Benicio Del Toro as DJ. Dude anyone could have been DJ but noooo they put 'em in because Disney can afford it. Benie could have an agent or manager that hooked you up with the minor role. He wasn't a likable character but hey that is what this  current Star Wars franchise does they do celebrity character cameos. Daniel Craig played a storm trooper in \\\"STAR WARS The Force Awakens(2015)\\\". Even though this sucked will I watch the third installment. Yes. I'm invested in this and I've already skipped really bad movies in the series like Episode II Attack of the Clones. I won't even watch it and I think it's on my not interested list. Natalie Portman at least you did good in Black Swan. We will see how good Annihilation is but she glad she wasn't in Thor: Ragnarok. BTW I'm only watching Annihilation because of Tessa Thompson. I digress Rey is well the female version of Luke and we know she is noble and comes from a family of drunkards that didn't care about her which is cool I guess there are many reveals and many not so much reveals in this movie but doesn't hold it's weight in the Star Wars universe. You can go ahead and watch this movie and maybe find it hysterical how lame it is.","true":true}