{"101487":147763,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I would typically never spend the time to write one of these\\, but in this instance accurate reviews are sorely needed. Do not believe the liberal SJW's screaming that only fanboys and racist hated this movie. This movie cheapened all of the Star Wars lore by making political statements and simultaneously exhibiting poor storytelling. Everyone has force powers! Why you ask? F@$$ you! Girls are powerful and can do anything they want\\, that's why! On top of the nonsensical nature of Reys abilities Luke Skywalkers character does nothing but be a downer the whole movie and then gets unceremoniously killed off at the end so that people only look at Rey as the main hero in future films. And all the while\\, liberal politics (most of which I agree with but hate to have crammed down my throat in a Star Wars film) are consistently pelting the viewer in a most unabashed and unimaginative way. This movie was the pinnacle work of the participation award generation. \\\"We don't care if the story is consistent with the lore from the other movies\\, or that it makes objective sense. Look! Women in positions of power and a diverse cast! What do you mean it sucks? We gave you flashy lightswords and some explosions! That means we are entitled to push our ideology on you and make you say you liked the movie or we reserve the right to call you a racist nazi!\\\" I disgust me that I have to be from the generation to ruin this IP. Certainly go and see the movie for yourself\\, but do not hold out hope that it is a good Star Wars movie. It is far more like a decent Transformers movie than anything. All visuals and no depth or consistent tone. Personally I am on the train to strike it from the cannon and we can all pretend it never happened. Gross\\, and good riddance to that piece of crap.","true":true}