{"101487":116960,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Don’t believe the critics! Clearly Disney is paying for positive reviews! This movie is so inconsistent\\, dull\\, and boring. The characters go against their own narratives and nothing they do makes any sense. You’ll hear from critics that it’s bold and the final act is fantastic! They are completely full of themselves! Spoilers ahead : We see Leia get blasted out of her ship into space\\, and manages to use the force to pull herself back in. Seriously the silliest thing I’ve ever seen in any Star Wars film. Luke is some washed up loser because of some past deed\\, and won’t go help his sister and the rebellion because he’s lost faith. We know from his character that he would always want to go help his friends. It’s literally what happens in the original films countless times - he even leaves yoda while training to go save them. Finn’s storyline is just terrible \\, just boring \\, pointless\\, and terrible. Shame on the story writers. Was so pumped to see leader snoke\\, and he literally dies in a comical way. Oh and same thing with Finns trainer\\, she just dies\\, and we’re supposed to be like yah!! Rey is somehow stronger than all Jedi and Siths after 1 day of training. Because yes\\, the storyline for this film apparently takes place within 1 day?? Somehow a whole fleet of first order ships can’t catch up to one rebellion cruiser\\, can’t destroy it with their weapons\\, and have to wait for it to run out of fuel? This is the best plot line they could come up with??? Seriously? And then Luke just dies on the island at the end. Did he need to die? Was it necessary? Or is Disney just trying to push along all these crappy new characters. Once more we’ll see another genre once loved turn into Disney goo. This is why films are dying! ","true":true}