{"101487":189457,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Too many nonsensical plot developments\\n\\nI liked the funny banter between Rey and Kylo and the \\\"light speed crash\\\" scene is an amazing image. But overall\\, there were too many strange nonsensical plot developments. \\n\\n\\nProblems: \\n1. Does not build on important mysteries from previous film\\n\\nWho are Rey's parents? It is simply mentioned by Kylo Ren. Are we supposed to just take his word for it?\\n\\nWho is Snoke? Where did he come from? We never find out and he is killed.\\n\\nWho is Captain Phasma? Why is she different from the other Stormtroopers? Character is never developed then she dies.\\n\\nWhy is there so much focus on Luke's light sabre if it's irrelevant to Luke?\\n\\n2. Slow nonsensical chase scene with the rebels\\n\\nWhy can the rebel ships just stay \\\"out of range\\\" of the Star destroyers?\\n\\nWhy can the star destroyers only fire the rebels from afar? Are they using lazers or slow moving missiles?\\n\\nWhy does the new commander keep her plans a secret? Why not do the suicidal jump to light speed with another ship?\\n\\nAt the start of the film\\, the \\\"bombers\\\" look incredibly slow and easy to target. Why use them at all?\\n\\n3. Completely irrelevant sub-plot with Finn and Rose\\n\\nWhat was the point of getting codebreaker if he wasn't going to help them anyway?\\n\\nWhy do they set the slave animals free but not the slave children?\\n\\nThere's no romantic chemistry or romantic build up between Rose and Finn. Why does she suddenly fall in love with him?\\n\\nI don't agree with the critics that there was some deeper effort to keep fans guessing. I think it is simply poor story telling\\, poor character development and invented dilemmas.","true":true}