{"101487":165085,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson did the impossible and made fans like George Lucas again. Lucas may have been inept as a storyteller when he created the prequels but at least he did not trample on everything that means anything to a SW fan.  \\n\\nThe good bits first: Daisy Ridley and Adam Driver deliver great performances and their scenes together really worked. The Rashomon reference was very nice in principle but just didn't rhyme with Luke's established character. \\n\\nA total lack of feel for established characters is where the deplorable misfortunes of TLJ start but not in the very least end. Given that Luke had risked his life based on a glimmer of hope that some good was left in his evil father\\, it just does not work to make him even consider killing Kylo Ren. \\n\\nYoda's brief appearance is exemplary for a number of systematic issues with TLJ: 1. Characters are used in a throw away manner. They appear from nowhere\\, are disrespected and disappear to nowhere again. No proper introduction\\, development\\, or closure. 2. Yoda's demeanour does not befit his established character. Instead of being a wise sage\\, he comes across as someone who has sniffed too much cocaine\\, commenting on the Jedi texts as \\\"page turners they are not\\\".  3. He is able to have an effect on the real world. This kind of playing loose with established rules of the SW universe(it happens a lot in TLJ) is not creative; it simply undermines everything that happened in all the episodes before. \\n\\nAnything that seems to drive his twisted story or creates shock value appeared to be par for course for Rian Johnson\\, no matter how jarring the experience for anyone who cares about SW. If you were tasked with creating a skit that mocks SW\\, would you be able to come up with something more contemptuous than Luke throwing his light sabre over his shoulder? Would you be able to come up with scenes that are more absurd than Luke soiling himself with milk from a four-teated sea cow\\, or swinging from cliff to cliff with a preposterously long spear for no apparent gain? \\n\\nAnother major issue is that the numerous attempts at humour constantly misfire. The jokes are not just daft\\, targeting Kindergarten level\\, they just don't work. These constant misfires also destroy any kind of consistency of tone. The inflationary use of bathos may have become normal (in the sense of \\\"regularly encountered\\\") in today's flicks but it certainly has not become good. \\n\\nOne could go on and on about the many issues this film has. The script is filled with illogical scenes and decisions. Even if Rian Johnson did not trample on everything SW fans believe in and everything TFA had set up\\, the ridiculous script on its own would catapult any sensible audience out of their suspension of disbelief. \\n\\nMy gripe with TLJ is not that it did not fulfil my expectations. I had none. I did not read any extended universe literature\\, I did not follow any fan speculations\\, I did not even watch any of the trailers. I have no problem with a struggling Luke either. My problem is that the film itself is just bad. Like the prequels\\, it completely and utterly failed to make me care about any of the characters for more than a split second. I liked the fledging relationship between Rey and Finn in TFA and loved their reunion in TLJ. But then Rian Johnson throws another spanner in the works by introducing Rose. Rose has no chemistry with Finn whatsoever but is artificially forced into the story as a new potential love interest. This makes as little sense as her egoistic stunt with which she prevents Finn from saving all his friends with a brain dead comment about not destroying what one hates\\, but saving what one loves. Wasn't Finn exactly trying to save the people he loved when Rose sabotaged his manoeuvre? Finn was not even targeting people. I'd be fully on board with a message along the lines of \\\"stormtroopers have kids as well\\, so let's not kill them by the dozen if you can help it.\\\" However\\, Finn was just targeting a weapon. He was making a self-sacrifice (a well established theme not only in SW but all of literature and even used in TLJ) to disable a weapon. Was his alleged \\\"hate\\\" going to hurt the feelings of the battering ram?  Let's not even contemplate as to why Rose and Finn even make it to this point under the bombardment of the First order\\, or how they get back safely unprotected across the battlefield. \\n\\nIt is a sad day\\, but TLJ managed to kill a saga not just for me\\, but for many\\, many fans. I couldn't care less what Disney does with Episode IV.","true":true}