{"101487":175076,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi has great visuals and audio. \\n\\nIt is surely the worst Star Wars movie to this date and simply a really bad written and partly directed movie with a lot of plot holes and many other big issues.\\n\\nThe humor of the film does not work. It is a mix of classic Disney and Marvel humor. It does not work in Star Wars.\\n\\nThe characters are in no way fleshed out. Luke Skywalker is the only character with a developement\\, which makes no sence it did not even take place in the movie. He was just dumped down to let Rey shine\\, which did not work either. I could write a whole book about what Johnson did not get right with one of the most iconic characters in cinema history and why his approach on Luke is a disrespectful disgrace. \\n\\nThen you have the new characters which don't get any developement at all. Rey has nothing to her. If John Travolta would appear in Episode 9 and accidently shoot her in her face\\, audiences couldn't care less. She's just kind of an overpowered \\\"Marvin\\\" who is the only real character interacting with the main villian but it has absolutely no meaning\\, because she is literally nothing.  Just like supreme leader Snoke who was kind of important\\, one might think but actually did nothing\\, just talked a bit how powerful he is and that's the end of his story. \\nKylo Ren got promoted\\, that's it. He's conflicted\\, insecure and exactly the same as in episode 7.\\nFinn on the other end got a developement. Rian Johnson pushed the reset button on Finns back\\, so that he's actually less developed than at the end of the last movie. But he's rewarded with an asian female version of Jar Jar Binks who's teaching him how to treat animals and that capitalism is bad. WTF has that to do with the story of this train wreck of a movie?\\n\\nThere are some of the stupidest plots and scenes in all of Star Wars in The Last Jedi which I don't even want to talk about ever again in my life.\\n\\nThen you have a strong feminist rebellion in a galaxy that introduced fourty f**kin' years ago one of the strongest female leads of all time to make this whole shit unnecessary from start to end. Every person with a penis is portrayed as stupid compared to the females but the whole plot shows that if general Holdo\\, a forgettable female rebel leader who became the end admiral ackbar would have deserved\\,  would not act like a dumbass the whole shit going on in the last act with many dead rebels would not even took place. And you could tell that there was a big feminist influence wrting the character of Holdo and that idiotic plot with Poe Dameron.\\n\\nAt the end of the movie you got a bunch of dead characters the same big questions from the force awakens still unanswered or answered in a lazy idiotic way. Episode 8 leaves you where it picks you up\\, just with less possibilities for a rewarding story to tell and the same characters without any progression. \\n\\nThis movie did not even take any risk like some reviews might assume. It reflects a lot of scenes from the original trilogy just without any impact and doesn't really tell any story. It has some feminists\\, anti-capitalism and vegan messages which it prefers over it's characters and story.","true":true}