{"101487":152630,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Luke was a jerk to Rey for no reason. Luke is a consummate good guy who was going to just kill his nephew? Milking that thing and spearing the fish were dumb. The Porgs are actually smart enough to feel grief about Chewy eating one? Porgs are completely stupid anyway except as an obvious way to sell plush toys. Rey is a Mary Sue but that doesn't personally bother me. Yoda was a joke. The humor was funny but was not Star Wars humor and mentally took you completely out of the movie. The entire chase was silly. The First Order really couldn't catch them or send someone in front at light speed? If Finn and Rose could escape\\, why couldn't everyone? Why not light speed through a ship earlier? Why not tell Poe that was your plan? Why not have Leia or Ackbar sacrifice themselves? Why not have Lando be the dude in the cell that helps Finn and Rose? Why would Poe and Finn go to Maz for help? Poe never met her and Finn barely spoke to her. Rose was a boring and wasted character. So was purple hair Laura Dern. They \\\"save\\\" animals that will be recaptured but ignore human slaves? Phasma is a bad ass that is easily defeated by a janitor. We see multiple new force powers out of nowhere. Lightsaber blades touch each other exactly one time...in a flashback. Luke could have actually been there and deflected all those blasts and let Kylo kill him (like Obi-Wan) and that would be much cooler than the punk way he went out and died. Chewy was completely wasted. How did Finn carry Rose a couple miles in about a minute right in front of multiple AT-ATs (or whatever they are now)? Rey could just throw boulders instead of weirdly lifting then all out at the same time in a dangerous and silly way. Snoke could have actually done something cool instead of dying in a stupid way for possibly the strongest force user we've seen on screen. His guards seemed powerful enough to just use lightsabers instead of clearly inferior crap weapons. Why wouldn't Kylo just stay on Rey's side? He just jumps back after not killing his mom and all his connections with Rey? The Leia force flight is horrible. Why didn't people get sucked out when they opened the huge doors to let her back in? Why was Luke such a jackass and just threw his father's old lightsaber? Jar Jar would have made this movie better. Zero cool lightsaber fights? You suck\\, Rian Johnson. It should be some indication to your ineptitude that your parents couldn't spell \\\"Ryan\\\".","true":true}