{"101487":134513,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left the movie feeling betrayed and underwhelmed. I immediately went to the Internet to confirm my feeling and yes - audience score of 55% on rotten tomato confirms it. I have no interest in watching episode 9. I know I still will watch it but I will go in with 0 expectation or expectation that Disney will fuck it up again. Rian Johnson is trying to impose his own creative direction on the whole movie and it is so disjointed from the rest of the saga. If you want to do all this\\, give Rey no heritage\\, kill Snoke off\\, then don’t build him up in Force Awakens and don’t build up Snoke in the trailer. In SWU\\, everything and every scene has meaning. You don’t come and say fuck your Star Wars fans. You can do that in Episode 7 but it’s too late in episode 8. This movie is full of misdirection. Why do you have to portray Holdo being bad and being a deuchebag? It doesn’t add anything to the plot. Why have useless casino scenes that don’t make sense? Why have them hunt down a code breaker and then fallback to a thief. Good work with the misdirection. It’s a pissoff a not being a good writer. Why does Admira Ackbar die? Why do you need to introduce Holdo? Why does Luke need to die? Where’s this force coming from? Why not tease it? It’s great as a new concept but seems more like Rian had too many creative control. There is so little scenes about Rey and Fynm. Episode 7 makes you crave that but Rian takes it all away. ","true":true}