{"101487":104639,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A profoundly tone-deaf awkward piece of cinema. Culture war politics aside the movie simply does not hold up on close or subsequent viewings. The pacing for the central conflict of the story is astoundingly bad as it rebounds between boring drawn-out exposition dumps and brief narratively irrelevant action set-pieces. What makes the viewing so painful is that so much time is spent dumping expository devices on the audience to replace all of the narrative threads Johnson arbitrarily abandoned from TFA. Many of the defenders of this movie claim that this criticism is unwarrented because the intent was to 'subvert audience expectations\\,' but if this 'subversion' comes at the cost of an astoundingly convoluted sluggish plot than I can't see how it can be justified. Johnson seemingly relishes tearing down Abrams previous film as he makes few references to events in TFA\\, and when he does it is solely for the purpose of arbitrarily refuting any narrative continuity. Effectively this felt like a film that truly wanted be the first film of the trilogy\\, and spent much of its astonishingly long 2.5 hours arguing that the last film didn't really matter. Every narrative breadcrumb dropped in TFA is methodically undermined in the most un-satisfying way possible. Who is snoke? Doesn't matter. Why is Rey so powerful? No reason. Where did the First Order come from and how did they build a planet sized deathstar in secret? Who knows\\, we certainly never bothered to explain it. Ultimately this is a film written and directed by a man with a chip on his shoulder the size of Star Killer base. The astoundingly poor treatment Johnson gives all of the characters (save Rey and Kylo) is really where people should be upset with this movie. Considering that the refreshingly diverse cast of TFA was largely welcomed by the fanbase it is astonishing how little attention or respect Johnson gives to his new cast of characters. Finn\\, a much beloved bumbling ex-stormtrooper\\, was given the absolute shaft by shoving him into an irrelevent\\, convoluted\\, and vestigial plot line. Accompanying Finn on this wild-goose-chase is the largely un-developed character of Rose Tika. Rose has almost nothing to do in this film save for deliver awkwardly obtuse political observations thinly veiling Johnson's personal views. Ultimately this awkward lurching behemoth of a screenplay ends up crushing its character's agency in the interest of poorly articulated and confused political statements. None of the characters have anything to do because Johnson is too busy 'enlightening' his audience in the most patronizing of ways. It is a film that claims to be 'subversive' and 'risk taking' but ultimately it is a self-indulgent bloated polemic disguised as a Star Wars film. At the end of the day this is a film in dire need of editing. But much like Episode 1: The Phantom Menace\\, the characters simply can't breath under the weight of the director's crushing ego.","true":true}