{"101487":163232,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Pretty much on par with the prequel movies.  Honestly was bored through huge chunks.  The handling of Snoke\\, Leia\\, and Luke was terrible.  The Casino scene is straight out of the Prequels.  The CG in this movie looked really questionable.  I thought it looked worse than the past several movies\\, and with it being the newest seemed odd.  The slowest chase scene ever.  Also\\, if a ship can destroy via light speed... why wouldnt the resistance just get a bunch of ships with Driods and lightspeed ram them into all of the First Order ships?  Poe pretty much is the cause of why the whole resistance dies... per the opening scene\\, and sending Finn on a wild goose chase that doesn't doe anything since they end up getting caught and killing the resitance ships any way.  The dialogue in this is soooo corny too.  Just a terrible movie.  It's not going to age well\\, and in 20 years no one will care about it.  Very few locations.  And the locations they had were super boring.  Space\\, Island\\, Space\\, Ship\\, Lame Casino\\, Hoth Salt like planet\\, Super Red Snoke room with ZERO Detail.  Just boring character development and weak plot points.   Oh yeah and now using the force means you are a SUPER HERO that can do just about anything.  THere is no subtlity in the force any more.  It's not mysterious\\, its just a way to do cool CG effects.\\n \\nI like FA.  But man this movie is just terrible.   Def wont got to the theater for a 2nd veiwing.  Could care less about the 9th movie now.  Just really underwhelming all around.  Disney is pretty much over saturating and ruining Star Wars at this point.  And don't you dare say Rogue One is good.  It's mediocre and depressing as hell\\, and the characters are als underwhelming in that movie too.  \\n\\nDisney only cares about $$$$$.   And it shows.","true":true}