{"101487":106491,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A truly disappointing film. \\nThe RT scores say it all. 48% audience ratings. So how is is that the critics gave it 91%?\\nTwo big assumptions here. Firstly\\, the original 'Star Wars' trilogy created such a huge fan-base and so much goodwill among critics that it is hard for many of them to give an objective review. Secondly\\, the makers\/distributors whatever\\, knowing their film fell short\\, wined and dined critics to 'create' even more goodwill.\\nHow can such a big movie get some really basic elements wrong? Like script and acting. Maybe they don't care. It's 'Star Wars' so people will still pay to see it\\, even if the reviews are poor.\\nPlot holes abound. The most interesting character in the film\\, Benicio Del Toro as DJ\\, is inserted as a coincidental plot device to allow our heroes to complete their mission. He only has a few scenes\\, then just disappears.\\nKelly Marie Tran's character states her love for Finn (John Boyega) after she saves him\\, but nothing that has happened before this scene indicates more than hero worship.\\nBut the biggest crime of this film is to allow poor acting to ruin key scenes. Daisy Ridley must have been chosen to play the lead because she physically looked right. Her face is open and universally attractive. Her silhouette looks right in the costumes provided. However\\, she is out of her depth in a Hollywood film. Her scenes with Luke when she is challenging his refusal to help the rebellion are embarrassing. It feels like she is auditioning for 'East Enders'. Some fault must lie with the director\\, who is responsible for drawing out the best performances from the actors. Screen acting is not about versatility\\, it is about being able to deliver a line well enough that it states the intention behind it. Note for the producers. Give Daisy some acting lessons before the next sequel. \\nGal Gadot as 'Wonderwoman' and Charlize Theron as 'Fuiosa' have upped the game when it comes to actresses portraying action heroines. Those performances combine a compassionate femininity with courage and kindness and the makers of 'Star Wars' need to keep up. This is not 'Underworld'. This is 'Star Wars' and the franchise needs to respect its audience.\\nAlmost as unforgivable are the unconvincing light-saber duels. A complete lack of athleticism on the part of the actors makes these scenes unexciting and slow. These fight scenes should be the modern equivalent of Errol Flynn and Basil Rathbone.  Note to producers. Train actors in sword fighting before next sequel.\\nThis may sound like a rant but I wanted the film to be really great but am hugely disappointed. Note to producers. Just make the sequel really good. Then maybe even more people will pay to see it.","true":true}