{"101487":178974,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"These new films are definitely for modern audiences. The innocent popcorn films that were the originals of my youth are gone. Since I was alive for\\, and saw the originals in the theater\\, these just don't feel like SW films. Taken on its own\\, many people\\, especially the younger generations\\, will most likely enjoy it. \\n\\nI thought Mark Hamill was outstanding- even though I didn't particularly care for what Disney thought of Luke. In fact\\, they've destroyed EVERYTHING that defined Luke up to this point- much like what happened to the ST: TNG characters in \\\"Nemesis.\\\"  And we never get to see him in real light saber fight.  I realize that the insinuation is that he exhibits an even higher use of the force by projecting himself.  But it doesn't matter- you want to see him in an actual duel.  Without it\\, we feel cheated.  \\n\\nIn fact\\, there isn't even one light saber fight in the movie.  The Rey\/Kylo Ren\/Preatorian Guard scene isn't light sabers.  The guards use vibro-blades. \\n\\nThe Finn\/Rose side plot was unnecessary and bogged the story down. \\n\\nThe bombs at the beginning would have floated away with lack of gravity.  \\n\\nThe revelation of Rey's parents is anti-climactic.  \\n\\nRey manages to skip all the training that\\, for 40 years of canon\\, we are told is necessary to become a Jedi. \\n\\nAdmiral Ackbar is killed off screen- not an appropriate ending for a character with his history.  If Leia had perished on the bridge and Holdo was brought in to lead\\, Akbar could have sacrificed himself by piloting the cruiser into Snoke's ship.  \\n\\nWe never find out where Snoke came from.  \\n\\nAnd remember Rey's vision in TFA?  She sees the destruction of Luke's temple.  In that vision\\, Kylo is in full garb\\, wearing his helme and the Knights of Ren are with him.  They destroy the temple.  The Last Jedi is apparently saying that he got out of bed\\, took off his jammies and pulled out his new outfit as well as outfits for his knights\\, and they then proceeded to destroy the temple.  \\n\\nAh\\, well.  You just can't go home again.","true":true}