{"101487":169495,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers!!!\\n?\\n?\\nThe Last Jedi was a great disappointment to me. In fact I am creating my 1st RT account just so I can express some of my thoughts and hopefully stop being bothered about this movie. I really wanted to like this movie and it has some of my favorite scenes in a star wars movie. That said here is my short review.\\n\\nFor some background on myself I am not old enough to have seen all the original trilogy in theaters but I did see Return of the Jedi in the theater. In fact it is one of the most vivid memories of my young childhood. So these films had a big impact on my childhood. In fact i don't really remember a time where start wares was not a part of my life. I\\n?While there are many critiques of some of the issues with this movie I will focus on a few that really ruined it for me. The 1st and biggest for me is the portrayal of Luke. in this move we are supposed to believe that Luke just gave up and went to some island to die because Ben Solo started to turn to the Dark Side. This basically undoes all character progression we see for Luke in episodes 4-6. This was just a leap to far for me and really pulled me out of the movie. i probably could have gone along with this plot point if they had spent some time developing this point. Instead all we got to support this was a few short flashbacks and some very short exposition. Maybe they could have cut the pointless Canto Bight stuff and spent some time here). One possible way this could have been down would be if Luke had been married and Ben Solo killed his spouse. I probably would not have liked this but I could have gone along with it. \\n?Many people have said there is precedent for Luke going into exile because both Yoda and Obi Wan did the same. I don't buy this. In this film Luke just gives up and goes into exile to die. Obi Wan went to Tatooine to watch over Luke and try and make sure Vader\/Palpatine didn't find Luke. Yoda went to Dagoba to bide his time and see if there might come a way to undo what had been done. From my perspective they both still carried a spark of hope. Luke just gave up with little explanation as to why. Are you freaking kidding me!?!?\\n?The next point I will talk about is the overall tone of the movie. The writer seemed to go out of his way to make sure we knew the that all the stuff from episodes 1-7 does not matter from this point on. There were some serious nihilistic undercurrents here. He went out of his way to say it doesn't matter who Snoke is. It doesn't matter who Rey's parents are. The Jedi origins and history don't matter. By the end of the movie the resistance is basically decimated with 1 ship and about 20 people surviving. I get that Disney probably wants to reset things so they can take the series in some different directions but did they have to go out of there way to tear down just about everything that came before to do it?  I really wish they would have finished out episodes 8 and 9 before trying to reset everything. \\n\\nIf episodes 4-6 were about hope and optimism then 8 seem to be about failure and deconstruction. Some have drawn parallels between this and Empire Strike Back because of some of the darker themes. These 2 movies do have some similarities. At the end of ESB the rebels suffered some severe setbacks and lost the Hoth base\\, there was still a fleet and a sense that things could turn around. At the end of the last Jedi there is basically nothing but  Poe\\, Fin\\, Chewie\\, Rey\\, the droids and the Falcon with a few other random people. This leaves me scratching my head as to where the story goes from here and I am not really interested in where this story leads.\\nThe last point I will make is that the writer\/director seemed to go out of his way to subvert every expectation. While I like some surprises i wish they were tied to a better story. I couldn't escape the feeling that I was being trolled throughout this movie. You expect to find out about Rey's past? Nope!. You expect to find out how the first order came to be? nope! you expect to find out more about Snoke? Nope You expect Admiral Holdo to act rationally and explain the plan so people know they are not just waiting for a slow death? Nope. You expect Luke to not be a bitter old man who doesn't care that his sister is in grave danger? Nope! You expect that Finn will retain some of the character growth he had from the last movie? Nope! You expect Finn to go out and sacrifice himself to save what is remaining of his friends? Nope!  You expect Poe to not act like a complete ass twice? Nope! You expect this film to make sense given the existing canon? Nope!\\n\\nIt seems like the movie was just one big head fake after another at the expense of making a movie that makes sense in the context of what came before. Its as if the director was so concerned with the criticism that the force awakens was just a retread that they decided to throw everything out the window whether it made sense or not. There were some of these surprises that I liked (especially the throne room fight). But overall I think this movie is a mess that destroys more than it builds. Worst of all the destruction has effectively eradicated my desire to see any more of the Disney Star Wars. I really enjoyed Rogue One and i thought The Force Awakens was ok. I even appreciated some aspects of the prequels. But this one just left me confused and disappointed. \\n\\nThere is a Youtuber named David Stewart who has a few videos breaking down the issues with this movie (in a better fashion than I can). One of the points he made was that this movie has the aesthetic of a Star Wars movie but it does not have the heart of one. There is no heart here just window dressing.","true":true}