{"101487":96903,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"1 star is generous for this movie. \\n\\nRian Johnson and Disney did something I didn't think was possible. They successfully ruined Star Wars for good. \\n\\nSPOILERS AHEAD!!! STOP READING IF YOU MUST!!\\nLet's break it down. First off\\, this movie isn't completely awful as it is utterly disappointing.\\nThere were so many times that this film could have saved or even reinvented the franchise\\, but EACH time it took the WORST possible decision and realized it in the movie.\\n\\nWhile I would say it is worth seeing at least once just to see how they f***ed this movie up beyond belief\\, it is basically a 2 and a half hour trailer of meaningless buildups and characters that you can't care less about. Honestly\\, if Finn\\, Po or Rose died\\, it would've meant nothing to the story. Reason being that in filmmaking\\, you HAVE to have conflict for these characters to grow from. Kylo was by far the most interesting character in the whole movie and then Disney decided that just when he started to bring some new interest to SW as a grey area villian\\, he should be boring and repetitive (just like Vader but NONE of the mystery or understanding of his backstory or intentions). Just a bad guy who keeps doing bad shit because well...he's bad. lol\\n\\nDONT EVEN get me started on how poorly Luke Skywalker or Snoke were handled. Just a hot mess of sloppy storytelling and trying too hard to make everything super grey area. Star Wars is ALL about the heros journey. EVERY Star Wars film portrays a meaningful journey of choices of a main protagonist. I got to say that I couldn't have been more excited to see Rey make the choices she would make in this film. Sadly\\, she NEVER develops or arcs as a character and basically is just always perfect. Because Feminism and stuff... Yeah\\, that's great! I'm a feminist myself (as a man)\\, but it doesn't mean it belongs in ruining a film's structure just to please the audience!! And that's what this film continues to do for the next 2 hours. NOTHING but audience-pleasing and teasing. It never gets to the point of the story or even gets you to care about any of the characters. I felt like I just watched a 2 hour trailer and have not progressed beyond the Force Awakens in terms of story. \\n\\nRian Johnson and Disney's writers are all flash and presentation without any of the heart. And that's what hurts the most. They want your wallet not your feelings. What happened to the days when we would watch characters struggle and face their inner demons? I HOPED for that with Rey SO bad. They never gave it to us and instead showed us a Luke Skywalker who hated the Jedi and what they stood for\\, Ran away from his friends\\, and betrayed the world he once loved.\\n\\nWhat a parallel to my feelings about Star Wars. I thought they cared about fans but I guess not.  Enjoy making your stupid space battle movies Disney\\, because its not Star Wars. It's a Cartoonish\\, Meaningless\\, Cash Grab Syndicate that just wants you to bend the knee to them and call it \\\"cannon.\\\" F*** you guys. I won't be sticking around for Episode 9 even if JJ Abrams comes back. Don't call yourselves Star Wars fans and then make this shit. EVER.\\n\\n1\/5 Stars. FAILURE.","true":true}