{"101487":175191,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is a great movie all around. While there are some moments where I thought were dry and didn't fit with the movie they were very few and far between. I will admit that I was not as hyped up about this movie as I was for the Force Awakens and thought the trailer showed the best parts and it was going to be awful\\, I was completely wrong. The Last Jedi has so many plot twists that make you say wow. The filmmaking was spectacular and the cuts between one scene to another showed how promising Rian Johnson is as a director of other big budget hollywood films. John Williams once again astonishes the audience with his score blending the classic score with some new that once again makes you feel like you are in a galaxy far far away. Adam Driver\\, Daisy Ridley\\, Laura Dern\\, Mark Hamil and Carrie Fisher all had amazing performances in their respective roles. We also see more development in Oscar Issac's Poe Dameron character. Overall I was amazed with this film and will say that it is better than all of the prequels and the best Star Wars film since Disney took over the label. All movies have flaws\\, The Last Jedi included\\, but in TLJ the good outweighs the bad. In total the feel felt different than most Star Wars movies. The movie starts with two story arcs then splits to 3 only for the paths to come together in the end . I highly recommend that everyone sees this movie. The Last Jedi will certainly test your emotions with it's bouts of humor\\, suspense\\, and despair. If I could give it a rating out of 10 I would give it an 8.75\/10","true":true}