{"101487":169383,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS AHEAD!\\n\\nI would rate this movie just a smidgen better than the prequels\\, and most of that goes to the side stories\\, not the main storyline. Disney took a risk here\\, but only time will tell if it pays off.\\n\\nIn the movie\\, Kylo Ren says \\\"Let the past die. Kill it if you must\\\". This felt like a quote from Rian Johnson directed towards J.J. Abrams' The Force Awakens\\, and even the Original Trilogy. Why do I think that? Let's look at the things he literally killed:\\n- Snoke (JJ introduced a good Palpatine-esque villain in FA\\, but he's gone before the third act in this film).\\n- Kylo's helmet (It was a cool helmet? Chances for new marketing for IX?)\\n- Luke Skywalker (The only death I expected\\, and was okay with\\, though the execution of it wasn't the best)\\n- Rey's lineage (Is she a Skywalker? Nope. Junk Traders. But what about---I said Junk Traders!)\\n- Rey's long drawn lightsaber gesture to Luke (The end scene of FA is now ruined for good. You know 2 seconds after Luke tosses it over his shoulder. WTF!?).\\n- Leia's honourable departure (Clearly she will not be in IX\\, RIP. So how do they address that now? I didn't want to see her go so early in the film\\, but surviving space? And then by the end she's still there\\, so how do you make her NOT appear in IX?)\\n\\nLike pizza though\\, even bad Star Wars is still Star Wars (and therefore better than most things)\\, but is that enough? I'll buy the blu-ray when it comes out; I can't have a gap in my collection. I am scared for the future though. This was a decent movie\\, but it wasn't a Star Wars movie.\\n\\nI kind of blame the people who complained about Force Awakens being a rehash of A New Hope. At least it was a Star Wars film! This felt like it lost it's direction.\\n\\nDisney took a risk with Rogue One\\, but it paid off. Not all movies can be Rogue One. Not all risks can pay out the same amount. But this felt like putting your life savings into the kind of scratch cards that only have a $1000 jackpot.\\n\\nUnlike this mess\\, I can only hope that IX turns this trilogy around. The Original Trilogy peaked in the centre. Can we hope for strong bookends for this Sequel Trilogy? Help us J.J. Abrams\\, you're our only hope.","true":true}