{"101487":105320,"Last Jedi":"Last Jedi","2017-12-15":"2017-04-01","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As an avid star wars fan\\, I've been waiting 2 years for this sequel to finally happen and after leaving the theater\\, I was a little bit disappointed in what the end result we got with this long awaited sequel. J.J. Abrams set up that cliffhanger at the end of The Force Awakens only for Rian Johnson to take it and throw it off the cliff (literally!). every scene on the island was terrible and now \\\"force skype\\\" suddenly exists between rey and kylo ren supposedly. however they did add a new interesting new ability about the force where you can hologram yourself from thousands of lightyears away however using it too much can kill you. I hate how they handled the characters in this film and the film itself didn't quite have the  same tone as it did with the force awakens except for the first scene on the island playing the music from the previous film during the scene. the humour was abit off especially how they kept using general hux as a punching bag in almost every scene he is in. I thought the whole Canto Bight Casino scene was pointless and too long. Out off all the time they had to exclude that whole scene\\, they could've answered the questions that us (the audience) had when we left the theaters from The Force Awakens such as who are rey's parents? who is snoke and where did he come from? (which by the way don't get your hopes up because he gets killed off with no story and his death leads to probably one of the best most unlikely lightsaber partnership duel massacres in the entire franchise only when you think kylo ren  has finally reached the light\\, he decides hes bad again after literally helping a foe fight off his own side. Plus there were moments that. And Luke Skywalker was not the Luke a Skywalker I remembered from the Original Trilogy. He was grouchy and every scene he felt obligated and forced (no pun intended) to be in the film. I found the Rose  character to be extremely annoying and she would not leave finn alone and give him space to breathe ever in this film. I understand this movie is meant mostly to kids but even films like this can appeal to adults (especially adults who grew up during the original trilogy). I don't hate the film because of the direction they were trying to go (I did like how they were trying to do something different and i'll give them props for that) I just hate how this film was poorly thought out and written. even mark Hamill said that he hated and disagreed with what rian Johnson did with his character. especially how considering in the original trilogy how despite how evil darth vader was\\, he knew and saw a little bit of good still left in him. however in this film he senses the dark side in kylo ren (who was ben solo at the time of this scene) and he tries to murder him in his sleep. that's not luke skywalker. anyway since jj abrams is back in the director's seat for episode ix\\, I hope he corrects all the mistakes that rian Johnson made with this film and redeem this franchise before it gets any worse. anyway I hope they learn from this film and move forward. I haven't lost all faith in star wars (yet). I cant wait to see what episode ix has in store in 2019 to conclude the trilogy","true":true}