{"101487":167936,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So I think I knew what I was getting into\\,when I went to the theater. I knew I was gonna hate this movie. At first I didnt want to see it. But its Christmas time and the family makes you decide things you often really regret. This was such an event. I cringed at every moment from beginning to end with a few exceptions where I thought they did quite good job. \\n\\nHamill is one of my all-time favorite (voice) actors and generally a person I really enjoy to hear talking. He is the only reason I went to this movie. I wanted to see him doing well. And the interviews were almost unprofessional at some points I feel. I just cant shake off the sensation that he is feeling betrayed and so do a lot of people.\\n\\nI wanted to see Luke Skywalker train a young jedi. I wanted to witness it first hand. But all it was... was her being awesome and Luke being a huge... I cut that here. Insert any swear word you want I dont care anymore. No fault goes to Hamill\\, he did an amazing Job with what he got.\\nSo she is a Jedi Master now I guess\\, just because she is a balance weight in the force. Yeah\\, I guess that makes sense. All you need for a backstory. Balance in the Force and Nobody. Makes you just awesome at everything. Yeah\\, makes me not want to care anymore. Nothing really happened. It is like a message: \\\"I dont matter\\, I am just pretty.\\\" And this sounds like a description of every female character in this movie. On the surface there might be an interesting character but there is none.\\n\\nI just wanted a good training arc between Rey and Luke. Really that was really all I wanted. But to be honest I missed so much more in this movie.\\n\\nSo lets get to the fun part. The rating\\n\\n+ Female cast\\n+ The old cast\\n+ Graphics\\n+ Spacebattles\\n+ Space foxes\\n+ Snoke\\n+ Hux\\n+ Finn\\n+ Kylo\\n+ General Phasma\\n+ Rey because young female Jedi\\n+ Holdo\\n+ Jake Skywalker\\n+ A lot of potential...\\n\\n- ...wasted\\n- Killing Hodor (Thats what I understood)\\n- General Hux is an idiot now\\n- not using Phasma\\n- Snoke is dead\\n- Rey is cheating somehow\\n- Leia too\\, I just would have liked something positive to say but I just havent\\n- Finn has a useless side story\\n- Rose putting rescueing Finn over rescueing everybody (Thats what I hate about most heroes\\, always putting the life of a few over the life of many)\\n- shallow female cast I just dont want to know anymore about because either dead\\, nobody or ... I leave it with these two categories.\\n- Killing admiral Agbar without a heroes death because he sets a trap ;)\\n- Killing lead characters we basically know nothing about if you are not buying crappy extras. It feels like the lootbox desaster again.\\n- Space battle chasing in UltraFullHDSlowM.......\\n- Kind of predictable sequences (Phasma\\, Betrayel by Benicio del Toro)\\n- Benicio del Toro (I love him\\, but somehow he doesnt fit)\\n- Kind of useless sequences (all side story lines that where dragged out)\\n- It didnt feel like they were under pressure\\n- No student\/teacher relationship at all (Not true Snoke and Kylo but that is short lived. And Luke is cool when he is tricking naive Rey. Thats what I wanted)\\n- Luke not dying in grace and self sacrifice like the old Ben against Ben Solo in a direct confrontation\\n- Hinting stuff thats just there to tease you (like the X-Wing in the water)\\n- No new cool Alien characters anywhere on the horizon\\n- No new cool ships\/technology except for World War bombers\\n- Original trilogy cast vastly underused. No reunion\\, no heartbreak over Hans Death\\, what is Chewie even doing there and C3PO and R2D2 and where the fuck is Lando or would that be a to diverse cast... \\n- Being worse than the prequals in many regards\\n- Being afraid of the prequals\\n- Not exploring on the ideas from the FA\\n- All these weird aliens that remind me of Hellboy (\\\"I am a tumor\\\")\\n\\nAll in all: The audience is young kids but thats an argument that Michael Bay can also use to defend Transformers. It is mindless fun and kids like mindless fun. Is it good because of that. Take a kid put it in front of anything involving a screen. Kid will love it most of the times. So is mindless fun always bad. No. MCU has it. But why has it to be always mindless fun. Because kids are stupid? Because kids shouldnt think? Thats when rage really is building up in me. Clone Wars shows that a Star Wars kids show has more substance than all of the Prequals and Sequals together. Thats how you present lines and characters.\\nDreamworks is doing a good formula with shows like Dragons and Trolls. Good World building\\, good character development. Kids show nonetheless. This is not a kids movie. This is mindless fun. And I dont care. I wanted Luke treated like Wolverine. But I dont care because otherwise this would be to painful.\\n\\nI leave it here because I could continue on and on.\\nI am not really invested in Star Wars anymore\\, ever since Kotor I\/II and Episode I-III came out\\, I still miss Kyle Katarn from the Jedi Knight-Trilogy. I miss good SW solo games. They should have written a good ending for the Skywalker-Saga and then they should have continued in future setting like 500 years in the future. In this scenario they would be absolutely total freedom without it feeling odd when established knowledge is just ignored. They could have invented everything themselves without touching the feelings of a lot fans. And without using all that we loved dearly to make us into money machines. I am holding on to my own canon of the Star Wars and the EU. \\n\\nIt had a lot going for it but all the potential wasted and the overall insignificance of everything concludes in nothing. Zero points. But that should be okay for a nobody.\\n\\nBut the new Trilogy I will only remember as Space Wars Episode I-III.\\n\\nPS: When they want to restart the franchise\\, why do we get a movie for every characer from the past? That sounds not right.","true":true}