{"101487":132076,"Last Jedi":"Last Jedi","2017-12-15":"2019-02-06","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I find the critics review of this film dubious. For all the talk of taking SW in a new direction & having twists i feel this film just feels off.\\nFrom Poe's opening 'on hold' gag which was so toe curling in it's crapiness i felt totally self aware of trying to titter in the vain hope that my Son would also feel this was amusing. It was not and these absolutely shite attempts of quick witted Han Solo type jibes came thick & thin but remained stedfast in there utter cringingly 'comic dying on a stage' type thing.\\nI suppose RJ thought he'd kick off the controversy straight from the off with the Sabre toss. I'm all for controversial moments in a film. They can be brilliant. This was not brilliant.\\nThe Luke being an arsehole thing\\, the 'milking' scene which made me attempt to stab myself in the eyes with my Diet Coke plastic straw. The fish nuns\\, Rey being being told her parents are basically the binman & pastry chef. The Princess Leia \/ Christopher Reeve moment ( believe me Johnson - that will forever be your Jar Jar moment ). They are all just awfully misplaced moments. \\nWhat to make of Rey being already seemingly more powerful than Kylo even though having not 1 spot on the Jedi dojo and then to compound the absurdity both Kylo & Rey being able to Judas Snoke who is obviously infinitely more powerful but is susceptible to the old 'look over there' routine.\\nThe trailing of the ship through hyper space\\, getting off the ship to get back on the ship after finder DJ schtick and as for Canto-Shite.....\\nHoldo's sacrifice although visually fantastic to look at just makes a mockery of previous struggles to battle these gigantic destroyers.\\nI cannot be even bothered to finish the review such is my ambivalence to this film. RJ has dropped his pants & dumped all over TFA possibly plot lines\\, turned around and thought he'd farted fairy dust. He hasn't.\\nJJ Abrhams will need Episode IX to run for 6 hours to rectify this particular turd.","true":true}