{"40636":"21664","TLOU2":"TLOU2","2020-08-05":"2020-06-21","10":10.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"I’m going to put it like this. All the review bombs for this game tells the tale. This game was reviewed perfectly from the majority of critics\/youtubers alike. If you want a good “fan” review look at the fans rating it between a 10-7. For me I give it a ten because it is truly an amazing game. Graphically it is stunning there is no denying that. So for people to give it a 0-4 without evenI’m going to put it like this. All the review bombs for this game tells the tale. This game was reviewed perfectly from the majority of critics\/youtubers alike. If you want a good “fan” review look at the fans rating it between a 10-7. For me I give it a ten because it is truly an amazing game. Graphically it is stunning there is no denying that. So for people to give it a 0-4 without even thinking about the graphics in mind are idiots. The sound and level design is phenomenally done. Again people giving it a 0-4 without that in mind are dumb. The combat and gameplay are superb. If you gave it a 0-4 for that again you are not all up there and have a lot of screws loose. The controls and overall feel of controlling the character is amazing. The accessibility they put into this game truly is amazing and is going to be a standard for games to come. The story is a emotional rollercoaster just like the first game. Everything about this game is amazing. Stop listening and believing the haters who thought about giving this game a 0 the day it was available to. Because of what some leaks that were half right months prior? A lot of those leaks you read aren’t true. If you aren’t a bigot than you will enjoy this game. It is truly a masterpiece in my humble opinion. Would I have liked the story to go a different route sure I guess a tad bit. Since that’s the biggest complaint\/hate of this game is the story. Yes it sucks something terrible happens and I wish it didn’t but it’s ok because unlike angry **** in their parents basements I’m at peace with it ladies and gents. We can wish and want the story to do this or go this way but at the end of the day guess what? We’re not the ones writing or making the story. It’s not our story to tel. We are the players. We’re here for the ride. And if you didn’t like the story of this game that’s fine and all\\, If you actually played The game. But you can not deny the marvel of everything else that I mentioned. The music in this game is amazing. So many intense moments. So many twists and turns and unexpected stuff happens in this game. That the leaks paint a different picture than what the game is. An it’s sad because a lot of dumb humans believe it. For me this game is GOTY contender and my advice to anyone reading this is to buy this game. If you love Naughty Dog and trust them and see that they have brought us nothing but great fun and amazing games. Than you won’t be disappointed in this game. I loved it! To all the haters eat a dick. To the Xbox fanboys hating; and probably are more than half the ones review bombing eat a dick. You’re console\/consoles will never get a game like The Last Of Us. So enjoy you’re overplayed Halo and Gears. Enjoy the review bombing; and **** talk all you want **** because 10-15 years from now Y’all won’t have a console to play on. Xbox won’t exist just like Gamestop. The only thing that will exist is Gamepass but that’ll be available on everything including Playstation. Peace out and everyone who is enjoying this game as much as me stand firm and say **** the haters. Game Of The Year.… Expand","true":true}