{"101487":179117,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Star Wars writers have a plethora of stories they could have used from all of the books written over the past 20+ years.  Instead they give us this goofy story full of plot holes and dead ends.  \\nWhere is the New Republic Fleet?\\nWhy is there only 1 capital ship in the resistance fleet?\\nWhy is the resistance leadership all women?  \\nWhat is this - Mother's Against the First Order?\\nWhy the heck\\, after 30+ years of fighting snub fighters\\, hasn't the First Order come up with an anti-snub fighter turret to ward off  X-Wings and A-Wings? \\nWhere are the rest of the Knights of Ren? \\nDid they all die?  Are they just chilling somewhere?\\nWhat is Supreme Leader Snoke's history?\\nHow old is he?  Where was he during the fall of the Empire?  Who was his Master?  How is he so strong in the Force?\\nLuke Skywalker - he finally starts talking and he refers to his lightsaber as a \\\"laser sword\\\"??  Who wrote this crap?!\\nAnd the creepy scene where he drinks milk from those goofy looking sea-cows??  Did we really need that?\\nFinn and Rose's little sidequest to the casino?  We didn't need that.  It was filler.\\nSo many holes.  So many dead ends - the big reveal about Rey's parents??  Totally anti-climactic.  Another mystery ruined.\\n\\nThis movie just felt totally disconnected and lost to me.\\nI sat there shaking my head a lot wondering who wrote the dialogue for this flick.\\nI left the theater a little bewildered and I wondered where the mystery and suspense of Star Wars had gone.\\nI sure didn't feel the Force when I finished watching this movie.","true":true}