{"101487":111688,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"By far the worst and most insulting Star Wars movie ever made. Let's start with the good. Visuals and Sound are amazing. And I mean AMAZING. That's it. Now lets get to the bad. Rey is the most boring hero character of all time. She never has to earn a thing\\, which makes me think that Johnson and Disney really have zero idea of the Star Wars history or don't find it important. It took Anakin YEARS to levitate objects\\, Rey can move boulders after 5 days of learning she even could use the force. Additionally she defeats Luke in a stick battle\\, which is the DUMBEST thing I've ever seen. He is a Jedi Master\\, has Skywalker blood\\, and has trained under the greatest Jedi of all time. Again Rey has used the force for five minutes and bests him. Great. They destroyed Luke Skywalker and all he stood for then they kill him in an inexplicable way. Leia has never been trained in the force yet can superman through the space vacuum after being blown up by the first order. Furthermore they must think there is gravity in space\\, as well as oxygen to breath because the bomber scenes insult the viewers intelligence. Fin and Rose scenes could be completely thrown out and nobody would notice\\, so why not cut it and save us the 30-40 minutes? Phasma could have been an amazing villain\\, but she is on screen for two minutes and they kill her off. They spend all of 7 making you think Snoke is this amazingly powerful villain yet half way into this film they kill him off in yet another dumb fashion. He literally overpowers Rey without even trying\\, and earlier whips Kylo when he steps out of line\\, yet he gets defeated by a parlor trick. Cool story bro.  I think our only hope for 9 is for Disney to sell the rights to someone who has actually watched the previous films and then maybe they can start over again at 7. It is a garbage product and Star War fans should demand better.","true":true}