{"101487":142517,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's a TRAVESTY. And I know I'm not alone in this... check YouTube. To justify their actions on the simply horrific choices that have been made in the making of this movie and the WELL DESERVED backlash for it Miss Kennedy and R.Johnson the director have blamed it on internet trolls\\, anti-feminists and racists. Or unrealistic expectations of overly-obsessed fans. I refuse to accept this. As I solemnly swear\\, I am none of these. Heck\\, I follow and support Emma Watson's He for She any many more feministic and equalist movements and never would anyone who knows me\\, say I'm racist. I'm well-educated and consider myself to be a genuinely kind and compassionate person. I don't mean to affend anybody. But I can't remain silent in the face of this. I'be grown up with the first 6 movies by G.Lucas and have been dearly enjoying them ever since. I'm not against Disney in any way\\, I actually love Disney!! Not necessarily the company but what it stands for\/used to stand for and their movies. BUT. The Last Jedi is beyond underwhelming\\, more so\\, a complete and utter disappointment and ruined Star Wars for many loyal\\, long-time fans. I was one of those optimistic fans and had full trust in Disney and Kathleen Kennedy with the sequel-trilogy we are being presented with. I actually enjoyed Episode 7\\, despite it's often argued unoriginality. But this movie.... Especially what they did to Luke Skywalker... how they portrayed him completely out of Character. It couldn't clash more with what Miss Kennedy stated and promised Fans and George Lucas when taking over Lucasfilm! She said her goal is to keep the characters true to the way they used to be. It couldn't be further from the truth\\, I'm sorry. I felt like crying and throwing up after the movie.... it took me a week to process what had just happened in that film. I'm just sad it had to go this way. I hope they realize what they've done and make it up to us\\, George Lucas and Mark Hamill. Shoutout to him!! He showed great acting despite his obvious disagreeing with virtually everything they've done to hie Character. You can tell how devastated he is about this and how much he cares about his role and the franchise. So WARNING: If you are a true fan\\, don't watch or support this movie. Let's hope 9 is better and will set things right. But I honestly doubt it.","true":true}