{"101487":122354,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Fun at times but mostly annoying Marvel hero movie style jokes and some surprisingly flippant dismissal of characters and plot points everyone perceived as important in Force Awakens. Won’t get into spoilers\\, but we were promised a real role for Phasma - they lied. We were promised this one wouldn’t be as derivative as Force Awakens - they lied. We hoped for a satisfying conclusion for Princess Leia\\, given Carrie Fisher’s passing - they failed... miserably... with very obvious better choices. Can’t understand the initial glowing critical reviews. Were they paid for? All things considered\\, not good. The worst of the new films by far. After time\\, consideration\\, and another viewing\\, I’m knocking off another star. There’s a ton of problems with this movie. Watch the “How it should have ended” video on Youtube for some of the highlights. Biggest problem tho\\, you can’t break Luke’s defining character trait like that. At least not without an entire movie of character (re)building to support it. Luke’s defining trait from the original series was that he could see the sliver of good in anyone and would never give up trying to bring them back to the light\\, even if it killed him. If there’s one “point\\,” one takeaway from the originals it’s that. This film\\, without setup or real explanation\\, shows us the opposite\\, a Luke who sees a sliver of bad in a person and can barely resist killing him. It’s garbage. ","true":true}