{"101487":160057,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"One of the best serials in the Star Wars franchise.  Non-stop action\\, and never a dull moment.  Every sequence meticulously timed and thought out.  A typical blockbuster of typical Disney proportions.  No surprises here.  Unoriginal.\\n\\nI personally did not like the \\\"training\\\" sequence between Rey and Luke.  How could the latter be overpowered so easily?  The expiration of Skywalker was touching as well.  I wish they went deeper into the character\\, but respect the attention he was given.\\n\\nThe female empowerment theme is truly overplayed in this and the last film.  Rey\\, as the untrained protagonist\\, that wins the day.  Rose who saves Finn from kamikaze death.  The head Stormtrooper is Captain Phasma\\, who is a female.  Princess Leia replaced by another female\\, Vice Admiral Holdo...give me a break.  What special interest agenda does Disney have?\\n\\nAlmost as bad is the forced (no pun intended) \\\"globalization\\\" is so apparent in Star Wars that it is nauseating.  Token Asian (Rose)\\, token black (Finn)\\, token latino (Poe)\\, token fat white guy (a pilot who gets blown up of course\\, like every other Star Wars film)...but wait...no token Middle Eastern?!  Disney didn't cover all the base\\, did they?  Was this intentional?   Conflict in the Middle East perhaps have something to do with it? \\n\\nWho are Rey's parents?  We will find out in the next Han Solo prequel film\\, or the next instalment of Star Wars in 2019.  Until then\\, my guess is that Rey's parents are Han Solo and\/or Princess Leia and thus the sister\/half-sister of Kylo Ren.\\n\\nAudiences will be getting what they expect from this film.","true":true}