{"101487":129442,"Last Jedi":"Last Jedi","2017-12-15":"2017-03-06","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a woman\\, and I have never felt so offended with a Star Wars movie until now. Rey and Finn\\, protagonists of The Force Awakens\\, were brutally reduced as plot devices to serve Rian's own vision of the sequel trilogy instead of honoring the previous episode with the narrative and its mysteries. For the long term\\, the original characters are now permanently demonized because Rian clearly wanted to humanize a villain that (still) has weak justifications to his fall to the dark side. The storytelling of this episode is the biggest issue I have with. It just doesn't make sense. The artificial bond between Rey and Kylo and its execution by Rian has heavily bruised Rey's agency and importance as her own character. In this episode\\, Rey is 180'd to be a messenger between two men who belittle\\, humiliate and betray her throughout the film. She has no meaningful task in this plot except to become yet another (stereotypical) option to save Kylo\\, in theory\\, from the dark side. In other words\\, in Rian's world\\, it's still a woman's job to save a horrible man because that's how (her) compassion should be used. Luke Skywalker isn't the man we have known for over 30 years. This is a grumpier and cowardly version of an Obi-Wan type of character. Luke isn't Obi-Wan. It's obvious that he was treated like this to reduce his importance going forward with even though it was clear in TFA that he was going to be much more significant. Finn? A HUGE disservice for the character here. He wasn't even treated like a protagonist. His injuries were treated as a joke. He was treated without the capacity to think for himself\\, but have no fear! The new character\\, Rose\\, is there to taser the crap out of him and teach him of all the bad things happening in their world... even if Finn was literally a stormtrooper and had already seen way worse under the control of The First Order. The forced kiss was clearly one-sided. I hated their arc and it hurts. I really wanted to enjoy their adventure. But it just doesn't click. Poe? Wow... I'm not going to start there. No way. Beyond regressive and insulting to fans of the character. Leia was okay. Holdo was unlikeable. The humor reminded me of Marvel movies so I still feel 'meh' about it. I LOVED the music. John Williams is still the man! Porgs are cute and I liked the caretakers. Snoke turned out to be useless. This film had so much potential to be a significant movie in the entire saga and it depressingly turned out to be a hot mess in writing\\, editing... just plain disrespectful to its lore. This film is definitely NOT in the same situation as Empire once had a long time ago. ","true":true}