{"101487":188536,"Last Jedi":"Last Jedi","2017-12-15":"2018-08-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was worse than the 90s starwars series.  I am having a hard time articulating everything that I hated about the movie. The only decent characters were Benicio Del Toro and Snoke. Most of the acting was wooden. \\n\\nThe general was a pretty poor actor. I felt like he was not in his character. \\n\\nThe director forced characters onto the film who had no back story and added little to nothing. It is hard to feel the purple haired lady's kamikaze when the character is never developed. \\n\\nPoe\\, Finn and Rey were awesome in the first movie. Now they are single dimensional characters. Poe wants to fight. Rey wantsLuke's help. Not sure what Finn wants. In the end\\, they became really boring. \\n\\nThe story was pretty lame. Why exactly did Finn pick up this random dude to be the code breaker when he went to Las Vegas to get a very specific guy. Leia floating through space was silly. Why is Darth Hipster so sensitive? Why is Luke milking that alien? Why is chewie cooking the furby? The humor was terrible.\\n\\nLuke was turned into a crotchety old I don't know what. There was nothing mystical about the character. He was taken out of the center of a film series in a most innoble way. Even Hammill hated his character.\\n\\nI get that space should be more diverse. Rogue 1 did that and gave an entertaining film. This one was terrible. It was so terrible I felt the need to write my first review terrible. I probably will never write another film review.","true":true}