{"101487":185057,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"this movie is simply...a piece of shit and that 90% from the critics is a joke. the story alone nobody with a leveled head could give it a passing mark. there was no connection to the previous film in any way. i thought you were supposed to build upon the characters in the first one? RJ is such a hack; a toddler couldve written a better script. where was the development\\, interesting arcs\\, etc? no i get a handful of new characters who nobody gives a shit about\\, horrendous kiddy jokes and humiliation of previously loved characters. Forget luke because i could write a thesis on where his character didnt make sense but what about finn\\, Snoke\\, Phasma\\, hux and kylo? you get these great characters that need layering so the audience cares but no. i get a 40 minute trip to a shitty planet about horses that need to get freed and rich people gambling. jesus H christ\\, it is almost unbelievable how horrendous this movie is. only good things are the music and visual effects which is a given because its StarWARs. in summation this movie was a total let down and crazy as it sounds it has killed a massive part of fandom inside me. like who gives a shit about episode 9? (or future spinoffs if this is where the starwars universe is headed) there weren't even any cliffhangers? Isn't that what good sequels do? \\n\\nPS--Disney please leave that sjw nonsense out of starwars. Sincerely me and the 52% of fans who thought your movie sucked ass. good luck on those TLJ dvd sales lmao. apparently nobody at the top knows anything about business leaving ALL THE MILLIONS OF DOLLARS LEFT ON THE TABLE","true":true}