{"101487":133940,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have seen it four times. First time I walked out disappointed and confused and then later I was pretty upset. I thought it was garbage and poorly done.  I was confused on why people were saying that this is a great film and it might be one of the best. Intelligent and bold? I was sincerely confused.  I watched a few reviews on youtube and people had the same feelings I did. Reys parents are no one? They just killed off Snoke? Luke was not Luke Skywalker? I was upset! Of course negativity spreads faster than positivity and Star Wars fans hate Star Wars more than anyone else. \\n\\nI've been so invested in Star Wars that I had to give it a second chance. I went a second time and walked out really liking it. I had more fun this time around and I was slowly understanding why people like it so much. I also understand why people hate it so much. The third time I saw it I liked it more and started understanding why it is bold and intelligent.  I like it\\, but don't love it. The whole Canto Bite Casino scene was just out of place and screwed up the tone and pacing. I understand why its there\\, but just didn't feel right. Also\\, the actress who played Rose was to cutesy for the role.  I just couldn't get into her. Everything with Luke\\, Kylo\\, and Rey was awesome! \\n\\nA lot of fans are angry because they had all these expectations and they weren't met. No matter what you tell them the film is trash. Luke transcends the force and the Jedi. He used the force for knowledge and defense not attack. He showed what a true Jedi really is and gave hope to a doomed galaxy. He became the legend! Its awesome Reys parents are no one. Why does she have to be apart of a blood line. It makes her more compelling and her journey more difficult. Snoke doesn't matter and never did.  He was an arch for Kylos growth and his final steps to darkness. Fans made him a big deal. If fans want to keep seeing the same thing then they need to watch the OT otherwise the story will get stagnate if there are no changes.  Not great\\, but good fun film. Im happy with the installment!","true":true}