{"101487":165075,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson did a great job making SW: The Last Jedi but...\\n\\nHe took too many liberties in the story telling that I wanted to throw my shoe at the screen multiple times during my first viewing. I will say this\\, I would trust him to make a new trilogy because like I said\\, he made a good to great movie. But he ruined this trilogy and I'll explain in a bit. Some pan the The Force Awakens because it was not original enough but JJ Abrams at least understood the fans and respected the franchise enough to pay attention to detail and continue \\,to the best of his ability\\, an already established story line. Rian did no such thing. He spit on JJ Abrams start to the trilogy and in some ways white washed George Lucas's vision.\\n\\nThe Force Awakens (TFA) to The Last Jedi (TLJ)\\n   I was never a big fan of the whole map to Luke Skywalker idea in the first place but Rian Johnson pretty much made the whole thing a joke. We find out\\, from Luke himself in TLJ\\, that the reason he goes to Ahch-To is to die - to live out his last days. Thanks Rian. What a great premise. Does that even come close to justifying a map being created and then split into pieces and hidden throughout the galaxy. Fail. \\n   In TFA Rey finds Luke's lightsaber. Flash backs incur. It awakens the force in her. Its Luke's F'n lightsaber for goodness sake. Rian chooses to turn the opening scene on Ahch-To into a SNL skit. with Luke tossing the \\\"laser-sword\\\" over his shoulder. Fail.\\n   Speaking of SNL skits... how about the early exchange beteween Hux and Poe. Funny stuff but not Star Wars funny. Fail\\n   In  TFA\\, Rey on multiple occasions speaks of returning to Jakku to await her families return. a set up Rian could have had a field day with. Does Rian even understand Star Wars fans? Rey's parents reveal fell as flat as a pancake. FAIL! and on a side note the Snoke reveal or should I say lack of a Snoke reveal equally as embarrassing. Double fail!\\n   These are a just a few TFA to TLJ transition issues I have. Oh\\, there are more. \\n\\nStory details.\\n   Where do I start? Ahhh... lets start with the space bombs. The bomb from its conception is based on the idea that in order to avoid ground fire\\, a devastating weapon could to be built so ground fire can be avoided at high altitudes and then gravity will be relied on as the delivery system. Rian Johnson thought it would be genius to rely on a space bomb weapon that actually relies on close proximity to deliver (closer than most high damage weapons we see in Star Wars universe) and then defy gravity with its payload release. Dude... missiles were built in an evolutionary process because\\, one\\, they can be fired from a much safer distance and 2 didn't rely on gravity as its source of propulsion. Fail.\\n   Princess Leia flying in space is the worst scene of the entire Star Wars franchise. FAIL!\\n   I'm going to jump to the end of the movie and finish with Luke Skywalker's final plan to save the resistance. Luke force projects himself all the way to planet Crait from Ahch-To in order to distract the first order who has trapped the resistance in a base with one way in or out. The resistance trapped inside declares there is no other way out but Luke form Ahch-To knows there is. So he must have mind melded with the crystal dogs to enter the base the resistance in order to show the trapped resistance that there actually is a way out. Really? If Luke has that kind of power how is there even a First Order?\\n\\nI actually like the movie... but I am equally disappointed. Sounds like I'm not the only one split.","true":true}