{"101487":146402,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I want to start by stating that I am a real person. I am a woman and a huge fan of the original trilogy (ep. 4-6). I will start by stating the good. Not much unfortunately. There were only two and a half things good about this two and a half hour movie. Spoilers so don't read if you don't want to know. The best scene in the entire film was the scene between Luke and Yoda. Yoda was always a mischievous master Jedi and I thought the scene of him burning the tree and exchange between him and Luke felt the most consistent with the original characters. I felt for the first time that maybe somebody involved in this film had actually watched one of the original films.  And it was the most emotional and deep of any scene - but these filmmakers didn't earn that scene - that scene was earned by George Lucas and Irvin Kershner in Empire Strikes Back who TOOK THE TIME TO ACTUALLY DEVELOP CHARACTERS and RELATIONSHIPS with Luke's training in Dagobah. This movie refuses to develop any characters. Instead of actually have Rey train with Luke they spend most of the time having her follow him around in the rain and watch him milk some creature. And somehow Rey needs absolutely no training which goes against the very heart of the first 6 episodes of Star Wars - JEDI TRAINING. Now suddenly you don't need it at all and you can best anyone. This film completely ignores the universe that has been built in the first 6 episodes that George Lucas oversaw. This film is just a thesis on failure. Each character is just subjected to a plot about failure so no character actually does anything based on who they are or how they interact with others. Everyone is just a device to present the filmmakers point of view on failure. Back to the good things. The 2nd good thing is a diverse cast. I applaud them for adding an Asian female cast member - not sure though why her name is Rose when almost all Star Wars character names are more unique than that and why her character is so one dimensional. she's always good - she needed to have more depth and conflict to who she was. Same criticism of Rey - her biggest desire is to know who her parents are but we don't truly feel her struggle in this film. We get some mirror thing which is a ripoff of the Dagobah cave. Again this group of filmmakers refuse to do the character work to make things add up to anything. In Empire Strikes Back the cave scene with Luke is SO PIVOTAL to him understanding how to control the dark side in him. We get no understanding from Rey's scene - the filmmakers and actor just haven't done the necessary work to make us understand and feel this moment. They are too busy spending time on random subplots that LITERALLY AMOUNT TO NOTHING. Take out the entire Monaco-style Casino scene and have the time spent on Rey and Luke - that would have meant something. That Casino \/ Race Track crap was straight out the Prequels in how bad it looked. It was horrible CGI\\, horrible look\\, horrible everything. This film has gone backwards. Rogue One knew how to be understated and yet honor the Star Wars World. This movie is just a flashier Phantom Menace in disguise. Last good thing which I only count as \\\"half a good thing\\\" - the moment when Rey and Kylo appear like they have joined forced and Kylo appears to have turned to the good side. This is a total screenwriter device and a fake out. It's a total manipulation for sheer manipulation sake. It was a good moment watching them fight together until you realize you've been duped by a film director. when i start to feel duped and manipulated as an audience member is when i start to stop believing in the story. because these are just devices and do not honor the characters. And are we supposed to believe that Kylo Ren - who always is completely volatile and immature and reckless is suddenly the master of cool\\, calm\\, collected deception. It's a complete 180 and he never is like that the rest of the time. He's either raging or whining and now we're supposed to believe he could get his emotions under control JUST FOR THAT SCENE! Inconsistent character development and a scene only meant to manipulate the audience. And then there are those Ninja Imperial Guards - stupid - again Rogue One knew how to play things down and not go for shiny new things. Rogue One has been the only new Star Wars film to get it right. Now lets talk about the structure of this film - ie there is absolutely no structure. The director has not chosen any storyline as paramount. If you stand very far back from all 8 episodes so far you can see that Episodes 1-3 were Anakin Skywalker's story\\, Episodes 4-6 were Luke Skywalker's story\\, so who's story is Episodes 7-8???? Is it Rey's story? If so they are not doing a good job of defining that for us. In my mind these filmmakers are completely ignoring what the structure has been for Episodes 1-6. It's selfish. They are getting everyone to see their film because of what filmmakers did before them without honoring the bigger picture of what got them there. Epsiodes 7 and 8 feel random and unfocused and going absolutely nowhere. I couldn't believe at the end of this film that the like 8 or so characters remaining were literally congratulating themselves for being the only ones to survive. Han at least got a moment of sadness that felt a little bit real in Episode 7 but Luke barely got anything. Luke Skywalker deserved better than this. Luke Skywalker is what made Star Wars what it is. He was George Lucas stuck in the valley as a teenage wanting more to life. Luke Skywalker deserved more then this kind of send off surrounded by whiny young characters who don't give a shit. And Leia was completely put into like \\\"Grandmother\\\" role of just being a device for everyone else. The only character that felt remotely similar to Luke was Po - Po has that youthful arrogance that Luke possessed. I'm very disappointed in how little regard these filmmakers had for Luke Skywalker. He's the only reason why this movie will make $400 million dollars - because people fell in love with Luke's story and his quest. These filmmakers used him and threw him out They get to have their film seen by millions of people because of his character but they treated him so poorly. We are in a discard kind of culture - use and discard. I wish I could give it ZERO stars.","true":true}