{"101487":180973,"Last Jedi":"Last Jedi","2017-12-15":"2019-11-13","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film is all \\\"cleverness\\\" without the heart or soul of the original trilogy. it is as if the writer missed that Star Wars is predominantly driver by character and emotion and not just plot. It is poorly written. The characters are just jelly that gets squashed into whatever shape\\, and new characters just appear\\, character arcs are incomplete and even the physics and history of this film universe bend unrealistically all so we can get the tedious \\\"messages\\\" the story is trying to tell us. Poor character development meant I didn't care what happened to anyone. More than half the film is spent trying to destroy the past instead of actually developing characters or just something new and interesting. If the film was gutsy and actually made something new and interesting we might indeed let go of the past. But the past is way more interesting than what we are being offered here. Any film attempting to subvert must at least make us believe the subversion - and with such poor\\, clumsy construction and weak characters no real subversion can work. With more thought\\, consideration and better writing this could have been an amazing film. Some concepts just make no sense eg \\\"Light rises to meet darkness\\\" - thats why there can't ever be a dark Empire which dominates a small handful of weak rebels whose actions matter... really? Also a terrible message for kids - as Light is surely just naturally rising to meet the challenges of Dark climate change - oh wait\\, it isnt...","true":true}