{"101487":185232,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is undoubtedly going to be divisive and coming out of this film my immediate reaction was very mixed on this film. There were some things about this film that I hated and other things about it that I loved. Rian Johnson really tried to do something different here in this movie and for that I applaud him\\, but that doesn't mean I have to like all the changes he made. I cannot talk about what I dislike about this movie without going into spoilers. I do recommend seeing it though just to see some of the things that are done. \\n\\nCAREFUL FOR SPOILERS\\n\\nThe biggest issue I had with this film was the treatment of Leia. I found they way Leia was used in this film to be horrible and awful and almost disrespectful to Carrie Fisher. They had a chance to have her character die in this film\\, but instead they toyed with her death\\, and thus played with the audience. The scene where Leia opens her eyes and comes back to the ship was cartoonish and stupid. It was the dumbest stupid scene in the entire movie. Like what Leia is Superman now? \\n\\nThe handling of Luke Skywalker also isn't that great either. While I did gelt like this was Luke the choices they make with this character in the second half of the film is terrible for me. They have Luke face Kylo and not even actually face him instead choosing for it to just be simple force ghost and then have Luke die in a really lonesome way making him feel more like a coward than anything else. \\n\\nThere is also this forced romance between Finn and this girl named Rose that comes out of nowhere. And the character of Rose in general is poorly done. \\n\\nNow lets talk about Rey......cause man...Rey is a really intriguing part of this film. The relationship between her and Kylo is really interesting and thought provoking. The bond they share for me was really nice and beautiful and kinda sweet too. Even if it all does kinda start to crumble down. Whenever it cut to them was when I really enjoyed the film. \\n\\nThere is of course the whole Kylo knowing Rey's parents stuff too which was really interesting\\, but the problem is that the movie itself leads you to believe it something bigger than it actually is so when the reveal happens your very much let down by it. \\n\\nAlso while Finn and Rose bond was meh the fight between Finn and Phasma was amazing!!! For me it really did redeem Phasma for me and make me like the character a lot more than before. \\n\\nThe film is very experimental in nature. There are a lot of interesting scenes like the weird mirror scene where we see multiple Reys is really something else\\, and asks a lot of different questions about Rey as a character. \\n\\nThe death of Snoke I also found to be really great as well and really cool look at Kylo's unsureness too. And Kylo being the leader of the first Order was a great choice as well\\n\\nSo for me this a pretty much half and half film. There is a lot of great stuff and a lot stuff I hated. And yet it is weird cause oddly enough I want to see it again and see where the story goes from here.","true":true}