{"101487":196110,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"When I originally saw this film I was releived that it was not copy paste episode 5\\, like 7 was of 4. However upon further reflection I have come to the conclusion that while containing interesting exploration of The Force as a... well force\\, the rest of the plot is so convoluted and horrendously bad that the recent film Jumanji had a better and more clear plot than anything this film has to offer. This is not only a disgrace to the legacy of Luke Skywalker. This is a slap in the face to the far more talented theory channels dedicated to bringing to life small explanations or fillings in that are more entertaining and captivating than cantobyte and the slow drawn out \\\"chase\\\" sequence that comprise this films runtime. This is the equivalent of if the opening of a new hope were made into its own film with unoriginal planets of \\\"not Hoth\\\" and \\\"not Yavin 4\\\"\\, excepting cantobyte which is entirely filled with political commentary more fitting of a news station than an action adventure film. This is of course not mentioning the unbelievable and ludicrous \\\"love\\\" story between Finn and Rose. Why are they in love\\, they have been together at max twelve hours and most of that was spent having them at each others throats or sneaking around. But I digress. Having recently rewatched the entire series (minus TFA) I can definitively say that this movie is not deserving to be called finished as it was released\\, let alone a Star Wars movie.","true":true}