{"101487":164907,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Review from a fan...not a super fan.  Wow\\, what a disappointment and spoilers in the whole review.   I wish they would just blow the whole thing up and start over.  So\\, so very bad.  How the hell do the critics amiss on this one..the movie sucks!  i don't know if I want to see another one\\, they totally ruined Star Wars and without Jar Jar.  DO NOT WASTE YOUR MONEY$$$$$$$$\\n\\nI want to start off with the good.  Visually\\, pretty stunning.  Great use of planets and cinematography\\, the ships looked great.  The use of some new characters were good and Del Toro was a welcome addition.  The use of humor was decent but didn't always fit in with the mood at the time.\\nRey and Chewy is good and about the only decent characters that they didn't try to screw up.\\nThe Bad...where to begin. \\nThe director had no respect for the Luke Skywalker...not even the same guy we grew up with.  Some whiny broken man....he creates a map to find him and when they get there he has forsaken the force??? WTF???  doesn't make sense and the whole concept is weak.  It is like the director is trying to get us to not care about the character anymore so he can kill off every one from the past.  Plus its an old concept...It was like watching the cartoon Surfs UP with the penguins or something...stupid.\\nLeia...dies\\, wakes up in space but uses the force to fly back???  So many layers of dumb I can't believe its in the movie.\\nBen Solo...can we get a whinier bad guy.  Surprised Snoke doesn't have him on Prozac.  the best part of Star Wars are the bad guys are awesome and this bad guy is cry baby.  He is going to hold his breath until his mommy lets him do what he wants.  What a wuss.  The guy gets beat by a girl that knows she has the force for a whole two weeks.   Makes no sense.\\nI think i am done reviewing...the whole thing is joke and a slap in the face George Lucas and Mark Hamill.  Please make this whole move a force dream that Luke wakes up from and start over...worst movie with great effects.","true":true}