{"101487":194676,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well what a disappointment. This is the first time I have ever left a review of a film\\, just because I am so disappointed. It seems star wars is the latest  victim to be sacrificed on the altar of diversity and social justice. Unfortunately like everything now our entertainment culture has to be politicised. Whether it be films\\, games or even sports. The problem is these people live in a bubble and don't realise people just want to be entertained without political opinions being thrown at them. \\n\\nI have to say jj set up TFA well. It had created an interesting plot that left good questions unanswered. However\\, Johnson due to I can only imagine his over inflated ego decided to throw this all down the pan. It was almost as though a toddler had created the story line. I can only imagine JJ is seething over the mess he has to now clear up. \\n\\nUnfortunately the casino scenes just sum up what is wrong with this film\\, a plot that leeds nowhere and just ticks boxes. It's unfortunate because John Boyega is a fantastic actor and it left me feeling that the story created for finn was just to tick the diversity score card. \\n\\nIt really didn't feel like a SW film. I'm sure of you didn't consider it a part of this universe it would be considered an okay film. The reviews of this by critics are shockingly wrong and the MM seems more interested on blaming the   alt right for the poor audience reviews than the amount of people who have had their SW universe shattered insteady of actually seeing why this film was poorly \\nthought out.  \\n\\nI can really understand why that guy started the petition\\, no doubt he said he regretted it as the MM probably threatened to dox him unless he spoke out against his own blasphemy against the church of social justice's latest project. \\n\\nThe cinematography was well created though\\, although having Snoke CGI'd was too much. I just pray JJ can save this abysmal non existent plot line.","true":true}