{"101487":183712,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie did lots of things right\\, and that's why it got 2 stars.\\nI had no problems with Luke dying.\\nNo problems with Snoke dying. But I am still curious about his story\\nNo problems with Luke's roll in the Kylo origins story.\\nThe hyperspace crash was visually stunning and the lack of any score for that 5 second period was brilliant cinematography.\\nI would have like to see Kylo and Rey continue to work together\\, rule together start a new order of their own.\\nAnd I don't care about Reys parentage because in a performance where Adam Driver is very believable and convincing to me he played that scene in a impetuous way that suggested that he was lying. So I don't buy it. But we'll see.\\n\\nTone -  It was all wrong. So allow me to explain by comparing the movie to Rogue One.\\nRogue One managed to capture the tone of Star Wars perfectly the glib droid was the source of comedy and it wasn't for comedy's sake nor was it in every single scene. I genuinely was awaiting the appearance of Chris Pratt (who I love but not for Star Wars) The Last Jedi was in fact\\, I guess silly.\\nThe Hux Poe scene. I did well to see the rest of the movie after such an intense eye roll.\\nAny scene with Finn.\\n\\nI feel like Disney forgot that George Lucas made a trilogy that was suitable for kids but not necessarily for them. See the sexual tension during tESB between Leia and Han.\\nInstead this is a movie that was made for kids and as a result is almost unbearable for adults. The humour wasn't funny\\, it was obvious and far too frequent to the point of being tiresome.\\n\\nLuke - An old grouch on the island. Sure. Ok.\\nConsidering to end Ben Solo. Sure-ish. Ok.\\nTossing the lightsaber. NOPE\\nDusting off his shoulder. NOPE\\nIt's lucky that came at the end of the movie because I'd have walked out had it been earlier.\\n\\nLeia\/Superwoman\/Neo - Odd odd odd. Not only is there no reference at any point that she has developed her force powers. Which granted was set up in RoTJ. But it was just done so horrifically. I've heard comparisons to Mary Poppins but it was more akin to some of the scenes from Lalaland.\\n\\nNext up Hux. Will someone (Namely you Mark Hamil (needs an older wiser head))\\, please sit this boy down and tell him he doesn't need to try and overact every single line. Was he meant to be a parody??\\n\\nCanto Bight - Very Very Phantom Menace. Pointless and the time could've been better used elsewhere\\n\\nPhasma - Was she just a marketing tool? They Boba Fetted the hell out of her.\\n\\nI found it very disappointing\\, because there was a lot of filler dialogue which either served little purpose and scored few laughs\\, some good performances (Hamil\\, Fisher\\, Driver and Dern)\\, some bad performances (Gleeson\\, Boyega)\\, poor subplots and tonally off the mark all of which really let down what was a promising concept of a story - minus Canto Bight.","true":true}