{"101487":143722,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's very short sighted that most people who liked the movie think that the \\\"haters\\\" didn't like it because it was \\\"different.\\\"  First of all\\, the movie has plot holes that you can drive a Death Star through.  \\n\\nSome examples:\\n-Why would a Resistance cruiser that was at its home base before taking off be short on fuel after one hyperspace jump?\\n-If small ships like the one Finn and Rose left on can escape and jump to hyperspace unnoticed\\, why didn't all of the shuttles do that instead of heading to that planet at sub-light and subsequently being mostly destroyed?\\n-Instead of just chasing the Resistance ship\\, why didn't the first order send some ships ahead through hyperspace to cut them off?\\n-Finn and Rose's side mission served no purpose in the movie other than to contrive a way for Finn and Phasma to fight.\\n-Finn drove that mining ship really fast for quite a distance - away from the base.  But like 2 minutes after crashing\\, he drags Rose back into the base - somehow walking right past a bunch of walkers and ground troops.\\n-Luke Skywalker... a person who believed that a shred of good in a mass murderer (who had  previously cut off his hand) was worth saving at all costs.  Yet Luke gave serious thought to killing his sleeping nephew - who at that point only had the POTENTIAL for evil?  Really?\\nThere's more\\, but you get the point.  But here's the thing. You can say that all Star Wars movies have plot holes. And you'd be right.  And I could have overlooked the ones in this movie...just I do in most of the others\\, if Rian Johnson had managed to give the character of Luke Skywalker a better send-off.\\nIn Force Awakens\\, I accepted Han Solo being killed\\, because I got a chance to see Han being Han one last time. He flew the Falcon. He killed a bunch of Stormtroopers. He helped blow stuff up and save the day. He got stabbed in the chest with a lightsaber by his own son while trying to save him.  A worthy send-off.\\nNow contrast that with the treatment Luke got in Last Jedi.  He was a sad\\, cranky old man who refused to get back in the fight.  Then they tease you with the idea that he DOES get back in the fight... and that you're going to get to see him in combat one last time... it's an illusion.  When he said \\\"See ya around kid..\\\" I still had hope that he would be back in the next film and get a proper send-off. But then he just \\\"becomes one with the force.\\\"  Han went out with a bang. Luke went out with a whimper.  What a disservice to both the character and the fans. \\nNo one says that a Star Wars writer\/director has to pay service to fan-boys. But if you're going to flip the fan-boys the bird\\, so to speak\\, you better do it with a rock solid movie when it comes to the plot. Otherwise you're going to get ripped apart by the hardcore fans.  And considering the current 57% audience  score on this website\\, that's exactly what is happening.\\nHopefully J.J. Abrams can find a way salvage something from the wreckage and close out this new trilogy in a satisfactory way. But that looks like a tall order right now.  Good luck.","true":true}