{"101487":113931,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Congratulations to the director and team that brought you Star Wars: The Last Jedi for having a monster box office weekend! This movie had it's moments\\, wows and yeahs\\, but as the movie ended I sat there thinking\\, this movie was not all that thrilling and impressive as the trailers made it to be. I did go in with low expectations after I saw the audience rating on Rotten Tomatoes website. The audience gave it a lower rating than Episode 1 The Phantom Menace and that's saying alot. However\\, the critics and others on social media are actually giving it a great review. My conclusion is you either love it or hate it. While many give it praise\\, I'll have to be on the side this time to say I really didn't like it. To me the spirit\\, the drama\\, the story is missing big time. I was hoping to get answers for many questions I have. Well it didn't happen. The story in this film was all over the place with a lot of plot holes not to mention over doing the cheesy humor. I understand this new trilogy is moving on the old and introducing new characters with a new story but one of the main characters in this movie I really wish they would have ended the way it was shown in a scene. I would have to say if you didn't grow up with the original Star Wars trilogy then this movie would be great. For me\\, it's moving away from the original story of Star Wars and seems to get lost in a bunch of random new people and plots. However\\, with all that said\\, it's still Star Wars and a fun movie to watch this holiday day season. Enjoy it!","true":true}