{"101487":176975,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie's theme of letting go of past failures was so over the top that it made the movie a failure and made me want to let go of the Disney's Star Wars franchise \\n\\nThere are so many reasons why this movie fell short\\, but it can all be attributed to Disney's decision to have a different director\\, who decided to forgo so many plots from the first movie that left me wondering if it was even a sequel or part of a trilogy?? \\n\\nThe story was so overly complicated and dragged on for so long. My god Finn's side plot was horrendous and utterly pointless\\, and left me wishing he had stayed in his coma for the entire movie\\, and I really like the character! but the plot was awful. Po and Holdo's story was just as terrible. You could have slept through all their scenes and not have missed anything! It was also disappointing to watch them waste the opportunity to further develop the depth of the more interesting characters (Snoke\\, Phasma\\, DJ\\, the great admiral Ackbar!). General Hux is also a waste\\, and more of a Disney cartoon villain than the General of the feared First Order. \\n\\nWith overwhelming poor reviews from the audience score\\,  I feel incredibly cheated and tricked by the bought critics on this website and others. I don't see how you can give this movie more than a 4\/10 either as a stand alone or a supposed sequel in a trilogy. \\n\\nTLDR: An overly complicated story that has so many underwhelming story arcs. For the longest star wars movie I felt I came out with less than all the rest","true":true}