{"101487":138196,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"In reading the reviews of others all I see are spoiled brats that have no idea what they were talking about.  The movie has it's place.  Is it perfect\\, No.  Did it answer questions\\, No.  Was it supposed to answer questions\\, No.  It was supposed to be entertaining\\, which it was.  It was supposed to bridge us from VII to IX\\, which I believe it's doing.  I enjoyed it from beginning to end.  Rey went to Luke at the end of VII to return his lightsaber\\, and hopefully get answers to her power and family.  She didn't get the answers she or we wanted but that's life.  He's an older Jedi that never had the full training himself.  It's obvious that he had to do a lot of personal training and sole searching for 30 years and is a frustrated and torn man.  He had a legend status he had to live up to for 30 years and it's beaten him down and losing Ben to the Dark Side destroyed any Hope that he has in the Jedi way.  He's truly being selfish and Rey kind of shows him this without knowing and helps him know what his role should be in all this.  \\n\\nThe Resistance is outnumbered and have always been.  Many think the movie doesn't answer the question as to how the First Order started or gained it's power.  The movie itself doesn't but if you read Bloodline\\, between the movie and the book you understand how it started.  A true Star Wars Fan know there is more that just the movies and everything can't be explained in the movies themselves.  The movies are for the bigger audience.  If Bloodline was made into a movie it would flop big time.  It would be utterly boring to the fringe Star Wars fan.\\n\\nSo ultimately I thought it was a really good movie and has it's place in the Star Wars saga.  It wasn't perfect and could have been better without a few scenes.  Overall it would be a 4 out of 5 and I believe that after the saga is finished it will show it's overall place as one of the better Star Wars movies.","true":true}