{"101487":98777,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A complete and utter disappointment in every way. \\n\\nCan I preface this by saying I *am* a SJW and all the SJW bashing in the comments is ridiculous. The movie didn't fail because it appealed to feminist and anti-racist ideals - and actually it didn't even do THAT to be honest. Finn and Rose were nothing but token sidekicks who had no major impact on the story in any way\\, didn't have any good character development\\, and were not inspirational to audiences. Rey's training and story were stripped away. She became just another \\\"pretty white girl\\\" on the screen. If anything\\, it felt like the writers retreated to trying to develop Kylo Ren where it's safe. If \\\"we\\\" know anything it's angsty white guys. They tried to make him someone you could identify with instead of continuing the story from Force Awakens where he's really purely a villain. That was interesting. This was not.  \\n\\nI LOVED The Force Awakens. It was bold\\, fresh\\, Star Wars goodness with puppets and perfect cues and transitions\\, excellent settings\\, action\\, and story and fantastic main characters. The characters had story\\, drive\\, and motivation. The humor was amazing\\, I had so many moments of burst-out-loud laughter in that movie. There was none of that for me here.  \\n\\nAlso\\, though the movie as a whole was mostly complete and utter garbage start to finish the ONLY thing I LOVED was LEIA FLOATING THROUGH SPACE so STOP BASHING IT. She's had the Force for years surely she can move things a little???? With no gravity or resistance????? Luke never showed her anything? Of course he did. If you can accept Luke force projecting himself across lightyears with no prior explanation but can't accept Leia moving herself a bit through the vacuum of space I got nothin for ya :P \\n\\nThat said that decision to even bomb the bridge was ridiculous in the first place........ didn't... they have.... shields??? I was so confused when I saw that because the ship wasn't taking any damage but then suddenly the bridge did?????? WHAT????\\n\\nTHE PHYSICS IN THIS MOVIE IS ABSOLUTELY RIDICULOUS. WHY ARE THERE \\\"GRAVITY\\\" STYLE SLOW MOVING BOMBERS IN SPACE\\n\\nThe entire opening act was just a disgrace of a military operation in film. Poe is supposedly the top pilot who makes decisions that get his entire bombing squadron destroyed??? REALLY??? This is so implausible it took me out of the movie right when it was beginning!\\n\\nAnd yes why didn't everyone get sucked out into space when they opened the door for Leia. \\n\\nI didn't care anything about Rose and I wanted to care. They made a preachy token out of her too with her stiff speech about equality in the middle of the film. Why do we have any reason to care?  \\n\\nSo many opportunities to do something truly awesome were missed in this film (hello Force spirit Han Solo???? Please????) Rey was reduced to an observer. What did she do in the film that was actually of any import?  Finn and Rose failed at their (ridiculous side mission that somehow took the majority of the movie) plan. Snoke's death felt like a cowardly out by the writers\\, afraid to actually do something with the chess piece on the board\\, they'll just nuke it. \\n\\nThis film has no redeeming qualities. Rey and Kylo's battle was ruined by the conclusion. \\n\\nWould it have saved the film for me if Rey decided to turn sides against her friends and join Kylo on the Dark Side? Absolutely. The film sets up this stunner then drops it like a rock. THAT would have been bold and new and interesting. The option was presented and we got nothing. So there was no point to her even being there.  \\n\\nLuke's appearance near the end of the film was a total and utter letdown. So many people have already gone into how they betrayed his character - and I find it so incredibly hard to believe he would have lost it over a few Dark Side thoughts from his NEPHEW. BTW THAT'S YOUR NEPHEW LUKE HE SHARES YOUR BLOOD but I digress. The way the epic moment at the end of The Force Awakens was completely abandoned at the beginning of The Last Jedi with that inane lightsaber toss over the shoulder... Rian Johnson the director clearly DOESN'T understand what it takes to make an EPIC. Like the original Star Wars\\, like Lord of the Rings\\, like the Matrix (1999). You don't DROP a moment like that!  Ever! That would be like Aragorn shrugging his shoulders at the end of The Return of the King and walking away from the gates instead of turning the fight. The Hell\\, Johnson???  It's like he's never seen another movie in his life and somehow got pegged to helm this one. \\n\\nFinn!! My heart!!  I would have loved to go deeper into Finn but somehow he ended up being the Trademark Coward (???) which seemed like a gross misinterpretation of who he was in The Force Awakens. \\n\\nAnd Admiral Holdo was a total disgrace as a leader. When the mutiny happened they should have ran with that\\, instead of deciding \\\"Oh wait\\, actually she was right somehow.\\\" The \\\"feminist\\\" angle about her doesn't bother me at all\\, and it's great to see women in power with funky hairstyles. It was absolutely ridiculous that she couldn't lead for sh*t and that the movie didn't allow the younger characters to depose her. What happened to \\\"destroy all the old\\\"???  There you go\\, she's the old\\, let her go! Instead she got \\\"redeemed\\\" and that was really a disgusting moment for me. \\n\\nI'm so disappointed with the handling of this film. Started off so well with TFA and could have been SO much better than that one as well. It even sets up a few awesome points for itself but then drops them completely. For all the fear we've had of directors fudging up their moments at an epic helm that didn't come to fruition\\, Rian Johnson truly took each and every one of those darkest fears and brought them fully into reality in the worst ways imaginable. As the film's runner\\, Johnson seemed to care nothing about the awesome new characters\\, or the legacy of Star Wars.  I'd be perfectly happy to see him rewarded for this monumental failure with a complete blacklist from film.","true":true}