{"101487":175581,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi manages to make even The Force Awakens look good by comparison. It's a crappy movie that only serves to show how much Disney doesn't care about Star Wars. Beloved characters are tossed out the window for new characters that don't even get written well enough to be cared about. Rey\\, who by any account should be the star of the new trilogy\\, is nothing more than a mary sue who doesn't have anything close to resembling a character arc. Poe and Finn were poorly written in TFA (Poe barely being in the movie at all) and somehow they got it even worse in TLJ.\\n\\nBut worst of all is how Disney so callously destroys classic characters without a single hint that they realized it was a mistake. Admiral Ackbar is killed off with barely a mention\\, Leia is downgraded significantly from her personality in the original trilogy\\, Han is brutally murdered  after having his character development rendered moot\\, and now Luke was turned into a nihilistic bitter old man. You'd think Disney would be trying to treat these characters well considering how popular they are but nope. Politics and pandering matter more to them and look where it's gotten them. \\n\\nIt doesn't help that TLJ seems to be dead focused on trying to make Kylo Ren look more sympathetic. Yes Disney we want to see Luke Skywalker\\, Jedi Knight and hero of the Rebellion\\, be turned into a raging douchebag who would kill his own family while you prop up your Jacen Solo knock off as the one who's more sympathetic. Disney you're not even trying to get people to watch your movie. You're just making a crappy movie solely to satisfy personal politics.","true":true}