{"101487":193258,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"WARNING - SPOILERS\\n\\nThings that didn't make any sense in this heaping pile of Disney excrement \\n\\n1. Leia can survive in outer space.\\n2. Leia can propel herself through zero gravity using her frozen hand. \\n3. Luke devolves to his persona at the very beginning of A New Hope or worse. \\n4. Finn and Rose can sit on a battlefield in front of an entire First Order armada\\, have a touching moment\\, and still make it the length of several football fields back to the base without being killed. \\n5. Supreme Leader Snoke is actually Supreme Let down Snoke and can be fooled by his completely unworthy apprentice. \\n6. Luke can create a holographic image of himself however many light years away from his position. Why weren't they doing this before? There's so many situations where this would have been useful in 4\\, 5 and 6.\\n7. Benicio Del Toro waiting for two other prisoners to show up before breaking out of his cell which he clearly could have done at any moment. \\n8. 93% fresh on Rotten Tomatoes. \\n9. Laura Dern. \\n10. Luke flip flops more than Trump. \\n11. Huge unnecessary plan that has no purpose and does nothing for the plot except to add another unnecessary character. \\n12. Chewie still would have just eaten that Porg or whatever they're called.\\n13. Couldn't the First order have just focused all their firepower on the mountain itself and collapsed the whole thing on the remaining rebels instead of wasting time with that door? I guess they deserve to lose if they're that dumb.\\n14. Couldn't the First Order just send a bunch of TIE fighters out to destroy the remaining rebels in that unnecessarily long chase? What was their initial excuse\\, they couldn't cover the TIE fighters from that far away? Since when are storm troopers not expendable? I guess the First Order deserves to lose if they're that dumb.\\n15. Seriously what the fuck is up with Leia floating through space. \\n16. Did Rey going into that dark side pit on the island actually have any purpose to anything at all? What the fuck was that all about?\\n17. Phasma. One thing's for certain\\, I thought she was going to be a lot thinner.\\n18. They could still turn this around but I'm not going to get my hopes up - All these burning questions that only led to dead ends. So Rey is just the daughter of some gambling delinquent parents? Snoke is just some wrinkly old random Sith with no history? \\n19. They kind of explained Luke disappearing but it was slipshod and a complete let down in terms of his end.\\n20. That scene with Maz Kanata was completely pointless because that entire subplot was completely pointless.\\n21. Kylo doesn't blow up Leia just to have someone else do it. I understand the point of showing the conflict within Kylo but that never even pans out. Get your shit together Rian. \\n22. The movie doesn't follow the Star Wars time lapses between movies. It's like - \\\"Here we are\\, it's the same day as the last scene of The Force Awakens.\\\" No mystery\\, no intrigue\\, just a frantic effort to fill in the holes that made TFA so great. \\n23. Why does Kylo Ren even kill Snoke? To save Rey just to betray her? This overgrown 6 year old needs to make up his mind (although I think Adam Driver plays the part very well even though it was so poorly written.)\\n24. Why didn't Holdo just tell Poe what she was up to? That would have saved us that 40 minute escapade to that casino. \\n25. Luke considered killing Kylo in his sleep in an apparent \\\"lack of judgement.\\\" Yeah sorry\\, that's not how Jedi's do things. They could have taken that and turned Luke into the next Vader. There's an idea for you Rian. \\n26. Why don't any of the resistance fighters actually share their plans with one another? Even hologram Luke doesn't cue anyone in on what's going on\\, which almost leads to Finn rushing out to help which I'm sure he would have somehow miraculously survived anyway. \\n\\nThat's all I can think of at the moment. Basically it was bad.","true":true}