{"101487":196088,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"WHEN I FIRST SAW THIS MOVIE\\, IT WAS WELL AFTER THE BACKLASH AGAINST IT HAD BEGUN. sO I WAS SORT OF EXPECTING IT TO BE THE WORST MOVIE EVER. BUT objectively speaking\\, it isn't. there are a lot of well done scenes and sequences and it's shot very well. However\\, as time went on and the backlash against Disney continued\\, Disney tried to fight back. Director Rian Johnson and multiple 'geek' websites that seemed to have a favorable view of disney started insinuating that the real reason there was such a backlash was because of sexism or some such. Rather than own up to the fact that people had rejected his hyper-politicized and arguably insulting take on Star Wars he instead resorted to the name calling and EMOTIONAL instability that he accuses his critics of. What this has ironically done has severely lowered my estimation of the film. \\n\\nThe Director's behavior since widespread rejection of both The Last Jedi and Solo has crystallized for me a lot of the oddities in the film. Why does the Canto Bight sequence go nowhere? Why are Rose Tico and Admiral Holdo (Johnson's characters) completely pointless? Why are the character arcs of Rey\\, Finn\\, Poe and Kylo Ren completely derailed by this movie? Why do both Luke and Leia act so out of character? All of these questions that I might have been willing to give the benefit of the doubt I no longer feel inclined to do so because Director Rian Johnson has revealed himself to be the very 'man-baby' he claims his detractors are. He took possibly the most popular IP on the planet and made a divisive and spiteful movie that split and already fracturing fan base. It seems fairly clear that Rian Johnson wanted to essentially Troll the audience and couldn't handle getting trolled back. With the financial failure of Solo\\, hopefully Disney will take notice of some of it's more exuberant critics but given that they were the ones that let Rian Johnson become a professional troll\\, i have little hope.","true":true}