{"101487":142778,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Its funny tomatoes isn't letting me post half star reviews.  Third attempt now.  What's not been said about this parody.  We are in a sad state of affairs when Mark Hamill knows the character better than any one in production.  We are in a sad state of affairs when Disney care more about modern day political correctness and toy selling rather than telling a story.  We are in a sad state of affairs when the cinema sits in stunned silence with zero claps at the end.  Ten year old kids were walking out stripping the plot holes and nonsense.  Its all a money maker now since the farce awakens.  The big problem is Disney have no idea of what to do with these movies. Yes to the common watcher the entertainment\\, music\\, visuals and space fights look decent but for the rest of us there's zero creativity and imagination. From the awful jokes to the dialogue and from how poor the characters interact its just damn ridiculous.  Why has this started 3 seconds after the last farce? Helps nothing in progressing story or characters.  Make fin serious now throw him in the falcon with chewy or have him a commander in a platoon of soldiers something anything apart from the nonsense that goes on throughout.  Even why not have luke pull the xwing out of the sea\\, fly over slice the red guards in half\\, fight snoke with rey\\, Snoke and kylo run off.  Luke picks up a injured rey then proceeds to tell her who she actually is. Cuts to the others the end.  Something anything to pull people in for the wrap up movie.  The damage tho is done well before the ending. Kylo can we take him serious? Tantrums\\, being shirtless and losing every fight hes in.  His general looks like he belongs in a old Scooby doo cartoon.  Actors don't even look the part many fighter pilots look like they've been plucked out youre local takeaway.  Plot holes the Serengeti wildebeest could migrate through.  Past star wars folklore is thrown in again.  Jedi scripts? Maids? pulling yoda out the mental asylum.  Alien milking\\, astronaut leia\\, phone pranks\\, vege chewy.  Chewys co pilot is a 6 inch penguin. Seriously who thinks this stuff up. One of the worst scenes in cinematic history is the running in half ATST.   2 years they've had to write this and this is the best they can come up with.  Utter nonsense.  We wait 2 years to  get some dialogue from luke only to throw the thing away like it was you're old flip flips insulting. Info on the last  35 years?  What to we eventually get luke standing over a sleeping kid seriously that's it . Does anyone care no they are outraged.  Please just end this.  Crash and kill chewy\\, blow up the falcon\\, disintegrate the 2 droids.  Unfortunately they're still making money and will ever do.  The next trilogy I wont be paying any money to watch.","true":true}