{"101487":143367,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's only a movie or Disney's Star Wars\\n\\nThe movie series so far is terrible. That of course is just my opinion\\, but that opinion comes from years of love and interest in the Star Wars Universe. The series of books\\, movies\\, and video games shared and created a massive universe of content. Sadly the new series which shares a small part of the expanded universe\\, newer comics\\, books and cartoons like Disney's Rebels\\, but also previous cartoons such as Clone Wars are still considered cannon.\\nThe Force Awakens\\, which rebooted the movie franchise\\, copied parts of the original movie released in 1977. Laying the foundation with events similar to the ones seen in A New Hope\\, while at the same time adding new characters and a new puppet master Snoke. The mystery of this character and the new empire he wanted to build with his First order. However neither the Force Awakens or The Last Jedi ever give much detail on who or what the First Order are about. I had to go onto wookieepedia just to find out that the First Order are more or less resistance fighters who want to see a return of\\, and I kid you not\\, the stability the Empire brought to the galaxy. First off what stability because even in the vast amounts of books and comics written over the years do you ever see an Empire that isn't in a constant state of war.   \\nThe Force Awakens ends with the First Order blowing up a large number of republic planets with a new doomsday weapon Starkiller Base or third Death Star( tomatoe-tomato). The film however never tells you which republic home worlds they destroyed. Once more I have to turn to wookieepedia for the answer and I doubt a large part of the audience would even do this. I don't want to get off on to much of a tangent but putting the answers to questions you raise in a movie in another medium such as a comic or book instead of putting those answers in a follow up movie like The Last Jedi is just  dumb. The new Death Star wiped out the galactic republic home worlds in the Hosnian system. The Hosnian system is home to a planet called Hosnian Prime\\, which was were the new Republic Senate resides. Now after finding this out questions begin to form. \\nIf the First Order destroyed a systems worth of planets and the home of the republic senate\\, why do we see nothing in the Last Jedi showing the remnants of a republic fleet? Why doesn't the movie show us any of the member planets of the Republic Senate preparing for war? How does the galaxy as a whole deal with this new threat that was dormant under their noses for so long? Why isn't the resistance  that acted against this remnant fleet of the Empire not going to all the other republic planets to recruit new fighters to their cause? There is literally a million things that could have been in The Last Jedi that would have been way better than what we ended up with. \\nThe Last Jedi or The Last Star Wars\\nEpisode 8 killed the franchise for me\\, sure it might be a bit over dramatic but it's hard to argue with how the film made me feel. Never have I watched a Star Wars movie and been more disappointed. Sure\\, I know what you're thinking\\, what about the star wars prequels. They were bad in a lot of ways\\, but somehow Disney found a way to outdo Lucas and the entire prequel trilogy. \\nWhile the prequel trilogy was full of cringe and terrible dialogue it had one thing going for it that the current day trilogy lacks. Heart. It had a group of characters love them or hate them( looking at you  J.J. Binks) had their own motivations and were thought out. There was a reason so many people liked or loved to hate Jar Jar. It was a character\\, you may not have liked the character but it was a fleshed out character. The current movies\\, outside of the original group of characters are bland. They have no development to them at all and are as one dimensional as you can get.  The characters in a Star Wars movie are everything\\, pretty glow sticks and shiny CGI can only carry a movie like this so far.\\n In episode 9 we get to see Po doing fighter pilot things. Why\\, because movie script says to be fighter pilot. We get to see Finn being comic relief\\, and we get to see Rey trying to find who out who she is. While all of these things could lead to character development none of it does. Instead we get to see Po become an idiot causing an internal fight amongst the resistance to take place while they are slowly being taken out ship by ship.  We see Finn do something suicidal for no reason\\, and it's something that flies directly in the face of the characters personal motivations. Then we come to Rey\\, who seems to be the most fluid character of the bunch\\, who is told she is the second most powerful person Luke Skywalker has ever met and doesn't bat an eye. Maybe the problem isn't characterization but the fact that none of these characters act even remotely realistic. \\nThe Last Jedi had its moments\\, it had potential but sadly it goes nowhere. The puppet master Snok could have been an interesting character but becomes a plot device. Killed before he could become fully fleshed out or much of anything really. The Knights of Ren\\, which you heard teased in The Force Awakens also meet the same demise with a total of maybe 5 minutes of screen time. Every major adversary you could have had for the third part of this trilogy is now dead.  \\nLuke Skywalker...is that really you?\\nLuke Skywalker in this movie is a pale imitation of the original. Luke is no longer optimistic or filled with the hope that drove him throughout the original trilogy. Instead what we have is a cowardly old man who thought about killing his teenage nephew because he was scared. He made a mistake and for that mistake he locks himself away from the rest of the galaxy on a planet that\\, his words not mine\\, is the most unfindable.\\nRey:  We need Luke Skywalker. \\n Luke: You don't need Luke Skywalker. \\nRey: Did you hear anything I just said?\\nLuke: You think what?  I'm going to  walk out with a laser sword and face down the whole first order. What did you think was going to happen here?  Did you think I came to the most unfindable place in the galaxy for no reason. \\nThe dialogue is terrible in more than one way. First off Luke did face down an entire Empire in the original trilogy and wasn't a coward about it\\, running head long into danger to save his friends. This Luke is a fraud and a coward and very prophetic because he foreshadows the end of the movie where he does face down the entire First Order. \\nThe movie is filled with a broken Luke who completely removes himself from the plot and the force. I won't go into anymore details because Disney has done a bang up job of creating an unlikable character and a character that has little to no redeeming value. They took the original actor one of the few and made him destroy the character he helped to create. A character that was a beloved part of a franchise that is 41 years old. What a waste. A death that served no purpose other than to make room for the non likeable characters Disney has created.   \\nAll in all if you haven't seen Star Wars The Last Jedi by all means\\, go and see it. You might like it\\, or you might not. The experience for me was like attending the funeral of the last relative you like\\, which is sad but also great because it frees you from ever having to go to another one.","true":true}