{"101487":164750,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Redoing review due to half star supposedly not counting.  Nothing else can be said other than it appears this is some type of parody of Star Wars.  Rian Johnson apparent ineptness is staggering.  I'm leaning though he is a patsy and was basically told what to put in the film and I would expect the new Han Solo to be in the same boat.  Axed two directors for creative differences and pulled someone in who would do the mouses bidding.  Probably why we haven't seen a trailer yet.\\n\\nSo about this abomination.  Many people will say it's because too many women and SJW etc...it's really not that.  Rogue one and TFA was pretty diverse and even though TFA was a rehash of ANH it was still Star Wars and made you made feel good.  The problem with TLJ is it is just a terrible movie\\, pure and simple.  The movie is just terrible.  It's a movie you would expect to see on SyFy at 3am right after Sharknado 3 oh hell no.  I'm not joking\\, it's really that bad.  It's a complete travesty and utter abomination of the Star Wars lore\/history\/canon.  It almost feels like it was completely done on purpose for some weird reason.  I can't think of how any sane individuals could make it through watching the cuts or ven the storyboard and go\\, YES!  That's our block buster!  This is the rich new direction of the Star Wars universe.  This movie is so bad.\\n\\nWhat really aggravates me is the trailer looks so good.  It's this constant hoodwinking\\, pulling the rug out from underneath you that's irritating as well.  At every turn in the film the rug is pulled out from under you or\\, another thing I love is every detail in the scene is pointed out and over explained.  Like Rose looking in the escape pod and seeing finns bag and she's seen others escaping and they she puts two and two together ( verbally ) and my god it's awful.  Like beavis noticing the tv was stolen in beavis and butthead do America\\, in which\\, it works in that movie because it's a movie about morons.  \\n\\nTo slightly touch on the SJW front\\, it's ok to have kick ass women and kick ass men share the screen.  One doesn't haven't to belittle the other to make the point the woman is strong.  Just be cool and make them both kick ass.  It's ok\\, we can all get all along no matter how much we say we can't\\, we will\\n\\nI won't go over the destruction of Luke.  It's freaking lousy and actually I think pushing an agenda which makes me sick\\n\\nChewbaca\\, Kathleen Kennedy\\, watch a Star Wars film and understand Luke can understand Chewie\\, we know Rey can do everything including interrupting but the previous movies show Chewie and Luke communicating.  One of the biggest critiques of the movie was lack of extortion towards any character due to non existent character development.  One spot that should have been obvious would have been to have Chewie explain to Luke Hans demise.  Remember when Chewie threw storm troopers in ESB when Han was going into carbonite?  Remember him howling and shooting Kylo and not wasting any time blowing the hell out of Star killer base when Kylo killed Han.  If you watch the previous movies you can tell Han and Chewie were pretty good friends and the obvious thing was to have Chewie do it.  Seriously aggravates me you spend 200 million on this load of crap and obvious things like this are messed up.  You have no direction.  It's silly.\\n\\nI could talk about Rey all day.  A true Mary Sue and it doesn't work.  You missed it here.  Her being so good at everything was hinged on this second movie and now that even ruin johnson has come out and said it was a creative decision to make her no one special.  Lol\\, seriously.  I have watched every movie in the theatre.  Every since EP1 I've camped out and waited in line\\, took vacation etc.  watch them at least 10x in the theaters.  Not this one and not another one.  I'm so over Star Wars at this point.  The decisions in TLJ have made it to where it unrecoverable.  Nothing can be done to unscrew this. I couldn't care less what happens to anyone in the film.  I don't care about the resistance I don't care about Rey or the insufferable Kylo ren.  Kylo is one hell of an actor.  Kylo changed his mood every scene in the film.  Adam driver is an all star\\, too bad he isn't being used the way he should be.\\n\\nI won't go on any more than this about this terrible movie.  Kathleen Kennedy and Ruin Johnson.  You will go down in history for ruining Star Wars.  Think about that.  Seriously\\, congrats.  This isn't Xmas with the kranks or home alone.  Lmfao\\, you took Star Wars and destroyed it!!   bwahahahahahahahahahahahahahahahaha. Seriously\\n\\,  at the time of this rating you're sitting on a forty nine percent audience rating.  And that's with people high fivng it for money.  It should be around thirty five or so I would\\,say is fair.  It's about a three out of ten star movie overall.","true":true}