{"101487":135995,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I LOVE Star Wars! So much so i have to write a review\\, my very first one\\, on why i think this one was a let down. \\n\\nFirst\\, the story focused too much on just Rey and Ren. This could have been a great thing but it just ended up being like a story of sibling rivalry. There wasn't anything emotional and too important to loose. Ren is just not a good villain. By the end of the movie he was just another whiny Anakin who throws temper tantrums. Without a real threat you just end up not being very connected to the strife the characters face. Then there is the love story between Finn and Rose which had the emotional pull of an after-school special from the 80's. This was just filler. \\n\\nWhile I enjoyed Luke and Leia they didnt add much either. Leia's story should have connected more with Ren and the consequences of his actions from Fore Awakens. Luke's training of Rey should have also been more fleshed out as basically all she gets is a couple of tips from Luke and she's a full fledged Jedi.\\n\\nThe Second gripe I have is with the music. John Williams scores have been so essential to the emotional connection with the characters and the story that they are almost like characters themselves. In Last Jedi i can barely recall any track. The music did nothing to enhance the big set pieces and the quieter emotional scenes. Big let down here.\\n\\nLastly\\, the action sequences were just okay. I don't think everything about the film was terrible. The scenes were well shot and executed but mostly forgettable because you don't feel connected to the story at large. \\n\\nThe stakes with this one just felt too small and poorly executed. While Force Awaken was just a an all around fun time\\, even though it was a re-shoot of New hope\\,  Last Jedi tries to add more stakes to the story but doesn't go far enough or add enough for it to ultimately matter very much.\\n\\nJust my two cents.","true":true}