{"101487":180216,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"They botched this big time. Whoever let Rian Johnson just run wild with his stupid ideas should be fired. Spoilers below\\, stop reading if you don't want to have yourself spoiled rotten:\\n\\n5 Major Flaws:\\n1) Snoke is setup as the most powerful dark side force user ever seen. He's flicking Rey around without even lifting a finger. He can connect minds across solar systems. Yet\\, he can't seem to hear a rusty old lightsaber slowly moving to slice him in half? DUMB! Additionally\\, they never gave us any explanation as to who this guy was or how he came to rebuild the \\\"First Order\\\" from the \\\"Ashes of the Empire\\\" DUMB! Don't setup big bad guys who are meaningless. STUPID!\\n\\n2) Luke's overall behavior. I get it\\, he's a defeated man. He doesn't believe in the Jedi anymore. All that is fine. I didn't expect him to come out doing backflips or have the most amazing duel ever. However\\, I did expect him to show SOME shock about how someone he's supposedly never seen before\\, SOMEHOW got the lightsaber he was holding when his dad CUT HIS HAND OFF. No\\, he just looks at it and throws it away like garbage. DUMB! This lightsaber was given to him by Obi-Wan. He doesn't even take two seconds to say \\\"How did you get this?\\\" Nope\\, just tosses it away like trash. Rian Johnson - you're an idiot. \\n\\n3) Rey's parents are no one. Ok\\, I understand. Any ol' fool in Rian Johnson's world can have the force. That's fine. But you know\\, there's no precedence in Star Wars for their being someone like Rey who just suddenly has all these force powers with NO TRAINING AT ALL! There's no precedence! It's stupid and irritating. It would have been believable if she was the descendant of someone powerful. Then you could imagine she's especially gifted. Nope\\, she's just somehow a miraclous no one who with 5 seconds of mediation can wield force powers that took Master Yoda 600 years to achieve. DUMB!!!!!\\n\\n4) Dumb story and plot. Why is Hodo? Hodor? Whatever the hell her name is\\, hiding information from Poe for NO DAMN REASON!? IT MAKES NO SENSE! DUMB!\\n\\n5) Finn was sent off on a useless mission that serves no purpose! Waste of a good character to basically just fill time while the slowest space chase on earth ensues. DUMB!!!!!!\\n\\nGOD DAMNIT DISNEY! FIX IT FOR EPISODE 9!","true":true}