{"101487":196119,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"When I stepped out of the theatre\\, I was thinking... this was a \\\"good\\\" movie\\, but definitely not a great movie.  Just good.  The problem is that this is a STAR WARS movie\\, and just \\\"good\\\" isn't good enough.  It needs to be well researched to fit into the canon of the original trilogy.  That CLEARLY wasn't done.  There was no continuity.  There was no character development of the main characters.  There was no nerdy research done.  There was no honoring the timeline.  It was that whole \\\"we're gonna be different just for the sake of being different and not care about the fans\\\" auteur crap with billions of dollars thrown at at.  There were some things I liked but Disney needs to hear the outrage first is Star Wars is going to remain something special.  Instead it's being turned into one of those crappy Marvel Comics movies which I don't waste my time watching as to avoid brain rot.  The main characters were flat (kind of like that stupid software trend that ruined Apple) and uninteresting.  I didn't care about the characters.  They RUINED Luke Skywalker.  Rian Johnson is a HORRIBLE writer and director who doesn't care about the fans.  Disney must understand they have a STEWARDSHIP over Star Wars.  They do not own Star Wars.  The fans own Star Wars.  Garret Edwards is an amazing director who clearly understood the stewardship aspect.  I liked The Force Awakens.  JJ Abrahms did a good job.  I loved Rogue One because it stayed 100% true to the mythos while still being fresh and original.  Rian Johnson masterbated all over Star Wars and deficated on poor Luke Skywalker\\, all while surrounded by brainwashed sycophants run by commitee.  Disney did a good job in the beginning because it seemed like they really cared about the FANS\\, especially with Rogue One.   But this The Last Jedi garbage shows that they don't care.  Star Wars Rebels season 4 is also hitting a new low\\, its very boring and uninteresting and Bering off canon.  If Rian Johnson gets his own damn trilogy\\, fans will not stand for it\\, and there will be consequences throughout the galaxy....","true":true}