{"101487":175156,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is a excellent star wars film that treats the force in different ways than most of the obvious ways we are used too\\, but unfortunately there are plot holes\\, and terrible editing throughout the movie that brings down the quality of the film.\\n\\nFor about the first hour of the movie the editing seems to be extremely choppy that breaks you away from the screen\\, and takes you out of the world they're building by making you reset yourself whenever there's a scene change. Not only does this make you go \\\"okay new scene\\\" it also seemingly assures you that this a movie instead of a world you can get lost in.\\n\\nIn The Last Jedi there are plot holes throughout\\, without going to into the movie with out spoiling you all I can say is there are parts in the movie that seems to go against the lore and rules of Star Wars by getting certain characters out of tight spots. Once they get the characters out I tend to go \\\"wait that's not how the force works\\\" without me giving anything away The Last Jedi would be much better if they didn't have some of these plot holes.\\n\\nLastly the movies special effects are just out of the world. Whether it be the lightsabers sound and visuals of the blade or just the space battles between the resistance and the first order they really take their time with visuals to build a world other than what the characters go through.\\n\\nThe Last Jedi is beyond perfect\\, but still makes a good star wars movie; not as great as episode VII or Rogue one\\, but still will satisfy your itch for a star wars movie leading up to the final movie\\, the showdown between our two favorite siths and Jedi. If you liked episode VII you should like The Last Jedi.","true":true}