{"101487":150974,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Lots of FANTASTIC ideas that I don't imagine will follow through. The direction that Rey and Kylo were headed would have made all the cringe humor worth it. Very unpredictable though. I surely thought their interactions would end differently and for the better. Gotta say though with what we've been given I'm definitely rooting for Kylo even though I see Adam Driver as an equal performance wise to Hayden Christensen\\, corny and unconvincing. Kinda felt like I got left with Blue Balls. I left the Force Awakens with so much excitement for what could be next. Unfortunately I don't think TFA will hold up knowing what follows. I really don't think I will ever see The Last Jedi in a positive light tbh. I still love star wars and will watch the next movies but I'm not expecting much from Solo other than even more cringe humor. Which is sad because it and the Bobba Fett film would make great gritty grimey action movies. I'm also keeping it in perspective that this isn't the worst thing that happened to Star Wars. Lucas throwing in CGI and tampering with the original trilogy still riles me up. I also see The Last Jedi as a blatant reaction to the Force Awakens. The fans said that they didn't want a retread of familiar territory and Disney has been successful using humor to appeal to people... which is why we have such a radical narrative left turn and the cringe humor. I think the Last Jedi has some FANTASTIC ideas underneath it's flaws... so may be I'm forgiving to it\\, but I wish we had gotten this plot delivered the way it should have. Sans humor\\, more build up and backstory to Snoke\\, less side-missions\\, and more focus on Rey's formation. I do love everything they did with Luke\\, Kylo\\, and Rey... but I wish it could have come about differently","true":true}