{"101487":114606,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Dear God... What was the movie even about? There are so many thing that are pointless.  At some point the movie reminded me a lot to Episode I\\, the worst part of.  They completely strip all the characters of the essence that made them so special (old ones and new ones) and completely shred all the expectations they made from the previous movie.  At some point the trama seems more like an episode of Rebels.  \\n\\nAs a lover of cinema\\, my reaction was like 'Ok...?' A lot of thing were left unanswered. New characters that didn't seem to have a reason or motif.  And the side stories seems to go in a very different direction from the main one.  \\n\\nAs a fan of Star Wars\\, I'm PISSED!  For so long I've waited for the return of Luke Skywalker\\, to know where he's been\\, his stories\\, what he did in the past 30 years\\, who he is now\\, and I'm completely disappointed.   I was like 'Are you for real?  Did that just happened?!' \\n\\nThis movie sucks!  You may say J.J. Abrahams was a remake of Episode IV\\, but he defo capture the essence and magic of the originals\\, and left us with so much expectations for Ep. 8 and gave new characters that I loved! (up until The Last Jedi) and what was even better we saw some of the original characters back in action.  In The Force Awakens at some point I was at the verge of tears when I got to see the Millennium Falcon take off once again.  It was magical.  The Last Jedi\\, has non of that.  It's even worst than The Phantom Menace.","true":true}