{"101487":169020,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So...  There's a big disconnect between the audience ratings and the critics ratings.  I think the critics liked it because the Last Jedi is confusing\\, filled with moral ambiguity\\, and delivers  \\\"emotion-rich action\\\".  I think folks liked the original trilogy because it was morally pretty straightforward; that is good wins over evil plus evil folks are redeemable.  I liked the IMAX\\, a little bit of the 3-D\\, some of the action (much of which seemed recycled).  None of the new creatures were as obnoxious as Jar Jar Binks.  BUT\\, what the heck was the point of the \\\"Last Jedi\\\"?  For most of the movie\\, Luke seemed to say that we should get rid of the good because good will always be offset by evil.  So\\, we have to live with equal parts of both good and evil?  But then why has the Empire been winning so much ruling over approximately 100 quadrillion sentients\\, while there are only a dozen Rebels left?  What kind of balance is that?   Or is that every good person is evil and likes trouble?  I think the only clear thing that I learned was the people having the most fun are the folks getting rich off playing both sides (or inheriting their wealth and just chilling on a resort planet).  The \\\"Rebels\\\" seem to just be pulling stuff out their butts without any discipline and letting lots of people die.  The Empire is filled with a lot of angry people.  The smart people are having fun at the casino.  At the end of the movie\\, is there really hope or just the sinking feeling that fighting the evil guys is a stupid pointless endeavour?","true":true}