{"101487":129368,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a lifelong Star Wars fan\\, and in that I mean that I was there watching A New Hope in theaters  back when it was simply called Star Wars.  I watched it 53 times the year it came out and I've watched every movie since countless times over.  I've read the books\\, watched all of the Clone wWars  and Star Wars Rebels.  I have even read most of the Star Wars comic books. And I for one am sick and tired of all these petulant child fanboys ripping this movie apart because it didn't fit their preconceived notion of what a Star Wars movie should be. Grow up.  Was this movie perfect?  No. But  it was a brilliant movie nonetheless.  It was surprising and heartfelt with some great action sequences and intriguing new characters.  Intentionally plays with the viewers expectations and most of the time this is done to great effect.  All the fanboys are complaining about things like that there wasn't enough backstory for Snoke.  How much backstory did  Palpatine receive in the original trilogy? Hell\\, I'm not sure they actually referred to him as anything other than the  emperor through all three original movies. \\n If you going to this movie with an open mind you're guaranteed to have a fantastic time.  If you go in with a bunch of preconceived  notions of what you think Star Wars should be then you'll probably be disappointed. If that's the case please keep your opinions to yourself. Nobody cares that your fanatical purist fanboy sensibilities were bruised.","true":true}