{"101487":122595,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Fun to see such polarizing reviews\\,\\, there is a lot of space between half a star and five stars. My own take on this is I felt that the movie was a good action film\\, lots of battles and explosions. The visuals were stunning. \\n\\nAs for plot holes etc. didn't really affect my enjoyment. The reason that I take two and half stars off is that frankly I didn't care about the characters.\\n\\n TFA despite being derivative created four new characters in Poe\\, Finn\\,\\, Kylo  and Rey that had awesome screen chemistry and intriguing story arcs. This film has none of that. There were some good ideas but whoever wrote this movie forgot the most important thing\\, if you want to have a high stakes movie the audience has to care about your protagonists. Watching big space ships or even planets blow up has no impact unless you either know someone on the ship or planet or you can see it affect a character that you care about or cheer against.\\n\\n. Honestly due to the writing and characterizations and the awful dialogue I felt nothing for the characters. This movie was like reading a text book with pretty pictures. The characters had no heart and the writers made no effort to bring the audience into their world. Think about it\\, when was the last time you enjoyed a movie or TV show with no feelings (either sympathy or antipathy) towards any of the characters. It was like watching a commercial\\, no emotional investment. And that is why it failed for me.","true":true}