{"101487":123949,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Good points: I was absorbed in the building of the relationship between Rey and Kylo Ren. I enjoyed the scene with Yoda. I really liked watching every scene with Rey and\/or Kylo.\\n\\nBad points:\\n\\n1. Kylo's mask: He destroys it because Snoke mocked him for it? There are thousands of children around the world that have this mask because they think it is cool and this film is telling them it is now stupid. Great job Disney.\\n\\n2. Who is Snoke? Who are Rey's parents? These have been such big debates on the internet since the release of the Force Awakens and has fuelled so much speculation. In response this film has left everyone disappointed and with a bitter taste in their mouth.\\n\\n3. What was the reason for the whole casino planet plot? Or the mutiny plot (which could have been completely avoided by a 2 minute conversation). A waste of time and completely detracted from the story.\\n\\n4. Leia can survive in space now. This scene made me feel ill. I'm sure I'm not the only one that feels this way.\\n\\n5. Do you like Phasma? Do you like Admiral Akbar? Prepare to be heavily disappointed.\\n\\n6. Was anyone really looking forward to Rey undertaking some Jedi training? Or Kylo Ren completing his training with Snoke? Again disappointment.\\n\\nFinally\\, Luke Skywalker has been a legendary hero of cinema for 40 years. This two and a half hours of trash manages to besmirch everything about him. You want to run away and hide? You want to refuse to come back and help? You want to kill Ben Solo; your student\\, your nephew\\, and your twin sister's only child because you sensed the dark side in him? What happened to the Luke that risked everything to turn his father to the light because you could still sense some good in him? Mark Hamill was angry with the way that Rian Johnson portrayed Luke and for very good reason. Rian let everyone down.","true":true}