{"101487":139359,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really wanted to like this movie\\, REALLY wanted to like it.  But\\, alas\\, I didn't and cannot recommned it.  The list of things I didn't like is soooo much longer than that list of things I did like.\\n\\nI liked the music\\, visuals and a few fight\/battle scenes.  That is about it.\\n\\nI disliked most of the direction the characters went\\, or should I say didn't go?  Most of the characters we grew to know in The Force Awakens don't seem to progress in this film.  \\n\\nInstead we are introduced to some new characters (DJ\\, Holdo and Rose).  \\n\\nDJ was a blip in the film\\, occupying only about 5 minutes of screen time\\, which is too bad because I actually found this new character interesting.  \\n\\nHoldo seemed too serious and couldn't be bothered to share her plan with Poe\\, which would have only made sense.\\n\\nRose is a terrible\\, obnoxious character and was very poorly portrayed by a weak actress. Every line that came out of her mouth was cringy.   She was self-righteous and a know-it-all.  I can only hope that she isn't in the next movie.\\n\\nI was shocked at the treatment of Luke.  Totally out of character and weak.  Not the Luke we knew in Return of the Jedi.  Yoda makes an apperance\\, but he too acts out of character and seems slightly drunk?\\n\\nThe humor in this movie really missed the mark and most jokes fell flat. As did the preachy politics.  \\n\\nI can only hope that the next director can somehow right this sinking ship.  But\\, I'm not sure that that is possible...this movie blew up anything that a Star Wars fan might want to hold on to.","true":true}