{"101487":175503,"Last Jedi":"Last Jedi","2017-12-15":"2019-10-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is the kind of movie you get when take a beloved franchise with a long history of established characters in a huge heroic opera and hand it over to someone who has absolutely no respect for it\\, didn't know anything about it and didn't really understand it. \\n\\nIt is glaringly obvious Rian Johnson either had no idea what he was doing when he wrote and Directed The Last Jedi or simply hated it and was determined to wreck it. He turned what should have been a triumphant return of the legendary Luke Skywalker into an awkward\\, cringy spectacle. The only thing Rian could have done to make Luke more unlikable and less heroic would have been to have him kicking puppies for amusement. Rian Johnson doesn't have enough critical thinking skills to recognise how badly he treated Luke's character and it shows in his arrogant\\, insulting responses to the fan's outrage following the movie's release. \\n\\nIn short\\, The Last Jedi is fan fiction written by a non-fan who set out to troll the actual fans. Rian Johnson shouldn't be allowed anywhere near any Star Wars film. I personally will not watch anything Rian Johnson has a hand in. I don't care if he's directing or was just hired on to clean location porta-potties\\, if he has a hand in it in any way\\, I'm out. If Disney doesn't take notice and recognise how badly they have handled Star Wars\\, we have witnessed the very end of the franchise. It will end awkward and pitifully\\,  Like Luke Skywalker gasping and dying alone on a rock somewhere with nobody to watch it.   ","true":true}