{"101487":99864,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After my first viewing I was unsure on how I felt about this episode.\\nThe unveiling of Rey's parentage and non discovery of who and what Snoke is left me feeling unfulfilled.\\nThe comedic beats felt over done and took away from the expected darkness I was expecting.\\nDel Toro and Gwendoline Christie felt largely under used. \\nWalking out of the cinema after that first viewing I really felt that episode 9 would determine where this film sits within the universe and that wasn't satisfying.\\n\\nHOWEVER!!!\\n\\nI went into my second viewing without looking for answers to questions like who is Snoke\\, who are Rey's parents etc and I completely got swept up in the adventure\\, emotion and drama of what unfolded in front of me. \\nThe second time around it got to me emotionally more than The Force Awakens.\\n\\nI nearly blew my load when Rey and Kylo Ren went back to back and unleashed the fury on Snokes red lobster hench men\\, especially when Rey threw down the assist to Ren who proceeded to literally skull f*ck his opponent with the push of a button. \\n\\nAfter my first viewing this movie was maybe sitting at a B- to a C+.\\n\\nAfter my second viewing it's a straight A.\\n\\nIt's visually stunning\\, the score hooked me early on.\\n\\nI hope that Del Toros character comes back into the next episode somehow to redeem himself and I don't believe Phasma is dead. There has to be more to get out of such a talented actress.\\n\\nI didn't mind Finn and Roses little side quest as much as I've been hearing other people complain but it was probably the one thing that dropped it down a mark.\\n\\nSam goes with the final scene. Showing a glimmer of light for the future got me excited for where Disney are going to continue to take and explore the universe. ????????","true":true}