{"101487":120596,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Far from great. There were some great moments. Adam Driver was far and away the most compelling part of this film. Unfortunately the star power and charisma of the original characters really makes it hard to care about the new ones. The film was so bloated and rushed that there was no time to develop Poe\\, Rose or Finn. They just felt like a ham-fisted subplot. Hammill gave a great performance but his character was very uneven\\, and a lot of the bold new comments this film makes about Force Lore don't really get explained. Without spoiling\\, most of the shocking or compelling moments frankly aren't earned or paid off. The whole film is just very bloated and disjointed. Their are certainly some funny parts.. shockingly the porgs are great. But most of the jokes are in teh marvel vein of being irreverent and unsentimental. It just rings insecure. Embrace the sentiment and don't undercut it with a forced joke. Not to mention that there are some moments in this movie that are more cringe inducing than Jar Jar Binks. It has some great moments\\, they just aren't earned. There are also so many fundamental questions raised in TFA that are frankly ignored just for the sake of having hype moments. I wanted to love this movie. But it's kind of a mess. I also understand why Lucas said their are too many sets. The film doesn't soak in atmosphere like Empire did in the Falcon. Half of empire is just characters talking and dealing with problems as the come. It's a journey. This is just place after place\\, set after set\\, with way too many characters to care about. Sadly this film was overhyped\\, and it's hard to not be disappointed.","true":true}