{"101487":194370,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"We have nine films within the Star Wars universe. The first two prequels are the worse. I have no idea how it has a 90% rating. The 50% rating by fans is shocking. The Last Jedi is now one of the worse. I should preface by saying that while I am a fan of Star Wars I am not huge Star Wars fan. I only enjoy the movies and not the books. \\n\\nThe movie is a giant mess. There are a number of plot holes. One is how the First Order is incapable of hyperdrive ahead of the Resistance's ships. The bombers. The X-Wing ability to take down the guns of a Star Ship with ease\\, etc.. Moreover\\, Luke's character has totally changed. He is unrecognizable from the first three movies. The producers could have easier made the film without Luke's character. \\n\\nThere are a number of missed usage or opportunity. Phasm and Snokes; they introduced these characters and built interest only to have them die in the second movie. Luke was also an underutilized character. Rey's origin is also a missed opportunity. She is a \\\"nobody?\\\" Is that really the best we can do? The training of Rey should have been expanded not reduced on the cutting room floor. An origin of the force could have been explained as well. The movie would have been more entertaining if the resistance would have a series of narrow escapes while Luke trained Rey and we get an origin of the force. \\n\\nI thought when Luke was walking through the MF\\, they should have flashbacks to the original trilogy. They dd the message\\, but this was a missed chance to pull at the heartstrings. \\n\\nThe Casino planet was plain bad and made it feel like you were watching a completely different movie. The city was like Monte Carlo and false perception of Dubai all thrown into one crappile. The Rose\/Fin subplot was a waste of time and made very little sense. \\n\\nIt really does look like there is an endgame in mind here. The Force Awakens opens the door to one storyline and this movie threw it all out. \\n\\nThe only positives are the score and the effects. Then again\\, most SW films are good that way. \\n\\nIn a nutshell\\, the plot and storyline were bad. Character development and usage were bad. I went to this movie with enthusiasm that it might as good as Rogue One and I left feeling betrayed like I was with the prequels. Well\\, at least I didn't wait in line all day.","true":true}