{"101487":129353,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a huge star wars fans but what disney has done to it is disgraceful and a spit and and slap in the face of star wars fans. Now this feeling seems to be generational as my uncle\\, a first generation star wars fans liked the movie more than empire strikes back and my cousin a third generation fan liked it for the special effects but did say there are some plot holes. Now being a 2nd Gen\\, some one who saw the second release of the originals in theaters hated it with a firery passion. First seen did not fit in a star wars films but something out of guardian of the galaxy\\, then Luke and lightsaber complete spits in the face of the past that we all know and love. Fish nuns\\, I will leave it at that with that comment. Princess Leia in space all who have seen it know what am talking about. This was plain stupid and unnecessary to the story except to include a Hollywood stars in a cameo part that wasn't needed. Then Yoda and Luke at the end come on in could think of 100 better endings that what we got. And finally Snoke\\, no back story no explanation and the supposed most powerful force user....I can write it for those who still want to see it. Way toof many storyline that could have been cut down to make a better film\\, the director and disney should be ashamed of what they put out. And George Lucas who created jar jar at least had a cast that took themselves and the story seriously this was a complete joke and I think the case knows it. EVEN MARK HAMMEL HATED THE FILM. What does that tell you?","true":true}