{"101487":188477,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was the worst Star Wars film of all-time. Every single critic was heavily paid off for this movie\\, because it's a critic's playground. Rian Johnson has single-handedly destroyed the entire franchise and made it a PC\\, pixar-styled alien\\, disney movie complete with Leia turning into Mary Poppins and Chewy literally eating a rotisserie chicken.\\n\\nFin and \\\"Rose\\\" have turned into the jar jar binks of the sequels. You could take them and that absurd casino scene (sponsored by PETA. Oh\\, and 'rich people are evil' theme) out of the movie and the plot would literally remain the same. Every single lead and character arc Abrams set up in TFA was completely annihilated by Rian Johnson in this movie. There is truly no antagonist now after Snoke died as we all know Kylo dabbles on both sides of the force. The whole first order has turned into a comedic joke with cheesy one-liners sprinkled about all in the movie. Rey has somehow turned into the most powerful jedi just within a few days with absolute zero training in force wielding or combat fighting. Leia has somehow learned to channel the force as well and flies through space unprotected. There are endless plot holes that leave the audience wondering why characters were even introduced into the movie at all (like benicio del toro??? and the hacker with the red plume?? what was the point??) And Luke's character was completely destroyed. Be prepared to watch Luke drink milk from an alien's utters as he mopes around on his island determined to destroy the jedi order. No you read correctly\\, he tries to destroy the jedi order. Yoda literally shows up and they willingly burn down the ancient jedi tree and (what they thought) were the ancient jedi scrolls. No you read THAT correctly too. Master Yoda and Luke Skywalker literally burn down what's left of the jedi temple. I mean\\, I don't know what's more to say it's so f*cking bad. I wanted to walk out within the first 15 minutes it was so heartbreaking and disappointing. It's not just a sh*tty star wars movie but just a sh*tty movie in general. I wonder if Disney will snatch the star wars trilogy that Johnson was supposed to direct after seeing what an atrocity his movie was and just how negative the audience reaction was.\\n\\nI can't believe we live in a world now where the prequels AREN'T the worst star wars movies anymore.","true":true}