{"101487":194396,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Welcome to Star Wars Battlefront 2 The Movie!\\n\\nPros -\\nStar Wars \\nLightsabers \\nAll the shit you would expect...\\n\\nCons -\\nNo physics (bombers starts using actual bombs that apparently drop out of the spacecraft without the help of gravity)\\n\\nTime and space is not a factor the movie gives a shit about. (Rey is on Luke's island and she came there by the end of the last movie. She is there for many nights and days\\, probably a week or so. Yet she keeps getting connected to Kylo. Kylo is at the other end of the galaxy and hunting down the \\\"rebels\\\". They have 16 hours of fuel and Kylo is following them for the entirety of the movie. So Rey's part of the stories is about a week while Kylo's take around 16 hours. Now there is one way that this is possible\\, but it's very unlikely\\, that the planet Rey is on is moving REALLY fast. But else it's just one big mess entangling two stories into one.\\n\\nCGI is really bad (Yoda and Snoke) \\nNothing really happens.\\nThe characters never really do anything. (Finn is fucking around trying to find a codebreaker; Poe is stuck on a spaceship with a bunch of old hags that don't want to tell him how they are going to survive; Rey explores an island and things the dark side is some bs for not having any answers.\\n\\nWhy the snow trooper outfit on a salt plant.\\n\\nThe editing was to fast pasted. No long shots of the characters talking or anything like that. The Finn vs Phasma scene was just like watching Mortal Combat - SW edition.\\n\\nWay too much unnecessary humor\\, a few were funny enough. \\n\\nWelp...\\nI don't really know what to say else then...\\nI probably forgot the worst parts and I am really disappointed.","true":true}