{"101487":187482,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This story is a mess. Luke's new look on life is somewhat understandable once you know the truth\\, but the movie spends too much time spinning different versions of that backstory that by the time the truth is known\\, we don't even care. We just want to move on with the plot. We know this isn't the Luke we remember\\, but we're forced to accept it anyway for the sake of Rey's character progression. This could have been done much better. The story continues on from the Force Awakens but only by using the same character shells. But we lose so much of what makes these characters who they are. And in the end\\, we seem to know even less about them. They've been boiled down into one or two key characteristics in order to provide a motivation for their actions in the next scene and to move the story one notch along. Much like the incredibly slow ship chase that spans half the movie\\, we are dragged on and on\\, hoping by some miracle that these pointless subplots are going to have an impact on the final outcome. But instead\\, they detract from the core story and do nothing. They don't help us understand Finn. They don't make us care about Rose\\, or her sister. They don't make us care about the lifestyle of the rich and famous on some random planet that has no signficance to the story. They don't help us solve the immediate crisis. That's what we care about. Through each of those subplots we are searching for meaning\\, and need to understand the reason why we sat through an entire casino\/animal abuse\/slave children narrative if nothing in that 30 minutes affects the story one iota. And in the end\\, we find that no character has a satisfying conclusion here. The film tries hard to sell you on Luke\\, Leia\\, Finn\\, Rose\\, and Rey's conclusion and maybe only slightly succeeds with the latter. (Rose is better off dead in my opinion) We wanted to see them grow. We wanted to understand who they are. Kylo Ren finally has some solid ground to stand on so maybe he can stop being a whiny teenager\\, which was perfectly ok in TFA and even the first half of this movie\\, but let's grow up now. Let's move on. We can't keep existing in this limbo state that we've created after the Force Awakens. We're not looking for a movie where we just participate in the day to day actions of the characters we know. This isn't James Bond. We want to see the full story unfold. We want a movie that is true to the saga of Star Wars and advances us to the next phase of the story. We'll have to wait to see how Abrams attempts to save the sage with Episode 9\\, but it won't surprise if 8 is almost completely skippable when watching the full story. This just isn't the movie we're looking for.","true":true}