{"101487":127351,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Having always loved the Star Wars franchise and after seeing the Force awakens and Rogue one i had pretty high hopes for this one and was looking forward to this movie. \\nBut all ready at the first scene something was not right\\, Poe calling Hux was a horrible cringe moment and from there it just got worse with the jokes\\, they might work in the marvel universe but it does not work in Star Wars.  \\nThe horrible story arc of Finn and Rose which was a complete waste of time\\, the Canto Bight scene all for the sake of watching a little kid force pull a broom in the end and at the moment when Finn actually have a good scene trying to stop the big Laser its ruined by Rose\\, which then goes on to deliver the most cringy speech ever in a star wars movie. Now comes the question how did they not get shot to piece by the walkers as they crashed very close to them ..?? horrible writing.\\nThe story Arc of Luke is also very disappointing\\, I wont even go into detail but it is just awfull. \\nThe story of Kylo is that he still a whiny EMO which is on purpose to make Rey look better and here comes the Kathleen Kennedy influence. \\nRey is just Meeeehh there is no reason to relate to her because its obvious that she is female version of Luke but much more bland and no depth. \\nAnd ooohhh the plot holes here we go. \\nWhy didn't Holdo just tell Poe what the plan was..?? \\nWhy would Luke try to kill his Nephew because he saw some darkness in him\\, considering how he would not stop to try and turn a much more evil being that he barely knew..??\\nHow could Snoke escape Darth Sidious and Darth Vader clearly he was strong in the force and had experienced the rise and fall of the empire which means the 2 sith lords should have sensed him\\, where did his dark side training come from..??\\nWhere are the knights of Ren..??\\nWhy didn't the resistance not just use the 2 fregats that ran out of fuel as weapons like Holdo did with the last cruiser..?? \\nThere are many many more points that makes this movie so disappointing but I will end here.\\nOverall it was such an disappointment to watch.","true":true}