{"101487":132007,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(If i could rate it 0 stars i would)\\n\\nWhat the hell happened to this movie?! It's like Rian Johnson didn't even bother watching The Force Awakens to see all the story arcs that JJ Abrams left open to be continued in The Last Jedi.\\n\\nKnights of Ren - thrown out the window\\nRey's parents - dismissed as some low beat junkers (after 2 years of build up)\\nKylo's obsession with vader because he wants to be as great a sith as he was- Completely dropped\\nThe map Luke left with the resistance in case they needed him again - He basically tells Rey to fuck off (then why did he leave a map that told them how to find him?)\\nPhasma's \\\"return\\\" - Absolutely pointless\\, she only has 10mins screen time and then dies AGAIN\\nForced humour crammed into the movie at the most pointless of times.\\n\\nThe list of faults in this film just goes on and on. It's so full of shallow plot points and 0 character development (Rose falling in love with Finn in the span of 12hrs? wtf?!). It's like Rian Johnson wanted to rewrite all the character development that was set up by JJ Abrams in The Force Awakens.\\n\\nIf you want to watch this as just a SCI-FI movie with no knowledge of the pervious star wars materials\\, yeah it's an \\\"ok\\\" film......at best.\\n\\nIf you want to watch this as a STAR WARS film\\, then you will be extremely disappointed.\\n\\nIf you want to know more of the films faults and plounders check out Angry Joe's \\\"Top 10 reasons the last jedi made me angry\\\" video. Angry Joe may not be for everyone\\, but all his points are spot on as to why this film is a piece of shit and disgraced the star wars franchise.","true":true}