{"101487":197599,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Words cannot describe how bad this movie is. I have never been a huge Star Wars Fan but I was always entertained by the spectacle. Good (Jedi) vs. Evil (Dark side) at its best. This movie however is inconsistent with everything star wars stands for. Their biggest hero is turned into a whiny old f**k who simply doens't care about anything to the point where he commits suicide. ARE YOU KIDDING ME ? Rey simply knows all the Jedi tricks without any training and you know what? Everyone can? You need no training or anything and everyone can be a jedi. Especially women by the looks of it. I don't know if this movie was trying to pin a \\\"me too\\\" batch to itself but what is with all the men bashing in this movie ? All men are reduced to hot headed macho idiots and girls seem to always be so very thoughtfull and wise. Every decision Poe takes\\, basically puts the \\\"rebels\\\" in a worse situation and finn is completely left in the dark about the plans\\, so he can totally make a fool out of himself by not just standing around and waiting to get killed. Here we have another shining hero woman\\, that commits suicide by crashing the ship via lightspeed. How stupid do you acutally think we are ? It is Star Wars for crying out loud ! There was no autopilot or freaking druid that could have done that ? I mean\\,... i was kinda smiling when they had those landing assistent guys waving their sticks in roque one. They have light speed and everything but can't land and find their parking position without a guy standing there and waving those pom\\,pom like sticks ? Sadly this movie is no comedy and I could probably go on whining about this movie all day\\, but I already feel a bit like Luke. I just don't care about this franchise any more and i am afraid that\\, if i put any more effort into this review\\, I might actually disintegrate like luke did...","true":true}