{"101487":169224,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILER ALERT: I'm a huge Star Wars fan but it's not like all the Star Wars movies are going to be flawless masterpieces every time they are released. The Last Jedi is a good movie. It's not great\\, it's definitely not the best Star Wars movie since Empire. There are some things that The Last Jedi does that The Force Awakens didn't do well and vice versa. In this movie\\, while there are similarities other Star Wars movies\\, does not copy paste huge plot points from the previous films and slightly change it. This whole story is a breath of fresh air when it comes to Star Wars. I liked almost everything in this movie but the reason why I'm not giving it a higher rating is that the problems in this movie\\, granted there are only a few\\, are huge. There is a 20-minute scene on a planet called Canto bight (I think that's how it's spelled) in a casino and I hated it. It doesn't feel like Star Wars\\, it feels like something I'd see in Guardians of The Galaxy or\\, dare I say it\\, Valerian. It was just done so poorly. The only other thing that I thought was kind of stupid\\, even stupid for Star Wars\\, was Leia floating in space. That was just plain dumb. I was also not a fan of the really cheesy and forced love story between Finn and Rose. Kelly Marie Tran isn't a very good actress either. But there are some things that I really did love in this movie. I loved the Rey and Kylo fight scene\\, I loved Snoke's death right before that and Luke was really amazing in this movie. I've seen this movie four times at this point and it's taken me a lot of thinking to finally come up with a score but this film is a low 7\/10. The Force Awakens is probably also a 7\/10.","true":true}