{"101487":180284,"Last Jedi":"Last Jedi","2017-12-15":"2017-02-10","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"They did rip off some plot from Battlestar Galactica here and made a mess of it when they did. There was some clunkiness to the plot in order to get the individual scenes they wanted but I'm really happy with the direction they took with all of the new main characters.\\n\\n Reading the \\\"bad\\\" reviews of the film\\, the only two big points I agree on was Rose's acting wasn't up to snuff (particularly near the end). At times her character felt like fan fiction. And we really needed more of Snoke's backstory please.\\n\\nif you were a dude who couldn't see what the hype was with Wonder Woman because you didn't feel represented\\, then yeah\\, you're going to have the same problem here because Finn and Poe are kind of flat and while Kylo is awesome he's the baddie.\\n\\nA lot of us wanted to grow up to be have a destiny like Luke or swagger like Solo but Finn and Poe aren't full filling the same adolescent male fantasies. part of this is because Poe has to grow from a hotshot flyboy to a future admiral. part of it is because Finn's character is the loser storm trooper who becomes so useful to the rebellion because he knows things.\\n\\nsome of the negative reviews I feel are from people who are fanatics but never consumed more than the media. there was a history of Jedi who left the order and became grey Jedi. Leia was always as powerful as Luke with the force but decided not to become a Jedi. There were cultures who used and experienced the force without the duology of Jedi and Sith.\\n\\nI actually feel in some ways that your own beliefs in the black and white of politics or religion and blood lines can keep you from enjoying this because there is a strong message that things are grey.\\n\\nmy personal gripe with the Star Wars universe is where are all the people and factions? the universe is bigger than the New Order and the Rebels. all of the other movies including bthe prequels had more than just the empire and the Rebels and that really feels missing from this film.\\n\\nwith both sides hurting so much after this film you'd hope there'd be room for some other factions to sweep in.","true":true}