{"101487":174220,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The filmmakers main goal across the board was to destroy and manipulate our expectations by breaking rules set in the Star Wars universe and by debunking every possible fan theory based on questions set up in the Force Awakens.\\n\\nI've seen every Star Wars movie in theater four times on top of countless viewings at home.  I will only be seeing The Last Jedi twice and that's only because I had tickets purchased for the second viewing in advance with a group of friends. \\n\\nI've never had such polarizing different opinions with critics as I do with this movie.  I spent countless hours reading fan reviews and watching youtube reviews (positive and negative) and the problems that everyone has are consistent across the board.  I'm having a hard time understanding why this would be the best critically reviewed Star Wars movie when I feel this may be one of the worst produced... The filmmakers were more concerned with burning the past to build the future that they want.  They don't care what the characters or story deserve.  \\n\\nGeneral flaws.\\n\\n- The plot and structure are flawed.  The low-fuel resistance ship being \\\"slowly\\\" chased by the first order fleet who were just out of harms way presented no sense of urgency.  It did not serve as a good ticking clock and it needed way to much exposition to explain what the filmmakers were trying so hard to set up.\\n\\n- The comedy was off putting and Star Wars should not have self-deprecating humor in the second act of a trilogy.  Both audiences at packed theaters did not laugh at majority of the jokes.  I actually was the only one laughing quit a few times. (I love the porgs.)\\n\\n- Luke Skywalker was not Luke Skywalker.  I can write an essay on this one alone.  His motives and arc in this movie made no sense on top of not remotely emulating who he spent 3 movies becoming.  I've heard many people express that they felt he was weak and passive.  Mark Hamill was very open about not agreeing with how Luke was portrayed in the script.\\n\\n- Finn and Rose's storyline completely destroys the pacing and is inconsequential.  This 30 to 40 minutes should have never been written or it should have been completely cut out of the movie.  The filmmakers disrespect and kill off original characters or put them in the background\\, and do not continue to develop the great characters set up beautifully in Force Awakens.  They instead decide to take us to Canto Bight to get preachy and repeat things we've understood about the rebels and oppressors since A New Hope.  (Why are they adding a love story with Rose and Finn when we just had the beautiful connection between Finn and Rey in FA?)\\n\\n- Snoke's fate and lack of any backstory were both unsatisfying and cheap. (It's like the filmmakers are trolling their fans.)\\n\\n- Rey's lineage was handled the same way as the latter.  It was set up for us to wonder for two years only for the filmmakers to out smart us by saying \\\"Tricked you! It's nothing!\\\"  I think most of the audience feels cheated and not wowed by this choice in story telling.  This is not a twist or even a good example of misdirection.  If you want to play with genre conventions do it in a new standalone movie by playing with it's genre conventions.  Not in an established universe.  And I'm not saying we have to stick to the same thing over and over because I can make a long list of things they recycled in this movie. \\n\\n- The decision to surprise us with Leia using her force powers is going against what we've known of her character for four decades.  To use Carrie Fisher's untimely demise to trick us with Leia's fake death and resurrections that early in the movie was manipulative and cheap.\\n\\n- The Skywalker family is what this saga evolves around.  If you want to make stories about Rose and Vice Admiral Holdo and their best girl friends do that in your spin off trilogy that I will not be seeing.\\n\\n- The theme of the movie \\\"It's time to let old things die.\\\"  So Yoda and Kylo Ren now share the same views?  If the filmmakers are going to embrace this\\, let go of characters from the past in a respectful way.  Don't discredit everything they accomplished in the previous films and try to let them go in a way that pays tribute to who we all fell in love with.","true":true}