{"101487":173943,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The disappointment in this movie continues to languish in me to the point where I recognize how unreasonable and silly it is.  \\n\\nAt at time where many are suffering through an world environment considered to be less than an ideal.  Many fans probably simply wanted a good Star Wars movie.  It did not need risk or groundbreaking.  It needed to feel more like home and what people have come to expect..    As critically and creatively unsatisfying as it may be. Luke with a green saber doing Jedi things would have been nice.  Luke for a second debating killing his nephew in fear is not.  And its not a second if he walked over to his hut to kill him!\\n\\nRian Johnson snubbed the past and legacy of Star Wars.  As a metaphor he ripped Anakin's saber in half after having such significance even through TFA..  The movie ignored the basic foundation that Abrams wanted to establish in TFA by ignoring several concepts and characters backstories such as Snoke\\, Knights of Ren. and Maz (a question for another time).    The goals of Kylo and Rey are always shifting and unclear and dropped.  Their use of constant telepathy I can't stand it.  \\n\\nI feel the movie was a testament to \\\"let the past die\\\" and if you don't like it you can leave.  I guess I'm old destined to find good Star Wars in the past and not participate in the future.  People who enjoyed the film under the premise of \\\"yeah something risky and new\\\"  will realize that its just that.  It's not Star Wars just something that looks like it.  \\n\\nRambling thoughts:\\n\\nThe director and writer contradicts himself throughout the movie.  No more Jedi\\, but Luke states the Jedi will go on at the end.  Kylo no more Sith\\, but together lets rule the galaxy Rey.  His movie is bloated.   If you ask yourself what happened in the movie from start to finish\\, you really aren't in a much different place than where you started.  No lightsaber duel (first time no battle two people two sabers).  All Chewie really did was debate Porg eating.  These are caretakers of the temple\\, watch me destroy what they take of.  Yoda was good.  Rian continues the new tradition for the need of constant dumb gags.  Ruins the end of TFA for a gag.   Milking a alien animal for what?  Space Leia.  Having the climax of the movie ruined with the use of a Hologram that everyone can see force and non force sensitive people alike.  Slow space chase that isnt really a chase at all.  Can't anybody watch the Cantina or Jabba scene and get a nice mix of aliens in somewhere?  Constant just beige toned aliens in different sizes.  Red soldiers on red background with Red saber visually bad.  I could go on.  We could have used a good Star Wars movie.","true":true}