{"101487":132964,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I genuinely can't get my head around the amount of hate on this review page. \\n\\nThe Last Jedi is built around its core characters and gives each of them satisfying arcs helping them grow as people. That forms the core of the movie and everything ties into one of those arcs. \\n\\nMINOR-SPOILERS AHEAD \\n\\nFinn goes from a selfish deserter to someone willing to give his life for the cause. He learns the wider context of what he's fighting for by seeing the inequality on Canto Bight. \\n\\nPoe goes from a hotheaded 'hero' to someone who is truly starting to understand what it means to be a real leader. \\n\\nRey and Kylo go from lost children unsure of their futures to committed adults ready to give everything to what they believe. They lose there respective mentors and now have to come into their own. \\n\\nLuke has a great arc from the reclusive cynic to the hero the galaxy needs after a pitch-perfect lesson from a fan favourite character- 'failure is the greatest teacher of all'. \\n\\nIt's these arcs that hold The Last Jedi together and make it a rewarding film first and a fun Star Wars movie second. \\n\\nThrow in some standout performances and spectacular action and this is definitely a solid entry in the Star Wars series. \\n\\nBy no means is it perfect but to say 'it's worse than the prequels' or 'Disney have ruined Star Wars' is completely unfair.\\n\\nIt's not going to be for everyone but as a huge Star Wars fan since the age of 6 (when I first saw ANH on its re-release)\\, ?I was in no way disappointed and neither were the group of 7 fans of various ages and viewpoints that I saw it with.\\n\\nYou'll have to see The Last Jedi for yourself to make up your mind but it would be a shame if this is the film that causes a real split in the Star Wars fandom\\, I guess time will tell.","true":true}