{"101487":165124,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-11","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson\\, great visuals but horrible story. Way to make Rey a perfect character who has no faults. What great character development! \\n(Sarcasm) \\nCanto Bight was terrible. Could've cut the entire plot line from the movie and it would've actually made the movie better. \\nLourd's  character was trash I hated her the whole time\\, why wouldn't she tell anyone about her plan? Just terrible leadership and terrible storytelling \\nButchered Luke's character. FU Rian Johnson for ruining my actual childhood hero and completely messing up the small amount of actual good plot you may have had going with him and the Jedi needing to end by backtracking at the end of the movie. Grey Jedi code would've been cool. Bendu and his philosophy and all that from Rebels would have been an interesting way to go with this but you're dumb. \\n\\nPlot was bad\\, Rey isn't a real person she's too perfect\\, Finn had no development\\, the only real character I was interested in is Kylo Ren\/ Ben because he actually had an interesting backstory and development it's just too bad that it incorporates the crappy version of Luke that Rian Johnson saw fit to shove down our throats\\, the Luke that saw the good in the most feared and terrifying person in the galaxy almost killed a young boy because of some bad dreams? Nope not OUR Luke\\, just Rian Johnson's twisted perversion of how he wanted Luke to be in his film. BTW he told Mark Hamill that it didn't matter what the fans wanted or thought the only thing that mattered is the story when Mark voiced his concerns over the direction Johnson was taking Luke's character. Such bull crap\\, Johnson doesn't even understand what Star Wars is about.\\n \\nAlso what's with all the fake accounts posting one sentence five star reviews? For sure not real people and if they are prob hired to raise the average rating. Pathetic that Mouse House can't take any criticism.","true":true}