{"101487":149859,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Life long Star Wars fan chiming in here. I'm a fan of the prequels\\, the original trilogy\\, the video games etc. So when it comes to Star Wars I love all of it\\,  good and the bad. But the Last Jedi is different. TLJ seems to get its kicks out of destroying old SW tropes we've come to know and love. Everything the Force Awakens sets up falls flat in this movie. Rey's training is only a few scenes\\, Kylo Ren's training is non existent. Snoke's backstory is never explained either.  Luke's character is sort of ruined. The man who turned Darth Vader\\, the man no one said could be turned. But for some reason he thinks its a good idea to kill a young Ben Solo? Mark Hamill even went on record in saying   \\\"I pretty much fundamentally disagree with every choice you've made for this character. Now\\, having said that\\, I have gotten it off my chest\\, and my job now is to take what you've created and do my best to realize your vision.\\\"  I don't blame him\\, I thought Luke's characterization was completely off and to make it even worse he dies at the end of the movie. So if you were going hoping to see a massive showdown between Luke\\, Kylo\\, and maybe the Knights of Ren. You will be sorely disappointed. Rian Johnson almost makes a mockery of Star Wars fans who put too much faith into there conspiracy theories\\, by turning them all on there head. I feel like this movie is a way for Disney to wipe the slate clean and get back at those who didn't like their initial stab at a SW film in The Force Awakens.","true":true}