{"101487":169115,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-11","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So when I first saw this movie I thought it was pretty damn good. However I left with a strange feeling. Something nagging at the back of my mind that I couldn't quite shake. Then I saw it again. And then again. I wanted to really get a good feel for why I felt so weird the first time even though I enjoyed it. \\nThe answer? \\nThe movie completely destroyed multiple characters and made them either uninteresting\\, completely different from what they should be\\, or downright bad characters. \\nLuke: In no way this is the Luke Skywalker we have been waiting for so long to see on the big screen once again. Rian Johnson screwed him and the fans over by making him this woos of a character who's motivations for leaving and hiding on the planet completely dumb. Then he had some interesting development with his view of the force and the Jedi and why they needed to end\\, and completely went back on that interesting development at the end of the movie for no reason. And killed him off for no reason\\, great scene don't get me wrong\\, looking off into the twin suns\\, but that should have been saved for the last movie and not this one. \\nFinn; crappy crappy crappy. Terrible plot line completely useless and annoying \\nRose: Unneeded addition\\, not a bad character just seemed too goodie goodie and kind of pissed me off for that reason \\nLeia: could have been killed off in that tragic explosion but instead pulled a Mary\\n poppins","true":true}