{"101487":169574,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*Spoilers. Where to start with this piece of work? There were a lot of underdeveloped\/pointless new characters and I would argue old characters (from pre-disney) didn't live up to their potential (Luke Skywalker\\, Leia). Some costumes (Such as Holdo's dress)  didn't fit the scenes. A lot of hypocritical actions like Leia pushing responsibility for military deaths onto Poe for actions she had the authority and awareness to stop (when Poe led a successful assault to destroy a lethal threat) or when Rose stopped Finn from committing suicide to protect the resistance and then telling him that the only way to win is to protect the people he loves (which is what he was trying to do and almost did\\, Rose literally almost got the resistance killed). First Order are childish villains and would be lacking punch if it weren't for the resistance being just as incompetent (First Order are supposed to be a military\\, yet their general is literally toyed with in the opening scene by an idiot\\, like an idiot). Old characters are literally killed in the most lacklustre ways. Epic Rey training montage missing. Phasma exists\\, and then doesn't. Snoke exists\\, kind of reveals his grand plan\\, stops existing because Deus Ex Machina. To finish\\, CANTO BITE (Oh god why was this even recorded). This movie had large backing\\, talent\\, and still ended up in a state which leaves me deeply unsatisfied. It shows you the potential gold behind the could-be genius lazing on a couch. Not saying this movie is the worst thing I've ever seen\\, it's just not something I consider a good movie. 0.5\/10 to balance the freaking critics giving this movie 5 stars (91%? Really...). I honestly think it's about a 2.5\\, or 3 tops.","true":true}