{"101487":159136,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok.... so as a major Star Wars fan boy\\, this movie was horrible awful a disgrace to Star Wars or Star “Was” after Rian rain ree or whatever boughie way he wants to spell Ryan touched it. So let’s talk snoke like this mystery this what we’ve never seen before character the character JJ Abrams plated and served to Rian and what did he do to this incredible character with a ton of questions where is he from? What is he about? There for the beginning...saw the rise and fall of the empire\\, so he was around for palpatine (a sith who legit worked the entire order created the empire and destroyed the republic and sadly took out Mace Windu (the baddest and bombest Jedi we’ve ever seen) and Darth Plagueis the wise (yay the guy who could cheat death and created the skywalker clan) and Vader(no need to explain lol) and the Jedi council.....So Snoke must be mind blowingly amazing and fans were like wait this dude snoke was around before and after all these titans?! Wait who is this guy? Like first jedi status like wait what wait aaaaaaaaaaand we got absolutely nothing from him via backstory. If Kylo could have taken him out that easily why was he under his thumb so long? Why would he need him for ”training” and speaking of training how does rey put her hand on a rock get sucked into a hole snap her fingers a few times no people legit not being sarcastic she did that there was west side story finger snapping in a Star Wars movie... I’ll let that sink in....and have one conversation and is able to take out praetorian guards with ease would a lighsaber at near expert status and blast Kylo (who just took out snoke btw) into unconsciousness fighting over a lightsaber? Oh yay these praetorian guards are they suppose to be the knights of Ren? Nope didn’t explain that either\\, and if they are or were them why fight kylo like isn’t he your boy? Your leader anyhow So basically snoke the creator of the first order and immensely powerful sith or Jedi or whatever was a wasted character who went out like a punk\\, he got Darth mauled and like he ain’t coming back. Enter Luke Skywalker....we’ve waited since 1983 to see this dude hold a lighsaber and all we get is him acting like a total idiot drinking sloth milk from a teet yay that was worse than the west side story snap and almost as awful as leia who has never used force on film btw like ever like not even to move a pebble is suddenly able to defy the laws of physics and “Superman” to an airlock... I digress. So not explaining anything about snoke or why the Jedi must end or really anything at all. What we do get is the potential of greatness with Luke staring down an entire fleet and getting blasted and dusting his shoulder off and were like whaaaaaaaaaaaaaa insert high fives THEN the epic battle gets teased Kylo and Luke!!! Aaaaaand this doesn’t happen just Luke slow motion doing a limbo move and we find out he’s a “force projection” wait what??? Ok weird and a let down but ok at least Luke’s still alive to be what he should have been in this movie and wait .... did he just collapse? and rises only to stare at the sun and disappear to be one with the force? The casino scene an incredible waste of time\\, the purple haired admiral did more damage than Luke & leía Snoke a wasted character Rey is legit a nobody who never needed training and is amazing apparently....yoda returns to the crazy nut empire status is disrespected thoroughly on film and burns the force tree down and the Jedi texts never explained... but show up again yay....phasma dies like a punk....leía should have gracefully been eliminated and she’s still alive in the movie....yes this movie had incredible cool action scenes and great funny moments but the telling of the story fell very very flat. We’re left with a boy sweeping the floor using the force with a resistance ring on holding up to as shooting star (please tell me this isn’t Luke) so I know people like Star Wars theory (love your channel btw let’s colab) are gonna tell you it’s all part of some plan and we all agree this movie is awful\\, so let’s admit it pressure Disney to turn over the next 3 to JJ not rian who spat on our childhood dreams with this movie! If rian touches anything more it’s over! ","true":true}