{"40636":"33761","TLOU2":"TLOU2","2020-08-05":"2020-06-23","10":10.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"I hated the story first and put down the controller for a couple of days and i calmed down. This is a mature game. It requires thinking and some reflecting. After everything went through my head i decided on the take that the story was good. Really good. You will experience an emotional journey and get to know what happens when you see nothing but rage and you want revenge no matter theI hated the story first and put down the controller for a couple of days and i calmed down. This is a mature game. It requires thinking and some reflecting. After everything went through my head i decided on the take that the story was good. Really good. You will experience an emotional journey and get to know what happens when you see nothing but rage and you want revenge no matter the cost or the consequences .\r\rI dont agree with people saying they ruined this or that character. Nothing was ruined. These are the characters we love and know from the first game\\, but this game shows you the cold hard reality of a post apocalyptic world without sugarcoating everything. There are no winners or heroes in this world. Its not a fairly tale and never was. It answers important questions of human nature and behavior.\r\rThe graphics are out of this world\\, i played it in 4K HDR and its almost CG level good. The animations are mind blowing. The combat is visceral and ruthless.\r\rRegardless what you think about the story. This is the best game Naughty Dog ever made and there are NO better games currently on the market regarding the exclusives.\r\rIt sparks debates and it should be\\, because forgettable art is not art. Even the haters and trolls talking about it. Even they are wrestling with their emotions and thinking about it constantly. You have to examine this game. Think about it. There are two sides of everything.\r\rWhen you meet with a stranger he or she has a life too like yours. Its just from a different perspective you wont see everyday\\, but here we seen everything and we have the chance to process it with all the knowledge. The knowledge of both sides. The coin.\r\rYou have to logically think trought that what was justified in the charaters actions. Where is the line? Is it worth it?\r\rAm i lost control? taking one more life will satisfy my quest for revenge?\r\rYou know the common theme when we talking about revenge is not knowing when to stop. An eye for an eye\\, but its not enough because you want to see the other one suffer so you take more and more people from their sides and in the meantime you risk the life of your people on your side.\r\rRevenge has consequences. Taking a life has consequences and these consequences will bite you in the ass in this kind of world because there are no laws no society no rules.… Expand","true":true}