{"101487":139335,"Last Jedi":"Last Jedi","2017-12-15":"2019-09-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really wanted to like this movie but\\, I just can't. There are some serious pacing issues here\\, the Casino sequence is absolutely pointless and the humor just isn't\\, well very Star Wars like. It seems like Finn and Poe were wasted and poor Rose\\, I can't tell what her purpose was aside for a love interest for Finn. As much as I love Laura Dern\\, I don't see what Holdo did here that Admiral Akbar or ever Leia herself couldn't have done.  I can forgive all of that but Luke's character arc is the one thing I just can't accept. When he said \\\"Did you think I would walk out and face down the First Order with a laser sword?\\\"\\, well YES!!! Episode 7 had us all set up for a kick ass Luke Skywalker in this movie. We were ready to see him ignite the green do what the greatest Jedi in the history of the galaxy does. It is what I and so many kids have waited over 30 years for. What we got was not the Luke Skywalker that brought his father back from the dark side. I walked out of this movie feeling like I was punched in the gut and left tossed over by the franchise that gave me such joy\\, wonder and hope. Rian Johnson made a visually stunning film\\, but I would have preferred someone like Claudia Grey or Dave Filoni to have penned the script. In summary\\, I don't think I've ever looked more forward to a movie that left me feeling so empty and disappointed. I can only hope for something better from Rise of Skywalker.   ","true":true}