{"101487":159086,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok\\, let me just start by saying I think i managed to not write any spoilers until the bottom where i tried to separate them. Even for me\\, this will probably seem really disjointed. Secondly\\, I'm shocked by the negative reviews for this movie.  \\n\\nNo\\, seriously\\, WOW!\\n\\nPeople really picked an odd time to start complaining about Star Wars\\, and at least some of those complaints are downright laughable.  I felt more engaged in this Star Wars film than I had in a long time and even wanted to clap a few times.\\n\\nUnlike TFA\\, this is something different and it works.  It's not perfect\\, but no Star Wars film is for the most part.  At least a little less nostalgia for nostalgia's sake is evident here.  Rian Johnson actually learned something from Lucas (aside from what people wanted to avoid in the prequels).   BUILD YOUR WORLDS. Say what you will about the prequels but Lucas actually made every place unique\\, CGI or not. Abrams gave us the same old desert\\, snow\\, and forest in his attempt to be more natural and it just didn't work.  This film is also less concerned with bringing in a new audience and actually telling the story.\\n\\nDid J.J have more pressure because he was tasked with the first of the trilogy? Probably.  But as a storyteller\\, Johnson has a leg up; even with a few eyebrow raising moments.  There's some surprises.  Even the things we've all been expecting to happen still felt satisfying to me. This film also feels less micromanaged by Kathleen Kennedy and i'm thanking the force for that.  There's darker moments to be had but still a hope that SHOULD be resonating with anyone seeing this film.\\n\\nThe battles were engaging\\, even in their multitude.  Johnson isn't afraid to show more violent moments when the story calls for it.  That isn't to say it's all like that (though the idea is awesome to consider for a Sith film).  Rey's training with Luke actually manged to be both emotional and funny in ways I wasn't expecting.  I kept wanting more of it!\\n\\n I'd honestly consider this the best of the three newest Star Wars films.","true":true}