{"101487":106326,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"At its best\\, The Last Jedi is a dazzling deconstruction of the Star Wars mythos and all the movies that preceded it\\, at worst it's a confusing and muddled mess that fails to do what those exact movies that preceded it did. \\n\\nThe film wildly breaks all of the conventions you thought you had for what makes a Star Wars movie but at the same time falls into the old trap of feeling odd and out of place. The amount of times I was scratching my head at a decision made or just downright groaning at how they went about parts of it. \\n\\nParts of the movie feel extremely useless and downright boring such as the Finn and Rose subplot (which was just a backdoor for a political statement that\\, thank God\\, wasn't too hamfisted). And other parts clearly lacked the right amount of development to truly propel the story forward (I'm looking at you Rey and Luke on the Island).\\n\\nThere's also a clear shift of visions from JJ Abrams'  world created in 'The Force Awakens' and the world that we saw in Rian Johnson's 'The Last Jedi'. And in some ways\\, it works. This galaxy is must more interesting visually and this movie had some very awesome sound design\\nbut you run into the issue of a storyline basically halting due to two different visions having two \\ndifferent ideas.  This results in story beats being clearly set up in 'The Force Awakens' and then almost completely dropped without a second thought in 'The Last Jedi'.\\n\\n-----END OF SPOILER FREE SECTION----\\n\\nKilling Snoke was a huge wrong turn. It completely undermines everything we saw in 'The Force Awakens' and also undermines a lot of what we saw in this movie. The same man who was able to make Rey and Kylo have visions of eachother is just killed by a swift Lightsaber slice? I'm sorry\\, what? And the death just feels so inconsequential it's hard to even give a damn once it's happened. The only rational person during that whole segment is General Hux who is visibly shaken at the death of Snoke. \\n\\nI need not get started on the supreme disaster that is everything dealing with Rey's heritage as it seems like that means nothing at all anymore. Yes\\, let's ignore the blatant set up to a huge reveal of who her parents were and the extreme foreshadowing in that scene where she gets visions form the lightsaber.\\n\\nThe new girl Rose is one of the most annoying and downright bad characters in the Star Wars universe. She had virtually nothing to do and just hogged screentime we could've used developing backstories to various subplots and characters. Her story with Finn should've just been; get on the star destroyer\\, and break the tracker. The storyline we got in the end felt like the bad side quest you have in that one open world game that still is loosely connected to the main plot.\\n\\nAnd yea\\, Leia using the force is cool and all but that scene was one of the more ridiculous scenes I've seen in a movie in a while. It also has no ramifications on the story\\, she just flies back to the ship and everyone moves on like it's just a normal Tuesday\\, did nobody see that? Seriously?\\n\\nThis might seem all doom and gloom but fear not\\, I do have a lot that I actually enjoyed about this film and the first point has got to go to the cinematography. It's just great. This film is visually the best in the entire saga. There's not one scene that isn't bursting with creativity and beautiful shots.\\n\\nAnother huge positive is a good bit of the writing. I did in fact enjoy the overall story in this movie despite the problems I had above. It\\, like Empire (my favorite of the entire saga) felt like a true middle part in this trilogy. It felt like the climax of a three act movie and I really love that. I felt the movie was small scale but extremely large at the same time and that it will have a great place in that middle spot.\\n\\nThe characters are also all pretty great of course excluding Rose.who I really needn't go more into detail about. Rey was pretty great in this movie and Kylo got some huge developments that I did not see coming at all. Luke's death was bittersweet and honestly one of the most beautiful scenes in the entirety of Star Wars. I love the direction they took with his character and the fact that he has become part of the force literally now. Yoda coming back was an absolute delight\\, loved the hell outta that.\\n\\nAnd the fight scenes were also truly brilliant. The scene where Rey and Kylo take down Snoke's guards was fantastic\\, the opening sequence was great\\, the final sequence was great--a lot of it was great.\\n\\nSo...what's the final verdict? Well it's really hard to say. For every positive I have about the movie\\, a negative sneaks up and shows itself to me that it's hard to really like the movie but of course with all the stuff that does work in the movie\\, it's hard to really dislike it. I think a huge problem with the movie lies in the change of visions between movies and the fact that well\\, I was just overhyped.\\n\\nSo is 'The Last Jedi' a bad film? No. Is it a great film? Nope. It's actually a pretty good movie on most accounts but the true problems still reign true.  I'm not going to talk out of my ass and call this movie the worst Star Wars movie ever\\, but I'm also not gonna talk out of my ass calling it the best since Empire. It's purely just 'good'. It was one of the biggest let downs I've had in a movie\\, but the movie itself stands on most accounts.\\n\\n2.5\/5\\n\\n-James","true":true}