{"101487":154709,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Movie was full of plot holes\\, bad dialogue\\, inconsistencies\\, actors that were hired based on diversity on not on talent\\, and bad pacing. The movie was too afraid to take risks. Hardly anyone died in this movie and anyone who did died of anti-climatic death. There were really no good guys or bad guys; everyone dabbled in both. They would hint at killing off of a character and then decide to immediately bring them back. They killed off characters that people care about and saved the ones that no one liked. They made up lots of new force powers that were clearly made just to make their forced plot work. \\n\\nThere were also several bizarre moments and scenes that seemed like they were from a different movie. Characters go on entire subplots that mean nothing because of the actions of another character. All of the force users in this movie are extremely powerful despite next to no training.\\n\\nIf you cant tell I hated this movie. I was extremely bored and cringing through 85% of the runtime. The movie was over 2 hours long but the content could have been cut down by an hour based on what actually happened in this movie. Half of this movie is people sitting around waiting for things to happen. There is very little fighting and when characters do fight there is no reason to care because there is no build up. \\n\\nThey frame the end of this movie to make it seem like the good guys won but in reality they have lots almost everything. Like I said before\\, there really aren't any heroes. Everyone gets things done by their will rather than with skill.","true":true}