{"101487":194228,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Way\\, way too long. All mini scenes took too long to resolve. Bad writing\\, bad story telling and bad execution. They didn't do anything with the alien animal creatures to be a key in the story. I swear they created the alien creatures just to sell toys at the Disney store.  And the Finn and Rose scene at the casino planet to find a codebreaker ultimately went nowhere and left the movie viewer perplexed as to why that was important to take 30 minutes of the movie time only to have the event be unresolved. Some of the individual fight scenes were long and just stupid. And Princess Leia getting her ship bombed and sucked out into space\\, her cold body blown out into space\\, opens her eyes and \\\"beams\\\" her way like mary poppins\/superwomen back to a rescue shuttle outside airlock. No injuries\\, scrapes or shredded clothes from the bombing. She was completely uninjured and only cold from being ejected. And the Purple haired-vice-admiral took forever to understand half of her resistence crew blown up as she was left behind only to have a bright idea to turn the ship around and do a suicide mission into the bad guys first order ship. That took 15 another minutes of the movie. I had that idea after the bad guys blew up the 2nd ship. Not too quick on your feet miss purple-haired-admiral after all. So many long Luke Skywalker scenes where he was totally depressed over training Kylo and discovering he was bad and went to the dark side.  His agonizing emotions got old and drawn out in this movie. His last virtual fight was uneventful and boring to watch. Overall a very bad movie.","true":true}