{"101487":122180,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Fuck the Past. Fuck Jedi. Fuck Sith. Fuck Expectations. Fuck Subversions. Fuck Continuity. Fuck Lore. Fuck Science. Fuck Fantasy. Fuck Gravity. Fuck Space. Fuck Airlocks. Fuck Air. Fuck Plot. Fuck Twists. Fuck Motivations. Fuck Logic. Fuck Consequences. Fuck Jokes. Fuck Tension. Fuck Characters. Fuck Luke. Fuck Leia. Fuck Family. Fuck Porgs. Fuck Meat. Fuck Milk. Fuck Tits. Fuck Islands. Fuck Huts. Fuck Holes. Fuck Mirrors. Fuck Reflections. Fuck Rey. Fuck Kylo. Fuck Poe. Fuck Finn. Fuck Maz. Fuck BB-8. Fuck Coins. Fuck Casinos. Fuck Weapons. Fuck Aliens. Fuck Fathiers. Fuck Puppets. Fuck CGI. Fuck Rings. Fuck Brooms. Fuck Codebreakers. Fuck Slicers. Fuck DJ. Fuck Stutters. Fuck Conductors. Fuck Trackers. Fuck Traitors. Fuck Ironing. Fuck BB-9E. Fuck Phasma. Fuck Hux. Fuck Snoke. Fuck Slippers. Fuck Helmets. Fuck the Knights of Ren. Fuck Red. Fuck Hoth. Fuck Salt. Fuck Sand. Fuck Walkers. Fuck Speeders. Fuck Rose. Fuck Sacrifice. Fuck Love. Fuck Hate. Fuck Redemption. Fuck Plans. Fuck Communication. Fuck Leadership. Fuck Holdo. Fuck Hyperspace. Fuck Computers. Fuck Droids. Fuck Spectacle. Fuck Silence. Fuck Slow Motion. Fuck Flashbacks. Fuck Visions. Fuck Training. Fuck Discipline. Fuck Lightsabers. Fuck the Force. Fuck Yoda. Fuck Trees. Fuck Books. Fuck Religion. Fuck History. Fuck Morals. Fuck Stories. Fuck Truth. Fuck Deception. Fuck Good. Fuck Evil. Fuck Light. Fuck Darkness. Fuck Choice. Fuck Hope. Fuck George Lucas. Fuck Ben Burtt. Fuck I Have a Bad Feeling About This. Fuck May the Force be With You. Fuck Traditions. Fuck Nostalgia. Fuck Artoo. Fuck Threepio. Fuck Chewbacca. Fuck The Millennium Falcon. Fuck Han. Fuck Lando. Fuck Ackbar. Fuck Critics. Fuck the Fans. Fuck Disney.   Fuck Episode Seven. Fuck Episode Nine. Fuck Questions. Fuck Answers. Fuck Myths. Fuck Legends. Fuck Heroes. Fuck Villains. Fuck Adventure. Fuck Fun. Fuck Off.","true":false}