{"101487":135961,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I love Star Wars but I did not like this at all I was very disappointed and have to feel bad for every fan out there because Disney just killed Star Wars. They might just need to completely start over. It was not a good movie plot wise\\, character wise both main characters still don't do it for me at all. All I want is some badass light saber fights like the older movies like the Anakin vs Obi Wan Kenobi fight. Light sabers speed was absolutely flying. For all of Ren's training he is simply not good with a light saber his movements aren't fluid and he's been training since a child. We finally get a glimpse of the how good Luke is with a light saber still then he has to go off and die and his legacy was completely disgraced. Rey isn't any good with a light saber at all but I don't blame her she's had no training but somehow manages to beat trained assassins... and best Ren in the Force Awakens... doesn't make sense at all she should've lost lol and don't give me this it's because of the force\\, at some point someone who has been training all his life with a light saber will beat you plain and simple. Luke took a long time to train and improve his skills with Yoda\\, she hasn't trained at all and yet can beat the Praetorian Guards lmao come on. She shouldn't be able to touch anyone in that room fighting wise. Luke didn't fight anyone that was actually trying to kill him (Darth Vader wasn't trying to kill him he was trying to turn him) throughout his first two movies. There was so much fighting in the prequel trilogy because they were so seasoned and veterans. So don't make it seem like Rey is a vet at all she's had no real training at all compared to the past training of Jedis. Also stop being so politically correct\\, don't get me wrong\\, I love strong lead women characters and women heroes (big fan of super woman movie) but do you really have to skip over every male hero now? I really feel like a male role would be better for this role just because it relates to Star Wars history and their target audience\\, it goes away from their target audience. 73% of men are likely to like Star Wars compared to 53% women. Why would you not relate it more to your target audience of majority men and make a movie that you target audience will thoroughly enjoy rather than trying to be politely correct\\, too cute\\, and too not Star Wars. Not only was it politically correct but left politically correct. Majority of the people going to see it in theaters were males lol why would you not cater to your target audience... I don't know maybe they just want to start a \\\"new age\\\" of Star Wars\\, then why not just make a different series where your fantasy can run wild with the plot. Or maybe they just wanted to kill the series so someone who actually knows what they are doing can redo it later. Also Finn and Rose literally did nothing important during that movie lmao. And why did Po not get put in charge I don't know. Also if the woman in charge just simply told Po the plan Finn would never have had to go to get the code breaker. I need a badass villain someone who can actually swing a light saber and who is actually intimidating and badass hero someone who can swing a light saber just as fast with the right training. It is becoming too far-fetched and magical and needs to go back to basics. Carrie Fisher cannot fly through space no matter how much of the force she has... literally half the movie theater laughed. Also Yoda was not wise at all- burned the books that Rey has apparently already learned in four day's time by training by herself.\\n\\nAlso anyone who says this is what Star Wars needed this to stay relevant- ??? Are you kidding me people were coming out in droves for the last three movies expecting master pieces and simple disappointed once\\, then I really liked Rogue One\\, and then the movie were just shamed and disgraced with a worse plot line in the last Jedi. To write Luke with that shitty of a return was disgraceful and shameful\\, the director should be fired and blacklisted from any type of movie industry job.\\nI just hope whoever is writing and directing it watches the past Star Wars movies before writing and directing the next one and hopefully he\/she writes it with some sort of purpose before he shuns and disgraces one of the greatest Movie Series in history even more with some political correct crap or just lack of consistency with shitty as plots. Learn that Jedis aren't born they're made.\\n\\nI just pray Game of Thrones does not try to become this politically correct.","true":true}