{"101487":99673,"Last Jedi":"Last Jedi","2017-12-15":"2018-10-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A flawed movie that can barely stand on it's own. It ruins previously established rules in previous movies and contradicts even it's own scenes moments later in complete disregard of both Episode VII and the OT. The villains act incompetently\\, the heroes forget who they are and are suddenly reduced to a small group despite it being said that they are the republic and most importantly: Luke Skywalker\\, hero of the previous movies\\, is reduced to a hermit that has given up\\, who chills in the background and doesn't even mourn for his fallen friend Han\\, neither does he acknowledge his sister to be in danger all this time. The plot drops plot points that were raised in Episode VII in complete neglect of Abrams work and instead chooses to do nothing with it - even a bad or an unexpected direction would have been welcomed but Rian chose to write nothing instead to subvert expectations for the worst. For being the longest movie in the franchise.\\n\\nFrom here on out\\, I will go into greater detail.\\n\\nYou cant run out of gas in space. Momentum keeps you going. Also there is no reason the First Order wouldn't be able to catch up\\, but they can't. Fuel\/Gas is a nice concept but there is no way a ship would actually stop in space where momentum will keep you going and there is no gravity.\\n The 1st order should have either\\n  A) launched more tie fighters \\nB ) sent a star destroyer ahead at lightspeed to intercept. \\nThe your momma joke was dumb. Took away from a serious moment. The way Hux took it completely changed his character from a menacing guy with a position next to Kylo to a dumb phoney that is easily tricked.\\n Why not use B-Wing bombers instead of the slow useless bombers the Last Jedi had? They are supposed to resemble WW2 bombers but their pacing is off. Rian really wanted to have those in the movie to go for style over substance.\\nBombs falling in space. (No propulsion shown\\, no sound effect to suggest propulsion) Apparently the novel explains them to be magnetic\\, in that case how come they don't cling to their own ship? Besides\\, that's side material. The enemy ship being magnetic wouldn't make sense either as there was no established reason for it to be.\\nWhen the doors open to drop the bombs\\, why wasn't everyone sucked into space? In Revenge of the Sith they have been.\\nWhy is Hux a bumbling fool in VIII despite being threatening and competent in TFA? \\nLeia blaming the loss on Poe was dumb\\, she was still in charge and could have pulled the bombers back. \\nPoe made the right call in destroying the Dreadnaught. \\nA) It's weapons have further range than a star destroyer and would have killed them all in a chase. \\nB ) It carried 275\\,000 people which is a HUGE win for the resistence and acceptable losses. \\nC) It is faster than the Raddus and would have caught them in a chase.\\nFinn healed instantly from a spinal injury\\, just another thing setup in TFA and thrown away in TLJ. The transition is jarring\\, as Episode VII closes with Finn falling into a deep coma\\, making fans wait for what will happen next\\, only for him to wake up right away.\\nHow can Finn pilot a ship in TLJ despite not being a pilot in TFA\\, and being unconscious between the 2 films? He flies to Canto Bait despite having said before that he can not fly. The speeder in the later part of the movie may get a pass because it's a speeder and not a flying ship\\, but it is flying too.\\nWhy do they assume there is a new technology to track through hyperspace? \\nA) you can already track in hyperspace if there is a beacon on board as shown before.\\nB ) why not scan the ship for beacons? \\nC) Leia has a beacon on board constantly sending a signal out so Rey can return. \\nWhy only use 1 tracker at a time? \\nHow do they know which of the several star destroyers is the one actually tracking them? \\nWhy does Poe recommend calling Maz? Finn met Maz\\, not Poe. They don't even know each other.\\nThe casino plot was pointless. General Holdo should have at least confirmed there was a plan. 40 minutes of filler because she didn't and Poe got cold feet because of it\\, not to mention nothing they do there goes anywhere\\, they get captured and immediately brought to the resistance hideout later on with no accomplishments\\, as the battleship is taken down by Holdo.\\nA) Poe is still the best pilot you have \\nB ) Poe even with a demotion is high on the chain of command especially how small the resistence is. \\nC) Poe asked 3 times for orders before comiting mutiny. \\nSaving the animals and leaving the slave kids was dumb. First off all these animals have been captive for all of their lives. They wouldn't know what to do if set free - Rose is a fucking idiot. And why KID SLAVES in a world where there are droids that can't get tired? Aren't those \\\"evil people\\\" supposed to be rich opportunists? And speaking of that\\, MAKING MONEY OUT OF A WAR SITUATION IS NOT A BAD THING but they are labeled as bad guys because of it. The kids literally only exist to make them look evil even if it makes no sense.\\nA) Your friends are literally running for their life\\, you dont have time for this. \\nB )Animals born and raised from captivity will die in the wild as they have no idea how to even live in the wild.\\nC) As a janitor\\, Finn should know that the rich are not inconvenienced at all by this and that the slave kids will have to clean up the mess they caused rescuing the animals.\\nThe cgi was bad\\, the people vanish then reappear in the casino after the animals bust through the wall. Thanks for the BluRay some poor guy had to get to confirm this.\\nLeia getting blown into space and flying back in was nonsensical\\, she should've been frozen to death. Never has she received training in the force\\, too. This was done to subvert our expectations.\\nThere was no space lock when letting Leia in\\, so everyone should have been blown into space. The BluRay cut this scene short - in the theatrical release it lasted longer and showed Leia flying up to the window looking into the hallway as Poe comes running along.\\n Conveniently being locked up in the casino with the guy you need is convenient... such writing.\\nWhat would the code breaker had done if rose didnt have the mcguffin necklace to break the lock? \\n Why does Luke throw away his light saber? \\nA) episode 7 set it up as heart filles\\, but what emotion are they going for in 8? Do they expect me to laugh? It completely breaks the tone... something the movie does a lot. \\\"Put a shirt on Kylo\\\". Any need for this to be in the script?\\nB ) its his fathers\\, and would be something to remember him by \\nC) it was given to him by Obi Wan\\, and should be something to remember him by as well. \\nWhy does Rey translate what Chewbacca says to Luke? Luke understands wookie. Why does Rey know wookie anyways? And why is the first thing Luke says when he see's Chewie \\\"WHAT ARE YOU DOING!?\\\" after 30 fucking years!?\\nHow does Rey understand wookie despite not being able to understand him in TFA\\, and with no time passing between 7 and 8? \\nRey beating luke in a fight with no training makes no sense\\, she is a mary sue that literally can not lose. She did nothing to earn this strength and didn't even believe in the force not too long ago.\\nLuke milking a sea cow.  Not really a flaw or anything but... this is the hero of the galaxy right there. That's what Rian decided for him to do there. And why did he hide anyways? He made a map\\, no way he went with the intention to die when he made that. Rian clearly didn't watch TFA.\\nYoda shooting lightning was dumb\\, since when can a force ghost affect things\\, and if they can where have they been? They could've saved their loved ones in other movies.\\nHow does Yoda hit Luke on the head with his staff? How can he even touch him? He is a ghost. While we are at it\\, Luke's force projection kisses Leia's head later on.\\nCrashing at light speed looked cool\\, but new plot hole: why haven't they done that before? They could easily make light speed missiles. It would've been possible for the Death Star and the Federation Ship in TPM. Why the fuck didn't anybody just shoot an empty vessel with a hyperspace jump in there? The Death Star was crafted and brought to the finest military standards as confirmed in Rogue One and the other movies. Side material goes into that in detail but should be ignored for the understanding of the movie alone - this hyperspace jump dated past movie space battles as well as upcoming ones effectively as this solution will now always be in mind whenever a space battle comes up.\\nWhy sacrifice your admiral to crash the ship? Why not use a droid? Or auto-pilot? Or a less important crew member who would gladly do it to save everyone? Especially given how dangerous the first order is.\\n At least 5 characters accidentally say rebellion instead of resistance during the movie... but there is no rebellion. That war ended a long time ago and most of them weren't even alive back then.\\n When committing mutiny you need to throw the commander in the brig\\, or at least take their gun away. Didn't happen.\\n Tasting the ground to say its salt not snow on \\\"not Hoth\\\". Having a person taste the ground is just so weird. The viewer wouldn't even know of this planet being a salt planet if it wasn't for that. There are several elemental planets in Star Wars\\, but this one in particular is just a clean white sheet of salt... keep that in mind.\\nAfter saying its salt\\, the movie immediately forgets that and sends snowtroopers into the base\\, not stormtroopers. Selling more toys? I didn't even mention the porgs and how Chewie was reduced to being in scenes only for them... that and to be shouted at by Rey and Luke-\\n Rose crashing into Finn was dumb \\nA) Should have killed them both... but surviving is possible. Yet there was a risk. \\nB) He WAS trying to save those he loved\\, what do you mean that will make us win? You made it so he couldn't!\\nC) Now everyone should die since no one destroyed the cannon. \\n Rose\/Finn kiss was fine as a scene but there was zero chemistry between them. Rose only made fun of him for being a coward that is called a hero. \\n It should take Finn 2 hours to drag Rose back to the base from that distance. Not just that but why has nobody shot them? Thats a blank white sheet they are walking over and considering how long it took them to make that distance with a speeder\\, this is literally impossible. The writer wanted to have them back at the base and gave us no explanation.\\nWhy is phasma the only trooper with armor that actually works? And she was held on gunpoint in TFA. Why was she scared by the gun then? No explanation between the movies why this is the way it is... in fact we get NOTHING from Cpt. Phasma. Zero character. Oh... why does she want execution by a laser axe to \\\"make it hurt\\\" in her own words when blaster fire would be a much more painful slower death? Why have such impractical weapons around anyways?\\nRey knowing how to swim despite having grown up in the desert. Mary Sue.\\n  Rey shooting 3 tie fighters with 1 shot was dumb\\, it was her very first shot too. Took Han a lot more time to kill a few fighters in the other movies at his prime.\\nWhy did Rey go to Snokes ship and try to turn Kylo\\, after previously saying how much she hates him? \\n When Rey leaves snokes ship\\, Kylo was unconscious. Why didnt she kill him? \\n How exactly did Rey leave the ship? Well\\, somebody mentions that she takes the Supreme Leaders ship... only to show up in the Falcon later on that was in the hangar there\\, still. Who to believe???\\n How did Rey lift all the boulders at the same time with no training? Oh yeah\\, mary sue. She didn't even believe in the force like a few weeks earlier. Luke on the other hand did and struggled with lifting his own ship.\\n They forgot how time works\\, the ship had 16 hours gas\\, but Rey spent multiple days with luke and still gets back in time. \\nSnoke insulting kylos mask was dumb\\, Snoke was perfectly fine with his mask before\\, too\\, and it was shown previously that Kylo didn't like not having it on. Why is he not wearing it ever again then? He betrays Snoke from zero to hundred but never wears the mask again because he said so.\\nWhat happened to the knights of ren? Another thing setup in VII thrown away in VIII.\\nWhy did luke leave a map to find him in force awakens if he didnt want to be found in the last jedi? \\nLuke force projecting was almost cool\\, except: \\nA) How could he kiss leia on the head but not die from blaster shots?\\nB) How could he hand leia the trinket? \\nC) How did poe know luke was stalling? \\nD) Why didnt luke tell anyone the plan? \\nE) Why the F**K died luke that way? He dies from what? Stress? And couldn't he show up in person then if he dies anyways? It could've been because he wanted to trick Kylo into thinking he is still alive but that explanation is not given by the movie.\\nF) Why didnt the trinket disappear at the same time luke did? \\nG) The Solo movie made the scene worse! When Luke hands Leia the trinket dice\\, its meant to be a reminder of Han\\, but Han gave that to his first girlfriend. If anything Leia should be insulted he kept the dice as a reminder of his first girlfriend. \\nH) If the dice meant anything to Leia\\, why did she leave them behind? \\nI) Poe notices that this is just a projection\\, but Kylo doesn't.\\n Lukes mechanical hand \\nA) Why does it look like Anakins\\, when his hand was severed 30 years later and is clearly an upgraded prosthetic in empire? \\nB ) why does his hand vanish when he becomes one with the force? His clothes dont\\, so why would his prosthetic hand? \\n Leia says they have everything they need to rebuild the resistence\\, but this is dumb: \\nA)They have no allies \\nB )They have no money \\nC)They have no ships \\nD)They have no men \\nE)They have no weapons \\nF) Actually... they are left with nothing now.\\n\\nThe visuals are the only good thing about this movie.","true":true}