{"101487":195374,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What a poorly written Star Wars film where all 'surprises' or 'twist' were just there to be different from all fan theories for the sake of being interesting but instead came across as lazy and just plain boring whilst not being coherent or true to the characters themselves\\,it is quite clear that Rian Johnson doesn't understand Star Wars at all..these are just some of the problems... \\n\\n1.Terrible amount of out of place humor \\n2. Rey has no training except lifting rocks but can fight for some reason?\\n3. They made a big set up about Rey's parents in EP7 but they are nobody?\\n4.  Luke made a map to be found but doesn't want to be found?\\n5. The whole Canto Bight scene was just POINTLESS\\n6. Snoke was big disappointment\\,they killed the most interesting character \\n7. Kylo had no character arc\\,he killed Snoke but still is weak?  \\n8. Why would Luke try to kill Kylo in his sleep..so out of character \\n9. Luke had no fight scene...then he died because ???\\n10. Leia uses the force in the dumbest way possible\\n11. What is the point of not telling Poe the plans?\\n12 Yoda only acts like he's crazy or drunk in Empire Strikes Back because he's testing Luke\\,when he reveals himself as Yoda the Jedi Master\\,he shows his true self by being calm and wise\\,....why in The Last Jedi does Yoda have act like he's drunk or crazy?????????  \\n\\nI can literally go on and on with the problems in the film\\,visually it was good\\,acting wise\\,it was good...everything else was rubbish..EPIC FAIL.","true":true}