{"101487":189082,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"TLJ was rubbish.  A disgrace to the Star Wars Saga.  Its story was soul-less and shallow.  There was scant little onto which an intellectual thread could be latched.  What I disliked the most in TFA was the constant regurgitation of old ideas\\, plots and scenarios\\, cheap and mass produced attempts to use nostalgia to recreate the magic of the original trilogy.  This time around they kept it down to an almost tolerable level but were clumsily mish-mashed in with a cargo freighters' load of plot holes and twists that infested the movie like drifting space junk.  Keeping the viewer engaged for two and a half hours does require a pretty great script and this one certainly wasn't.  There were moments that felt like the Empire Strikes back but no sooner did you begin to settle into the train of the story (after several failed attempts and more than half way through the movie) than a plot hole\\, twist or gag jumped out of light speed and crudely slapped you in the face.  I left the movie theatre feeling I had just stepped off a cab ride across the city with a lead-for-feet-and-hands pilot at the wheel.\\nI like to think that Rian Johnson is a fine film writer and director and that in TLJ\\, he was tied down to a strict contractual brief from Disney to produce a mega-bucks earner for a younger audience that will ensure the financial success of future installments\\, shoot-offs and merchandise.  After all\\, isn't that why Disney purchased Star Wars in the first place?  In this current generation\\, they don't need to waste time wiriting up even a half-baked story for a new Star Wars movie to sell. Just throw in ample CGI\\, a few choreographed fight scenes and silly characters clowning around in any random order.  The film critics who gave the movie positive reviews : you can tell us - Disney paid you all handsomely didn't they?  This leaves the fans of the original trilogy\\, those old dreamers who can't stop moaning about the good ol' days - they're no longer in the easy-money formula so riddance to them - and easily done for our galaxy contains something far more powerful than the force :  it's called the dollar.","true":true}