{"101487":194850,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Were do I begin...in a word this is by far the worst of the Star Wars films in the entire Saga and I will elaborate in detail as to why shortly but before discarding this review as bias let me give you a little back ground from 4 different perspectives-me\\, my wife and 2 kids just came from seeing this film and I am (or was) a HUGE SW fan\\, my wife knows nothing about SW and my 2 kids know very little yet we ALL agreed it was a terrible jumbled together mess (even I was shocked to here this from all three of them because I knew the back story yet they didn't)\\nNow on to the details (slight SPOILERS)...lets start with how this film single handedly decimated the characters that made SW the memorable saga that it was\\, foremost of these being LUKE who arguably should be at this point one of if not the most powerful and knowledgeable Masters the Jedi has ever known. I have never seen a Master or a trained Jedi for that matter beaten so easily by a pupil in any capacity  let alone an untrained one. Those who are comparing LUKES actions to that of Yoda fleeing to Degaba are missing a huge point-Yoda NEVER intended to give up on the force nor training and hid not to run away from his failing but so that he would be on hand when he was needed to help mentor the \\\"New Hope\\\" aka LUKE. That alone should have been something Luke was capable of reflecting on as a Jedi Master which would help him make rational decisions instead of acting like a whiny old man who runs away when things don't go as planned. But it didn't stop there...something that Luke has always held dear because of his Love for his Father was his Father's lightsaber which was something endearing as Luke was able to see past the SERIOUS flaws of his Father and recognized the good in him...but here we are in TLJ were he simply looks at it when handed to him and tosses it over his back into the abys (or endless ocean) likes its a piece of garbage (WHAT?). Moving on...so Jedi I guess no longer need to go through any trials or training to affectively use the force or be proficient in anyway...I mean after all its just a power Jedi use to move rocks right? (Rey's exact words)-this little statement shows a serious lack of appreciation on the directors part for what proceeded him and what Mr Lucas came up with and the fans-look I'm ok with introducing new ideas and characters and even phasing out the old but I have a problem with how you portray those characters and ideas you deme as irrelevant which in this case was utterly insulting to the fans and the SW canon.  Lets say  someone came along and re-made a beloved Disney flick but dismantled who those characters were in those films (think of any of those beloved Cartoons) I'm sure people would be taken back a bit. On that note Kylo Ren and Snoke claiming to not be practitioners of only the Dark side but attempting to act like the Sith in their goals and objectives is simply ridiculous..look either you are going to create something new or you are not and if you are \\, don't put the original\\, beloved characters in the movie only to dismantle them in an attempt to introduce your own-the film would have been better if non of the old characters were there. Its sad to say the new characters in the film who barley knew each other seemed closer than all of the old characters combined who have REALLY been through the trenches together was not believable one bit.  True the prequels had their flaws but at least they told a story you could connect the dots and put the pieces to but here we have no back story as to where a order who is allegedly more fierce than the Empire comes from. There are so many other points about this movie that were not great but I will say the graphics were good though I'm sad to say that was it. I am seriously curious as to what some are seeing in this film as phenomenal  and if those ones are general movie goers or real fans of SW.","true":true}