{"101487":187443,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This social justice warrior movie makes me sick\\nSnoke was pointless and turns out not to be a major character at all. For someone so strong\\, he was sure killed easily and in a pathetic way. \\nRey is nobody....\\nLuke is a coward who then dies because he used the force. \\nHan and Luke are dead. Carrie Fisher RIP can't be in the next movie. There's the 3 big heros gone.\\nForced an inappropriately timed humor. \\nDumb script\\nHorrible plot \\nChewy had 1 minute of screen time\\nStill unoriginal\/ similar plot to episode 5 just like force awakens had an almost identical plot to a new hope \\nFinn could have sacrificed himself to save to rebel base but that dumb girl rose stopped him\\, ruining a possibility of a good plot point and a beautiful sacrifice for three greater good. \\nHow did phasma get off starkiller base\\, is sheer really dead this time? \\nHow did Kylo get off starkiller base\\nKylo kills his master then wants Rey to join him.  Go find an original idea!\\nLeia surviving in space and force pulling herself into the ship was stupid. Sure she is force sensitive but had never demonstrated any true force abilities but all the sudden is super strong in the force. \\nThe whole plot would have been different had leia's replacement commander just told poe the plan. Their inability to communicate caused every issue they encountered\\nThe only part of the movie I like was Paige Tico making that hero move opening the bomber doors knowing she would die to destroy the dreadnought","true":true}