{"101487":178514,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There really isn't much this movie could have done better.  It is in my top three Star Wars movies of all time.  The movie had plenty of \\\"wow\\\" moments with new force powers and had a great balance of humor mixed in without becoming annoying at any point.  Despite some complaints I think the scenes showing Luke's island survival skills were wonderful.  The only real complaints will come from misguided 1) nostalgia and 2) impatience.  Nostalgia can make some viewers upset that our old heroes are no linger the focus.  I don't know what to tell you other than get over it.  Luke has become are more complete person in this movie and his final encounter made the fanboy in me want to sing from a mountaintop.  People who have issues with how he \\\"leaves\\\" the movie must be terribly afraid of their own impebding deaths.  This taking into account that Luke gave us a heads up by saying none of us are ever gone and the wonderful Star Wars movie mechanic where Jedi really are never dead.  The impatience comes in the form of not trusting the movies writers and direction. I believe this movie 6-ton lot of the problems I had with the force awakens and in a similar manner I will trust it to fix any issues in the next movie. Who is Snoke where did he come from? I am sure we will find out in the next movie. I actually don't believe that he died. Force projection ala Luke anyone?  We will find out who is right in two years. The Last Jedi directly touched on how Rey and Fin could possibly last more than 4 seconds against kylo Ren. Something that we were forced to assume before but now has been explicitly explained in a very satisfying manner.  I believe that history will look as favorably on this movie as it did unfavorably on jar jar and Anakin's acting\/direction in the prequels.  (Side note:  I am hesitant to blame the actors and the prequels as Natalie Portman's is a well-known brilliant actress and was horrible in the films. I have to blame writing and direction for those hard misses.)  In all my hairs were on end from beginning to end\\, surely a partial result of positive nostalgia for this 40 year old.  I walked out of the theater jealous of those who were walking into the theater.  Thank you Disney and everyone involved in the project for breathing new life into the series.","true":true}