{"101487":178026,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The plot was slow and terrible they spend most of the movie with Luke switching his mind of whether to train Rey or not and stuck with the rebel ship runaway from star destroyers to avoid dying. I mean it I swear it blinked and missed part of the movie. I honestly felt that after the resistance made it to the planet after escaping the star destroyers that the movie was suppose to be over. I also would like to point out some other issues which I will list below: \\n1. They sketched out every \\\"dramatic moment\\\" where a character is either about to die or is facing a problem (such as when Rey is talking to Kylo) \\n2. Rey's training wasn't much of training at all and in the darkside of the planet(the black hole) Rey did not confront her darkest fears\\, just a kongo line of Reys \\n3. Captain Phasma makes a return\\, only for about 5 minutes\\, so she was bait for people in the trailers (overhyped character) \\n4.A number of unanswered questions about Snoke\\, youtube theorist came up with many of theories such as who Snoke is\\, Disney didn't give any answers in the movie and killed him in his first real appearance which leads me to.... \\n5. Snoke's death\\, I was kinda hoping for a fight and a more satifying death scene \\n6. Not a lot of action\\, the most of the good action (how little there was) took place at the beginning and end of the movie I came here to see a Star Wars movie but to be honest I thought it was more like Star Trek. This movie does not deserve all the money it is making\\, just think Disney is taking more money from the movie theaters for this!","true":true}