{"101487":163635,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Pure throwaway rubbish.\\nLuke Skywalker was a letdown. After destroying the Emperor and redeeming his father even though he was full of terror. Now apparently tries to kill padawans in their sleep for fear they 'might' turn to the dark side? It made no sense. Daisy Ridley once again was awful. Why she was cast in the lead role is beyond understanding. She cannot act.\\nYoda was hilarious\\, due to him looking like someone had their hand up his ass. Though the original trilogy had a good excuse for him since it was due to the early 80's and sfx wasn't great back then.\\n\\nPoe and Finn were decent in this film. But that was the height of it. A terribly boring film overall. With too many awkward stupid scenes like the opening scene with General Hux talking to Poe. And don't get me started on 'any' scene with Kylo and Hux together. They were all cringe-worthy scenes. Kylo looked like he was about to burst into tears the entire time.\\n\\nThis movie was a mess. Yet apparently Disney has put a spell on everyone and it's having rave reviews? I would love to watch the movie everyone else seen. \\n\\nWas stupid too how Snoke was this big badass who sat on his rocking chair the entire time talking about how nobody can get one up on him\\, only to then have Kylo........get one up on him immediately after saying this? \\n\\nThis director is being handed a new SW trilogy after this one is concluded. I cannot even imagine what tripe he will concoct next. Oh and as for Del Toro's character? A complete joke. His character was boring and meaningless.\\n\\nTerrible addition to the series.\\nNo soul.\\nNo passion.\\nNo love for the franchise.","true":true}