{"101487":190756,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Unconnected movie with very underwhelming characters that make stupid decisions. More on that lower.\\n\\nEverybody likes Poe but please. When somebody disobeys the command of the superior officer he should be incarcerated. No matter that he was successful. First because of him a lot of the already small rebellion died\\, another thing is that he is now full of himself so he thinks of another plan which results in spoiling the plan of another superior officer who he disobeys. Not only spoiling but results in losing even more lives. (Here the admiral Mordo is also iritating me with not sharing the plan and with being so indecisive and waiting to make her super cool move). Still his actions are carelessly discarded and they prep such a person to be a new commander. And then when they need to destroy the cannon after they already lost so much he backs of. At least Finn\\, after he and his unnecessary plot fail with the cost of many lives\\, is willing to make the ultimate sacrifice but nooo\\, I must save you from saving a lot of people. Who cares about them\\, and please after killing them they kill him no matter what. So just plain stupid.\\n\\nAnd in all the above the amount of cannon fodder in the rebellion is amazing. At one moment they had 400\\, then lost much of the transporters. Then managed to fill the trench on the planet. And after lots of deaths there still is somehow enough people to \\\"save\\\".\\n\\nThe Rey and Kylo characters are so uncharismatic and naive.\\n\\nThe character of Snoke is unused but i don't care so much about that but I do care for wasting  the character of Luke Skywalker. Sooo underwhelming. And the new saga can't be good because it doesn't have a good villain. Snoke didn't do anything special\\, and that tantrum baby Kylo can't be a good villain. \\n\\nAnd for the end if Yoda can interfere with the world why can't Vader talk some sense in his grandson.","true":true}