{"101487":197120,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Why you shouldn't watch even if you've only seen The Force Awakens (no spoilers):\\n1.) Finn in TFA would risk his life helping Poe\/Resistance and Rey. Finn in TLJ would risk the lives of Poe\/Resistance for Rey (there's a difference).\\n2.) Same thing with Poe (but his reason isn't Rey).\\n3.) My relative whose first Star Wars is TLJ commented that she didn't like Rey because Rey came off arrogant\\, quick to judge\\, and quick to act. Hardly the role model Rey was originally set up to be.\\n4.) No new John William's soundtrack. Application of existing tracks was also overused and not impactful.\\n5.) Lines and scenes from previous SW movies are pasted into this one\\, and they're used better in their original movies.\\n6.) Luke in the original trilogy jumps at the opportunity to help people he has never met (Princess Leia in A New Hope) and people he considers family (Han\\, Chewie\\, and Leia in Empire Strikes Back; Vader in Return of the Jedi whom Luke has literally no previous experience\/reason to want to help) even at the cost of his life. Luke in TLJ would rather die (literally) than be by his sister's side.\\n7.) The romance. The entire theatre audibly cringed. It was bad.\\n8.) The bad guys are cartoony\/shallow in character.\\n9.) Overall the plot and mood of TLJ were shallow and wholly out of place in a series characterised by meaningful messages and by allusions to the Bible and Greek tragedies. \\n\\nAgain even w\/o knowing anything of Star Wars beforehand\\, if you've seen TFA and then watched this movie\\, you'll be confused by the direction TLJ took and disappointed. Good night and thank you for coming to my TED Talk.","true":true}