{"101487":170351,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"STAR WARS: The Last Jedi.... The most hellish travesty in the entire history of the Star Wars saga. I have literally never been so disappointed. Part of my childhood was raped before my very eyes.... Thank you Rian Johnson for destroying such an amazing Universe. \\n\\nI will list certain key problems and offer some of my own reflective suggestions.  \\n\\n(1) The Starship Chase Scene\\nThroughout the entire movie the First Order is chasing the Resistance fleet.  It is an overly drawn out and ultimately ridiculous chase sequence.  It simply makes no sense and shows just how poor the writing was.  I mean why couldn't the First Order just send out thousands of fighters to attack the fleet?  Why not jump in more starships ahead of the Resistance fleet?  Why not fire all orbital cannons on Snokes flag ship to take down the shields?  The answers are many and the whole sequence is foolish and sloppy.  \\n\\nSUGGESTIONS: Why not have the Resistance fleet continue doing jumps to get away from the First Order but unfortunately they are always somehow found out?  *It would give it that Battlestar Galactic kind of vibe*  The subplot would be the idea that the Resistance people think there is a traitor among them who is selling out their jump coordinates to the enemy.  This would set up a much better plot sequence in which people like Poe think Holdo is the real traitor\\, which would justify the tensions between them.    \\n\\n(2) New and Yet Meaningless Characters\\nVice Admiral Holdo and Rose are literally pointless characters.  You only meet them for the first time in this movie and yet we are somehow made to feel as if we should care about them.  But who can?  No one knows who they are\\, no backstory\\, and therefore no real emotional investment.  Further they seemed to be forced into the film just to fill space and movie time.  \\n\\nIt is ridiculous that Rose would \\\"fall in love\\\" for the \\\"hero\\\" Finn after\\, what\\, 24 hours or less?  That she would be emotionally invested to save his life much less want to be with him?  That is so stupid and silly and rushed.  It is not believable in the slightest.  \\n\\nAt the same token Holdo's whole character is just off and her 'sacrifice' is pointless on many accounts on the simple fact she is an undeveloped unknown character.  When the epic scene of her sacrificing the flagship took place\\, I was thinking to myself \\\"Why care about this or her?....Yes the huge explosion scene was very cool....but.... I really don't care about this 'sacrifice'.... Why should I?  It's just eye candy for those who have a fetish for 'big explosions'....\\\"  To the point that is NOT how a sacrifice scene should feel.  And yet when you think about it in an even bigger sense not only is her character meaningless but her sacrifice is really laughable and ultimately meaningless.  Why?  Because she could have easily put the ship on auto and left in an escape pod.  WHO WOULD OF THUNK SUCH A THING!?  Obviously not Rian Johnson.   \\n\\nSUGGESTIONS: Rose should have been developed to build a trust in Finn\\, to fight alongside him\\, not to fall in love with him.  Over time this could be developed and perhaps\\, if the writers then wanted to\\, by Episode IX\\, they could have introduced an interesting love relationship of sorts.  \\n\\nFurther Holdo should have been saved and further developed into the next movie as a major leader of the Resistance considering the fading out of Leia due to the loss of Carrie Fisher.  Specifically to her whole sacrifice scene I saw this differently.  In fact I didn't see her doing the sacrifice because there was no emotional investment in her character at the time.  Rather my idea of a 'sacrifice' like scene would have involved Ackbar.  Roughly\\, something as follows: Have Ackbar sacrifice himself and some of the Resistance people to allow the others to escape....  How hard is this?  The Resistance flag ship could be badly damaged from being attacked...  The auto-pilot systems are fried so a manual jump is required.... A chaotic exodus on escape pods to Crait ensues while a skeleton crew of Resistance fighters elect to stay behind along with Ackbar who believes a commander should go down with his ship... The skeleton crew powers up thrusters and hurls the ship into the First Order fleet.... Ackbar and the Resistance fighters are seen as real heroes.....  How hard is that?  \\n\\nAdmiral Ackbar is too much of a beloved and developed character in STAR WARS lore to simply have been blown to bits on the bridge and given less than a 10 second eulogy to him.  \\n\\n(3) Phasma's Death \\nStraight up it has to be asked\\, \\\"What the heck is the point?\\\"  Why even waste time bringing back Phasma from the previous film only to have her killed after 3-5 minutes of screen time?  And what is the whole odd rivalry between her and Finn?  That seems artificial.  Why would she care so much about one defective storm-trooper?  The point is Phasma had so much potential and had an opportunity to become a beloved awesome bad-guy but she was nothing but a wasted opportunity.  \\n\\nSUGGESTIONS: Keep her alive!  Have some epic fight sequence or scenes showing her true abilities as all the fans wanted in the first place!!! \\n\\n(4) Misplaced Cringe Worthy Humor \\nHumor has its place in STAR WARS but it was not well done in this movie.  STAR WARS is not Marvel so stop trying to make it that.  It is it's own thing.  It's not The Avengers\\, Guardian of the Galaxy\\, or THOR so stop trying to morph it into such a thing.  Case in point General Hux was a bumbling idiot in the movie.  The very opening scene of banter between Hux and Poe was chuckle worthy but it really wasn't fit for such a segment.  Likewise the silly and foolish characters in the casino went way out into left field and literally took up important screen time that should have been geared towards developing plots.  \\n\\nSUGGESTION: Curb the humor.  It has its place but it was too much here.  \\n\\n(5) Leia as a Super Space Fairy \\nSo Leia is apparently some Superman-esque being who can fly through outer-space.  I understand Leia has some force abilities.  She's a Skywalker\\, it's in her blood.  But it was unsettlingly odd and out of place to have her flying through outer-space after being hurled from the bridge of the flag-ship in a fire ball of destruction.  It was like something from a Marvel or DC movie and did not feel right at all.  And how do you explain the whole air-lock thing?  Like\\, it's the cold dark vacuum of space and yet they open the air-lock to let her in and they don't get sucked out into space?  How does that happen?  And if she can create force bubbles around her like that then why not do so for everyone on the bridge?  It's all just weird and too far out there.    \\n\\nSUGGESTIONS: I am mixed on this but it would have served a better purpose\\, considering the loss of Carrie Fisher\\, to have had some kind of shock value death for Leia that would\\, at the same time\\, have been honoring to her legacy.  The death on the bridge could have actually worked had it been further along in the movie..... Her floating lifeless in space while in the background the Resistance fleet burns would have given a truly ominous and darker tone to the entirety of the film that would have given shock value and a sense of\\, \\\"We aren't in Kansas anymore.\\\"  But\\, I would ALSO be okay to have her simply in comatose for a time too.... Just some thoughts.... \\n\\n(6) Supreme Leader Snoke's Lack of Peripheral Vision \\nOne of the biggest disappointments in this movie was the utter waste of a buildup character as Snoke.  To the point Snoke ultimately was pointless.  You know nothing about him other than he corrupted Kylo and is somehow connected to founding the First Order.  He is portrayed as this almost omniscient ancient being that saw the fall of the Republic\\, the rise of the Empire\\, and the fall of Vader and Palpatine\\, and can even create mind connections between two people.... and yet he sucks with peripheral vision???  He doesn't know a lightsaber is turning beside him?  Really\\, you're going with that?  The lightsaber splits him in half\\, he dies\\, and that's it.  It's over.  No dialogue where he discusses who he is where he came from\\, how he knows Luke\\, what his purposes are\\, or anything....\\n\\nSome people say \\\"Snoke served his purpose.  He was meant to serve a story purpose of corrupting Kylo and then he needed to be removed.\\\"  Well\\, to them I say\\, \\\"You're not only wrong your stupid.\\\"  All the movie evidence\\, and all the behind-the-scenes talks\\, indicate that Snoke had a deeper meaning than that and if he didn't\\, then why put him in the movie to begin with?  Why not just mention him and be done with it?  Why take the time to merchandize his character\\, talk all this crap of his ancient origin and mysterious purposes\\, and even show a massive overpowering hologram of him\\, if he doesn't have some bigger purpose?  Why not just substitute all that merch for more Porg plushies?   \\n\\nThe point is Johnson and company were simply sloppy with this character and wasted every-bodies time even re-introducing the him on the screen. \\n\\nSUGGESTIONS: If you are going to kill Snoke in Episode VIII then (and I really think it is a bad choice to do it this movie and not the last) at least give backstory to who he was and what his purposes were!!!  The shock value of his death so soon would have been pretty interesting but it was executed poorly due to the fact no one had time to really invest any sense of care or hatred for his character.  \\n\\nBetter yet\\, his death could be redeemed by a reveal that he has some sort of a resurrection capability or cloning processes where his withered darkened spirit is forced to re-inhabit another body to stay alive - thus he comes back in Episode IX.  Just some thoughts.  \\n\\n(7) Castration of Luke Skywalker's Character \\nI am not sure if I have ever seen a better example of character castration as I saw with Luke in The Last Jedi.  Again\\, phenomenal job in destroying an iconic character!  There is so much to say here but let me try and pick just a few.    \\n\\nOne of the central plots of Episode VII was the whole idea of finding Luke Skywalker and giving him back his lightsaber and bringing him back to fight!  The final closing scene of Episode VII leaves you slightly on edge as Rey finally makes it to Luke\\, marches up to him\\, and holds out his lightsaber.  Episode VIII picks right up with this intense scene and does what with it?  Turns it into a meaningless moment of humor as Luke awkwardly throws the saber behind him and proceeds to walk off.  Now\\, don't get me wrong\\, I liked the idea of Luke reneging against the Jedi Order out of a sense of guilt\\, but this scene was no place to do something funny.  It took away from the gravitas of the situation.  And this is what we get with the rest of Luke's scenes.  \\n\\nFor the remainder of the film Luke doesn't really do anything except give Rey a crash course on The Force (which is literally one lesson)\\, that apparently we come to find out doesn't matter in the long run because Yoda comes along and says \\\"She already knows everything she needs....it's within her...\\\" and some other mumbo-jumbo crap.  So your left wondering why care about Luke then?  What was the point of finding him?  He didn't really train Rey.  He didn't really accomplish anything.  The only thing he did was somehow\\, in a weird twisted X Files fashion\\, astral project his being across the galaxy to meet with Kylo Ren... toooo do what exactly?  Kill Kylo?  Stall Kylo?  Or something else?  If it was to stall him then how was that some heroic scene worthy of sacrifice when in fact we find out he's not really there!?!  He really didn't do anything actually.  And how would that have stopped the First Order from attacking the base anyway?  In short\\, how does any of that justify this whole idea of \\\"Luke will come and save us and be a really epic hero again!!\\\"???  The answer:  It doesn't.  \\n\\nAnd what of his death?  ....  He just shakes with sweat like he is constipated and then Obi-Wans-Away???.... This was as ridiculous as it was sickening.  \\n\\nSUGGESTIONS:  If you are going to kill off Luke - which I think is a bad idea in this movie and could have served better for a final show-down in the 9th movie - then why not do it by truly showing a real sense of power and heroism????  We have already had the \\\"fade-away\\\" idea twice with Obi-Wan and Yoda.  Why not actually show a fight between physical Luke and Kylo?  Why not bring Luke physically to Crait if your going to kill him off anyway!?!  It's so stupid and pointless and laughable and sad at the same time....  \\n\\n(8) Rey's Insignificance \\nI really wanted to like Rey.  Like many other people her parentage was something everyone was wondering about with much expectation.  And yet we find out she is a nobody and her parents are white trash druggy sellouts who sold her into slavery so they could fly across the galaxy shooting up?  Now I know it is possible that Kylo was lying\\, but the scripting of the scene and the comments by directors and the actors suggests this is exactly the direction they were wanting to go.... To come out and shoot down the idea that she is \\\"special\\\" or has a \\\"destiny.\\\"  What such a move is is nothing short of giving a middle finger to the entirety of STAR WARS' classical fantasy heroism vibe and give it a dose of reality by saying\\, \\\"Look here\\, no one is special.... Rey isn't special because of her parentage\\, she is special because she is ordinary and is more powerful than any Jedi....\\\"  Blah blah and blah.  *gag*  That is ridiculous.  It make's no sense of the following: \\n(a)\tWhy would Luke's lightsaber call to Rey?\\n(b)\tWhy would Obi-Wan's voice be heard in her vision?  \\n(c)\tWhy would you depict Cloud City and hear Darth Vader? \\n(d)\tWhy would Snoke care to link Kylo's mind to this worthless white trash on the edge of nowhere? \\n\\nFurthermore the whole idea that some white trash rugrat could learn in 2 days what it takes weeks\\, months\\, and\/or years to accomplish is ridiculous.   So she somehow has all the knowledge of Jedi skills in a matter of 2 days?  And she's nobody?  The very fact she CAN do such things literally falsifies the whole premise that she is \\\"ordinary\\\" because ordinary people don't and can't do such things!!!!  Again\\, another example of sloppy writing.        \\n\\nSUGGESTION: She needs to have a purpose.  A destiny.  A bigger than life\\, bigger than she is POINT!  That is the WHOLE POINT ABOUT STAR WARS!!  For 1 hr 30 minutes or for 2 hrs and 30 minutes we are engrossed into the bigger than life space-odyssey of classical good vs. evil\\, where there is destiny and damnation\\, where there is redemption and loss...ect.  That's what makes it appealing.  I'm not saying I want a Mary Sue style character but a character that we invest in and see her come to understand that she is part of something bigger.  At this point - after the disasterous movie - I would actually have taken the idea she was some kind of \\\"force-baby\\\" creation of Snoke's to balance Kylo so Snoke could have manipulative control over the entirety of The Force.  Or better yet\\, why not have Rey have been a creation meant to somehow destroy The Force *kind of like Darth Kreya in KOTOR???*  I'm just throwing ideas out there.   \\n\\n\\n(9) Unexplained and Apparently Worthless Plots \\nSo there are so many more things wrong with this movie but let me sum up several plot concerns under this generalized heading.  I will do so in the form of questions or major points.  *I realize a few of these things could possibly be answered in the final movie\\, but nonetheless most of them apply to connection with Episode 8* \\n\\n(a) What is the whole point of R2-D2 having a hidden map to Luke if Luke \\\"didn't want to be found\\\"? Like\\, why create a map if you didn't want to be found on a secluded planet?  This makes no sense whatsoever.  And\\, it's not explained.  \\n\\n(b) The Knights of Ren...like... Where are they?  This literally went nowhere.  Were they the Praetorian Guard? If so\\, poor writing.  If not\\, poor writing.    \\n\\n(c) Maz Kanata's brief interjection was pointless ultimately because Finn and Rose don't even go with her suggested person.  Further\\, how did Maz get Luke's lightsaber?  How does she know Luke?  How does she know the force so well? \\n\\n(d) What about Kylo Ren's obsession with Vader?  And how did he get his mask?  Why was all of this just forsaken?  \\n\\n(e) So why again couldn't Kylo see that Luke was an astral projection?  I mean\\, couldn't he tell that Luke's lightsaber was blue and not green?  The blue saber had been destroyed just previously and yet he sees look holding it on Crait?  Makes no sense.  \\n\\n(f) Why didn't the First Order fleet just send in more ships to cut off the Resistance fleet and ultimately destroy it? Case closed.  Again\\, poor writing.  \\n\\n(g) Why didn't Holdo just tell Poe the plan about evacuating the ship to go to Crait?  This is a completely open and easy solution but it was\\, as many other things\\, left pointless.  \\n\\nCLOSING\\nThe more I think about it one of the central underlining problems with this movie is the utter sense of pointlessness it gives at the end.  Everything is actually pointless when you think about it.  Holdo is pointless.  Finn and Rose are pointless.  Phasma is pointless.  Rey is pointless.  Luke is pointless.  Snoke is pointless.  It is utterly pointless on all accounts.  Nothing is really answered and everything is made irrelevant.  That is why this movie is bad and if you can't see that then I don't know how you can really understand STAR WARS.","true":true}