{"101487":141188,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I thought The Force Awakens was bad. I found something that beat it. It should be called The First Mary Sue. Ray continues her perfect character arch of being unbeatable and perfect. How Leia does her Mary Poppins imitation when she never showed an prior powers. Where did it come from?? General Holdo that causes a mutiny cuz she doesn't need to share her battle plan and cause a mutiny. How a sub plot of going to a casino planet to free horses\\, but not the enslaved children goes no where. OR how this was a remake of The Empire Strikes Back\\, yet none of the characters like Leia goes. WAIT A MINUTE\\, this seems allllll familiar?!?! Not to just rail on the female characters BUT Luke milking a space cow? Po being an ass clown of a character and to be just smacked down cuz he was a man? How Boyega's character had nothing to do in this movie. Or how they had to throw in an animal cruelty with Chewbacca being shamed into eating a porg by a sad porg looking at him?! I can not say nothing positive about this movie. I can't even say the music was good\\, as in Hollywood\\, when it's a bad film and your best friend that directed it ask you what you think\\, and you say\\, well\\, the music was great! the music was forgettable. I can still remember A New Hope\\, The Empire Strikes Back\\, and Return Of The Jedi. I just can't stop saying how awful this was. Let me just finish by saying. It's time to fire Katheleen Kennedy\\, oh and the 8 out of 10 writers she hired to help write this burning garbage dump.","true":true}