{"101487":130885,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't hate the movie and actually enjoyed it by itself...but as part of the series and as a continuance of known characters and storylines it failed...I went in ready to watch the best star wars movie yet and came out feeling like I just watched the worst.  From the beginning it was too comical and not in the original star wars way...this was way too gimmicky. Making Luke turn into a coward was totally wrong and having him toss the lightsaber was an insult to his character which he himself agrees with(he hated what they did to his character). I hated him milking a sea cow and just about every decision they made for him. In episode 5 he was adamant about saving his friends and now he abandons them? Every man in the movie had a huge flaw(Luke is a coward\\, Finn is a coward\\, Poe is ignorant\\, DJ is a conman\\, Huxx is lame\\, Snoke is weak\\, Ren is conflicted and has issues) and I felt that there was a strong push towards making the women much stronger which came across just wrong and forced. Leia in space(mary poppins style) should not have been included and is my single most hated moment in all of star wars. I did not like that the first order lost just about every battle except when the rebels ran out of gas. Poe was able to blow up a dreadnaught with the equivalent of a jet ski and a bb gun. The rebels accomplished every mission without much issue and even ran into the dj problem which should have been huge but came out of it unscathed as well. Phasma and Snoke were glossed over as characters and were treated as nothing. I can not believe that Rey was able to go into a room with Snoke and Kylo and the red guards and came out of it and every other situation unscathed and superior in most of the situations. Knowing star wars I hate that Rey and Ren are stronger than Luke and in turn Vader...my issue is that going back through out all of star wars history back to the old republic Vader was the chosen one and supposedly the strongest jedi ever...and now for no reason they just continue to get stronger? That seems dumb and not reasonable. The last scene was also stupid. Anakin and Luke never had force abilities before they were trained. No jedi had the ability before training. It was way too many negative changes to what star wars is and ultimately was a swing and a miss as part of the star wars history. By itself its fine but it failed to follow the story and further the storyline in a cohesive way.","true":true}