{"101487":197083,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-14","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Why Star Wars: The Last Jedi Sucks. In outline form.\\n\\nBiggest Thing: Rian Johnson is bad at improv. He does not say\\, \\\"yes\\, let's\\\" to those who went before him. JJ Abram's setups are rejected. Not only that\\, but the entire original trilogy is thrown in the trash. I would not want to perform with Johnson if I was doing improv. \\n\\nStructural Issues\\n- Pacing \\n- Two climaxes\\n- Runtime too long\\n- Pointless subplots with no payoff\\n- Feels like 2.5 in the trilogy. Dips into what should be a third movie. (It even incorporates Return of the Jedi motifs) \\n\\nComedy and Tone\\n- Totally out of synch. Too comedic\\, too often. \\n- Lack of weight. Rebels are being OBLITERATED and the tone is light.\\n- The first order are comedic. They should be menacing. \\n\\nAwful Writing\\n- Much too focused on \\\"gotcha\\\" moments and screwing with expectations. Feels trolly. \\n- Truly awful moments. (SuperLeia and the airlock\\, Rose saving Finn. Saving the animals. Etc.)\\n- Character inconsistencies. Luke. Kylo. Yoda has dementia. \\n- Rey is still a Mary Sue. The whole story so far takes place in about a week and she's already beating down Luke. \\n- Admiral Gender Studies shouldn't exist. Akbar or Leia should have done the kamikaze attack.\\n- Did Poe need such a belittling subplot? Poe deserved better.\\n- Why didn't Gender Studies just tell Poe the plan?\\n- Continuity errors. \\n\\nLoose Ends Rejected\\n- Rey's parents? Drunks. \\n- Snoke? Some guy. He dead now.\\n- Luke's mission? Nothing.\\n- Knights of Ren? Gone. \\n- Finn's injuries? What injuries?\\n- Maz has lightsaber? No answer. \\n- Finn+Rose now. Because Rey+Kylo. \\n- The twist is that there is no twist. \\n- Where do we go from here? There's no more mystery. I don't care about episode 9 anymore. \\n\\nInjection of Politics\\n- Feminism and awful female characters. They never earn anything.\\n- Animal rights!\\n- Think of the orphans!\\n- Rich people are evil.\\n- The military industrial complex?? (Space nazis aren't the only bad guys. So deep.) \\n- Make love\\, not war... in star WARS\\n\\nDeeper Meaning\\n- Star Wars used to be about the hero's journey in space. High fantasy wish fulfillment. Good versus evil. Purpose and destiny. \\n- This new movie breaks everything down. It's postmodern and nihilistic. It's against heroism itself.","true":true}