{"101487":143195,"Last Jedi":"Last Jedi","2017-12-15":"2019-08-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's not hard to see why I have it a star but I'll try to be brief... (Spoilers)\\n-First order = everyone is just mad all the time and needs to explain everything even to the enemy in full detail \\n-let's shoot the base that won't move but not shoot the ship that probably will jump any second \\n-Hux forgot to not listen to Poe and just shoot him.    Yo mama joke ensues \\n-Rose has no reason to have heard of Finn\\n-Finn wasn't a pilot in the first movie and now is in this one... \\n-Didn't explain force powers or the training into them on either side \\n-Instead of any form of military tactics or command level cadre explaining the situation? Let's just trust the purple hair woman because she's her.   \\n-Casino planets lesson is just utterly stupid!!!  Those kids are gonna have to clean it and rebuild it!!!   \\n-Rebels Or Resistance!!!! PICK ONE!!!\\n-Rey is unbeatable in every situation ever and I'm sick of that.    Let her LOSE for ONCE!!!\\n-Plot Armor....\\n\\nFor real I can break this movie down so easily.... so let me end this whole deal with this.      I sat in the movie theatre with 14 other people 1 week after open...   3 people walked out midway through.    \\nI laughed when Leia floated back to the bridge and opened the airlock and it just cut to the next shot instead of elaboration on how she didn't just explosively decompress the ship right then and there.   \\nI sighed when Rey beat Luke in the stick fight.   I was interested in Snoke.... well I guess that was time well spent...   worst of all I lowered my expectations DURING THE MOVIE to allow that Rey would save the day and wasn't disappointed.     Luke has been abused and finally killed and it was painful to see that.    I actually shed a tear that that was all the respect they had for my hero.      \\nI left the theatre in good spirit's because the visuals are amazing and the sounds and music are generally great.      If you think that forgives a terrible story filled with plot holes and inconsistency's you'll love this movie.     I'm no critic.  I'm a Star Wars fan.    This movie is a disservice to Star Wars \\nThis movie may have turned me away from even seeing number 9 in theatre... and that's a damn shame.  \\n\\n\\nUpdate:\\nAnd guess what..... I didn't see it in theatre.   I saw it on Disney plus....","true":true}