{"101487":196078,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"When I first saw The Last Jedi\\, I would say I liked it kinda. I but the more I thought about it\\, the more I realized there was actually a lot I didn't like.   I liked it for a Sci-Fi Film but I don't like it for a Star Wars Film if that makes any sense. And my real issue with this movie was the way Ruin Johnson took Luke Skywalker's Character! I completely DISAGREE with it.  And refuse to accept it. LOL I know a lot of Fans Hated The Force Awakens but I actually Liked it aside from Hans fate that is. (But who wants to see these beloved characters go) and I could put that a side. I just can't do it with the Last Jedi. \\nHow can you take the optimistic hero who knew without a doubt there was still good in Vader and wouldn't give up on him even knowing the horrible things he's done become this bitter old man that felt his nephew turning to the Darkside\\, so he crept into his tent at night to kill him in his sleep?????? And doesn't fear lead to the Darkside??? \\\"Fear is the path to the dark side. Fear leads to anger. Anger leads to hate. Hate leads to suffering.\\\" Shouldn't Ruin Johnson Know this?  Out of Fear that Ben was turning to the Darkside He was going to kill him???? UM NO!!! Luke would never do that. Luke would find a way or try to\\, to at least reach him. But then I guess this film wouldn't exist LOL. It would be a whole other movie.  LOL I also take issue with killing him off\\, I mean with the Passing of Carrie Fisher There is no longer anyone from the original story (droids don't count) in episode 9. We have No Skywalker left to finish the Skywalker saga. (And Kylo Ren is a Solo) Which makes me sad. Even if Luke is brought back as a force ghost it still isn't the same. \\n The other issue I had was Ray's parents are no ones? As in nobody special. I really hope that was a lie I feel like If she turned out to be like the granddaughter of Obi Wan or a relation to Qui-Gon Jinn hell I would have even been happy if she were a Palpatine LMAO I feel like that would have takin the sting out of losing everyone from the original films. Now I know Carrie Fisher didn't die in TLJ but she is gone in real Life (RIP) and I have no idea what they are going to do with her character\\, but I think this also makes it that much worse that we lost Luke.\\n I saw this in the theatre once and I did buy a digital copy for my dad but I haven't watched it since it came out in the theatre and I'm not sure I ever want to see it again. And I have watched the Originals and prequels I can't even tell you how many times\\, I have seen The Force Awakens maybe like 4 times and Rogue One about the same amount maybe even more. I have also watched The Clone Wars (all seasons + movie) multiple times\\, Star Wars Rebels at least 3 times all the way through. The Last Jedi Just makes me sad\\, It doesn't feel like a Star Wars movie to me. It's a good\/not great Sci-fi film just not a good Star Wars film","true":true}