{"101487":156045,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"Nobody Hates Star Wars more than the fans themselves\\\" has been a common phrase since the Release of Star Wars Episode I.  \\n\\nBut as someone who enjoyed both the prequel trilogy and the original films---I never felt understood this phrase...until now.\\n\\nThe Last Jedi has a strong unified message \\\"LET THE PAST DIE\\\".  While it is a bold statement\\, it is one the movie itself does not seem to reinforce.  The movie mocks fans who admire the original trilogies hero by forcing him make horrifically poor choices.  \\n\\nLuke has a bad dream about his nephew then contemplates killing Ben for a moment.  How this Luke the same man who put his life at risk to save Vader!?  Luke already wrestled with the Dark Side and won when he stood up to the Emperor in Episode 6. \\n\\nThe movie would rather us connect with new Heroes such as Vice Admiral Holdo\\, a female leader of the rebellion who inexplicably finds time to dye her hair purple while running from the First Order.  Holdo become the leader of the Rebellion after Leia suffers a serious injury.  \\n\\nThe movie also has several ham fisted messages that fall flat.  The anti-animal cruelty angle rings hallow in a galaxy that still has SLAVERY.  The casino planet mocking capitalism is laughable coming from a film funded by Disney   \\n\\nThis Star Wars saga is also one that wants viewers to respect diversity while introducing zero new non-humanoid characters.   \\n\\nIn short this film seems more interested in using their characters to lecture the audience about how terrible everything in the Galaxy is---rather than making any sort of lasting impression.  This movie mocks legends\\, which is appropriate...because none of the characters introduced in this Trilogy will be Legends.","true":true}