{"101487":177783,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The opening sequence of The Last Jedi begins as The Force Awakens ends; and in doing so creates a timeline overlap that only goes to amplify the jarring and blunt style transition taking place.\\n\\nThe newly simplified existing characters and their cardboard tag-alongs spring from one unconvincing scenario to the next\\, while the trusted writer\/director manically wipes the legacy slate clean. In it's place is served a large dose of passive and disposable entertainment that consistently fails to deliver enough internal logic to keep disbelief at bay.\\n\\nThe entire storyline to date gets unceremoniously rolled through a mangle and cut into a shallow and insincere Star Wars parody.\\n\\nInbetween the bizarre dialogue and poorly executed creative choices\\, we bear witness to tumbleweed one-liners\\, frown inducing sitcom set-ups\\, script-bending erratic manoeuvres and eye-rolling merchandise tie-ins.\\n\\nEvery time the story raises its game; poised to deliver some real grit\\, tension or emotion\\, it immediately disappoints with cheap audience-aware gags and cringe-worthy pop-culture references not of a galaxy far\\, far away.\\n\\nThe Last Jedi stands out like a sore thumb next to the succinct storytelling of The Force Awakens and the impressive cinematic impact of Rogue One.\\n\\nI seem to have found myself injected with a totally unexpected appreciation and respect for what George Lucas achieved with his Star Wars prequels\\, despite the significant flaws of their own.","true":true}