{"101487":170499,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Was.\\n\\nNot anymore after this awful movie.\\n\\nHilarious\\, as it looks like Disney\/Kathleen Kennedy finally got to Mark Hamill on Christmas as he has been vocal enough about his character that they destroyed.  See the headline below:\\n\\n\\\"Mark Hamill Regrets Criticizing 'Last Jedi' Version of Luke Skywalker\\\"\\n\\nAt the point\\, I had to review this since the latest PR machine story is trying to save this terrible film.  Watching The Last Jedi was like watching The Last Spaceballs.  Poe prank calls Hux on a cruiser\\, and then proceeds to Tokyo Drift an X-Wing?  And we are just minutes in.\\n\\nYou've heard and read many bad reviews of this film and people have nailed it.  How could we be mislead? I thought they would have hit it over the park after doing Rogue One (which I thought was very good).\\n\\nI actually read a professional review of The Last Jedi in which they stated Adam Driver aka Kylo had a \\\"beefcake moment\\\" being shirtless with Rey.  Could you possibly imagine Vader or Maul having a shirtless \\\"beefcake\\\" moment?  Hilarious.  \\n\\nLet's sink this ship called Star Wars.  Don't go to Solo.  Don't go to Episode 9.  I'm not buying the DVD of this stinker\\, and I will not give it the dignity to watch it a second time.  My kids don't care either.  I won't go to any more new Star Wars.  It's dead.  Forget JJ Abrams.\\n\\nThe way JJ will fix this Episode 8 is have Rey wake after a bad dream on the island with Luke.  That's the only way that this can be saved.  Rey will wake up after a long 2-hour bad dream and start to train with Hamill.\\n\\nTrust me.  You cannot unsee this film.  It's really that bad.","true":true}