{"101487":174878,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The is visually the best Star Wars movie. It’s has some great locations a picturesque moments. There is the right amount of humor and some of my favorite battles (Throne Room with the royal guards). The writing although was not great. The dialogue was fine but some of the situations had some things you could pick apart. There were not enough to ruin the movie but they were consistent if you looked for them. It is a fantasy movie so most will give the writers some slack. Here are a few that I remember\\, The plan to use escape pods vs. doing a cloaked warp drive. Poe makes is seem like it’s suicide to use the escape pods but the plan probably would have been much easier than the complex 3 step plan they had. Can a ship go half light speed? How come the big ships don’t care about small ships leaving to go to other planets to recruit code breakers\\, how did Kylo trick Snoke? How could Fin jump on a top of a walker so quick for an escape\\, opening a door into space to let someone is there is not even a cold breeze\\, when did ships get force fields .. isn’t that a Star Trek thing\\, If they have force fields why doesn’t tinge more advanced army have them\\, why can Poe easily shoot ten cannons off the ship\\, why are these huge ships not equipped to shoot smaller ship\\, because every battle I have seen it’s nothing but fleets of smaller ships trying to destroy them close up..... ok you get my point. I recommend not getting too caught up in the details and enjoy it.","true":true}