{"101487":97837,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Absolutely 100% crapola! Critics should be ashamed to rate this movie so high! I'd rate it 0 stars if I could! Terrible story telling of characters\\, terrible plot\\, all the new characters (Both good and bad) are unlikeable\/boring. Snoke was just axed before we even got any details on him or his back story. He was so over powered and to die so easily I mean come on! They killed off all the original cast characters that matter now. Made Luke's character turn a 360 personality wise and made him a weak broken useless shell of the character he originally was. He should have been a legendary badass. Filled the movie with political agenda bs. Made Rey over powered with zero effort\/training. No real lightsaber fight scenes to speak of our worth mentioning. Way to much stalling\/filler scenes that could have been cut out as they were not needed at all. Like the scenes of the way luke lived on the island by milking a weird creature or spear fishing etc. Why is this important to know\/who cares? I could go on and on. But one thing is for sure\\, this is the absolute worst star wars movie ever made hands down!! I see why so many hard core fans are pissed off at this movie and I would not blame them if they all stopped watching future chapters. I don't have any real interest to continue watching any further myself. All the characters I had any interest in are now dead\\, what's the point now? A 5 year old could have written a better story than this! Poor director choice and agenda is what killed star wars off!","true":true}