{"101487":105402,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a Star Wars fan and a big admirer of Episode 7\\, I feel obligated to give any others like me this warning before they enter the theater to view The Last Jedi. If you felt that JJ Abrams was able to re-ignite the blaze of hope within Star Wars fandom with The Force Awakens\\, than be prepared to feel like new director Rian Johnson is determined to extinguish that flame with all of the grace and respect of the guy who whips out his \\\"light saber\\\" to put out your campfire.\\n\\nIt's difficult to put into words how much of a disappointment that Episode 8 was. I can't say that it was bad just as movie. As sheer entertainment I'd rate it as 2.5-3 stars. It has some completely unnecessary subplots and characters\\, especially for a nearly 3 hour film\\, and I felt that it continually insulted the intelligence of the audience. But I suppose it was entertaining. This\\, however\\, is not the standard that  should be applied to a Star Wars feature.\\n\\nThis movie lacked continuity both within the Star Wars narrative as a whole and within itself. I'm with Han in that I'm pretty sure that's now how the force works. It was boring in parts\\, painful in others. Perhaps the biggest tragedy is that there is one moment in particular that if executed correctly could have made the entire movie worth it\\, warts in all. But unforgivable failure in story telling and writing bring the entire thing crashing down to a low that almost surreal. By the end I kept wanted something more to happen to justify the 3 hours of film\\, something to redeem it\\, but sadly\\, no. I won't add any spoilers but I will say that if you have spent any amount of time at all investing into the Star Wars universe since The Force Awakens\\, prepare to be let down. None of the burning questions of fans were answered satisfactorily and some were just dismissed completely. This is such a loss because the reason that these questions were burning was that the answers had the potential to make for such compelling cinema and story telling. \\n\\nDisney recently made it clear  that they were in love with Rian Johnson. It appears that perhaps this may have been due to his willingness to completely take in all of their profit minded marketing based ideas with shamelessly little regard for actually making a decent Star Wars film. Not everyone will hate this film. Some people will seem to actually enjoy it. The same way that some people enjoy the movie Frozen\\, or modern country music. If however you are searching for some movie magic that can only come from a film with some kind of a soul\\, than this is not the Star Wars movie you're looking for. \\n\\nHelp us JJ Abrams\\, you're our only hope!","true":true}