{"101487":146282,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wanted to like this movie and almost forced myself to try to\\, but I did not. To me it spits on the entire Star Wars franchise. The movie isn't even good if I turn off my Star Wars fan googles. The whole premise of the movie is that a capital ship cannot shoot another ship it is chasing for an eternity till they run out of fuel. They had no other sources to deal with the ship other than this? This makes no sense and was a bad idea to begin with. We sit there watching a ship shooting harmless blaster bolts at the other ship for a very long time\\, doing no damage.  Then it turns around later and blows up the capital ship by going into hyperspace through it...why not just do this all the time?\\n\\nThis was only 1 of very many problems I had with the movie. Luke doesn't act anything like his former character and the motives for what occurred don't add up to me\\, Snoke is ignored and tossed aside as an interesting character\\, Rey is ungodly powerful and skilled with no training at all\\, there is no actual threat that the \\\"bad guys\\\" pose anymore\\, all the interesting characters except Kylo Ren are dead\\, the Casino scene is very long and just as pointless....I can go on and on and really I have a hard time giving it 2 stars.\\n\\nIt is my 2nd least favorite Star Wars movie now and in some ways it is my least favorite. Some will love it\\, but I don't think they went over the movie in enough depth. It really makes this new Trilogy pointless in most aspects.","true":true}