{"101487":121851,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"For Star Wars fans this movie is an abomination because it ruins the Force\\,Powerscaling\\,Luke\\,Yoda\\,Leia and the Expanded Universe in general.\\n\\nFor normal people who knew nothing of the EU its just a regular bad movie because it has unnecessary arcs\/ a stupid or nonexistent plot\\, plot holes\/no answers and messy storytelling. \\n\\n1. Unnecessary arcs: The movie is allmost 2.5 hours long\\, yet around 1\/3 of it is basically filler that adds nothing to the story. (Casino Planet and Poes mutiny.)\\n\\n2. Stupid\/Nonexistent Plot: The Rebels are running away from the Empire and Rey is trying to convince an old man to change. Thats the plot of a 2.5 hour movie.....\\n\\n3. Plot holes and no answers : The actions taken by the characters + the events happening in a movie have to be at least partially believable. Or they have to deliver a satisfactoy explanation (Superman can fly because he has superpowers). The most important questions arising due to the setting of a movie have to be answered - especially in a movie that is the second part of a trilogy and not a stand alone movie.This does not happen:\\n\\nA few hours ago the First Order was limited to the Unknown regions (1\/4 Of the Galaxy) now they apparently conquered the remaining 3\/4 of the Galaxy in a matter of HOURS after just loosing Starkiller Base. HOW?\\n \\nWhile todays civillian Cruise ships have enough fuel for 24 days - hyper advanced military space cruisers have only enough fuel for 24 HOURS. WHY?\\n\\nThe Rebels have enough fuel for one more jump - yet instead of jumping into a New Republic system with a local defence fleet\\, or a system with an asteroid field\\, ect they just continue to fly casually away from the First Order Fleet. Also if the First Order already took over the Galaxy couldnt it have spared a single Star Destroyer to approach the Rebel ships from the other side? This whole chase doesnt make any sence.\\n\\nWho was Snoke? How is it possible that such a powerfull force user was never encountered\/hunted down by the Jedi or Sidious?  What did he do during the Clone Wars and the era of the Empire?\\n\\nHow can Rey be so strong in the Force? She performs feats of a Jedi Master without ANY training at all. Yoda\\, Sidious\\, Anakin and Luke - ALL Sith and Jedi in the movies and the Expanded Universe had to train - why doesnt Rey?\\n\\nSince when does the Force work like a magnet? (Leia scene)\\n\\nI could go on for hours - but I think you get the picture\\n\\n4. Messy storytelling: The story jumps randomly from one location to another back and forth back and forth back and forth....\\n\\nExcept amazing visuals and the occasional good scene - this movie is a disaster. A youtube reviewer or an amateur film maker could have made a better movie. \\n\\nDont believe the \\\"professional critics\\\".","true":true}