{"101487":169514,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"***SPOILERS****\\n***SPOILERS****\\n***SPOILERS****\\n\\n\\nHonestly\\, this movie had a very high expectation from most fans and it fell short for me. It is a \\\"cool\\\" movie but doesn't feel like a Star Wars movie. Before\\, you think I'm just an original trilogy snob\\, I liked all of the prequels\\, TFA and Rogue One as well. The biggest issue I have with this movie is that the dark side should be shown as a formidable foe for Rey and company\\, especially after the events of TFA. This just doesn't happen. Snoke dies in the most ridiculous way possible. He is able to EASILY control both Rey and Kylo but he can't feel a lightsaber turning towards him or sense that he is in danger? Without him\\, we have a teen going through puberty left to run the entirety of the The First Order. He can't even defeat another force user who has had little to no force training. Sure\\, Luke taught her some stuff\\, but he trained Kylo in multiple facets of the Jedi way. Not to mention that Kylo also received training from Snoke. I just find it absurd how terribly weak the dark side is. This movie is basically Empire in reverse. I don't know a single fan who can say that they see The First Order or Kylo as any kind of threat. We've already seen Rey either defeat him or tie with him when it comes to force ability. The villain should be feared. The heroes should have to overcome a great adversity to defeat them because they're so powerful. With Snoke gone\\, we are left with no one to fear. \\n\\nThe comedy in this movie is so forced that it's a joke. I'm fine with joking\\, in fact comedies are my favorite type of movie\\, but this was a joke shoved in almost every 5 min. Star Wars is a serious franchise. Comedic relief is great and is used during serious films all the time\\, but this was just too much. Halfway through the movie\\, I couldn't believe that they were throwing in this many and it only got worse. \\n\\nOverall\\, it was cool and a lot of scenes were awesome for a sci-fi movie. This\\, however\\, isn't just another sci-fi movie. This is STAR WARS. It is held to a higher standard than this. I really hope the final movie can somehow tie everything in and make sense of all of this. I just don't see it happening. If you're a Star Wars fan\\, go see it but don't expect to leave the theater feeling amazed. I left feeling disappointed.","true":true}