{"101487":133766,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have never been more gutted as a Star Wars fan. Where do I even begin?\\n\\nHow about the guy who triggered the events of the new trilogy? Who seduced Kylo and wanted Luke dead so badly. Who took over a fallen Sith Empire and saw the RISE AND FALL of the Empire according to the TFA Novel? He's is generic bad guy X. JJ built him up and Rian brought him crashing down. He was OP but couldn't detect a slow-moving lightsaber. OK!\\n\\nLuke? DEAD. Because force illusion across universe too draining something something? He doesn't train Rey with anything or give any real knowledge. Sit on this rock and breathe? Reach out so i can slap you with a blade of grass? I wont train you but then will train you only so you can see why you shoulndn't be a Jedi???\\n\\nREY? Story about her lineage hyped for YEARS? With call backs and dragged along for 1.5 movies? Where JJ said her parents are in TFA only to walk it back? THEY WERE NOBODY!!!!! TA'DA!!!!!!!!\\n\\nHux is a goof now? Being punked by Poe in a cartoonish way? He's human Jar Jar just flying and being kicked around? OK! BRAVO!\\n\\nPhasma? Useless again. No reprimand by Snoke for DROPPING THE SHEILDS IN TFA????? SHE SAVED HERSELF AND SACRIFICED STARKILLER! FORGIVEN!\\n\\nBut we'll let the JANITOR beat the HEAD of the Strom Troopers. And give her no screen time other than to die.\\n\\nAll Johnson wanted to do was create a Space Goodfellas. everyone got whacked.\\n\\nSAVE YOUR MONEY. Wait for redbox or your local library and rent it for free. \\n\\nim done with Star Wars. The EU was made LEGENDS for this shit movie. FU Pablo Hidalgo and the rest of you frauds at the story group too.","true":true}