{"101487":138124,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"In my opinion\\, this was not a good Star Wars movie at all. The resistance scenes were very predictable and dragged way too long. There was way too much unnecessary \\\"comedy\\\" in the movies...examples include furry creatures tumbling around in the millennium falcon\\, luke pumping green milk out some creatures breast and sucking the milk from a bottle like a mad man (no I'm not making this up)\\, the yo momma jokes at the beginning of the movie when Poe interacts with Hux\\, chrome dome jokes hurled toward Captain Phasma by Finn and I can go on and on with the corniness of this film. Also\\, it has some awful moments like Leia flying through space like Mary Poppins (I guess that was a Disney easter egg). Save the Jedi scenes\\, the rest of the movie was just dull\\, boring\\, and been there seen that. Also\\, I feel that there is a constant push in the new series to have women in positions of power. They are portrayed as wise and intelligent while the men are portrayed as beings with no self control and irrational. I'm all about women being in positions of power but you can definitely tell there is some type of agenda in the series in this regards. Needless to say\\, I feel the Star Wars franchise is close to destroying my faith that this series can be redeemed if continues on its current track. I do not believe I will be spending my hard earned money to see the next episode. This movie was just a let down in too many ways.","true":true}