{"101487":157618,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not just a bad Star Wars movie. One of the worst movies I've ever seen. Rian Johnson ruining one of the most beloved franchises is just the cherry on top. I actually loved the Force Awakens\\, but wow have they tanked this. Points below with NO SPOILERS.\\n\\nPositives first:\\n1. Wonderful special effects\\, visual storytelling and cinematography. Beautiful shots\\, colors\\, planets and interesting aliens brought the universe to life.\\n2. Solid casting and acting\\, though ruined by the dialogue and story (think how good Ewan McGregor is in the prequels\\, even though the story is lackluster). The cast is diverse which would have been refreshing had the plot been any better.\\n\\nNegatives:\\n1. The WORST STORY of any Star Wars movie. WORSE THAN THE PREQUELS. If you didn't watch the old Star Wars: the gaping plot holes\\, illogical characters\\, lack of cohesion and overall choppiness of the story should render it unwatchable. If you dis watch old Star Wars: it will destroy the characters you knew and loved in a way that makes no sense.\\n2. Following from point 1\\, the movie is too long and has terrible pacing. Entire subplots are unnecessary or don't make sense. Things get campy in these subplots\\, but get choppy and rushed for scenes where the audience needs more development. Underutilizes some characters and overutilizes others.\\n3. Dialogue is HORRID. Again\\, worse than the prequels. Cheesy one liners and humor sequences play like a parody of Star Wars. Think cringey one liners with insults like \\\"Chrome dome\\\".\\n4. Several \\\"cash grab\\\" moments clearly marketed to children. From the overuse of cute creatures to literally having children with rebel decoder rings. Don't inject marketing into the story please. It feels even worse when it's targeting kids who don't know any better.\\n\\nPersonally\\, I will not watch another Star Wars until this movie isn't cannon\\, the only exception being an Obi-Wan spin-off because Ewan McGregor will not live forever. I will never see ANY MOVIE with Rian Johnson as a director again. I don't know why Disney took someone who was clearly out of their depth (Looper and Brick and that's it? Really????) and handed them a franchise to destroy. He wrote AND directed this hot garbage.","true":true}