{"101487":196308,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where to begin? Rian Johnson decided that rather than make a decent movie\\, he would make a political statement. The fault lies with Disney for allowing a universally loved franchise to become the topic of such polarizing opinions. \\n\\nBut hey\\, instead of talking about all of the political messages that were prioritized above the actual story\\, let's talk about said story. So who is Rose Tico and why should we care about her? Why do she and Finn make a pointless trip to the casino? Why does nobody listen to Poe Dameron until it's too late? Why does RJ think that making Luke milk some weird alien only to drink it right in front of us would be funny? Why was Snoke built up\\, only to be killed in such an anticlimactic way in the second movie of the trilogy\\, AND without offering any backstory to why we should have cared about him as a villain. Why is Rey perfect at everything she ever tries\\, without having to practice? Why does RJ feel the need to add such stupid one-liners like having Finn call Phasma \\\"Chrome Dome\\\" during what is supposed to be a tense situation? As bad as the prequel trilogy was (from a dialogue and acting standpoint)\\, there was at least a big-picture story that was well crafted (Minus JarJar). Johnson took the blueprints for what could have been a great trilogy\\, and wiped himself with it... i hate you Rian Johnson. Because of you it is going to take a literal miracle for J.J. Abrams to salvage the trilogy into something even remotely palatable. Honestly though\\, my hopes are not high. For all the fan outrage at how terrible the plot is\\, the Disney team\\, Rian Johnson\\, and even JJ Abrams seem to be stuck on the mindset that to criticize TLJ is to somehow be sexist. As if because we don't like the film we are somehow threatened by a strong female lead. Its arrogance like that\\, which will guarantee that the next episode doesnt see numbers anywhere near the first two with regards to opening weekend. Disney sure has their work cut out for them. Oh yeah\\, and did i mention that Leia turns into Merry Poppins?? Terrible movie.","true":true}