{"101487":132127,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If I wasn't a Star Wars fan this movie would still be garbage.  Just from a storytelling perspective this film is jacked up.  There were setups in the previous film that Rian Johnson decided to payoff by wiping his ass with and tossing it in the trash.  He doesn't even flush it.  He puts it in the trash so the shitty smell lingers in the air just to irritate our sensibilities.  The payoffs sucked.  I guess in Episode 9 Abrams will be like:  \\\"hahahaha!  That was just a joke.  Here's what's up really.\\\"  Then we'll get the setup\/payoff we have been waiting for\\, but it'll be too late.  Rian Johnson already fucked it up.  I feel like Episode 9 will be about cleaning up Rian Johnson's cluster fuck of a film.  Unfortunately one movie wouldn't be enough to undo the damage that's been done.\\n\\nIt's not just the setup and piss poor payoffs that ruined this movie.  How he handled characters in The Last Jedi is terrible.  Mark Hamill said something along the lines of\\, he fundamentally disagreed with everything Rian Johnson wrote about Luke.  Totally understandable.  Nothing about Luke in The Last Jedi makes any damn sense.  I feel bad for anyone who has ever looked up to Luke Skywalker as a hero.  I feel even more sorry for Mark Hamill\\, he is Luke.  When you pour your heart and soul into something you begin to take ownership of whatever it is.  If you love your job\\, you take ownership of that.  You're proud of your accomplishments.  I can't imagine how this must make Mark Hamill feel.  Something very dear and very special to him absolutely destroyed.  That's the thing that angers me the most about this film\\, how Rian Johnson ruined the legend of Luke Skywalker.  I know that this isn't about Luke or the old cast anymore.  That doesn't mean you have to shit on and dismantle everything the old cast did.  You don't have to drag the original heroes through the mud.  \\n\\nWhat's funny is my expectations were low for this film.  I set them so low thinking there's no way I can be disappointed.  I was actually hoping I would be pleasantly surprised.  It's mind-blowing how shitty this film is.  But who gives a shit it made a ton of money.  So\\, we'll continue to get pathetic films\\, because even shit covered with frosting can rake in tons of cash.","true":true}