{"101487":166373,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Saw TLJ about 2 weeks ago. And I can't still come in terms with how bad this movie is. \\nI'm not going to go into the whole Mary Sue or \\\"SJW forced agenda\\\" territory to justify my rating\\, but I will point out the numerous gaps in the plot and also the dubious forced jokes.\\n\\nWhat really bugs me though is the fact that the movie really felt like a really bad B movie\\, where the Deus ex Machina teick is used constantly due to the shortcoming of the scripts.\\n(SPOILERS)\\nI was especially disappointed when the Rebel transport shield blew up (what happened to shields is anyone guess)\\, and a couple of scenes later we see the EXACT SAME bridge functioning as if nothing has happened. Considering the fact that the whole movie takes place within the span of a day (as far as the pursuit is concerned)\\, there is no way possible that they could restore a bridge in that timeframe.\\n\\nI also couldn't accept the excuse they gave for pulling Kylo Ren back into the First Order dreadnought  during the pursuit.\\nWhat does it mean we can't support you? He had just blew up the enemy hangar and Bridge\\, the transport had no guns and the other two cruisers weren't a threat too. There was no obstacle between him and the destruction of the whole transport. But apparently the director wasn't able to provide with a believable excuse of a malfunction or something in that line on Kylos ship. He just found a military jargon he doesn't understand (apparently)\\, and threw it in there to make his Deus Ex Machina work.\\n\\nI'm not getting into the territory of what this movie did for the SW lore\\, or the fact that most of the movie was non consequential and really threw away whatever plot points and points of interest were set up in the first movie.\\nSomething that you get a whiff of when you read the prologue\\, where somehow the First Order having suffered a crushing defeat at the hand of the rebels (the planetkiller base was their main base and apparently had the majority of their military equipment)\\, to being on the verge of conquering the whole galaxy within the span of few hours (since the movie starts right after the end of the previous one).\\n\\nThis movie has managed to kill my interest in seeing the last one of the trilogy. Simply just by demolishing everything\\, and leaving nothing of note to keep me interested.\\nFirst order is basically injured gravely\\, the rebellion consists now of about 10 to 20 people (the whole rebellion fits comfortably within the Falcon which also is the only spaceship they own)\\, Kylo is still a bad boy and Rey is a Mary Sue. No surprises no interesting cliffhangers not an interesting future for the trilogy either.","true":true}