{"101487":187834,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was an extremely disappointing Film.....\\n\\nThe Rebels and First Order are both full of estrogen....\\n\\nThe Rebel Admiral wears nightgown and has purple hair.....suicide hyperspace's into Enemy Capital ship.....this tactic would\/coukd have been used in any previous space battle by any star wars extremist group and would render most any Capital ship in the galaxy useless.......Lets Just Hyperspace into the Death Star in episode 4 instead?\\n\\nWe have new ridiculous characters with poor character development.....Mary Sue's and Diversity Hires...shoehorned in Toxic Feminism....\\n\\nThe 1st Order is silly re-imagine spin on the Original \\\"Empire\\\" \\nIt is clearly a comedic\\, degenerative re-skin of a certain German speaking nation circa 1933-1945.  Kylo and Hux are like emotion teenage boys\/(or girls?) whining and throwing tantrums....or in Hux's case an unbelievable character to portray a prestigious General...\\n\\nAdmiral Holdo is also guilty of ridiculous pick for a Military leader....No Uniform? No communication?  Suicide Hyperspace (this tactic...why?) it ruins the historical battles that could have just done the same thing with a droid flying the ship in every battle.\\n\\nWW2 Gravity Bombers?......In Space?....... in the Opening  Scene?\\nWhat happened to Y-wing bombers? Wha happened to all other Rebel style Vehicles from Original Trilogy and Video Games?\\n\\n\\nLuke character goes from lucky young dreamer to experienced pilot\/jedi knight......to breast milk drinking looney old man  full of regret.....not exactly the path we expected after so much character building in Episodes 4-5-6.......What a disgrace in screenwriting....clearly the writers wanted Han\\, Luke\\, Leia killed off ASAP.....to speed up re-makes\/spin offs\/ new episodes....\\n\\nIn a Star Wars EPISODE IV A New Hope and EMPIRE STRIKES Back......the EMPIRE and its Forces seemed a lot more....dare I say realistic in portrayal of British\/American Space Nazis's compared to the laughable boyish 1st Order.....what a Joke Disney.  \\nThe Original Empire was as if Nazi Germany and the Imperial Empire of Japan Joined Political and Religious Ideologies and learnt to Space Travel.......Truly one of the Scariest Nightmares of an Enemy.....to a generation or two of people born post WW2","true":true}