{"101487":184328,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is a massive disappointment from start to finish. I began to type out everything wrong with this movie but reali into my 8th line of the reviewthat I wasn't even done with the opening sequence so I've cut it down to the abs simplistic examples. But first what I liked.\\nThe Yoda Sequence\\nThe throne room 2v10 fight\\nThe Anakin child scene at the end\\nThe light speed suicide(why has no one done this ever? Too convenient? Why couldn't the medical cruiser do this earlier?)\\nWhat I hated.\\nPoe's ridiculous fighter pilot skill\\nMultiple instances of gravity applying normally in space\\nLeia Organa can fly in the vacuum of space using the force with no protective gear whatsoever\\nA depressurized room with no airlock? Eh who cares let's open the door for Leia. Not like anything bad will happen.......seriously nothing bad happened. This was the perfect time to kill off Leia Organa.\\nEverything to do with Luke(completely out of character)\\nFinn & Rose(Let Finn go out like a boss\\, I've never seen a forced love-interest character as bad as Rose)\\nCanto Bight(slavery=bad\\, animal cruelty=Bills ad\\, rich people=bad)(This sequence was completely unnecessary and takes you out of the movie. I could write a chapter on everything wrong with this decision\\, and it gets no payoff)\\nConstant\\, unadulterated Convenience. Everything was so ridiculously convenient at the last second that by the midway point I didn't care about any bad positions anyone was in.\\nCaptain Phasma\\, Rey's parents\\, Snoke\\, Knights of Ren\\, etc.\\nHoldo not actually explaining the plan to Poe. Just saying we're going to fly away.\\nExplanations for everything =weak as fu**\\n\\nI really want to go on but I really need to go but this is the first movie I've ever seen that was so unfaithful and wrong that I can off the top of my head come up with better ideas for 99% of these scenes and sequences which I know for a fact would be recieved well. Listen to your fans you idiot Rian. And get your ass away from the Star Wars franchise","true":true}