{"101487":118165,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-03","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Enough time has passed that I can finally review this film.\\n\\nBeing a big star wars fan\\, it took me a while to digest everything that's happened...\\n\\nLet's begin with the positives: this movie is beautiful visually... really beautiful. The colors\\, the scenes\\, the costumes\\, CGI is coherent and breathtaking.\\n\\nThe plot... I saw the movie on the premiere... didn't know what to think... saw it again a week later... The more time passed I realized the story is very weak. The opening sequence is quite okay but from there it goes downhill... I will keep it short because it would be wayyy too much reading otherwise:\\n- Admiral Ackbar killed off screen\\, new and unlikeable character of Amylin Holdo takes what should be his place - worst part is that she doesn't reveal any survival plan for the Resistance leading to an unnecessary mutiny of Poe (why would on earth would she keep it for him?)\\n- Canto Bight - a hazard city where Finn and Rose are supposed to find a hacker is set to be both: another social commentary as well as some comic relief. It feels weird having this when the Resistance is at a brink of destruction\\n- Rey is not trained by Luke at all (despite him promising 3 lessons). Luke's character is desecrated\\, he is inconsistent with the ideals he fought for throught the original saga. Worse yet everything Luke achieved is undermined by his actions.\\n- in the final clash between The First Order and what is left of the Resistance a couple stupid things happen: Finn who became a human parody is denied a meaningful sacrifice by Rose - the Resistance uses unarmed? fighters but after half of them are shot down Poe calls the whole thing off? why? what was he expecting?? Rose rams Finns fighter risking both of their lives anyway... it took them like minutes to get to the cannon that threatened the resistance and we are supposed to believe Finn made it back on foot? with Rose on his back? while the whole First Order watched? Jesus...\\n- Rey's parents are drunkards? she succeeds in everything just because?\\n- the biggest let down of the movie of course is the fact that Luke doesn't come to the aid himself... He projects himself which is obvious: no marks left on the surface\\, he has that damn lightsaber that was destroyed 10 minutes earlier etc Then Luke dies after the effort. Really??? He didn't even tell the Resistance fighters to run.\\n\\nSorry for the bad writing... Long story short the movie is set to deceive us on every step. Every plot hole is resolved in a unsatisfying way\\, just to shock you. This could have been such an awesome movie\\, so many oporunities were wasted (Kylo and Rey switching sides). Now the damage is done and I really don't know what they can do to fix this and save IX.","true":true}