{"101487":132046,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I finally get it - this movie Red-Pilled me.\\n\\nI finally get why Trump won. This movie was a wakeup call for me. I lean left and a registered Democrat and finally understand why people would support Trump and I never believed their criticism when it comes to mainstream culture. These left-wing identity politics destroy everything. NFL\\, Religion\\, everything - now Star Wars - just to push a fake outrage that is completely fabricated.\\n\\nI visited right wing movie review site like https:\/\/www.reeyaa.com and checked out Forbes\\, WSJ\\, Breitbart\\, and The Federalist to see their perspective and review. I never visit these sites but they were right. I cannot trust Rotten Tomatoes anymore. This movie really woke me up about MSM and Democrat politics and tactics. IMDB will probably delete this because they are part of the MSM network.\\n\\nI am disheartened by this movie. I am a long time Star Wars fan. I collect everything Star Wars and this movie really disrespects the previous episodes and the mythos. All I hear from defenders are - \\\"Oh\\, you are not a true fan\\, it's a different approach and you are just a hater\\, nothing they do will make you happy.\\\" What!!! Excuse me\\, would you like to see my house\\, my collection\\, the years and money I've put in to this franchise. I defended the prequels and The Force Awakens. Take off your stupid bias goggles off and try to understand how they just destroyed the universe. This movie is now canon. All previous episodes and characters are pretty much worthless now. The younger generation grew up liking Transformers will probably like this movie. I knew something was wrong at the beginning of the movie when they had their Spaceball moment. No other Star Wars movie has stupid comedy like that. Star Wars is space opera\\, a Western in space.\\n \\nI can go on forever on how bad this movie is. Not just as a Star Wars movie but just as a movie in general. Luke\\, Snoke\\, Superwoman\\, R2D2 everything about this sucked. Screw you Kathleen Kennedy - there is no point watching the next episode. I have no desire and couldn't care less about the remaining characters.","true":true}