{"101487":175998,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The lost Hope!.\\n\\nThe whole movie could have been a 25 minute sequence of a greater one..it felt like making the asteroids chasing sequence of Empire Strikes Back into a complete film...\\n\\nIf you take the skywalker last name out of the movie and change the name\\, it could have been a greater story.\\n\\n\\nGreat movie... but not for the original saga... \\nNo main character\\nNo main plot\\nWeak pace and rhythm\\nIllogical timeframe\\nToo much emphasis on useless sequences\\, too little important sequences\\nConfusing moments\\, wasted second act.\\nDisrespectful to the Jedy History\\nNot Funny.. K-2SO was much funnier\\nGeneral Hux destroyed\\nYoda? Not even close...\\nAdmiral Akbar died by choking with seafood\\n\\n\\nNo time to explore the character's personalities. Undeveloped\\nLuke's story line destroys the family legacy\\, \\n.....Its like making a Indiana Jones film showing that he always was a Nazi Spy!!.\\n\\n\\nGreat cinematography\\nBravo Mark Hamil!\\,.. even acting against his own feelings towards luke\t\\nBrave effort\\,.. \\nGreat music\\nSFX.. as always.. great\\nSnoke dead sequence.. a nice surprise moment.\\n\\n\\nI hope there will be a smart fix on the next one\\,... like:\\nLuke has always been dead\\, that is why he was unable to leave the island\\,.. and he was in a temporal half living stage due to the strong force he has.. and all we saw\\, was his path to finally become one with the force... or some thing like that...","true":true}