{"101487":133684,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have been looking forward to seeing the Last Jedi since the end of the Force Awakens two years ago. Though that movie was OK\\, I felt it was far too much a copy of a New Hope but it still half worked. It posed interesting questions going forward\\, and as it was seen mainly from Rey's point of view (an abandoned child on a backwater planet) we still had the mystery of galactic politics and the First Order to be revealed. \\n\\nSo where the Force Awakens only half worked for me\\, it was entertaining. Alas\\, its sequel falls flat in so many areas that when I left the cinema I was genuinely disappointed. \\n\\nSPOILERS BELOW: \\n\\nIt all stems from the writing and the plot. Fans of the Last Jedi and movie critics seem to praise it for something new: but this isn't new. In fact\\, it is almost a carbon copy of Empire Strikes Back (Rebels on the run after being hounded out of a base\\, try to get help from a 'charming' character\\, Jedi apprentice on a location with a Jedi Master). It also steals the throne room scene from Return of the Jedi\\, giving a slight twist that left me more puzzled than entertained (that Snoke bit!). Finally\\, it ends up with Luke returning to grant the remains of the rebels time enough to escape a battle which is so like the battle of Hoth that it's just ridiculous. \\n\\nSo there is actually very little new in this film\\, and the determination to kill off the older characters leaves what is left on very shaky foundations indeed. I pity the writer who has to put episode 9 together with the leftovers - time will have to be devoted to explaining Princess Leia's absence after Carrie Fisher's death\\, and the main antagonist now is so weak that I can't imagine the First Order will hold together for duration after suffering 2 catastrophic defeats. \\n\\nOnto specifics of why I didn't like this movie then: \\n\\n1. Plot holes. In some movies you can let these slide\\, but not so in this one. The main rebel scene involving a sublight spaceship chase is so contrived it's actually frustrating! Why don't the First Order ships just hyperspace a single ship to cut them off? We know it's possible as it is done later in the movie in reverse. This type of writing makes me think they took the audience for granted and is just unforgivable. \\n\\n2. Character motivation only for plot. With the writing being so weak\\, character's motivations are highly suspect but needed to get them to go from A to B or so something to move the plot forward. The big one here is Rey surrendering to the First Order after being with Luke for about 2 days and not learning anything. Rey has only known about the Force for no more than 3 days or so\\, as The Force Awakens and the Last Jedi take place back to back and yet she still thinks that she senses good in Kylo Renn and surrenders herself to him and Snoke just to convert him back to the light. This is without any knowledge of Snoke and his abilities\\, and comes immediately after Star Killer base was used to commit mass genocide in the Force Awakens that killed billions\\, perhaps trillions of beings. It just doesn't stand up to the simplest scrutiny. Bad motivation also rears its head with other characters in the film and forces them to make stupid and lazy decisions to move the plot along: such as Rose knocking Finn's salt-speeder off course to stop him making the final sacrifice to save the Resistance. It's just lazy and incompetent story telling. \\n \\n3. HIGHLY derivative new characters; DJ is Lando again without the charm\\, Max Katana is basically a female gun slinging Yoda whose appearance in the film left me puzzled than entertained. \\n\\n4. No thought from a trilogy point of view (no questions answered from Force Awakens). Don't they even have a story arc of where they want the characters to go? It appears not - apparently Rian Johnson was given free rein over this when he pitched his script and didn't cross-check it with the movie that went before. OK\\, I don't mind having things left unanswered but they have to be done in the right way\\, not just ignored. \\n\\n6. Character failures: Luke's character was dreadful. More so his reasons for becoming what is supposed to be in this movie. He's turned his back on everything and has abandoned all the teachings of the Jedi because \\\"they were so arrogant they let the dark side rise.\\\" Hang on Luke - the Dark Side is rising again without the Jedi (this might have been better done if we knew more about Snoke!) and Luke's belief that the Jedi should end is basically taking out the only safe guard of Force users in the galaxy. Without any training\\, do you think more people growing up with these powers will go to the Dark Side? Of course they will! Grrrr. The internal logic of this film is just awful. Luke's solution to a problem basically consists of \\\"If I just walk way from it it will go away.\\\" Even Mark Hamill said he fundamentally disagreed with this version of Luke - and I think he is 100% right. \\n\\nI really don't understand how critics can have ignored all these points. There are good things: the effects and cinematography\\, but these are just fluff when the story and logic is so poor. \\n\\nIt's a real\\, real shame\\, as this could have been a good movie had the writing been more on the ball (though it is still a clone of Empire and the throne room from Jedi). \\n\\nA wasted opportunity that flies wide off the mark and will leave many viewers disappointed.","true":true}