{"101487":176080,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Thematic Spoilers possible\\, I am kind of vague though. \\nI'll start by saying I've been in love with Star Wars since I accidentally watched The Empire Strikes Back first as a kid in the 80s. The lore was fascinating. I've been enamored ever since. The Last Jedi is the bravest film in the series since Empire. Both films expanded and contradicted the established lore in masterful ways. Both turned the saga in bold directions. Both are\/were divisive when first released. I was speechless when The Last Jedi ended. The bittersweet taste in my mouth left me stunned. My childhood heroes came full circle and closed the arc. But\\, that end scene filled me with hope. This film was about moving on\\, healing\\, and seeing hope when there is no reason to hope. Every main character learned a lesson\\, every single one. It's okay to let go of the past to embrace the future. But\\, what truly matters is the here and now. Be in the moment. Be a spark that ignites the future\\, but you don't have to burn up. Just a spark. Rian Johnson has crafted a film that will stand up as one of the best of the saga with time. He showed us that hope dwells in all of us. That ghosts of the past can fade and that's okay. That nobody can be somebody and it's up to us to loosen our shackles of expectation. The very last scene will be with me always. I understood the message and I have hope for the future of Star Wars. Rey is our new farm boy. Kylo is our new tortured villain. But\\, the future doesn't matter. They're not bound to the cycle before them. Neither are we. Rian Johnson broke the damn mold and stepped on it in the most respectful way possible. Bravo\\, you've got Bantha sized testicles\\, sir. I'm anxious to see where it all goes unchained. My heart was broken\\, put back together\\, and filled with hope. Fiction is rarely this daring and good at the same time. See this film.","true":true}