{"101487":171580,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Take \\\"Star Wars\\\" out of the title and you still hot a hot mess. A movie that insults the audience with almost every frame. From ignoring the laws of physics to an absolute ignorance of the 40 years of work preceding it; this movie will stand as the  absolute worst of the saga. Disney and Co. need to do some serious soul-searching after this. \\n\\nOf course it will make money\\, but unfortunately that isn't a metric for success within a saga. This movie may have done irreparable damage to all future star wars films within the hardcore and casual fan base. It has retroactively ruined the series\\, something I didn't think was even possible?!? It feels like Lucas sold the rights to Disney knowing that they would screw up (and badly) thereby making the prequels look like works of genius. Frankly I'm embarrassed for the actors having to go through this\\, and the executives should be ashamed for this being the last time we'll see Princess Leia. What a terrible last film to have attributed to an otherwise wonderful career. RIP Carrie\\, you deserved better. \\n\\nSpeaking of deserved better:\\nWhen the man who literally defines Star Wars (other than Vader) tell you \\\"this is wrong.\\\" it's time to take a step back and think...\\\"Hmmmm\\, maybe this isn't such a good idea after all.\\\"\\n\\nKudos for a beautiful film and the score was top notch\\, but these are expected. Huge plot holes\\, gimmicky gotcha moments\\, literally contradicting itself in the next scenes. It's just awful. \\n\\nSave your money.","true":true}