{"101487":194591,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well\\, now I can't say anything bad about the prequels!\\nI don't know who I am anymore.\\n\\nCan you just imagine for a second how bad that makes this movie? It was a complete epic fucking disaster!\\nI don't think there's anyway for the brand to recover from this catosteophe. As a lifelong fan of the series\\, I never thought I  would say that I would never be seeing another Star Wars movie again! I used to WISH for more Star Wars movies!\\n\\nLet me put this situation into a little more perspective. I am the biggest movie buff that's I know off. It's been my passion for as long as I can remember. And NEVER has a movie made me this violently\\, physically\\, and emotionally\\, sick and upset before. And I've probably seen a few hundred thousand so far!\\n\\nWriting 101 people; it's all about the payoff. It's the first thing they teach you when your a literature major\\, your suppose to foreshadow events\\, and in that PROMISE payoff. Get it\\, boys and girls? This movie disregarded ALL THE SET UP from the Force Awakens. And SHITTED on all our expectations for seeing Luke Skywalker again. He didn't even get an epic lightsaber fight. It was a HOLOGRAM\\, and the lightsaber NEVER CLASHED. WTF!!!!!!\\nThe expanded universe WAS BETTER.\\nWHY?!?! Why did they bring back the originals if they were going to treat them this way. \\nIf they hated the characters so much\\, they should have never had them in it to begin with. They should have kept the expanded universe and made the character legendary figures in world\\, because they sure didnt use them. \\nAt the very least\\, the prequels didn't DESTROY the original characters. What he did with Anakin didn't matter because that was leading up to Darth Vader in the originals. He didn't make Darth Vader revert back into a whiny teenagers. Which would have even been better then what they did with Luke!","true":true}