{"101487":147724,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I would rather have to f**k a Porg whilst sucking one of the four tits of that cow thing Luke was milking on the island as Jabba the Hut sodomises me with Kylo Ren's light saber and Jar Jar Binks repeats hs annoying catchphrase endlessly\\, ... than have to watch this film again.\\n\\nJar Jar Binks making an appearance would have probaby improved the film. It was just so fucking awful. Luke chucking the light saber away. The stupid fishing. Is Luke gonna eat all that fish? All the Jedi's knowledge is in what\\, five books? The awful stilted dialogue. The wooden acting. Rey looking a little podgy. The fish-faced fucking Caretakers from the Never Ending Story. Weaponising hyperspace. So why didn't they just do that with the Death Star? Fuck off with the Porg thing. Shove your stuffed Porg merchandising up your a**e! Luke being a hologram\\, but it's hinted at a couple of times because he's not leaving a red footprint like the other guy you saw earlier whose sole purpose was to stand outside a fucking bunker\\, just fucking stand there\\, so they could show the ground was red under the white salt. FFS. 3 lessons to train a Jedi and she doesn't even complete one? There's a dark evil below the island? Oh\\, no\\, that must be bad. Oh\\, it's ok. It's just a cold pond and a spooky mirror. Leia going all Superman. Just fuck right off. The whole Finn\/Rose side show. Pointless. A thief locked in a prison cell\\, but he can get out anytime he likes\\, just chooses to wait until these two clowns turn up. Gravity bombs. Last surviving bomber cliché. A fight scene reminiscent of the LOTR scene with Elrond and Saruman vs the 9. Snope's missing back story. His obvious monologuing. The supposed chemistry between Rey and Ren and Finn and Rose. The tedious starship chase scenes. Crap purple haired leader from The Hunger Games. The only action she ever saw was in a hairdresser. Luke wanting to kill Ren in his sleep - even for  a split second? Nope.","true":true}