{"101487":100851,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A hot steaming amateurish mess of pointless subplots and missed opportunities. \\n\\nI am a long-time Star Wars fan. I remember the magic of seeing the first movie in 1977. I understand that the franchise needs to grow and change to stay relevant. That's not my problem with this movie. I'm fine with diversity. I love the female protagonist. The Force Awakens was derivative of the original Star Wars\\, but it gave us some interesting set-ups\\, including a fascinating protagonist (Rey)\\, a mysterious bad guy (Snoke)\\, and the promise of Luke's reemergence. This movie capitalizes on literally nothing. \\n\\nThe storytelling in this movie is just bad. That's true both internally and in the context of The Force Awakens\\, which set up a bunch of interesting questions that this film never answers. Even worse\\, this film tells us the questions were irrelevant. OK\\, fine\\, but then why bother asking them at all?\\n\\nSPOILERS AHEAD: \\n\\nThis movie is disrespectful to fans. It is ultimately kind of stupid\\, too. Like who the heck was Snoke? How'd he build a massive empire in 30 years? And then he's toast and I'm supposed to go along with petulant man-child Kylo Ren as the big baddy? Please.\\n\\nAnd then there are the plot holes and needless digressions and sheer stupidity of the setup. The First Order can't blow away a few ships until they run out of gas? The stupid jaunt to the rich people's casino so that they can get a hacker? Leia not dying when she's out in SPACE after having the bridge blown to bits? \\n\\nMark Hamill turns in a good performance - kudos to him. But the whole Jedi training thing was just lame. Rey gets what\\, like 3 minutes of training and now she can do anything because.... why? Luke\\, who was the very spirit of optimism\\, considers killing his nephew? Um\\, no. \\n\\nI feel bad writing a bad review\\, but I feel compelled to because the critics' score is so absurdly high that I feel like the audience needs to tell the truth - especially to those of us that love this franchise and hate to see it steered off a cliff.\\n\\nI respect Rian Johnson's desire to break new ground and take risks. There might have even been some kernels of good ideas in the script. But this script just didn't do it for me. \\n\\nThis is the first review I have ever written  on this website. I feel compelled to write one because I keep reading press from critics about how good this movie is. Don't believe the hype.","true":true}