{"101487":198525,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars movie ever! I actually joined RT so I could post this as I'm so pissed off. The resentment for this film is real and not a bunch of paid for posts from a troll living in his basement. Haters gonna hate? Piss off you soulless Disney drones happily apologizing to yourselves that this 2 and a half hour train wreck was any good. Any REAL SW fan will hate this installment.\\n\\nI was there in 1977. I became an instant fan like so many others. A pure fan and by that I mean one who was not sidetracked by the fringe books and other nonsense \\\"canon\\\" that followed years later.  SW changed the way films were made and experienced. It heavily influenced my life and even dragged me into the film industry. To watch the magic and soul of the SW universe be so callously crapped on in this feeble attempt at \\\"being different\\\" is nothing short of infuriating.  I don't even know where to begin. So much about this film blows. Rose the diversity hire? The needless side plot to the casino? Leia channelling Mary Poppins? Vice-Admiral what's-her-name\\, fresh from the Resistance prom on deck 20 to take the lead while Leia thaws out. The core plot about a bunch of slow assed ships chasing each other until one of them runs out of gas!? What is this\\, Battlestar Galactica!? By far the most egregious slap in the face is the way Luke was handled. I hate to break it to you younger SW fans but this story is not about Rey or Finn or Poe. It's a Skywalker story. It's Luke's story. At least it should be. Kennedy\\, JJ and the SJW's at Disney have forgotten this. Killing off Luke is so cliche\\, so predictable. I'm so tired of the worn out apprentice comes back to kill the master plot device. Why the hell be a master then!? Kylo is Luke's kill...not Rey's. But that's where these douche bags are taking the story. Any reason I had for watching Episode IX went up in flames. I never thought I'd ever say this but I wish Lucas was back at the helm. Star Wars is dead to me. Thanks Disney for destroying my childhood.","true":true}