{"101487":101131,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"All in all The Last Jedi is another triumph for the franchise\\, but one can't help but wonder if it could have been written neater to seem less like 3-4 episodes of a TV show and more like an actual movie.\\n\\nFor a film that runs so incredibly long it sure as hell doesn't address quite a few plotholes either. We still have no idea who\\, how or where Snoke came to be or who the alleged \\\"Knights of Ren\\\" are that Kylo took with him in his rebel against Luke. It also has time to create new plotholes like how did Rei suddenly become so adept with a Lightsaber when Luke literally taught her no combat skills or why is Finn still considered a main character?\\n\\nIt fails as a sequel in the sense where it races to tell us more before resolving questions inspired from it's predecessor. \\n\\nThis isn't to say The Last Jedi is 152 minute failure though\\, in fact outside of the former problems mentioned I think it did an exceedingly great job bringing new character ideas and story elements into the franchise. Especially the relationship between Kylo and Rei as they walk parallel with each other in discovering their connection\/role with the Force.\\n\\nA lot of the subplots went beyond expectations because it's arguably there just so there's epic Sci-Fi battles to be had (A necessity in a Star Wars film\\, no?) I was really impressed with how much newcomers Dern (Admiral Holdo) and Tran\/Ngo (Rose and her sister) quickly became favorites on screen.\\n\\nI stepped out of the theater exhausted but still pretty satisfied with my Star Wars experience. Like The Force Awakens there's a lot of nodding to existing lore in the franchise and a lot of new stuff to sink your teeth into\\, I just wish it was written and presented more efficiently.\\n\\nThere seems to be a lot of the general negativity from fanatics. They're probably just unhappy with where they're taking the story or certain characters\\, it's unfortunate but loyalists will always hold onto that sense of entitlement.","true":true}