{"101487":113434,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"C- movie. Here's what I'd change. SPOILERS.\\n\\nPoe- no \\\"your mom\\\" joke. Instead of defying Leia\\, have the First Order focus all their energy on jamming his radio playing on the crank call and give a reason why Poe wasn't able to call back the troops...it's still a failure\\, but not a court marshal worthy blatant disregard for chain of command. \\n\\nLuke- Push back the Aniken lightsaber and say\\, \\\"It's yours now\\\" implying Rey may be the reincarnation of Aniken and avoiding the SNL-esque overhead toss... Luke from 4\\, 5\\, and 6 would never think of killing a pupil in his sleep\\, much less his nephew for \\\"bad thoughts.\\\" Luke is the guy who found the good in Vader...have the exchange with Ben Solo be like having a tough kid in a principal's office he said\\, he said argument that turned into a fight then Ben comes back and eggs the principal's car... it just makes no sense that Luke would attack Ben while he was sleeping. Have Luke tell Yoda\\, \\\"I've read this frontwards and backwards and they still don't make sense\\\" with discussing the Jedi texts instead of suggesting the guy with nothing to do on an island didn't crack a book. This also adds to the mystery of the force and challenges people have with religious texts.  Do something about \\\"the hair\\\" comment. Just have it be anything else. Anything. \\n\\nLeia- have the shot by Ren's minions be less of a direct hit making Kylo's hesitation on the trigger actually matter. Have Admiral Akbar (spelling) go flying out of a bay door\\, have Leia use the force to close the bay door by force touching a button\\, have her slam into the door as it closes injuring her but avoiding the ridiculous space walk. \\n\\nFinn and Rose- make them look like they actually like each other\\, get them much closer to the guy with the corsage before getting zapped\\, have Rose hotwire the AT-AT. \\n\\nBB8- no slot machine slapstick\\, no hotwiring the AT-AT.\\n\\nLaura Dern's character- recast someone who actually looks tough and general-esque. Not waif. Have her tell Poe the plan after Finn and Rose are in jail already showing that her stubborn streak was a problem as well as Poe's trash talk.   \\n\\nD.J.- best character in the new movie. \\n\\nRey- I liked her. \\n\\nKylo- I liked him. \\n\\nSnoke- no gold jacket. Have him looking beyond arrogant as Kylo slices him up as if he is beyond sure Kylo is under his command.\\n\\nFirst Order General- I liked him.  \\n\\nYoda- way too cheesy. Let Luke set the fire.","true":true}