{"101487":169499,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS! \\n\\nSo Disney took one of the most courageous cinematic heros and turned him into a coward... Luke was happy to sit on an island to die whilst the galaxy was being destroyed by his nephew... Luke also was not interested about seeking revenge on Snoke for corrupting his nephew or attempting to win Kylo back from the dark side...\\n\\nWe dont know who Snoke was? Rey's parents were nobody... The Skywalker saga is over...\\n\\nWhat Disney did do good though was getting in a scene for Vegans\\, a scene for the LGBT\\, a scene for animal rights activists\\, a scene for feminists (actually multiple scenes). Its Star Wars not SJW Wars.\\n\\nI gave this move 2\/5 and not 1\/5 because there are a few things that I liked such as Rey and Kylo's character development. I also know that Star Wars will not be able to develop as a new franchise with Luke Skywalker. Luke is basically a wizard. He will always be a fan favourite and with him around it would be hard to move forward with future installments... I hope he still appears as a force ghost though! Luke's finale could have been better...It was like seeing a concert of your favourite band before they retire and they only play one song. There was a nostalgic niceness to it though but an extra minute of light sabre action would have made it fantastic.\\n\\nI really hope the next installment will be better. The family element is gone though and Rey has beaten Kylo before.\\nFingers crossed.","true":true}