{"101487":169259,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"[SPOILER ALERT]\\n\\nReview will contain SPOILERS.\\n\\nThings to hate about this movie:\\n- The bad guys aren't so bad – they're pathetic. They're not imposing\\, they're just really incompetent. It really beckons how they became that powerful to begin with.\\n- The master code breaker Mcguffin (think casino planet). The side quest that really achieved nothing except reveal that good and evil aren't so clear-cut. If you take this Mcguffin out\\, the outcome won't change.\\n- I thought Finn liked Rey? What's he doing with Rose? Rose is annoying. Period. She offers nothing in the movie. If you took her out\\, the movie might actually improve because ...\\n- Finn might actually go sacrifice himself and save his friends? See why Harrison Ford thought Han Solo should have died in Empire Strikes Back.\\n- The Battle of Krayt. Pretty stupid. They went into a fortress only to mount a David v Goliath battle?\\n- The space battle. So very boring. Fuel shortage. And a secret escape plan that leads to a mutiny which then leads to a lesson?\\n- Hyperspace kamikaze. How stupid does everyone have to be in the Star Wars universe not to just build a bunch of X-Wings and let a bunch of droids kamikaze the Death Star and Star Killer base. Why should a big space ship or ANY space ship be intimidating?\\n- Jedi ghost Yoda can still manipulate the physical world through the force. But that means... \\n- Obi-Wan and Yoda are jerks. Death Star 1 and 2 could have used help? Luke & Darth duel in Empire Strikes back? Just saying.\\n- Leia flying with indignity through space. How does anyone forget that? Maybe she should have died in space. Like everyone else in that ship's bridge.\\n- Captain Phasma. The trilogy's equivalent to Boba Fett – coolest masked figure of all time. Like Boba Fett\\, meets a pretty pathetic death. Unlike Boba Fett though\\, she didn't achieve anything in her appearances. \\n\\nThings I loved about this movie:\\n- Luke is a quirky hermit like Yoda and probably Obi-Wan. Got (teal) milk? – cheesy\\, yet I like it.\\n- Luke's first Force lesson to Rey. Funny\\, yet insightful. I seriously don't know why people don't like this. \\n- Luke's sacrifice.\\n- Yoda (still) teaching Luke about the Force.\\n- Throne room fight.\\n- Rey's origins: nothing (supposedly)\\n- Kylo Ren usurping Snoke. \\n- Kylo Ren's internal struggles: dark side of the force\\, family\\, Snoke. Adam Driver FTW!\\n\\nMeh:\\n- Porgs.\\n- Rey's journey into the dark side cave. I'm too stupid to understand this. Someone please explain it to me.","true":true}