{"101487":146336,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wanted to wait a bit before righting a review on this movie. I didn’t want to just make a snap judgement\\, I wanted to reflect on the movie and my feelings towards it. That being said my gosh this movie is an abomination to the Star Wars Universe. The film is beautifully shot and the score is fantastic\\, that however are the only two pluses to this film. This is not a Star Wars movie but a Rian Johnson movie with Star Wars Characters in it. I am by no means a huge Star Wars fanatic... I LOVE the original trilogy and I own all the movies and have seen them countless times and Luke Skywalker was my first hero in film\\, but I don’t own every toy or piece of memorabilia and have not read all the books so I may not be the best person to criticize this movie. From my understanding of the Series however this movie contradicts so much. LUKE would NEVER act like he did in this movie! Rey is somehow the greatest Jedi in the history of the Galaxy with no training at all and literally learning she has force abilities about 2 weeks ago. Seriously she overcomes nothing\\, has any story arc that is compelling or explains any of this\\, it’s incomprehensible to me. Snoke who is more powerful than Vader and the Emperor gets bested by a whiny Kylo Ren with relative ease. I disliked so much about this movie is ridiculous. I avoided spoilers or reading or watching anything about this movie before seeing in\\, part of me wishes I wouldn’t have and perhaps I could have avoided this travesty. ","true":true}