{"101487":114598,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Dear Disney\\,\\n\\nLet the past die. Kill it. \\n\\nThat point was hammered home this weekend. Repeatedly. Not just to the characters on screen. But\\, also\\, to the audience members watching. \\n\\nStar Wars has become\\, for millions\\, more than just a movie franchise. It's part of us. Part of our childhood. One of the few things we get to take with us and pass down to our children. \\n\\nThat died this weekend. Disney killed it.\\n\\nIt is clear that Disney is trying to move the franchise away from the Skywalker's and make the saga about something entirely different. That's fine. I get moving it forward. Introducing new characters for a new generation of fans. But why do it at the expense of the original and prequel movies? Even episode VII now seems greatly diminished. Why release a sequel that then renders every important aspect from the previous film as irrelevant? \\n\\nFrom a business perspective this seems a grave mistake. If the original Star Wars were to be released today it would not be the phenomenon that it is. It'd just be another good movie amongst a plethora of other good movies. What makes Star Wars unique is the lure. The nostalgia. It keeps people talking and reading about it. It keeps parents bringing their children to see it so that they can share a special time when they were a child. Maybe have some nostalgia of their own to pass down. I fear that nostalgia was crushed and we've seen the end of Star Wars. Not a new beginning like Disney hoped. \\n\\nOf course\\, it won't be the end. Disney will push forward and continue to push out movie after movie\\, year after year\\, until the fans finally say enough is enough and the box office numbers don't make sense. But\\, that's not what it means for Star Wars to end. \\n\\nWhile The Last Jedi\\, on its own\\, is a good movie\\, it cannot be judged on its own. It is not\\, nor should be\\, considered its own movie. It has a history. A history it ignored. A history it tried to kill.\\n\\nMaybe Episode IX can save the day. But I won't know. I won't be watching. Nor will my children. They'll have to find their own nostalgia now. \\n\\nI'm too old to get excited about new movies. About new characters. I have too much reality to deal with. My love for Star Wars was different. Star Wars felt like something tangible. Something I could pass down to my children. Something I could share with them. Now. Well...\\n\\nNow I have to let it die.","true":true}