{"101487":180955,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film is a disappointment. \\n- It hurts to see how Disney put political subplots in this film by force f.e. feminism or Chewbacca and the vegetarian incentive scene \\n- This film lacks of story writing as Ep. 7. F.e.: The casino scenario was an unnecesary filler and the spaceship hunting worth for a 30 minutes episode.\\n- The caracters did not make any developments\/tiny sidesteps or grew. F.e. Rey is still a Mary Sue\\n- The film's logic is aweful. F.e. Luke Skywalker is probably THE most iconic hero in the film history and his backward thinking and his death were caused cheaply; Snoke is still unknown and his dead has no big impacts because there was never a history to him\\, Leia making the Superman-Move\\n- Disney destroys loved characters cheaply and replaces them with unpersonal ones: f.e. Admiral Ackbar's Death. He would have earned the ship's destroying move and not Captain Purple Unknown.\\nOne last sad thing: Now there are qualified Regisseurs and politicians but no good story tellers. George Lucas handed out a possible script which was apparently not given much credit. The EU had so much good output! Timothy Zahn with Mara Jade!\\, Jaina Solo! and Thrawn! The Yuuzhan War Conflict had been a very good Triology f.e.. So much development on this franchise grabbed in the next garbage tin. In contrast people gets popcorn cinema which is worth 1 look but not for more. This franchise is dead.\\n\\nOnly 3 things are positive at this film: John Williams epic music\\, Mark Hamill's performance and luckily no 5th Death Star. I see that thing saved for Episode 9 directed by Jar Jahr Just-do-it-Again Abrams.","true":true}