{"101487":154741,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Movie was horrible I wish they never made it. There were some enjoyable parts but the script didn't hold up to the standards of a billion dollar franchise!  So many problems with the movie... First of all I'm not even sure what Jj Abrams is going to do with part 3 this movie killed off  snoke 1\/2way through ... So much for the big bad guy they were trying to build in a story arc. Who was he? No one knows and it doesnt matter now. What happened to the tractor beam? This was technology developed in star wars new hope ep4 and yet the current destroyers couldn't use it to pull back the rebels who kept their distance the whole movie. Don't get me started on the ending that was a waste of a character who we built the last trilogy around . ok so I get you want to build around new generation characters but who are they? They ruined Reys backstory after they are the one's who built it up last movie? If its not important then why didn't u just tell us that last time. As4 Poe how are we supposed to admire him when his plans killed thousands of rebels. His loose lips discussion of plans with Finn led to the bad guys learning the secret ...ok well that killed all the rebels. Ham solo never made mistakes like this. As for Fin who is he? No character building has ever been done on the mew generation characters and now we are 2 movies in and dont know anything abt any of them ... Meanwhile while we were 2 ep in on the George Lucas movies we knew a lot about all the characters. Whether it was Luke\\, Anakin\\, Padma\\, Obi\\, or Han the character dvlpmnt was much better in the past movies . the current character dvlpmnt is lacking .... Who are these people? How is it possible that before To become a Jedi you needed to enroll in an academy as a youngling\\, years later become a padawan \\, then a Jedi years later.... Now Rey skipped all those steps\\, Fin goes from being sliced in the back with a saber to being paralyzed to running and fighting and beating Phasma within the course of days\\, also there are no efforts to develop secondary characters !!! In the last movie we knew abt Lando\\, Boba Fett\\, Ackbar etc... This movie is so determined to kill off old classic characters they didnt bother building up their new characters first ...? Now we are heading into a 3rd movie and dont know any of these people","true":true}