{"101487":156881,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not anything. No. I did not enjoy it. Ill be nice and start with the good. Great cinematography. It's absolutely stunning. Action scenes are great. Even acting is better in my opinion. But then\\, it all just goes down. So the movie is just one big chase sequence with about 5 stories being thrown at you at once. With 2 of them being anything important and 1 being interesting. And I'm not even going to get started on the whole backstory. Basically its can the rebels escape the empire? This part should only take up one arc\\, but no\\, it needs two. Which is about the worst part. Then it's can Rey learn the force? Which takes up 3 arcs. I was okay with two of them. But we get little screen time on those. Then it's all coming together. Everything comes to one last desperate push. Btw\\, just about 3 of the previous arcs now mean nothing but screen time. So back on topic\\, this one lady does something that would've just solved everything in the first place. But it doesn't? Then how does it? Anyways now everyone is on this salt planet and just holding out. People ask if something could be possible for escape. Answer is no. Luke comes in\\, now the answer is maybe. Anyways\\, Kylo and Luke fight\\, rebels escape\\, and it ends. About none of it made any difference except\\, SPOILERS\\, Luke dies from nowhere just cause\\, and Snoke dies\\, in a way that they just show you cause we don't like surprises here. Also Luke is completely out of character because he tried to kill Kylo and that's why he's evil. So Luke now just hates everyone and everything. It's like they tried to pull off Logan in this movie with Luke and it just backfires. There's just three things they could've done easily. Cut out about 3 of these arcs so they can work on the important ones and do a bit of editing to cut out what gives away these surprising moments. Then there's this part where Leia dies and she flies back to the ship no explanation no questions. Really? Ugh\\, so anyways\\, great cinematography. Like one joke I heard people laugh\\, I kinda chuckled. Nothin else. Best way to summarize the movie is the way Luke reacts when he grabs his dad's lightsaber again. Just chuck it out.","true":true}