{"101487":146790,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was one of many kids who grew up before smartphones and YouTube and obsessions with race and gender. I imagined myself immersed in the Star Wars universe for hours on end through toy blasters in the yard\\, books and action figures. Creativity and originality won the day. Then In the real world\\, Disney is the First Order with their greedy consuming entertainment monopoly. Rian Johnson is Kylo Red erratically murdering and burning down everything on an emotional whim. And Kathleen Kennedy is Vice Admiral Holdo. We didn't know she had this much power to make stupid decisions until it was too late. Now we can only watch as nothing is explained with each step closer to obliteration of all we invested in.\\n\\nUpon first viewing\\, the opening action\\, wit & anticipation keep you engaged\\, even when the story grinds to a snail's pace for a side quest with less merit than Jar Jar Binks' backstory. At least that wasn't political and preachy and only lasted 5 seconds. There are so many shocking moments that you don't have time to piece it together sensibly until you escape the jarring cloud of red dust.\\nAs you mull it over\\, frustrating disillusionment sets in with the absurd decisions the characters make. \\n\\nThis movie puts the nail in the coffin of professional movie criticism. They're more out of touch with reality and the public than Po Dameron was with the pathetic leadership hierarchy of the \\\"resistance\\\"\\, which is astutely named in this new series since the Rebellion could actually fight and win through unity.","true":true}