{"101487":168524,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Some of this movie I can't believe people are taking seriously.  Luke milks the udder of a huge sea cow\\, then drinks it?  Uses a 50 foot fishing spear to harpoon a cartoon fish?  Leia seems to die in the vacuum of space\\, then Mary Poppins herself back inside?  Poe does an \\\"I'll hold\\\" routine with the senior First order bad guy?  This was all so numbingly stupid.\\n\\nThen there were the logic errors - like Luke's hiding out... on THE sacred force island (ie not some random island hidden somewhere) - wouldn't Snoke and Kylo know where that \\\"special force island\\\" is?  And books?  Books have NEVER been seen in a original trilogy SW film before - why now?  And if you could use hyperspace as a weapon\\, then why didn't the rebellion use this against the Imperial fleet above Hoth (in ESB) or Endor (in ROTJ)?  And force projection?  I guess Yoda never heard of that in ESB so he could aid Luke in his battle with Vader.\\n\\nAnd don't get me started on the treatment of THE CORE OF STAR WARS\\, Luke.  Ready to murder his nephew?  Throws his lost saber away - as a joke?  And is ready to toss the Jedi and the Force into the dumpster?  Lame\\, lame lame.  Hamill was absolutely CORRECT about the utter disrespect for a much-loved character.\\n\\nOh\\, and should I mention how Rey's face-off with Snoke is simply Luke's face-off with the Emperor (in ROTJ) but with the NAMES CHANGED?  Exact same things said and occur.  And the Crait battle - Hoth battle ripoff (they apparently were smart enough to change it form an ice planet to a salt planet\\, but then used Snowtroopers anyway.)\\n\\nI'm giving this film two stars but it should have been one\\, solely for the lame Finn\/Rose casino subplot which was a horrible waste of everyone involved time.  Benecio was utterly wasted in a Lando knock-off role.\\n\\nDisney - please reconsider Rian Johnson for future SW films.  This one was a disaster.","true":true}