{"101487":130380,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I definitely don't think that this movie is as bad as everyone makes it out to be. There are loose ends and some unanswered questions but the thing I disagree the most is the treatment of Luke's character.\\n\\nMany tend to see that Luke was out of character and unreasonable. I can only think this - people change. It's been what\\, 30 years? Of course we won't have the same person as we saw in the final scenes of ROTJ. It seems like it was uncharacteristic for Luke to lose it and go against Ben when he was a student\\, however\\, we have seen Luke lose his control and succumb to his emotions. In his fight with Vader\\, Luke went berserk\\, lost himself\\, and almost killed his father. Seeing an unemotionally unbalanced Luke isn't something so surprising. \\n\\nAnother reason for Luke's actions against Ben? Snoke had Ben so cloaked in the dark and clouded his mind so well that Luke most likely saw NO sign of good in him. In a recent Star Wars graphic novel (of course I forgot the name)\\, it was said that Snoke had touched Ben's soul since he was in the womb. How could Luke possibly see the good if Snoke has been in his grasp since birth? It was different for Anakin\\, that's why Luke was able to see the light in Vader. Totally different situation. \\n\\nI wasn't a huge fan of the light humor\\, it came up at the wrong times or just didn't work. I wish they either went in depth on some of the new characters\\, didn't give them a lot of screen time (aka Rose and the purple hair commander)\\, or left them out entirely. The plot seemed a little weak and there were too many good coincidences for it to be believable. \\n\\nAlas\\, I can savor the Rey-Ben relationship that this fulfilled amazingly (every seen with those 2 were my favorite) and the interactions with Luke and Leia. Hell\\, anything that Luke was in. \\n\\nNot the best\\, but not entirely the worst. Plus BB-8 kicked ass and I'll forever love him.","true":true}