{"101487":122989,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"God awful film that takes the comparative mythology of Joseph Campbell and throws it in the trash. A waste of time and space (I don't mean this figuratively either). Rian Johnson's complete lack of respect for the source material is apparent in all of its disgusting glory. I was no fan of the force awakens but it was a harmless film that did little to damage the overall story that existed within the Star Wars universe. This film is a desicration of that film and everything. It was like a complete slap in the face to JJ Abrams and the producers who worked on the first film. Snoke the villain? Dead. Rey's lineage? No one cares apparently. Emo Kylo Ren who has zero gravitas in this film compared to Vader? Made the heir apparent villain to the future films. A proper conception of Good vs Evil as dictated by the consultant and mythological founder of this film Joseph Campbell? Good and evil are all relative. Jedi lore? NO MORE. Luke Skywalker? A pathetic excuse for a jedi... I walked out of there with the heaviest heart imaginable. Critics don't understand how we view Star Wars and the universe. It was a timeless good vs evil space opera that made sense in the grander scheme of things. This film is a desicration of all of that and more. Good job Disney....thanks for taking a dump in another epic story. Can't wait until you guys make The Lion King 3 and make Mufasa into a child abusing psychopath who was a dictator in the pridelands...","true":true}