{"101487":138800,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really don't understand the glowing praise this movie is receiving. I wanted to like it but was certainly hesitant after hearing all the flak from audience critics. Storytelling is a mess here with a poor plot\\, completely undeveloped characters\\, and some of the good parts are little more than rehashed bits of ESB and ROTJ.\\n \\nThe movie feels like it goes out of its way to shoot down any expectations you had.. Dare to want answers from VII? Too bad. Dare to want the universe and characters fleshed out more? Too bad. The movie basically adds nothing but subtracts a few beloved characters along its meandering way. Spoilers follow: \\n\\n-The best main plot you could come up with is a car chase in space? The movie also picks up right after VII\\, so how is the resistance already nearly crushed immediately after the destruction of starkiller base? \\n-If you are running low on fuel\\, why didn't they just make the jump to the rebel base the first time? There is no reason I can think of why they came out of lightspeed in the middle of nowhere.  \\n-Why has no one else ever thought of using lightspeed as a weapon before now?\\n-Completely pointless sub-plot on casino planet. It literally does nothing for the plot except get more resistance fighters killed in the end. Hamfisted moral messages abound that were unneeded. It just gives Finn something to do which is a disservice as I liked his introduction in VII. Here he suffers the same fate as many in that he doesn't see any further character development\\, just stagnation. \\n-Rey: I think the actress does a fine job but the character is the problem. There's nothing interesting about a hero or heroine who is just automatically good at everything with almost zero training. At this point in the previous trilogies Luke and Anakin had both lost a fight and a hand\/arm. While that would probably be called rehashing here what happens with Rey? She gets a scratch\\, can lift huge boulders after 2 lessons from Luke\\, and already knows everything she needs to know according to Yoda.\\n-Yoda cameo was a surprise and was....something. But I feel inclined to agree with another reviewer because how do you make Yoda look worse today than 30+ years ago?\\n-Everyone's already talked about Leia in space. Not quite as cringey as I feared but...yeah. Also who decided it makes sense that the character still alive from the OT is the one whose actress is deceased? \\n-Wasted villians: Snoke was kind of interesting here\\, but is killed pretty quickly\\, in a rather ridiculous fashion. Then there's Phasma\\, who still comes off as a badass for the 2 minutes she's in the movie. It's funny for the \\\"most diverse\\\" Star Wars ever the female villain is hardly there. Why? \\n-The humor: As everyone's noted it feels almost slapstick or Marvelesque and it just doesn't gel with this franchise. \\n-Rose: There are comparisons with Jar Jar for a reason...\\n-Admiral Holdo: First glimpse of this character and she's rude and condescending to Poe and refuses to tell him the battle plan\\, because plot reasons. Namely that the plot couldn't survive if common sense was used. She was woefully underdeveloped and then dies. Pretty much the theme of this movie. \\n-Luke: Just too much to say. Some of what they did might have been interesting deviations in his character if done competently\\, which it wasn't. It became a mangling.\\n\\nI get the \\\"let the past die.\\\" The torch had to be passed at some point but a little respect and competence for the characters that made this franchise shouldn't be too much to ask. Not only does this movie disrespect the old characters\\, it does zero development on the new ones. Just like the movie itself\\, they end where they began. In other words\\, nothing has been accomplished and no growth has happened. That's the feeling this movie left behind. There's no excitement for IX because anything interesting begun in VII was intentionally slapped down in this movie to \\\"subvert expectations.\\\" \\n\\nIn so many words this movie was a disappointment when it should have been epic. They had plenty of plot threads they could have used\\, fleshed out the state of the galaxy and the characters\\, used Luke properly\\, etc. They did none of it. The resistance is almost wiped out at the start and they're almost wiped out at the end. The end. Oh wait it's not. Little slave child on casino planet using the force. So you leave with Disney taste in your mouth. Bleh.","true":true}