{"101487":171101,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Such a mess! Where to start? Besides the meaningless side stories and Holdo causing a mutiny because she’s in charge\\, the biggest problems stem from (1) the heavy-handedness of the dialogue and (2) the complete emasculating of the original trilogy’s main protagonist (aside for the nonsensical sacrifice at the end). [SPOILERS] Regarding the heavy-handed dialogue\\, I mean does Rose really need to loudly announce “now to find the Master Codebreaker!!! He has a pin on his lapel!!! Remember!!!”? This was already explained and discussed ad nauseum. I hate watching movies where the director thinks the audience is stupid. And its not just the dialogue\\, the heavy-handed treatment of the morality subplot was also off-putting. Yes\\, I get it\\, the universe has sleazy people that gamble\\, sell weapons and use child labor. I think this was understood in the original trilogy as well. There was no need to have monologues about it and muddle the pace of the film. Don’t misunderstand\\, maybe there is a good movie to be made about the Jedi stopping broader injustices in the universe but the way it is presented here seems cheesy and does not do the seriousness of the issues justice. Regarding Luke\\, I was disappointed to see that he was no wiser than he was in TESB. He even had to be dressed down by a comical Yoda just as he was 40 years earlier. Would have been great for him to have the wisdom of someone with his age and experience and not be addressed as a teenager (and be as moody as one). There are many other problems which I’ll leave unaddressed here. The bottom line is\\, while TFA made left me wondering about the fate of our heroes\\, TLJ left me without any interest at all in seeing the next installment. Even TPM didn’t do that.","true":true}