{"101487":185051,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is second only to 'The Blair Witch Project' as the most overhyped movie of all time. \\n\\nSome observations:\\nGeneral Hux - a strange amalgam of Moff Tarkin and Barney Fife.\\n\\nBen \\\"Kylo Ren\\\" Solo - There is no possible combination of DNA from Carrie Fisher and Harrison Ford could produce Adam Driver\\n\\nCaptain Phasma - and the point of this character is... ?\\n\\nMaz Kanata - ibid\\n\\nWeird sea creature with silicone implanted cow udders - The scene could have only been made worse by having Luke get squirted in the eye\\n\\nLight saber toss over the shoulder - Who doesn't toss away irreplaceable family heirlooms like an empty can of Bud Light?\\n\\nFaster-than-light capable interstellar starships - Who would've guessed they get such crappy gas mileage?\\n\\nDeath Stars\\, tie-fighters\\, X-wings\\, blasters\\, etc - all made by Halliburton - I certainly feel hoodwinked. Don't you?\\n\\nPoe Dameron - if only someone had realized sooner that friendly fire can be a good thing\\, there would be more than ten people left in the \\\"resistance\\\"\\n\\nSnoke - immensely powerful\\, immensely old. How old is he? What species is he? Where and from whom did he learn how to use the force? How did he gain control of the First Order? It's a good thing they killed his ass otherwise we would all be forced to contemplate satisfying answers to these questions.\\n\\nHas it occurred to anyone else that Jar Jar Binks has a deeper back story than Snoke?\\n\\nRey - By golly isn't she a fast learner? I bet she could even show up on 'The Voice' and win that too.\\n\\nDisney has fatally wounded Star Wars. It will not recover from this. The mythos is ruined forever\\, and there is no fixing it.","true":true}