{"101487":113502,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Coming out of this movie I was extremely dissapointed. There are several good things in this movie but unfortunately the bad outweighs the good. Rian Johnson takes all of what was set up in The Force Awakens and destroys it along with several plot holes. He ruins the story of Rey's parents (apparently they are just nobodies)\\, we don't learn who Snoke is\\, the character of Luke is treated extremely bad\\, and Johnson gives us a unnecessary Finn and Rose side story that is cringe worthy. There is a really silly and laughable seen with Leia that may go down as one of the worst scenes in the history of Star Wars. Also why is there a fleet of star destroyers just shooting at one rebel ship when they can deploy all of their bombers and other ships after it? Why doesn't Admiral Holdo just tell Poe her plan to evacuate instead of just letting him mutiny against her? Perhaps one of the worst things is the new character of Rose\\, who apparently falls in love with Finn only hours after meeting him and she gives him one of the most cringe worthy kisses in a movie I've ever seen! And the whole point of her and Finn going on a side adventure has no point! The characterization of Luke Skywalker is a huge letdown in this movie and may be the biggest crime committed here. If they are going to kill him off anyway why not just have him show up in person at the end instead of a hologram? It is as if Rian Johnson just didn't care and basically screwed everything that was set up in The Force Awakens!\\n\\nNow there are several good things in this movie too. The acting is for the most part is good. There is a excellent fight scene with Kylo Ren and Rey where they fight Snoke's guards. The visuals and battles are amazing. I would say this movie had the potential to be great and it has alot of good things about it but ultimately the story direction Rian Johnson went with along with certain scenes ruins this movie for me. JJ Abrams has his hands full if he is going to be able to fix the mess this movie created with the storyline.","true":true}