{"101487":150036,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Like so many others\\, this movie was such a disappointment to me.  I felt like we waited 2 years to see what Luke was going to do when Rey handed him the light saber.  2 years of buildup.  That closing scene of the Force Awakens showed us so much emotion on Lukes face.  It felt like the whole world was on his shoulders.  Years and years of emotions pent up...almost consuming him.  I absolutely could not wait to see what he said and did.  And he tossed the light saber over his shoulder.  ARE YOU KIDDING ME?!?!?  We wait 2 years for that?  Luke has not once\\, in any movie\\, told a joke.  And for the sole reason than to shock the audience\\, he throws it over his shoulder.  I literally looked over at my brother and said out loud \\\"are you kidding me???\\\"  I get it.  I really do.  Avengers makes billions of dollars.  Hollywood has stumbled on to the whole \\\"we should make action movies funny...because they are better\\\".  And for the most part\\, it's true.  Avengers IS better because they are funny.  But this isn't Avengers.  And Luke isn't a comical character.  And that was just the beginning.  That scene with Admiral Hue on hold.  Are. you. kidding. me?  The spend the whole Force Awakens making him a pretty decent bad guy.  Yelling.  Killing people.  Ruthless.  And in a 30 second clip\\, he's completely neutralized.  Worthless.  Comic relief.  They wasted all that was created for him in TFA in 30 seconds.  Star Wars is not meant to be funny.  Iron Man is a funny guy.  Luke is not.  Yoda was funny in the Empire Strikes Back before he revealed himself to Luke because it was part of his test.  As soon as he revealed himself\\, he was not funny.  He was not funny in any of the prequels.  They ruined Yoda.  They made him play the same character he played before he revealed himself to Luke.  But that's not Yoda.  That's Yoda acting.  \\n\\nAnd I can't even begin to comment on the ending.  Again\\, for the sake of shocking and fooling the audience...Luke dies.  Oh\\, I get it.  We know you have to eliminate princess Leia...we KNOW it.  Because she's passed.  So you fool us.  You keep her alive and you kill Luke.  Nobody every saw it coming!  You guys are awesome!  Great job fooling us!  Cuz that's what Star Wars is about!.\\n\\nI've waited years to see Luke unleashed.  We got to see Yoda in AOTC.  We got to see Obi Wan and Anakin.  We got to see Darth Vader in a way that we could only dream in the ending of Rogue One.  Now was our time to see Luke.  And you guys almost got there.  Until we learn that it's fake.  A \\\"hologram\\\".  And then\\, to add insult to injury\\, we learn that it kills him.  It took \\\"too much for him.\\\"  He was just \\\"too powerful\\\".  Are.  You.  Kidding.  Me.  I've waited years to see Luke unleashed.  You just took that from us.  And now we can never get it back.  And because all these paid critics say \\\"best movie ever!\\\" Hollywood is going to keep making them this way.  \\n\\nI read a review that summarized it well.  Disney and Rian Johnson just took decades of blood\\, sweat and tears\\, decades of stories\\, of directing\\, acting\\, innovations\\, countless people devoting countless hours....and they just threw it on the floor and stomped on it.  You can't do that\\, guys.  But you did.  You did it so that we would be \\\"shocked\\\".  Because that's what you thought Star Wars was about.  \\n\\nHere's what it's not about.  It's not about Luke dribbling cows milk all over his beard.  It's not about Admiral Hux looking pathetic.  It's not about Yoda coming back like a friggin kid.  It's not about Leia floating through the space.  It's not about Snoke getting chopped in half because we didn't expect it.  It's not about any of this crap.  It's not about countless story lines created in TFA that were tossed aside.  It's not about being \\\"fresh\\\".  It's not about being \\\"funny.\\\"  \\n\\nStar Wars is more than just a bunch of movies.  It's more than just a vehicle to make money. Somehow\\, watching it as kids\\, it became part of us.  \\n\\nAnd you took that from us.  And that's more than disappointing.  I know it probably sounds lame...but I can't stop thinking about what they just did to something so important to me.","true":true}