{"101487":176193,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-10","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The most beautiful looking Star Wars film I have ever seen. Sublime sets with very convincing aliens and environments. Cannot speak highly enough of the visual effects of this film. Truly some of the best of this generation.\\n\\nI have two favourite scenes which are the only two which I am particularly fond of. The Throne Room fight and Kylo vs Luke. I thought Andy Serkis played an awesome Snoke - his voice still gives me shivers. I loved the pure hopelessness everyone had around him due to his immense and truly unrivalled power. The Throne room fight was just cool. Nothing else to say there. Despite a couple of annoying plot points around it I just really enjoyed it. Interesting choreography although I would have liked to see some cooler moves. I thought the dynamic between Rey and Kylo was very unexpected and left audiences wondering how they would act towards each other next. General Hux seeing Kylo on the floor was an interesting idea too. They hate each other and betrayal is not out of the question.\\n\\nLuke vs Kylo had some cool shots in it however I did not like the conclusion of it. Mark Hamill did a perfect job in his role but I definitely did not like the character that Rian Johnson had written for Luke. I have to say that Kylo's character has definitely become my favourite after this film and I am very excited about where they take his narrative next. He is a fractured man with unpredictable tendencies which really adds to the story nicely.\\n\\nNow\\, I pretty much hated everything else. There is a lot of hate on this film across the internet and to be honest I think a lot of it is justified. The film felt very much like it was solely there for money and nothing else. Obviously a lot of movies are these days including J.J. Adam's Star Wars: The Force Awakens. However I felt that\\, while it had many flaws\\, Star Wars 7 had a fresh take on the Star Wars universe with compelling new characters and a story line that the franchise could really sink it's teeth into. But with The Last Jedi it had many\\, many plots holes or just completely illogical scenarios. It was barely a continuation on from number 7 and just really served to be a weak story with lots of merchandise\\, cheesy and cliché moments with a Star Wars label stuck on it to take in billions. The writing was poor at best and really dragged the movie down for me. It was very obvious that the movie was a complete suck up to a general audience with no real continuity\\, feasability or attention to detail. I ended up leaving the theatre quite disappointed in what I had seen.\\n\\nThere was no attempt to align the previous film with this one. All major plot points seemed to be cut off completely. Rey's parents\\, the Knights of Ren\\, Snoke's character\\, the hope everyone had in Luke etc.\\n\\nThe under lying political ideologies seemed too prominent for this film. While I would have not normally minded\\, it was just too obvious. While I actually agree with some of them\\, I thought the double standards for racism and sexism were so blatant that it was hard to ignore.\\n\\nFurthermore\\, the slapstick of this film was difficult for me to get accustomed to. I tend not to like cheap humour type films and this was the same. I really wanted to have an epic story line like the trailer portrayed and not the absolute cheese ball that the film farted out. The cheap humour in many scenes just displayed a huge lack of understanding of time in the film. From things like Luke throwing the lightsaber over his shoulder in the beginning (which is probably the most significant object in all of Star Wars being passed down through the most important 3 generations of characters) to the part where Rose knocks Finn's ship out of the way of the cannon and stops him from sacrificing himself and saving the rebels.\\n\\nThe characters. Oh dear. After this film Kylo is DEFINITELY my favourite. In fact\\, so much so that I am leaning towards the dark side now in my preferences of the force. Po Cameron was a good side character. I enjoyed his involvement as a talented pilot. General Hux was quite fun. Princess Leia was ok as a character. Now\\, I hated everyone else. The portrayal of Luke\\, I thought\\, was just sad. I didn't like it at all. I have almost completely lost interest in Rey now. Finn is far too cheesy for me. Rose is the most piece of shit character I think I've ever seen. Captain Phasma was wasted again. I found there were far too many irrelevant people.\\n\\nIn conclusion\\, it's a disappoint to me\\, the fans and the franchise. I only hope that the next one is much better. Nothing more to say.","true":true}