{"101487":136574,"Last Jedi":"Last Jedi","2017-12-15":"2017-01-28","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm going to throw this out there to begin with: The Last Jedi was not what I was hoping for out of this story. After The Force Awakens\\, I was extremely excited at the prospects of what would happen in the next film. With that out of the way\\, I understand as well that this story could all be a ruse and the real revelations will be in the third and final film of this trilogy. If that does end up being the case\\, I will go back and correct this review as necessary. Until then\\, this was a good\\, but not great follow up that has several problems outside of my own personal bias. The most unfortunate being that it is simply too long and sluggish to justify being the longest Star Wars film to date. They could have cut out the entire casino subplot and the film would have been better off for it. I also have read other people say the climax happens and then we get another 40 minutes of film\\, which I also agree with. Director Rian Johnson has gone on record to say the first cut of this film was over 3 hours. I can't imagine what they cut out\\, but it couldn't have been worthwhile. One minor complaint I have that is probably pointless to mention\\, but nonetheless bothered me\\, was the decision to go back to the puppet Yoda. The CGI Yoda was not even close to being a problem in the prequel trilogy and I thought the use of the puppet Yoda in The Last Jedi was laughable. I enjoyed the CGI Yoda of the prequel trilogy\\, but ultimately this doesn't hurt the film as much as it does just make me wonder why they made this decision.\\n\\nNow that I have gotten my complaints out of the way\\, let me say that this film has one of the best scenes of the entire series. The scene with Kylo Ren and Rey fighting together after Snoke gets cut in half got my blood pumping and I thought it was brilliant. Absolutely the highlight of this film and the new trilogy so far. The action is fast\\, relentless and plentiful in this film. The performances are also very good by the main cast throughout. I find Kylo Ren to be a very fascinating character and one of my favorites of this new trilogy. I always tend to gravitate towards villains rather than hero's\\, but Kylo Ren has a little of both in him and I like the juggling act they have continued with his development and Adam Driver's impressive performance nails it. I look forward to seeing how they finish this part of the story. The special effects are not as in your face as some other Star Wars films\\, grounding it more in reality and giving it the darker tone they were seeking after the beautifully colorful and lighthearted Force Awakens. Many people have discussed the new style of humor not fitting Star Wars\\, but I disagree. Star Wars has always juggled light humor and heavy emotions very well and I enjoyed the new humor of this film. Watching Luke taunt Kylo Ren towards the end of the film was hilarious and another highlight. \\n\\nUltimately\\, I found more positives than negatives in my first viewing of The Last Jedi\\, hence my 3  1\/2 star score. I think the director change hurt more than anything as Rian Johnson completely threw away the story they had and started his own version when he took over for J.J. Abrams. Luckily\\, Abrams is coming back for the final film and I have full faith in his abilities. I look forward to seeing if some of the complaints I stated are corrected in the final chapter and I can look back on this film with a new perspective. Until then\\, I am moderately satisfied and I'm happy with that. Star Wars is still Star Wars after all and we never thought we would get another main installment after the prequel trilogy finished to begin with. I will never take this series for granted and the people claiming this killed Star Wars are just flat out wrong.","true":true}