{"101487":152675,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Made a Rotten Tomatoes account exclusively to review this movie. \\n\\nLast Jedi gets one and a half stars for being a beautiful looking movie that provides the audience with pretty cool space battles\\, lightsaber battles\\, and halfway decent comedy (I know I'm in the minority on my opinion of the comedy though).\\n\\nNow\\, on to the bad parts. Last Jedi is a movie that is so bad from a storytelling perspective that it actually retroactively makes The Force Awakens and even some of the original trilogy worse. It breaks many rules within the Star Wars universe and makes virtually all of the worst decisions possible with the plot lines that were set up in the previous movie. It also fails to mention some fundamental questions for even moderate fans of Star Wars (like myself) to understand the movie. Some major flaws include:\\nHow did the First Order get so Powerful and the \\\"Resistance\\\" so weak between Episodes 6 and 7? Having the resistance whittled down to literally one ship makes all of the struggle in the original trilogy useless.\\nHow much training does it take to be a Jedi? The previous 6 movies would make it seem that it takes years of intensive training to use the force. However\\, Rey uses the force with great skill and with no training. Initially\\, we thought this was because she is the daughter or granddaughter of some great Jedi. However\\, we are informed that her parents are \\\"nobody\\,\\\" which is literally the least interesting revelation ever and raises huge questions about how she got her powers.\\nWhy in God's name would you take Poe\\, the most fun character in the series next to Solo\\, and give him a character arc that says \\\"You really shouldn't be a gung-ho space-cowboy and should instead be more careful and obedient?\\\"\\nHow do bombs fall in space? How do ships not depressurize when exposed to open space (This happens twice)?\\nFLYING SPACE LEIA WAS A TERRIBLE IDEA\\nWhy would you let such a divisive and terrible ideology like Identity Politics seep into your movie? \\\"Diverse\\\" characters don't matter if they are not interesting. The audience is not stupid. Most normal people are pretty offended if you are casting people simply because they check the box for diversity. It is not progressive to cast people based on skin color and gender. Period. Rose and Admiral Holdo are terrible characters.\\nRose completely ruins what would have been a moving self-sacrifice from Finn. If Rey wasn't there to rescue them\\, the ALL THE REBELS WOULD BE DEAD.\\nKilling Snoke was pretty cool... but now you just killed off the only character that could ever pose a threat to Rey. Rey already whooped Kylo with NO TRAINING. What kind of threat does he pose to Rey in the next movie? Also\\, I'd like to know a bit more about Snoke\\, but I guess that'll never happen.\\nFinally\\, the character turn that Luke takes is so out of character. You couldn't have made a worse Luke. He is so grumpy he doesn't even train Rey. And on top of all this you decide to kill him off because he... meditated too hard? You were handed one of the most beloved characters in all of movie history and you could not have done worse by him. I am so sorry for Hamill.\\nSo yeah\\, if you care even a little about Star Wars\\, do not watch this movie. If you've never seen Star Wars before\\, want to turn your brain off for a fun sci-fi action movie\\, and enjoy leftist identity politics then this is the film for you.","true":true}