{"101487":196374,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While being utterly disappointed after leaving the cinema\\, the more I think about this movie the worse it becomes. Even if you are not invested in the Star Wars Franchise it is simply a badly written film\\, with uninteresting plots\\, plotholes as big as death stars\\, cringey one-liner humour including \\\"yo' mama\\\" jokes and leaves you with a feeling that all it aims to do is sell fluffy CGI alien merchandise.\\n\\nIts even worse if you are interested in Star Wars: This movie totally destroys Luke Skywalker and his character progression in the OT. His character is getting ridiculed ( senile old man drinking alien titty milk) acts out of character and the conclusion of his character arc makes neither sense nor is it fun to watch.\\n\\nBut most importantly this movie destroys not only the OT but basically the plot of every Star Wars movie so far. By having hyperspace suicide bombing destroying an entire fleet all the battles for Death Star\\, Death Star II and even Star Killer Base dont make sense anymore. Just have R2D2 remote control a cruiser into these battlestations. Problem solved.\\n\\nSome other things that annoy me because they dont make sense at all:\\nFor some reasons Y-Wing Bombers are no longer a thing and Bombs fall in zero-gravity. One X-Wing destroys all turbolaser turrets on the biggest ship in the fleet. Turbo-Lasers now fire in a ballistic arc in space ( let that sink in for a minute).\\nI could go on and on about characters being dissapointing and plots being redundant or bad but I will leave it here. The only entertaining part was the relationship of Rey and Kylo but this also fails in delivering any surprises.\\n\\nI do not understand how this movie gets the critical acclaim it currently gets.\\n\\nThis movie will hurt you\\, if you are the least bit invested in the franchise.\\nIf you are not\\, it will be a long boring and not well written space-flic.\\n\\nTLDR: A film that does everything to discredit the original trilogy\\, disrepect great characters and is in my opinion a long merchandise commercial and cashgrab. Terrible. Competing with Episode II for being the worst Star Wars film yet. Seriously worried for the future of SW under Disney now.","true":true}