{"101487":116489,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disney needs to fire itself and get George Lucas back. They are destroying the universe he created with these new films. No Jedi or Sith? No good vs evil? Lucas created his universe with these elements in it because its fantasy\\, and we like it that way. The greatest human stories have always had good vs evil. Otherwise its just some people who disagree fighting each other. \\n\\nNot to mention the plot holes in this film were the most i've seen in any movie\\, not just Star Wars. Capital ships running out of gas? Gimme a break. Submarines and warships in our day have reactors\\, not gas tanks. And why didn't the Imperials just send out their squadrons of TIE fighters to destroy the escaping ships? The whole premise of this movie (two ships slowly chasing each other) was ridiculous. Lucas must have hated every minute of it. \\n\\nAnd how did Benicio del Toro's character tip off the Imperials about the cloaked transports? Who told him about this plan? Not even Poe or Finn knew. And if someone had had the common sense to elucidate poe about this grand plan\\, there would have been no need to go off to find the code slicer on the Casino planet. That whole side trip was one big waste of time. Like\\, just let us leave the theater earlier instead of wasting half an hour of our time with a pointless side quest that doesnt affect the story.\\n\\nAlso\\, since when were Imperial Officers (General Hux) so immature and moronic? In the original trilogy\\, they may have been cold and ruthless\\, but always professional. Seems DIsney is just trying to throw humor in their films like they have been doing since the Avengers. With the Avengers\\, it works. On a Star Destroyer\\, it doesnt fit the atmosphere and is not consistent with the SW universe Lucas created.\\n\\nDisney's new  SW movies seems like they are designed to fit nicely into their corporate mold. They have great cinematography and visuals\\, but short on content\\, engaging characters\\, and making the movie feel plausible.","true":true}