{"101487":166356,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Saw this on opening night and definitely regret it.  The story is uneven and the plot is filled with contrived twists just for the sake of twists.  It wants to shrug off the Star Wars traditions but it does so by trolling the audience and being more parody than actual departure.  Thor: Ragnarok was a departure from the usual Marvel formula and it worked great.  So\\, it can be done but Last Jedi comes in wide of the mark. \\n\\nThe movie is unnecessarily long\\, the characters are generally unsympathetic\\, the relationships forced or lacking chemistry\\, and the generally bad writing all make for a sad entry in the Star Wars saga.  I'd have preferred to watch the Star Wars Ewok Christmas Special\\, which was a stain on my childhood\\, than have spent my money to see this film.\\n\\nThe movie repeatedly killed my ability to suspend disbelief.  I felt that many of the things that happen were just plain stupid.  I don't think it's a spoiler to say they drop bombs in space.  Have you ever seen an astronaut let go of a pen and it just floats there?  It does that because there's a distinct lack of gravity in space.  So\\, having bombs falls down is just mystifying when there literally is no such thing as \\\"down\\\" in space.  (FYI - I realize that technically it's a microgravity environment but that isn't relevant to my point)\\n\\nOverall\\, the action sequences were just generally bad.  Space chases without tension.  Space battles that just plain disappoint.  Where are all the fighters? Where are all the other ships?  Why is the First Order non-threatening in this movie?  It's just inexplicable.\\n\\nIt's called the Last Jedi but there's only one real light saber battle.  Way to go.  You defied my expectations by having a movie about the last Jedi that has the Jedi acting very un-Jedi like to include not wielding a light saber.  Awesome.  How hip.  Oh\\, what's that? it's just over my head.  Nope.  Gotta disagree.  It's not clever so much as it's just a bad movie.\\n\\nSave your money.  I hear the new Jumanji film is good.","true":true}