{"101487":129346,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-12","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a huge star wars fanatic and honestly a fanboy\\, but when episode & came out at first I was so excited to finally see a Star Wars film in theatre for the first time and it was a huge disappointment and at the time I thought it was the worst Star Wars film yet( I still think its Horrible) but this is a close one for the worst. The only parts I liked involved Kylo Ren even then it wasn't that good but compared to the rest of the film and episode 7 they were the best scenes in both films. The tone of the film and incompetence of the director starts right off the bat when the scroll comes up and you find out that the new order has taken over the entire galaxy out of nowhere! and the resistance is now galaxy-wide (generic rebels now)\\, just because you destroyed a capital of a nation doesn't mean the entire nation will fall and just surrender! Snoke why was he even a character? Luke wasted opportunity and ruins the lore and character in this one film. Johnson is by far the most incompetent director in the 21st century; he is worse than George Lucas! this film along with episode 7 is worse than episode 1 or 2 because at least 1\\,2\\, and 3 are actually original and are somewhat enjoyable; 7 and 8 are just lazy ripoffs of the original movies. I honestly only went to go see episode 8 because I thought it would have been better than episode 7 but I guess I was wrong. The only good thing about this film is with what they did with Kyle\\, as he does what Vader could not. I must reiterate that this movies only ruins established lore of the saga because johnson wanted to have cool looking scenes and have wow shots for who? I don't know most of the \\\"wow\\\" shots are done to impress children or people who are mentally incompetent.","true":true}