{"101487":155126,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My biggest complain is the plot\\, Finn\/Po\\, and Luke island scene. \\n\\nPlot was slow paced and not action packed enough\\, which all the \\\"middle\\\" movies have been to an extent. Plot was different which was refreshing but not very creative nor purposeful. I didn't ever feel that I was cheering on any heroes. It felt redundant in \\\"what's our plan...just keep going until we run out of fuel I guess...okay!  ...what's our plan? Same thing!\\\" For the entire movie lol \\n\\nPo was made out to be dumb which bothered me. I get they were trying to teach him a lesson and improve his trigger happy character\\, but it only made him look stupid like he didn't know what he was doing which lessen the viewers trust in him. \\n\\nFinn is such a dynamic character and talented actor that I think he got screwed entirely. They're like well we can't really think of what to have you do in this movie...so we'll create a WORTHLESS side mission. With the most ANNOYING human we can find lol. Instead of giving you cool fight scenes and a sense of urgency to save everyone we'll let you have deep conversations and hang out for awhile on some planet while you continue to get caught over and over cuz apparently you're not nearly as capable as you were the last movie. And then you'll have accomplished nothing and look dumb and while we're at it make em kiss at the end just because we need a love triangle even though she reminds us of a 13 year old tom boy (im so mean). \\n\\nFINALLY the entire island scene just pissed me off. How many times can you say teach me! No! Then storm off haha. Enough with the weird animals and showing your daily island activities like let's get to it! It felt like it kept dragging on! We wanted a yoda Luke line training sesh!!! That's what we needed to feel like we were watching Star Wars! The same Luke Skywalker who represents basically the entire Star Wars franchise\\, who saved death Vader\\, took down Death Stars\\, trained with yoda! Was like this weird emotional grumpy guy who hated all things force related haha it felt off and strange. I get he had his issues and that's fine! Work them out\\, have the necessary dialogue then let's move on and start training Rey and both come to the rescue at the end like idk I want that kind of cheesy happy hero stuff in my life! They could have cut out an entire 30 minutes I wouldn't have missed. \\n\\nDon't get my started on the leia flying in space thing (although I love how kylo ren pulled off to shoot) they should have killed her off (obviously they didn't know she would die) and keep Luke skywalker alive but whatever. And the infinite Rey's in the glass scene was cool and artsy I guess? But also creepy and totally unnecessary as gained zero information. \\n\\nDisappointed that we found out so little. Who was snoke? Guess he wasn't a very powerful sith? died pretty easy. Also instead of wanting to turn Rey and use her 'amazing strength' he was like okay after allllll that I'm just going to kill you now. Felt silly to me. \\n\\nI'm so disappointed in the little insight they gave into who Rey is\\, her story\\, background\\, connection to kylo. \\n\\nI really hate this writer\/director. Hoping JJ Abrams will take back the reigns because being the final one it needs to answer all my questions\\, be crazy action packed\\, and basically perfect because I'm allowed to expect that of this franchise.\\n\\nIf you enjoy an action movie you may like this movie\\, although very boring at parts. But true Star Wars fans will hate this movie.","true":true}