{"101487":152703,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Made me think of the following movies:\\n\\nMary Poppins\\, Oceans 11\\, Oliver twist\\, fantastic beasts\\, pokemon\\, harry potter\\, gremlins (when arsonist yoda turned up) and many many classics but with my head in my hands.\\n\\nNow for the actual review. Everything Force Awakens built is gone and there is nothing of any substance to look forward to.\\n\\nThe moment the movie starts the tone of it is set\\, overly pantomime theatrical like\\, and that tone is forever with you through the movie. Snoke is basically nothing nothing seriously nothing.  Those at the top of the Order are hormonal teenage like characters.  Full of name drops with little reason. The back story to Kylo don't expect much. Back story to Luke going into exile don't expect much.  Actually don't expect anything from Luke at all. He has butlers and a farm on that island. Expect a whiney Ren who continuously Skype calls Kylo in an attempt to establish a long distance relationship for no reason.\\n\\nSlowest galactic chase ever. More weak point hits to blow up entire ships. A ship that looked like a milkshake containing explosives with a massive gaping hole and a load drop mechanism guaranteed to give the enemy about a minute to shoot one of the bombs to take out the entire carrier. Also\\, what's the point of ships with gaping entry points? Do people not use their eyes anymore.\\n\\nAs one reviewer has put was this a parody? A joke? A laugh?\\n\\nI can't even gather all the thoughts to put into words for this review so this is the end of it. 0 development in anything.\\n\\nThis is far from fresh at all and does not honor the Star Wars legacy in the slightest.  This has put me off even thinking of watching any future sequels at all. Will barely bring myself to get the dvds.","true":true}