{"101487":129891,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I cannot come up with a single reason why the worst Star Wars movie ever and a subpar movie in general would have > 90% tomatometer score other than that the critics are obviously pandering to Disney. It is also highly disappointing that RottenTomatoes would compound the problem by artificially inflating the audience score by ignoring half star ratings. It doesn't take a genius to scroll through the fan reviews and see that the average of all the ratings is WELL below 46%. What a joke.\\n\\nThe feel of the movie was disrespectful to the history of the franchise\\, even more so to Episode 7 which was so bizarre. Aren't these supposed to be part of a cohesive narrative?\\n\\nThe entire Cantobytes diversion was completely unnecessary and a waste of time. It would have been more powerful and character enriching to have Finn and Rose stuck on the ship engaged in dialogue about loss and frustration that they can't help. Instead we waste 40 minutes and they improve things not one bit.\\n\\nThe Snoke throne room scene was a complete throwaway fight scene. I don't see how that did anything positive for the story either. Probably just a vehicle to make more toys.\\n\\nThis movie and more importantly how the movie industry including\\n critics and journalists responded to it and to fan backlash about it has \\ncompletely deflated any enthusiasm I have for the future of Star Wars\\n at Disney. I won't be spending any more money on anything Star Wars \\nuntil we see some real acknowledgement from Disney that they messed up and actually take real steps toward change.","true":true}