{"101487":133830,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have never written a review before\\, but I feel like I just had to for this.  I really don't understand how some avid Star Wars fans actually enjoyed this movie.  Even looking at the numbers and reviews from opening weekend really throws me off.  It was not the best at all.  I grew up watching Star Wars my whole life.  I loved every aspect when watching 4\\, 5 and 6.  They were phenomenal.  Everyone knows how mediocre 1\\, 2 and 3 were\\, but that's okay because you could stand watching them.  I am sad to say how deeply disappointed I am in The Last Jedi.  By no means am I saying it was awful because it is still Star Wars\\, but it was NOT good.  I have never said this about a Star Wars movie before\\, but this is one I couldn't care less to ever watch again.  Disney ruined Star Wars.  The Force Awakens built so much hype for Episode 8...it all was ruined.  Everything was dramatically dragged out for no reason.  They forced too much into it.  Finn was a badass character in Episode 7\\, but now he is pointless.  The relationship between him and Rose was forced and their characters could have been left out and saved us all 30 minutes of dreadful time in the theater.  The humor was forced.  Star Wars is not supposed to be a funny movie\\, but the original 3 had moments because of the way it was written and the way to actors acted.  It wasn't something that everyone could say 'Oh that was supposed to be funny so I guess I'll laugh' which is how I felt with the humor in this movie.\\nWHO IS SNOKE?  Unless he comes back into Episode 9\\, his character was also pointless.  Every Supreme Leader had an awesome background of where they came from and what defined them\\, but Snoke?  Who the hell is he.  Rey's origins....really??  That is the best option on the table?  She was the daughter of junk traders that happened to pick up the ability of the Force?  Makes no sense why she wouldn't be somehow related to Luke\\, Obi-wan or someone for her to be truly tied into the Force by.  At least Kylo Ren was the offspring of someone with the ability.  And speaking of Leia\\, now she can fly?? Apparently the Force is not taught on how to control your feelings anymore.  You can just have it.\\nThe plot with Kylo on how he is still childish and can't control his emotions was great...just like Anakian.  You can see the light in him that Rey tries to bring out\\, but he takes out Snoke to show he wants to dominate...which is clear that he is the supposed Gray Jedi...why was there no elaboration.  The fact that Luke finally gives in to teach Rey the ways of the force but also explains that the Jedi are gone and that she needs to bring balance to the force is great...elaborate.  Why was there no time on the important aspects of STAR WARS?  Just small parts of the movie.  This is what Star Wars is.  Not to be dramatically dragging everything out to make it all Hollywood.  This is about Star Wars..not Hollywood.  Unless Episode 9 blows me out of the water and saves Star Wars\\, you can say goodbye to the Galaxy we all know and love.","true":true}