{"101487":139627,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw this film opening weekend and I am still massively disappointed and mad about it. I'm upset about the news that the rotten tomato score is high but user ratings are low so it must be fake reviews by the fans. It's not. Most everyone I have talked to has hated it. Hated it not because its a bad movie\\, but hated it because it feels like a film made by a director who isn't a SW fan or understand the rules of the SW universe. The few friends I know that do like the film it are casual fans or not fans at all. \\n\\nThis film has no continuity with the original series and following SW canon and lore. It absolutely throws away amazing opportunities and PLANNED direction for new story lines and plot twists that were obviously set up by TFA. It has ridiculous scenes (such as the casino\/ code breaker side missions) that are akin to the disastrous episodes 1-3. It leaves gaping plot holes like \\\"why don't ships just hyper space into one another when they are about to be defeated?\\\"\\, questions about new force users and suddenly all these new \\\"force powers\\\"? (Leia aka: Space Ghost Superman)\\nTo quote Han in the last movie \\\"That's not how the force works!\\\"\\n\\nThe entire film felt like I was getting Rick Rolled.  \\n\\\"Hey you really thought Rey's parents were important? Haha they're nobodies!\\\" \\n\\\"Hey you thought\\, who is Snoke? He must be important? Haha you'll never know now!\\\" \\n\\\"Hey you thought the Knights of Ren must be important? Haha Knights of Ren who? lol!\\\" \\n\\\"Hey you thought Luke\\, JEDI MASTER would do... something? Haha Jedi master? He just a grumpy old man!\\\"\\n\\nThis movie is beautiful in terms of its use of color\\, its cinematography and sound and it is non stop action. However it has little character development\\, too much cheesy dialogue and has multiple climax scenes preventing the viewer from knowing when the movie is coming drawing to a close.","true":true}