{"101487":169227,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoiler alert\\, I tell all here!\\nRion Johnson did every thing to juxtaposition every audience expectation to the point he leaves nothing for anyone to grab on to in the end.  One third of the film is great with Luke\\, Kylo and Rey but the rest drags like a television miniseries.  Millennials  will be lost on my expose here as they are use to television and streaming of videos. \\nA movie is all about sight and sound and being big on everything.  The screen and sound systems should be used to full impact.  This did not happen with the Last Jedi. The plot is tedious and mediocre which fouls up the pacing.  The characters are goofy like a television mini-series where the acting should have been left for a sit-com.  \\nKeep in mind\\, I saw the original\\, non-titled\\, New Hope Star Wars and remember vividly as Luke stared at the bones of his aunt and uncle who had been killed by the storm troopers. There is nothing in the Last Jedi to live up to this impact.  There were no preachy moralizations in the original and  Luke's life had changed and the story moved on. \\nThis does not happen with the Last Jedi.  Why was Maz and Yoda brought in to the Last Jedi when they had nothing to offer? Beats me\\, but it was a stupid move.  What was the point of Holdo and Rose but to support a television sub-plot?   Why would the Last Jedi not let Leia die in space? What is the point of keeping her alive?\\nThe Phantom Menace looks good in comparison as far as pace\\, action and intriguing characters where the Last Jedi just comes up short.  The critics have always hated Star Wars so I am no surprised about their supposed rave reviews.  However\\, I think these Star Wars trilogies are a waste of time. I hope the Disney Star Wars anthologies  are better.  Rogue One was awesome. \\nThe Last Jedi did have strong points with Rey\\, Kylo and Luke but the rest was just tedious bull crap. Yet it is gold buried in a pile of the most noxious smelling manure.  You have to dig to get to the gold and I am just not up to it.  The film is no fun for me. Those who like the film\\, God bless you. I am just not a poop diver.  Sorry\\, I won't go for such crap deceptions.","true":true}