{"101487":131145,"Last Jedi":"Last Jedi","2017-12-15":"2018-11-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't see how anyone who was a fan of the orginal series could rate this attempt of a star wars movie as good unless they were paid to do so or were a bot set up to prop up the ratings.  The vast difference between the audience and critic score should clue you in to something is not quite right here.  So many things were very wrong with this movie\\, the major issue is it is supposed to fit in with the other star wars films but totally misses by ditching the history\\, lore\\, and backstory and seems to just make up new stuff to try and be new and unpredictable.  The director and producer must have been unfamilliar with the franchise or disliked it and it shows.  Also\\, the characters lack any building of their own story and the lead Rey is probably the worst example of a Mary Sue I have ever seen.  There is no struggle or Jedi training for her\\, she just is the best out of nowhere and since there was no build up of her backstory there is very little attachment garnished for the character. A lot of the other characters are that way in this movie\\, they are shown like cameos but so little time was spent having them provide anything if value to the story they are just there and gone with no attachment to the movie.  Pacing is off and some side stories should have been edited out in favor of  development of the main story line.  There are tons of other nagging incongruities that should not be in a star wars movie that only a first time watcher of a star wars film would not catch. Definitely the worse  star wars movie ever made\\, even worse than the ones with Jar Jar.  The original star wars trilogy movies were blockbusters with big shoes to fill for this film to fit into and it doesn't even seem to even try to come close to equalling the previous standard that was set by the movies that made sequels a thing.  The Last Jedi is not a sequel but something in star wars name only and was thouroughly dissapointing to watch.","true":true}