{"101487":169556,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS: This is only MY opinion\\, if you don't agree that is perfectly fine with me. If you like the film that is good\\, please allow me to explain why I personally felt the film was disappointing. This will probably come of as nitpicking...\\n\\nI don't think this was a bad film. However\\, I left the film disappointed.\\n\\nThere were some great isolated scenes and characters. Snoke was very cool when he was alive\\, Kylo Ren's ambiguity was interesting and some of the battle scenes were fantastic; the light sabre battle with the Praetorian Guards springs to mind. But I felt the film was ultimately dissatisfying.\\n\\nThe plot seemed to go nowhere; the film consisted of a snail's pace chase scene and a random off-beat adventure to a casino planet. Luke was unlikable and his opinion towards Rey was completely inconsistent. \\n\\nPlot threads were't continued from Episode VII. Where were the Knights of Ren? When did Snoke finish Kylo's training as he said he would? Leia floating in space and flying like Superman; that didn't need to happen and seemed forced\\, forgive the pun.\\n\\nThere was token exposition from Maz Kanata; how did she get Luke's light sabre? It seems like that character was thrown away in this film.\\n\\nThe plot was driven by coincidence: Benicio Del Toro's character springs to mind. Fin and Rose  just happened to be in a cell with him. He's are a hacker?! What! Then he betrayed them!? It seemed so empty and convenient; all used to make the simple chase plot have some twists. \\n\\nHow did Yoda's force ghost make lighting to destroy the old tree? Could't he just have mentored Luke to give him the resolve to do it himself?\\n\\nThe new character Rose get more character development than Snoke! Luke's death wasn't satisfying. Snoke's death wasn't satisfying; they were both interesting in their own way\\, but both cases felt underwhelming. I'm okay with the masters being killed off\\, but they went out with a fizzle\\, not a bang...\\n\\nRian Johnson did a good job of subverting our expectations; however\\, I would have preferred some predictable catharsis\\, as opposed to surprise disappointment.\\n\\nThere was a strong theme of learning from failure in the film\\, in the film Yoda says \\\"failure is our greatest teacher.\\\" I do hope that Lucas Film can learn from this films failure to provide satisfaction in future. To clarify\\, I don't think the film will fail financially; doubtless it will make billions.\\n\\nI realise I just wrote an essay on a film i'm not that fond of. This is a reflection of my passion for the series\\, and my desire for the next film to be better. When I view the third film I may completely re-evaluate this instalment. Fingers crossed.\\n\\nI would be very interested to hear if other people agree\/disagree with any of these points.","true":true}