{"101487":129665,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am thoroughly confused by some of the fans rejection of this movie. I feel like the bad rating has a lot to do with Luke Skywalker\\, Rey's parents & Snoke. I think a lot of people are so caught up in the legend of Luke which the movie address awesomely that you forgot the whole point of the TLJ. TLJ is about New Hope and it's about Skywalker seeing the Hope that is around him. I am a rabid fan of the original trilogy. the prequels not so much. Force Awakens was little too much like a new hope. However the TLJ was not about light saber battles but the internal battle of leadership & sacrifice. Fans have gotten so caught up in how or what Luke Skywalker should be that they missed this movie completely.\\nLets talk about Snoke. First I have to say this character was a stupid creation to begin with. In the TFA I hated that this character was created we didn't need him. Kylo Ren talking to Darth Vader's mask is all we needed. In-fact it would have been better if Kylo Ren was in charge of the first order and was taking orders from himself talking to Darth Vader's Mask. However\\, Rian Johnson was handed this stupid character\\, that basically just stood in the way of a more interesting concept of Kylo Ren being the dark leader of the galaxy\\, and I'm glad Rian Johnson got Snoke out of the way in TLJ. Much better. I say bring back the Darth Vader Mask and have Kylo start talking to it again\\, WAY MORE INTERESTING. SNOKE WHO\\, WHO CARES.\\n\\nRey's parents reveal was a great scene and here is why. Kylo tells Rey she is nothing and means nothing in this story except that she means something to him. This was great. If you could not read between the lines in this movie you would know that it's not about who you come from that makes you something its about who you want to be and Rey wants to be the New Hope. Rian Johnson answers wasn't good enough for the fans\\, come on that was a great answers. It says I don't need to be Jedi royalty to be somebody. We don't need stupid metachlorines\\, or do you all want to go back to that. Lets not forget that when Luke first started his journey he thought he was a nobody farm kid.\\n\\nI don't get why fans would be so disappointed with this movie. Oh yes fans didn't like that Luke had become hopeless. I'm not sure what movie you all saw but I saw Luke Skywalker return to hope at the end of this movie when he delivered the most hopeful lines of the entire movie. I thank God for Rian Johnson returning Luke back to the beginning of when this all started. Luke looking over to the new Horizon. How was this not fitting or satisfying. I think a lot of fans had built up their own story for what Luke Skywalker should have been in TLJ\\, but I have to say by the end of the Movie Luke become the hopeful farm boy again looking out into the horizon. I suggest all of you one star fans\\, go see the movie again and you'll see what I'm talking about. My only criticism is that the movie needed a little more training scenes with Luke\\, and one cool bonding moment for Luke and Rey. Thats it. Thank you","true":true}