{"101487":121331,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First of all this film wasn't even Star Wars\\, it trashed all the continuity and added pointless characters who did only wrong decisions (aka pink hair Captain Holdo).\\nSo it's already 1 star out\\nAnd then the story. It didn't even feel like a progressive story but more as a bunch of disconnected episodes of a TV show in a row. \\nThe timescale without you really understanding what is going on when\\, the tume jump at the start leaving us with only more confusion etcetera.\\nA star out.\\nAnd then the characters. All important characters being female is not a problem\\, the problem is what they do.\\nMary Rey beats Luke Skywalker in a duel after having two lessons\\, an history one and a meditation one.\\nHoldo with personality issues who seriusly thinked not telling everybody how they are not going to die was a good idea.\\nLeia Mary Poppins was less of a problem\\, the major one was how her plan was conceived after she told Poe that he lost \\\"valuable\\\" bombers to destroy a Dreaghnout when her plan was to trash away a cruiser.\\nRose saving Finn and dooming the Rebellion (and wasting a perfect gay relation between Poe and Finn).\\nAnd many others.\\nA star out.\\nAfter that we have internal inconsistencies  (such as the fact that the Raddus supposedly was out of the range of the Supremacy but the transports were in-range) and pointless animalist and anticapitalist moments during the casino arch (they seriusly liberated a bunch of animals who are likely to get recaptured but left the slaves? And also they were arrested FOR PARKING in the wrong place?).\\nHalf a star out.","true":true}