{"101487":139642,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw this movie a day ago and I’ve been processing it since. It’s not a great movie. There are great parts but overall it’s just not a very good movie. They killed Snoke without revealing anything about his character. Finn is totally wasted on a pointless and boring side mission. Rose and Holdo could have been left out of the movie entirely and it would have improved the story. Poe was also totally wasted in this story. Phasma again gets no screen time and apparently dies. Leia survives exposure to space. Reys parents are apparently nobody. Luke doesn’t really train Rey and apparently Rey didn’t need training because she goes off and is a badass anyway. There are 7 or 8 huge plot holes that really invalidate the movie and break the immersion. That being said there were some crazy cool moments. Snoke himself was a strong villain before he was killed. The connection between Rey and Kylo felt real and emotional which made the entire throne room scene very powerful. Most of the stuff with Luke was pretty good. All in all I think I will see the film again to see if a second viewing improves it. I just can’t believe with all the money and resources available to Disney and Lucasfilm that they can’t seem to hire competent writers who can produce a coherent story. Like I honestly feel if you got five 30 something year old Star Wars fans and put them in a room for a week they’d be able to come up with a better plot. It’s actually a little odd how incompetent the writers appear to be. Anyway\\, hopefully a second viewing will make me feel better as it did with TFA. In the end it’s only a movie. ","true":true}