{"101487":125721,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Great movie. Laughing at all the fan boys hating this movie because they couldn’t cope with there childhood dreams being tested. Disney let fans of the franchise make what they wanted so ignore the Disney spin. Simple steps to understand. If you ever watched the entire saga up to this point that you truly need to grasp. 1: Luke is not the hero never was\\, he was an important figure. 2: The force has never been for good guys only. Watch the saga it slaps you in the face about it’s an energy around everything creating a balance in the universe. It created Vader to bring balance it brought Luke to help Vader balance it back and now it’s in Rey to “balance” Snoke and ren. 3: This is not the 70s & 80s were everything was black\/white good\/evil. We live in a sons of anarchy\/sopranos\/game of thrones world were nothing is safe\\, characters die and you have to deal with that. Was there slow parts yes\\, was there comedy yes but we forgot the comedy in the prequels that was just as stupid and out of place like rescuing a princess who just got tortured yet make fun of a “short” trooper but the story was still fun the special effects were still grand and the great moments were still great. Best part is you have no idea how the next movie is going to bring all this together and that in itself is cool. So watch the movie with an open mind. Take what it gives you but stay in the moment or you’ll get sidetracked fan boying this to death. It’s there universe not ours we just like to live in it a few hours at a time. ","true":true}