{"101487":151593,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Loved it\\, loved it\\, loved it\\nA lot of people who didn't like it use the same language\\, \\\"I expected this\\,\\\" \\\" I expected that\\\" \\\"My feelings were\\,\\\" etc.\\n\\nI had no expectations when I walked in the theatre\\, not because of doubt. I was there to see a story told in the Star Wars universe. I was there to see characters grow and change and learn. And action. \\n\\n** Spoilers **\\n\\nPeel back that expectation and dig deeper into the themes of the movie.\\nThe characters grew:\\n- Luke never addressed the flaws Yoda sensed in him in The Empire Strikes Back. He looked to the horizon. That flaw left him with the consequences of his rashness. But he learned that being a Jedi is more than sacred texts and failure. It's what you do when you do fail\\n- Poe Damron grew exponentially and learned what leadership was really about\\n- Finn learned that love is just as powerful a motivator as hate\\n- Leia's iron will kept her alive in space\\, but by the end\\, she's learning to let go\\n\\n- Can the Force ever truly be balanced if the light and the dark are constantly killing each other? A balanced Force is pretty powerful (see Throne Room scene). A self balancing Force. And people who are Force-sensitive can come from anywhere. \\n\\n- The lines of good and evil are blurred. And it all depends on your point of view.\\n\\nAnyway\\, I loved it. It had the morrow of Star Wars themes told in a new way. A gutsy awesome way. \\n\\nCan't wait till Episode 9.","true":true}