{"101487":169284,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoiler analysis!\\n\\nI did not like. It does not look like a Star Wars movie. Many things do not match the saga.\\n\\nLuke at the beginning of the film\\, with all due respect\\, looks like a loser!\\n\\nRey's \\\"training\\\" was ridiculous.\\n\\nIn addition\\, the film does not seem to make much sense. (My vision)\\n\\nThings that never happen\\, happen in the movie and without any explanation.\\n\\nSimply read Levite in space. Luke creates a homogram for you.\\n\\nDid not like.\\n\\nThe supreme lord dies of **** It is unbelievable that the \\\"lord of evil\\\" dies with a lightsaber at his side\\, not realizing that he will be activated and simply dies.\\n\\nHow can the \\\"villain\\\" of the movie die like this? No explanation of where he came and dying roughly.\\n\\nIf you are a fan\\, go watch and draw your own conclusions.\\n\\nPersonally\\, I did not like it.\\n\\nOther things:\\n\\n1. The Death of Luke\\n2. Luke's Legacy & Behavior\\n3. The Death of Snoke\\n4. Finn & Rose's Subplot\\n5. Rey's Parents are Nobody\\n6. Death & Return of Leia\\n7. Death of Phasma\\n8. Humor & Tone Issues\\n9. Dropped Force Awakens Subplots\\n10. Plot Holes\\n11. First Order Fleet Chases instead of Destroys\\n12. Vice Admiral Holdo Sucks\\n13. A Single X-Wing can Destroy a Dreadnought\\n14. Why didnt Kylo notice Luke Projection\\n15. Knights of Ren Dropped\\n16. Kylo Ren & Vader Relationship Dropped\\n17. Rey Perfect Saber Techniques with No Training\\n18. Snoke doesnt know his ship can track the enemy?\\n19. Yoda looks weird! (and can control lighting?)\\n20. Rey happens to be at correct spot to save everyone and lifts all rocks with no training.\\n21. Why was Finn hurt if it has no ramifications?\\n22. Rose Falling in Love with Finn was Stupid!\\n\\nhttps:\/\/www.change.org\/p\/the-walt-disney-company-have-disney-strike-star-wars-episode-viii-from-the-official-canon","true":true}