{"101487":122902,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Get your damn politics out of my Star Wars.  Adamant fan of all star wars movies\\, have watched 1-6 20 plus times (that's a safe low estimate).  Favorite franchise of all time.  TFA was ok\\, with some new characters that seemed to have an interesting journey ahead of them we could go and grow along with them for a new trilogy.  Even if the plot was too safe (a new hope v2) it had promise.  I watched hours of fan theory craft about Luke\\, Rey\\, Kylo and Snoke.  ALL TRASHED.   Get this garbage out of here.  SJW politics\\, wasted characters!  Who the hell is Holdo?  Why not tell the crew the plan to avoid mutiny?  Why not give that role to Leia or Akbar?  They are the ones that deserve the heroic end off!  This is not my Luke Skywalker\\, the Jedi knight I pretended to be throughout my childhood\\, when Star Wars wasn't the cool thing (mid 90s' elementary)  Snoke was the only thing done well in this heap and look at the decision made there.  Let's kill him in the early 3rd act.  Why is Po made to look and treated like an idiot?  Why didn't we get to see Finn turn into the resistance hero he deserves to be?  General Hux\\, a bumbling bafoon.  You know\\, when an Imperial general would lead a fleet in the original trilogy\\, he would be feared\\, he would be taken seriously.  Rey is raised by junk traders eh?  Learned a Jedi mind trick in a matter of days...  Luke had to train his ass off\\, failing over and over again for an eternity with Master Yoda on Dagobah\\, only to be told he was not ready and he would fail if he left.  I'm sick of seeing characters who have no depth because they are perfect and confident of victory in every battle.  Show us characters that have faults\\, show us growth with hard work or hard lessons\\, give us great stories with arcs that do our beloved characters justice.  The characters that built this house.  Man\\, Phasma should've kicked the crap out of everyone in both movies\\, sent 'em packing to lick their wounds and learn to hide to stay alive or ascend and defeat her.  I know I'm everywhere\\, I could continue forever.  Drop these two saga movies and start with a clean slate ala the incredible hulk with Edward Norton.  Nobody remembers that movie when the avengers are kicking ass with Mark Ruffalo.  Maybe keep TFA... Maybe.  \\n\\nMake Star Wars great again!","true":true}