{"101487":108144,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Bad plot inundated with holes and forced comedic one liners that are totally unnecessary.  Opening scene to the movie had a joke that was almost like the old Verizon commercial it makes me wonder if it was intentional seeing as there is a Verizon\/Star Wars ad on my page right now.  Totally unnecessary characters added and most of the characters in the movie are human\\, even at a giant casino\\, despite that Star Wars has always shown different races because it is able to with its galaxy.  One potentially redeeming plot twist is passed over because Disney can not have anything less than a super happy ending despite being the middle of a trilogy.  No continuity of rules established from prior Star Wars films\\, and all these weird unnecessary love triangles are popping up - why?  Seriously\\, there were seeds for a great love story that could have gone well had they had the guts to do a cool plot twist and it would have carried itself into the next film.  Resistance uses awful military strategy to the point where the only reason it should have worked out is Disney Magic.  I felt bad for a General Hux by the end because of the incompetence he was dealing with and he's not even a fleshed out character beyond a General and \\\"evil.\\\"  I'll have to think hard on if I even will see the next one because I love Star Wars but this was utterly ridiiculous.  Also\\, if the writers are going to plagiarize can't you just plagiarize some well written fantasy or sci fi novel instead of botching up a reboot of the original trilogy?  It's possible to tell a new story instead of the same one over and over again\\, especially in the universe setting there is potential - which is why there were shows and books that went on beyond the movies to explore the universe before these new movies ever came around.  I will give praise to the visual effects though.  Also\\, the animals were cute - though totally unnecessary and obviously Disney influenced.","true":true}