{"101487":132677,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If you like fast-paced action movies with nice effects and Guardians of the Galaxy humor\\, this one is for you. If you are looking for the \\\"best Star Wars movie since Empire\\\" it is not.\\nLukes reation to getting that lightsabre from Rey sets the tone for the rest of the movie and is a metaphor for how Disney deals with Star Wars and the whole idea of the Force and Jedi Religion.\\n\\nThe Top 10 dumbest moments (SPOILERS):\\n \\nFin and Rose riding the weird alien-horses - Narnia Style and their whole sub-plot in general\\n- BB8 operating an AT-ST\\n- Chewi eating that grilled Porg (in front of its family??)\\n- Leia flying through space as all-glittery Superwoman\\n- Snoke killed in 5min\\n- Resistance fleeing from the First Order in snail pace\\n- Luke throwing away that lightsabre\\n- The one crystal fox that patiently waited for the humans to follow him out of the cave\\, just to lead them to a hole that is too small for them anyways (Alice in Wonderland?)\\n- The kid with the broom at the end - I was waiting for the \\\"Luke Action Figures - in stores now\\\" ad\\n- Yoda burning the tree and everything left of the Jedi Religion (let the past die - kill it if you have to .... Well done Disney)\\n\\nThe Top 2 best moments:\\n- Rey and Kylo fighting the Praetorian guard\\n- The fight on Crait\\n\\nIn the end a review I read the other day pretty much sums it up. \\nWith all the rumors about who Rey's parents really are and who Snoke really is\\, fans put more thought into that than the actual makers of Episode 8.","true":true}