{"101487":198307,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars film ever. I felt similar to how I felt leaving the theater after seeing The Phantom Menace at age 13\\, except worse. Which is hard to do. I'm a die-hard fan of the OT. I did think this movie would be different\\, and it was\\, but I didn't think it would also be bad. Rian really tricked us fans with this one; the trailers gave little to no idea of what we were in for\\, and I realized why almost right away. Sometimes you can tell a movie is going to be bad only a couple minutes in. Pacing is very important\\, and certain parts felt rushed\\, others too slow. There were\\, of course\\, even bigger issues\\, many of which have been mentioned many times over. Not sure I need to repeat those. I was wrong to purchase tickets on opening night\\, I should have waited until word got out of how bad this was. I'm baffled by the 90% score\\, but have come to the conclusion that Disney and Rian Johnson are most likely in bed with critics. I've now lost all interest in future Star Wars films. What is there to care about\\, these new characters they tried to force on us?  I re-watched TFA after this\\, and the difference in quality was massive; I'm one of those who appreciated the nostalgia in that one. I thought it could have been a bit better\\, but overall I really liked it and felt things were headed in a good direction. Not so with The Last Jedi. I'll know not to give Disney more money. Out of all of the flaws in this movie\\, Luke dying the way he did was the single part I hated most. I could have ignored a boring\\, aimless film like this if Luke had survived. At least then Episode 9 could have still had a fighting chance to be good. But IMO they killed him and Snoke off early and did Luke in the stupidest way possible. I don't see how J.J. can fix this.","true":true}