{"101487":118776,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-01","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"eventually the mob mentality of hate this movie gets will die out and it will be seen as what it is. while it's not the best in the saga it is certainly a welcome addition that offers plenty of moments that are right up there with the best in the series. it's a welcome change of pace after The Force Awakens played it a little too safe and relied to heavily on the \\\"mystery box\\\" method that has failed jj abrahms on several occasions now. the movie has a few flaws that hold it back; but if you look at the overwhelmingly negative review\\, you'll find many inconsistency's on why people actually dislike it. i mainly decided to write this after seeing someone bash Mark Hamill and Carrie Fisher\\, claiming \\\"you'd think this was their first movie\\\"\\, to claim their performances were poor  while most of the movies biggest detractors find hamill and fishers performances to be the strong point of the movie. i feel its simply unfair for this movies fan rating to sit as low as it is with so many mindless\\, and idiotic reviews coming from people who would normally not bother adding a review to the movie if there wasn't this mob mentality of hate that this movie has recived. you would have to be a moron to say that this film somehow retroactively makes the prequels better\\, or somehow is as bad as the prequels\\, which is far from the case. you assholes make it so hard to enjoy anything and the fact that people refuse to acknowledge that this film has any positives at all and act like it was just a shit show from start to end is mind boggling.","true":true}