{"101487":99874,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After reading all of the reviews on Star Wars\\, good and bad\\, I decided to give the movie a chance and form my own opinion. I have to say that I left the theater disappointed.  It wasn't a terrible movie but it definitely did not feel like Star Wars.  The old cast seemed like completely different characters. Infact\\, it seems as though the Director\\, Rian Johnson went out of his way to completely destroy everything that the old characters meant to us and stood for just so all of our concentration would be placed on the new characters.  The problem is that the new generation of characters were really not that interesting and with the exception of Poe\\, I don't really care about them at all.  I hate the way that Rey's character has been portrayed from the beginning.  I love a strong woman character; the problem is that Rey's character is too strong.  She has had virtually no training yet she is able to kick everyone's ass in the film; including Kylo and Luke and they went way over board with the scenes between Rey and Kylo.  The scene where Leia survives space was terrible and I hated the way Luke Skywalker's character was portrayed.  There were to many plot holes and too many things that didn't make sense and would never happen in the Star Wars Universe.  One of the things that bothered me the most was that there was virtually no interaction between the classic characters.  One of the main reasons why the original Trilogy was so loved was the chemistry between the characters.  Disney was given these classic characters to work with and they had the ability to make something great using the original cast but sadly they missed the opportunity to use these characters to their advantage and\\, I'm sorry\\, but the new characters just don't have the same chemistry.  They mentioned more than once in this movie to leave the past behind. Well it seems like the Director has done just that\\, trying as best he can to erase the original Star Wars to make way for what Disney believes Star Wars should be.  That said Mark Hamill and Carrie Fisher did an awesome job with what they had to work with.","true":true}