{"101487":116966,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Don't believe the FAKE reviews on here! They're clearly paid. Any REAL OG Star Wars fan will walk away from this feeling defeated. \\n\\nLet me start off by saying I grew up with Star Wars and all the mythos surrounding the characters. So I'm literally a lifelong fan. \\n\\nThis movie missed the mark on so many levels I honestly feel cheated. Who as a kid didn't fantasize about the power of Luke Skywalker? Who didn't try to pick up a toy while hanging upside down using the force? \\n\\nIssue 1. I'm all for taking female characters to the center stage but they did it at the expense of the male characters. The men were weak\\, cowardly and impulsive. The women were strong independent leaders.. Again\\, I'm all for having strong female leads but not like this...\\n\\nIssue 2. The vacuum of space doesn't exist! And where\/when did she learn to use the force??? LITERALLY MADE ME SAY WTF!\\n\\nIssue 3. Campy comedy only applicable in 20'teens earth. Communication connection jokes in a starfighter capable of light speed and Luke Skywalker dusting off his shoulders. REALLY! Also a JEDI would never refer to a lightsaber as a LASER SWORD. \\n\\nIssue 4. 17 hours of training and now you're a JEDI. I'm sorry but that doesn't add up. \\n\\nIssue 4. The shoehorned relationship between Fin and the female mechanic. Was that even necessary?\\n\\nI could go on but Disney has sufficiently killed any hope I had for Star Wars. \\n\\nWorst Star Wars movie EVER MADE.","true":true}