{"101487":135160,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I loved Disney as a kid\\, but they used to care about good story telling. It seems like the movie was written to sell toys. Kathleen Kennedy and Rian Johnson don't understand the franchise!\\nMy problems with Star Wars VIII are:\\n\\n1. Bomber Ships from the beginning of the movie moved super slow and were super easily destroyed....did the Resistance not design them for war? ...Also bombs don't drop in space. \\n2. The Force Awakens was about finding Luke Skywalker. He left a map\\, and Rey tracks him down and brings him his original lightsaber as a gift! Then he just throws it away? It is supposed to be funny?...or was it a \\\"f*** you\\\" to fans who have been speculating about what Luke would say? (It was originally his father\\, Anakin Skywalker's lightsaber that was passed down to him by Ben Kenobi when he first became a jedi. WTF?)\\n3. The \\\"Rian Johnson Version\\\" of Scaredy-Cat-Luke; wanted to kill his Nephew because he sensed the dark side in him; even though Luke refused to kill his own father\\, because he believed there was some good left in him. (Even though he extinguished the Jedi Order and killed all the younglings\\, and committed genocide by destroying entire planets...). What had Ben Solo done that was even close to that evil?\\n4. Space Ships with laser guns still run on FUEL?...It seems like a stupid plot device to create a countdown clock (Spoiler...18 hours) so there is time for drama between Vice Admiral Holdo and Poe Dameron\\, and room for a side story for Rose and Finn.\\n5. Holdo refuses to tell Poe the plan? WTF? If the Resistance is so depleted; even with Poe's demotion he is still second in command\\, and she won't tell him the plan? And when he staged a mutiny....she still refuses to discuss her plan. If she was a diplomat; wouldn't she have the social skills to resolve this better?\\n6. The Rose and Finn side story was a failure! They had 18 hours to get to a casino planet and return. Which must have been really close since they didn't travel at light speed....how LUCKY! Then they are told by Maz Kanata that they need to find a specific hacker who can disable the First Order's tracking system. Finn must have asked for Maz to exchange phone numbers when he met her on Toakodana for 5 minutes (in the Force Awakens)....how LUCKY! But before they can find the hacker Finn and Rose get arrested for a parking ticket\\,...but there is a hacker who can do the job; in the same prison cell with them...how LUCKY! He can let himself out of prison anytime\\, so then take some \\\"ME\\\" time and free some alien horses (on an island where they will be rounded up the next day)\\, and destroy some property (which is insured and will most likely make the \\\"evil\\\" rich people even more money) Then they fly away with the untrustworthy code breaker; leaving all those slave children to CLEAN UP THE MESS?! What heros?....When they are captured by the First Order\\, their essential \\\"Code Breaker\\\" spills the beans about the Rebels plan to evacuate\\, and Hux begins destroying the escape pods. Rose and Finn caused half of the remaining Resistance to be blown up!? Which they never regret or even acknowledge.\\n6. Superman Leia....returns from death\\, but now Carrie Fisher tragically died. So now she will have to die off screen before the next movie? (and when they open the door to let her back on the ship....no air or people get sucked out?....is the cold vacuum of space a myth?) \\n7. They kill admiral Ackbar off-screen? It seems like they just wanted to create room for sexy purple haired Hunger-Games Holdo!\\n8. Luke dies meditating? If he was going to die\\, it would have been more impactful if he did it in person (we saw the sunken X-Wing\\, or did he forget to renew his driver's license)\\n\\nKathleen Kennedy may have worked with David Spielberg\\, but she has none of his instincts or tallent.  She needs to step down before she tanks the entire franchize.....\\nShe hired Rian Johnson to write the script...","true":true}