{"101487":159135,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok since it's opening weekend I'm going to keep this spoiler free. I was tempted to really pour out a spoiler review but resisted for now. I'm a huge star wars fan I've read lots of now out of cannon books and some of the new in cannon books. I can't help to be disappointed by this film. Yes it has some good to great parts in it but was ultimately a let down. I feel so strongly about it I actually came here just to write a review. Which I never do but may do so in the future seeing the amount of movies I watch\\, and holding a moviepass card.  Back to the film\\, it just didn't answer any questions.  It created much more questions and just feels to me like just another reboot. Where The force awakens felt like A new hope. This feels like The empire strikes back but with more comedy and nothing really happens. I mean the movie is two and a half hours long and some stuff happens to some characters in the time frame but nothing really happens in the arc of the Galaxy.  While nothing is actually explained either \\, like what's going on in the rest of the Galaxy ? I don't know its hard to get into without spoilers but it just feels like it's The empire strikes back 2.0 comedy hour. Not to say I didn't like the comedy it has some actual funny moments\\, but lets not turn it into space balls. I would prefer a more adult star wars kind of like the DC universe or Nolan Batman films\\, but that's not going to happen with Disney behind the wheel.  It's not all hate either being the fan that I am\\, I like it anytime a lightsaber is activated. There are awesome parts or scenes in the movie and it's probably the best star wars visually there is. I just can't get by the fact that this is not the story George Lucas wanted to tell\\, because he already told it.  I say most people will like it \\, casual fans will like it . Fanboys like myself will have to see it but I think you will ultimately have problems with it as I have.","true":true}