{"101487":195497,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What a waste. How could this script pass an approval process?? Rian Johnson and Kathleen Kennedy need to leave the Star Wars franchise as this movie indicates neither has any understanding of the canon  or passion for the characters. Very sad when breaking down the things people loved about the originals is now seen as delivering the audience with surprising twists. There is no palpable emotion between the characters with the exception of the beautiful scene between Luke and Leia. Everyone else is cardboard and vapid and do not bring the story to a conclusion that satisfies either the audience or the legacy of the original films. It feels sad when anyone disagrees that the film is not good that they are treated as 'angry fanboys' or 'not understanding the genius of the film'. Simply put\\, the story is bad. It does not develop any character. It\\, instead\\, seeks to destroy what we once enjoyed with the movies to shoehorn in characters we are not passionate about so new directors can add their own 'me too' into the franchise. Sadly\\, the director fails to make any character compelling. This does not feel like Star Wars because everything you loved about the movie is missing. A good sci-fi film\\, but definitely not a Star Wars film. Disney\\, Johnson and Kennedy need to reevaluate what made Star Wars so good before they try this again. For the first time in 40 years I'm not excited to see anymore Star Wars films and actually cringe at what may be coming.","true":true}