{"101487":188991,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"tldr; The most cinematically beautiful Star Wars train wreck ever made with repercussions so critical that it derailed the entire trilogy and perhaps the end of the 9 movie saga.  \\n\\nRian Johnson and the Lucasfilm execs screwed up the entire trilogy with this one. The core problem here is that the trilogy has no structural plan. Even the prequels had a structural plan across the 3 movies. Each movie was handed off like a relay race where the runner could go wherever they wanted and it's never been more apparent than in The Last Jedi. Did this movie have beautiful artistic shots and some twists (interesting or upsetting)? Yes. Did it make sense as the 2nd to last movie in a trilogy trying to wrap up the Skywalker Saga? Absolutely not. I have a LONG list of issues with this movie but I think it comes down to these things:\\n- Trying to be \\\"different\\\" by butchering the Luke Skywalker character as though he had learned nothing from the originals.\\n- Canto Bight was so boring and contributed nothing to the story or series except some weird out-of-left-field anti-capitalist message. Even if you think its character development for Finn this was the most round and uninteresting way to do it. With so many legendary characters to explore more of (Leia\\, Rey\\, Poe\\, ect) why did they need Rose? I would have much rather them spent more time with Leia\/others and what's she's been up to.\\n- Too many loose threads. Knights of Ren? Absent. Setting up meaningful story progression to wrap up all of the Star Wars movies? The Rebels end up pretty much where they started minus some of the favorite characters who died. I could go on.\\n- The core plot of a slow space chase was the most boring central plot for a Star Wars movie I could think of. I mean really? Of all the cool things they could have done in the Star Wars universe.","true":true}