{"101487":152495,"Last Jedi":"Last Jedi","2017-12-15":"2019-01-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Lucasfilm nowadays is far more downhill than it ever was. ever since Disney bought the franchise they had been calling the shots on how to make star wars shows and movies. One of the results is the last jedi. I do not care for this film one bit because there is so many problems about it that just cant go unnoticed and bother me to hell. the stupid decisions they make and the various plotholes and killings of characters. yes they do kill a lot of characters including snoke. I would expect micheal bay's transformers films to do that not LUCASFILM OF ALL PEOPLE! and killing off the most interesting character of the new trilogy was a bad move entirely! we dont know who he is or why he is intimidating. or even why he did what he did. it pisses me off as a star wars fan thinking about this! Rey is the most undeveloped main character I have ever seen! this is a problem spawned by this first film of the trilogy the force awakens. she just runs into fin and goes on this adventure for no damn reason. and she is a terrible jedi btw. yeah even though she started training with luke she didn't get ANYTHING done and also MAGICALLY saved the day which further proves the feminist message that \\\"WOMEN ARE MORE GIFTED THAN MEN\\\" and \\\"THE FORCE IS FEMALE\\\" bullcrap spawned by kathleen kennedy and rian johnson! and kylo ren though slightly the most tolerable character in the movie has the most bullshit backstory about how he turned to the dark side! and instead we are given the reason why and that is because luke tried to kill him. WHAT!? THAT IS SO WRONG ON SO MANY LEVELS!!! Luke Skywalker: one of the most beloved characters in the franchise tried to KILL kylo ren HIS OWN NEPHEW BY THE WAY AND THE SON OF HIS BEST FRIEND HAN because he was slipping to the dark side! WHY!? he could've personally counciled ren and tried to help him somehow. why am I supposed to care about this character! oh wait knowing the actual character he HE WOULD!! Luke wouldn't just KILL his own nephew because he had a spec of darkness inside him! whatever this movie is basically the worst in the franchise. I did not enjoy it in theatres and I do not recommend watching this. the characters are written poorly\\, the plot is out of place\\, and the constant killing of multiple beloved characters such as admiral ackbar just proves that I have no respect for Disney and the current morons at Lucasfilm. dont even bother with this film.","true":true}