{"101487":134160,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I honestly just loved this film. There was so much that Rian Johnson did so well especially when it came to developing character. I've noticed that many people didn't enjoy the film but are very quick to judge it based off of a few things. For example:\\nThe non-reveal of snoke\\nThe fact that Rey's parents are nobody's\\nLuke Skywalker's death\\nThe comedic aspect\\nThe limited time that this movie occupies\\n\\nHowever I believe that people aren't looking at the bigger picture of things. If you're only here to watch a Star Wars movie to see if your theory is correct\\, or see a giant bloodline reveal\\, then you're not watching it for the right reasons. This film was great because it showed character development\\, it expanded the world of Star Wars\\, it didn't rely on a large and expected reveal\\, it took the plot and characters in unexpected directions which made the movie unpredictable\\, the visual affects were outstanding but the movie also didn't rely on them the same way that the prequels did\\, it used clever comedy to add to the dimensions of characters (lest people forget that as much as this movie is for the people that have always loved Star Wars\\, it is a family film)\\, and it had a certain heart to it through the connections everyone in the movie had with each other. \\nMaybe the film didn't make a significant difference to the story line. But it should appreciated for itself as a great movie and not as something that only exists to prove theories. It is a true piece of modern art and I congratulate Rian Johnson for that. I can't wait to see what he does next with his upcoming trilogy.","true":true}