{"101487":127407,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Hear me out on this. The Last Jedi wasn't what we expected. The decisions were off and made no sense. I walked in hoping to get answers about Luke\\, Rey\\, Snoke\\, etc. I got them\\, but not in the way I expected it. I came out upset. Then I watched it again with my friends. My opinion still didn't change; however\\, I looked at my friend (who has only seen Force Awakens) and he said \\\"That was a pretty good. I guess you can call me a Star Wars fan now.\\\" That made me really happy. I realized that even though I had a gripe with the movie\\, it managed to please another. Star Wars was part of my childhood\\, it still is. The hype with every installment was bigger and better than any movie out there. Star Wars is for everyone\\, and it should be for everyone. Wanting to boycott the new films or saying that your done with it because of The Last Jedi is plain dumb. Do you want to let Star Wars die? Do you want them to stop the story? Honestly if you want to complain and boycott the movie or movies\\, then you're just a selfish person... and for that you should leave. You're ruining the experience for everyone else whether new or old. You shouldn't let this one be the end all be all. If anything be hopeful for the next one\\, or the next few. No movie is perfect especially in Star Wars. These aren't just your movies\\, it's ours... for everybody. So please kindly allow everyone to enjoy and watch the new movies. I know i'll be hopeful for Episode 9 or any of the standalone films. Please spread this around. I don't want my favorite series to die\\, I want the hype and passion to be there. I want to not be able to get tickets to the first showings because they'll be sold out. I want to see children playing with their star wars toys or collectors buying the sets. So as a fan to a fan\\, please let the series live.","true":true}