{"101487":136465,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"i'm by no means a professional reviewer or a giant Star Wars \\\"Nerd\\\" and I use that word in a good sense of the word \\\"nerd\\\". That being said\\, here are my two cents: \\n\\nThe movie is \\\"OK\\\". It's not great. It's not terrible. I saw it on the Thursday night opening so presumably\\, I was among a group of pretty savvy Star Wars aficionados but nobody clapped at the end of the movie. I didn't overhear anybody walking out saying how amazing and awesome it was.  The movie doesn't really leave any lasting impressions. It's just sort of \\\"there\\\". \\n\\nThe opening scene shows the new order fleet arriving from hyper space; which is very cool\\, but then for whatever reason the scene goes into something more fitting of space balls than star wars. Star Wars always has some moments of comedy but this is the opening scene. it didn't set the right tone. \\n\\nthe movie is long b\/c there are entire threads in the story that are quite inconsequential. That don't move the plot forward at all. The Finn\/Rose subplot could have been cut entirely and probably should have. in addition to being completely extraneous that particular subplot was also rather preachy in my opinion.  we need warfare between the resistance and the new order\\, not class warfare and social justice. \\n\\nAll Star Wars movies suffer from a bit of lazy writing. how many times do we need to see the all-important\\, yet unguarded\\, secret \\\"thingy\\\" that needs to be disabled to bring down the shields\\, the tractor beam\\, the tracking device\\, the cloaking device etc? It's lazy moviemaking and they need to retire that plot device. \\n\\nAs someone who likes all the movies but doesn't follow the expanded Star Wars universe\\, I have no idea who Snokes is. I don't know where he came from. Where he got his power. I don't know what motivates him. He's just a cartoon villain. I guess we are supposed to hate him b\/c he's ugly.  And we really don't know how the New Order is different from the Empire. How are they different? How are they the same? To me there didn't appear to be any difference at all. \\n\\nRey's lineage seemed to be a big deal. But Kylo Ren's explanation\\, if true and i don't know if it is\\, suggested that this big build up was for nothing. but why does it even matter if it was just ehhh she's a commoner? who cares? \\n\\nThe good parts of the plot could have been developed more if they had just eliminated the Finn\/Rose sub plot. \\n\\non a side note; if Disney is listening Star Wars fans don't want a kids movie. We want an adult Star Wars. leave the cuddly creatures and their obvious toy tie ins to the cartoons or something. Get rid of the scenes that are obviously just a video game set piece. I think many of us would prefer a smaller\\, darker\\, film that I more Jedi focused. epic space battles are great but they all look the same at this point. \\n\\nso my review sounds super negative but the movie is not bad. you'll probably enjoy it but you will walk out thinking what could have been.","true":true}