{"101487":131397,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I enjoyed how it attempted to avoid the plagiarism of the force awakens and it does manage to keep your interest for the length of the film BUT the world of the story literally makes no sense. In the original movies the Empire was extremely strong after having used politics to legitimately take over the Republic which was made up of thousands of worlds and species. In this new trilogy the First Order destroyed a handful of planets with the starkiller base and now in this film the First Order has suddenly taken over everything with no explanation of how their tiny military managed to take on a republic of thousands of worlds. I have no problem with them somehow getting the upper hand on the good guys but at least explain it. Apart from that the new writers have zero understanding of what it means to be a jedi or how the force works\\, or they just conveniently forgot in order to make Luke look like a depressed hermit. Even after Yoda and Obi Wan were at the helm of a jedi order that let down the entire galaxy and created darth vader they didnt get depressed and just focused on how they could make things better by helping Luke. Not here\\, now Jedi make one little mistake and are responsible for perhaps the least threatening sith lord ever and suddenly get super depressed and abandon all of their friends and family to die. Sci fi movies like this are dependent on creating a cohesive world with logical back stories and rules that help give the story a feeling of reality which helps with immersion. The writers of this film just blindly wander from one scene to another without ever taking the time to use the real world of the star wars universe to their advantage. \\n\\nAlso on top of all that the space chase which lasts almost the entire movie is really poorly done. For one thing they create this new idea that the huge capital ships of the star wars universe rely on fuel. Not even the aircraft carriers and submarines of our modern navy do this since they have nuclear reactors that can let them stay at sea for decades if necessary. I'm sure star wars technology would be on at least the same level as our modern navy. And then on top of that the First Order ships laughingly cant catch up to the Resistance ships because they are bigger. In space the bigger ships would have bigger engines and therefore be faster since it is a vacuum and there is no resistance to slow the bigger ship down. This idiotic premise goes on for nearly 3 quarters of the movie. \\n\\nRey and Finn were not as annoying as they were in the Force Awakens which I appreciated but Finn's subplot doesnt really matter in the story. They make you think it does but in the end pretty much everything he and Poe does is irrelevant.\\n\\nAlso thought we were gonna get some interesting backstory on Snoke but that story is randomly cut short. Unlike when Vader takes out Palpatine which is a gradual process that builds up over the course of three films and is hugely satisfying here its kind of tacked on.\\n\\nAnd finally\\, Luke's death. I honestly think I would have liked the movie alot more if Luke hadnt died. A) Its depressing and B) It makes no sense. \\n\\nAfter getting into a rather interesting fight with Kylo Ren we find out he had just used a force projection\\, okay clever Luke we thought. Then it cuts back to his hermitage where he's looking at the suns in a homage to his Tattooine days and we think\\, cool he's gotten back to his roots now he's gonna kick ass like in the old days\\, but then he just dies. For no real reason ... THE END","true":true}