{"101487":182941,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the first Star Wars movie that has left me truly disappointed. The prequels had their missteps\\, sure\\, but the overarching story they told was interesting and worth telling. It is clear that this sequel trilogy is being completely made up on the spot with no thought given to the overarching story of the trilogy or even coherence between each film. JJ Abrams restarted the franchise with an infectious energy that got the world excited about new characters and the possibilities of Star Wars again. Rian Johnson took all of those possibilities and flushed them down the toilet. Luke Skywalker is an old asshole for really no good reason. Snoke is a generic Emperor reboot that I feel dumb for giving a second thought to. Captain Phasma and Maz are given a few seconds of screen time. And who are they replaced with? 1) A character that is the biggest waste of Benicio Del Toro’s talent in his career: a stuttering codebreaker in a pointless side story. 2) Laura Dern’s purple hair cosplay and 3)Rose\\, touted as a strong female character\\, who ended up being nothing more than a Finn fangirl who risked her life to save a boy she had an unrequited crush on. This is not progressive writing! Even the noble idea of resisting an oppressive regime is sullied because the rebels somehow buy their arms from the same dealers as the First Order. The resistance is just part of the war machine and making money for rich Vegas-types. Is a better option to stop resisting and let the regime win to spite the profiteers? That seemed to be the message. Rey was revealed to be a nobody who “doesn’t belong in this story”. Rian Johnson won’t say if this is definitive or not because he has no idea what they have planned for Episode IX (this is sadly actually true!). Im all for giving directors a Star Wars movie and a blank canvas\\, but that works better in a spinoff story instead of the 8th episode of a series about the Skywalkers. Rian Johnson threw away or ruined all of the tantalizing mysteries from The Force Awakens (The Knights of Ren\\, Luke’s reason for going into hiding\\, Snoke\\, etc). And he left me with no interest or excitement for watching this movie or Episode 9. Finally\\, for everyone saying this movie is fresh\\, new\\, and original compared to The Force Awakens — It’s just a warmed over version of Empire Strikes Back: 1. Young hero trains on secluded planet with old Jedi who doesn’t want to train them. 2. Cave sequence shows hero their biggest fear. 3. Other characters split up and go on side mission to fancy luxury city. 4. Battle on remote white planet with hidden rebel base and AT-ATs. 5. Bad guy reveals family history to hero and says “Join Me”. The theme and decisions in this movie seem to be a message to long time Star Wars fans that “the past wasn’t as good as you think it was” and it “needs to be destroyed”. All I know is the original Star Wars movies are great\\, they still hold up\\, and they have a lifetime connection with many fans. Audiences flock to new Star Wars movies for this reason\\, not to be shamed for liking the series. ","true":true}