{"101487":107758,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Awful. \\n\\nNo point in listing all of the bad it has been done. How bad? so bad that a friend even came around for a therapy session as he was also baffled why the movie was so bad. We spent the afternoon bitching about it. \\n\\nStar Wars has a strong fan base who have supported it for years\\, like the 501st Legion. This movie craps on that legacy. \\n\\nThe prequels were not great films\\, but they still advanced a story and were based in the Star Wars universe. This story\/plot was a mess and did nothing\\, characters and events served no purpose. There were moments of good\\, often ruined by slap stick comedy\\, but ultimately the entire film was let done by a pointless story and a cavalier attitude to the previous films\\, universe and lore.\\n\\nYou can make a new story with new characters and still be true to the original universe. Don't give me this crap about \\\"challenging my preconceptions\\\" that is just lazy for a bad story\\, because you can't write anything with constraints. \\n\\nI was going to write a big review why this was so bad .... but honestly much like the writers of the Last Jedi\\, I am not sure I care anymore. \\n\\nIf this is the future of Star Wars .... then I'm no longer a fan.\\n\\nFinally\\, stop trying to blame the bad reviews on bots and accept the fact that a lot of fans disliked the film. I am more concerned that all of the critic reviews seem suspiciously overly positive.","true":true}