{"101487":178746,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There were a ton of good ideas in this movie but they never really got off the ground. everything  seemed rushed never quite hitting the sweet spot it was very disappointing. I love Ray even though she she seems to be  the Jedi idiot savant and puts little t no effort in her training. for two years things we were presented with things that in the movie just did not live up to the hype. every idea seemed  like the shorthand version of itself in endless procession. It is sad because in all those ideas there could have been a better movie in there especially because the cast gave stellar performances they just never had the time to let it breath naturally. One would think that a movie of that length would provide the viwer and lifelong fan with more substance. All in all I could live with most of the way the story went except for what they did with Luke -Hamill was right it is a disaster. Whoever wrote the script  was not a starwars fan nor did\/he \/she \/they care about the character. This bitter and defeated Luke was so alien to watch and just not skywalker. I really understand the base concept of him realising that something in the way the force is used must change and this avenue could have been pursued without butchering the very soul of the character. The execution was sloppy and frankly disrespectful to a story that has inspired generations of viewers. We your cashcows have swallowed the fact that you killed off years of storylines that now are sold as\\\" legends \\\". I get it you wanted to go a fresh route but you should have treated the base material more kindly and even your own ideas with more respect ...","true":true}