{"101487":165672,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rotten Tomato Movie Review:  The Last Jedi\\n\\nDid not enjoy The Last Jedi as much as I wanted to.\\n\\nI had to been looking forward to this film since The Force Awakens 2 years ago.\\n\\nI was so excited about Star Wars again that when they announced a stand alone film called Rogue One... I couldn't wait to get back into the Star Wars world.  So when Christmas of 2016 rolled around\\, I jumped at the chance to watch Rogue One\\, hoping to keep being beguiled by that Star Wars giddy feeling.  \\n\\nThat emotional stir of someone caught in a fantastical space soap opera.  Spinning and dancing with that crackling crash of light sabers!  Dodging and ducking the zooming swoosh of light speed space ships tangled in an epic battle between good and evil.\\n\\nHowever\\, Rogue One wasn't the film I was expecting it to be.  So I patiently waited\\, like most of us fans for The Last Jedi.\\n\\nIt was a loooong year.  It was to be the highlight to my year.\\n\\nUnfortunately\\, it wasn't the film I had hoped it would be.\\n\\nWatching The Last Jedi shook my confidence in the whole Star Wars world so much I didn't know why I felt so empty.\\n\\nSo I did what most fans do.   I actually rewatched The Empire Strikes Back just to compare it to this new sequel.\\n\\nUpon re-watching The Empire Strikes Back\\, my mind became clearer.\\n\\nWhat I discovered was that this 1980 film wasn't all it was made out to be.  For a start it had a lot of slow bits.  And there were plot lines that seemed to make little sense.\\n\\nThe Empire Strikes Back turned out to be unevenly paced and illogical on many levels.  Right from the start\\, Luke was out in the middle of the snow for no apparent reason.  Han Solo just announces he needs to take off due to some bounty on his head or some such.  Yet we forgave it because in 1980\\, you tended to forgive blockbuster films for being huge plot-hole monsters with explosions to make up for the lack of finesse and elegance of smaller more well-thought-out films.\\n\\nThese days we want the big films to have it all.  We want them to be plotted well.  We want great acting.  We even demand clear character arcs\/journeys.  And we want the explosions to boot.\\n\\nFor my money\\, I had more thrills watching smaller budget films like The Foreigner with Jackie Chan or found more charm in the modestly budgeted Paddington 2 than this $250 million dollar marketing machine.\\n\\nI will admit\\, my love for the Star Wars universe will never die.  However\\, I feel a bit like that kid who has to wake up to the realisation that Christmas will never be the same once you admit that Santa Claus is just a man in a red suit.  He has no powers.  He doesn't read our wish list letters.  He doesn't gobble up 100 million cookies in one night without suffering diabetes or a cardiac arrest.  It doesn't take away the warmth of being with our loved ones... but it takes away the sparkle in our eyes when we stop believing in flying reindeer or gifts created just for us made by loyal caring elves in the north pole.\\n\\nSo there it is.  I still admire the film makers for doing an incredible job of taking us to another universe.  But it's just not the Star Wars that kept me glued to the screen as a child.  It's become a well designed bit of fantasy fluff.  Just not an imaginary world where we can be sword fighting rebels who move objects with our minds and inspire legions of rebels to triumph.  It's just kind of above average... with a killer musical score by legendary John Williams.\\n\\nThe villain isn't even as captivating.  The heroes are rather forgettable.  And the battles are predictably high budget spectacles that don't linger in my mind.  Not sure if I'll even look forward to the 3rd film... I appreciate the effort.  Close but no cigar for this Star Wars fan.  May the Force be with you indeed.","true":true}