{"101487":138105,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"In my opinion\\, The Last Jedi was really good. It's a very interesting movie that upsurps your expections and hopes but does it in a way that makes sense. Movie critics seem to love it. After seeing it\\, I thought fans we're going to be more divided. This ended up being the case.  I think this is because while movie is not disrespectful to Star Wars\\, it is not overly reverent. It does not bow to fan theories or the fanfics theorists created in their head. Part of me is slightly dissapointed in some of the story decisions. Still\\, I thought the movie was very well done. \\n\\nThe ironic part is that people are going to hate this movie for the exact opposite reason as the Force Awakens. The Force Awakens was like a chocolate cake. It was super delicious but somewhat simplistic. This movie is deeper and the flavor is going to drive some people away. The Last Jedi could be called the new Empire. This is not because it follows the same story beats as Empire but it is Empire in the sense that it leaves the audience unsure of how to respond. Like I said\\, I liked it. I need to watch it again a few more times. While it did not follow the epic I wrote in my head or the old EU\\, I do not think it's trash. I am not sure if this is simply a good Star Wars movie or if it is something truely special. As far as criticisms go\\, I think the movie has some pacing issues and not all the dialogue works. Not a negative but some the character decisions might make fans uncomfortable. The plus is that this movie is something new and it has breathtaking visuals.","true":true}