{"101487":96806,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"1 1\/2 stars.\\n\\nProduction values are industry leading. Visuals are masterful\\, dynamic and pleasing throughout the film. Audio effects\\, including music\\, are excellent as well. Costumes are exceptional quality\\, as expected of a uber-high budget film\\, and fashionable while being completely relevant. If a single person was responsible for all of the mentioned production successes--they deserve an Oscar. Unfortunately a film isn't a music video and what truly counts above all else is the story.\\n\\nThe story is where The Last Jedi completely fails. There are countless criticisms abound on the net so I'll summarize here. The basic fundamentals of storytelling do not exist here. The story is constantly told\\, instead of being shown. The concept of building up for dramatic payoffs don't exist. Characters are introduced and killed off in dramatic scenes that only make the viewer wonder if they missed something. Continuous logic fails that take the viewer out of suspending disbelief and into a continuous pattern of wondering how something works. \\n\\nRian Johnson sadly failed miserably in his \\\"masterpiece\\\". He has spent weeks explaining plot points and scenes over and over which means he failed to do it onscreen--where it should have been done. This film is so amateurish and flawed it makes one wonder if Rian Johnson was not just simply a figurehead as he clearly has some experience in directing. \\n\\nThe Last Jedi is best watched at a busy bar with the sound turned off along with loud music and drinks.","true":true}