{"101487":162229,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Please stop making anymore and ruining a legacy which once upon a time was untouchable.  I have signed up simply to slate a dreadful film.  I am in shock that critics view this film so highly.  I was concerned the minute Mark Kermode praised it.  Not because his judgement is poor\\, but because when it comes to Star Wars he was always critical and for some reason the Force awakens changed his mind.\\nLet's be honest\\, The Force Awakens was just Star Wars episode 1\\, only politically correct by having black and female leads.  I have no issue with this but quite frankly\\, I think LBGT\/gender\/\/race are now more important than that old fashioned idea of having a good story.  Luke Skywalker is clearly a re hash of kenobi's failure with Anakin.  \\nThere are some interesting ideas\\, and twists which I will give some credit - but ultimately there is no tension.  Even the Ireland scenes - are a poor man\\,s Dagobah.  It was tedious watching this.  I accept it must be hard to take this franchise in a new direction.  It must be hard to avoid the criticism of Force awakens....ie Star Wars repeat.....and it must be hard to come up with new ideas...but then that is exactly why you should stop making anymore ....\\n\\nThe only person to remotely come out with credit is the excellent Adam Driver who is fantastic.\\nWhat it makes you realise is simply how good the original cast were with the original trilogy.\\n\\nI feel satisfaction that the audience rating is so poor because this was dreadful.\\n\\nIf you really want to make a story that appeals....here's an idea....why not actually do a study in what really turns somebody to the dark side....what really makes somebody become evil....follow that path and mirror it with the story of evil being defeated...but please no more of this nonsense.","true":true}