{"101487":129813,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I came into this film with high expectations. Rian Johnson seemed to have such a deep love of Star Wars and such genuine interaction with fans. I wanted to love his Star Wars film. I expected to love his Star Wars film. I left the theater in a bit of a daze. It reminded me a bit of how I felt walking out of the Phantom Menace. Thinking\\, \\\"It's Star Wars. I liked it... didn't I?\\\" With Phantom Menace I was able to tell myself that the next one would be better. This one was just setting us up for the next one\\, when the story would really get started. But with Last Jedi the story was supposed to be in full tilt. Instead it felt like it had come to a grinding halt (or maybe been reduced to\\, at best\\, a slow crawl.) \\n\\nThe first issue I had was with the pacing. It felt very uneven over the course of the film. Much of it felt frenetic\\, with no chance to slow down and process what was happening. This seems to be a trend in modern Superhero films\\, but it feels wrong for Star Wars. I want a story\\, with some action. Not action hung together by a paper-thin story. I get that the new films are not going to be the same as the originals\\, but watching the OT the pacing feels so much better. (Even my teenage son agrees with this\\, so it's not that kids today can't pay attention to a movie unless there is non-stop action.)\\n\\nThe second issue was character development. There was so very little. A lot of time was spent with Poe\\, but he became less interesting and less likable than he was in TFA. As for the others\\, Kylo Ren seems to develop\\, but this development is quickly backtracked. When he seemed to feel close to Rey\\, it was an unexpected and exciting development for his character. But it's not explained very well. I get that he has this Force-bond with her that  Snoke has facilitated\\, but it's unclear why he feels such compassion for her that he kills his mentor rather than Rey. He murdered his fellow students at Luke's training temple. Why spare Rey? What has changed  in him? It apparently doesn't matter because he quickly changes back. I'm not sure if Rey develops at all\\, which is a bad sign. Maybe she's a little more confident? Her interactions with Luke are strange and feel untrue to both characters. She doesn't seem to gain knowledge from any of her experiences. She doesn't receive much in the way of training. I can understand why she might feel sympathy for Kylo\\, since Luke is  doing his best to shut her out. But she watched Kylo murder Han. Why would she forgive him so easily? I was really looking forward to getting to know Rey more and seeing her develop as a character\\, but instead I feel estranged from her. She no longer feels authentic as a character. \\n\\nI think that splitting Finn and Rey up for the entire film was a mistake. The bond between them was just beginning to develop and now it feels stunted. Finn's entire subplot is wasted because his quest turns out to be pointless. The bond between him and Rose seems like it happened too fast. And clearly there was a scene cut out because Finn gets angry with DJ for taking Rose's pendant and tells him\\, \\\"You don't know what that pendant means to her!\\\" But Finn doesn't know either because we never see Rose tell him.\\n\\nI loved the idea of Rose as a character and Kelly Marie Tran did a great  job with what she was given to work with\\, but since the entire Rose-Finn mission failed it felt like her character had no purpose. I guess she was supposed to be convincing Finn to stay and fight for the Resistance? But we never get much sense of Finn's internal struggle. An important mission comes up and he's instantly on board.\\n\\nQuestions raised by TFA go unanswered or are  answered cheaply. It feels like the writer\/director was afraid to confront these questions and afraid to accept the challenge of writing some truly dramatic moments. For example\\, there is this huge dramatic tension of Rey handing Luke the lightsaber. JJ Abrams set this up so well. It felt cheap to watch Luke throw the lightsaber away without even speaking to Rey. With strong writing this could have been such a powerful scene and instead the moment is wasted. Snoke is pointless and all our questions about him remain unanswered. I know people argue that the Emperor was also unexplained\\, but the context is quite different as we didn't have all the Star Wars backstory we have now. Snoke needs to fit into that history someplace. He raised intriguing questions and the duty and challenge for the writer is to answer those questions in interesting ways. This felt like a cop-out. \\n\\nFinn's awakening and the Knights of Ren are also left unexplained.\\n\\nThe scene with Rey in the allegedly dark place under the island was similar. An interesting dramatic situation is set-up and then it comes to nothing. The scene feels pointless and there is nothing in the place that seems to represent the dark side of the force\\, unless it is a lie\\, preying on Rey's fears that she comes from nothing and is nothing. We aren't really given a chance to process it and neither is Rey. She might have discussed her vision with Luke and it could have led to some development for both of them\\, but this doesn't happen.\\n\\nThe most positive thing I have  to say about this film i s that the actors did a fantastic job with what they were given to work with. I hope the next film is able to pick up the pieces\\, but I'm not sure if that can happen in a single film and since Luke is gone\\, the chances of redeeming what was done to his character are  gone as well. I think I am going to bury myself in the old EU for awhile. I haven't given up hope for Star Wars yet\\, but I think I'm going to be much more  cautious in my anticipation of future films.\\n\\nAnd then there is Luke. I have to agree with Mark Hamill that the decisions made for the character are just fundamentally wrong. I can understand Luke wanting to exile himself after the destruction of the temple. But I can't understand him even considering for a second that he would murder his young nephew. Luke doesn't feel like Luke.","true":true}