{"101487":160702,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"One star because it looks beautiful\\, and has a couple of fantastic scenes (Snoke's throne room being one). As for everything else? The writing is terrible. It's supposed to be part 8 of the Skywalker saga\\, but instead seems to have a completely different agenda. It trashes lore established in the original trilogy. Some defend this by quoting \\\"kill the past\\\" ... well\\, ever thought that line was put in the film to try and justify the mess made? So okay\\, let's assume it's fine to move away from the rules established in the original trilogy... this film completely disregards characters and plot strands from The Force Awakens\\, and that's inexcusable. The Knights of Ren? Meh\\, not important. Rey's parentage? Forget about it - this is a new millennium and anyone can be a Jedi. \\n\\nDon't be fooled by the line being pushed by Abrams and Disney\\, that anyone who hates this film is Alt-Right or women-hating. I didn't hear anyone being upset about Rey in TFA\\, she was great. But in this film she is totally irrelevant to driving the story forward\\, and is replaced by new characters whose actions make no sense whatsoever! Rose 'saves' Finn (who has been reduced to running around in a meaningless sub-plot) at the expense of dooming the entire rebel base?! It makes no sense. Hux is a joke\\, gone is his effective rivalry with Kylo Ren from the previous film. When did fuel ever become an issue in Star Wars?! Why bring back a character as iconic as Admiral Akbar if he's just window dressing before being sucked out into the ice-cold vacuum of space? And on that note\\, what happened to all the colourful aliens of Star Wars? All the new major characters are humans\\, presumably brought in to... well\\, I have no idea why. \\n\\nIt's interesting to note the disparity between the critic reviews and audience reviews. An explanation could be that we the proletariat aren't scared of being blacklisted from future Disney screenings (Disney has form for this\\, look-up the incident with the LA Times).","true":true}