{"101487":168821,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So now you cannot apparently give honest reviews because it will be dismissed as just 'bots' and the movie really is great.  Maybe a decline in ticket sales will prove if its bots.  \\n\\nI basically created an account here to post a review.  I'm not sure what Star Wars movie the critics saw or if they just succumb to the all powerful Disney\\, but this does not deserve the hype it was given. This is better than the Episodes 1-3 but not by much.\\n\\nInitially when I saw Force Awakens I thought it was a rehash of a New Hope\\, but I saw the movie 3x.  It may have been a rehash but it had the elements of a classic Star Wars film.  And I believe that it gave the franchise hope again. \\n\\nSpoilers ahead...\\n\\nThe Last Jedi seems to have taken a step (or two) backwards.  There is too much forced and cheesy humour.  Critical story elements (that I feel at least) with Snoke and Rey's parents that leave you going \\\"What?? Are you serious?\\\" .  They build hype from Force Awakens only to disappoint.  Leia with her Force skills which I have never seen until now.  Also Kyle's confrontation with Luke\\, I'm sorry but Adam's performance left me thinking of Hayden Christianson performances (anyone recall Attack of the Clones and Anakin saying 'the sand people made me so angry').\\n\\nIt seemed like they were trying to cram everything in 2.5 hrs and tie it all off.  I still consider Empire Strikes Back the best.  In that story the Rebels were being chased by the Empire\\, Luke was training and the unexpected twists and Empire 'striking back' left you in suspense.  And it was not rushed\\, it was a good story.  In Last Jedi it seemed a little unorganized or all over the map combined with scenes of 'gimme a break'.  Rey ends up with getting no training yet yields a saber like a pro against Snoke and company.  Luke is a disgruntled grumpy old man with flashbacks when he went cookoo trying to kill Kylo.  Snoke ain't that powerful obviously.  Rey came from Hobos (doubtful).  And the whole slow Rebel chase\\, it's like when I play with my 3 year old (I'm gonna get you!). But granted it gave enough time to go to a casino and ride some wild animals. And the force must be with Finn and Rose since they go back to the Star Destroyer only to get captured yet survive a collision when everyone else dies.\\n\\nI can go on but again\\, sometimes it's better to keep it simple.  After this fiasco I won't be in a rush to see Episode 9.  Disney suckered people into rushing to see Episode 8 because of the hype from critics about how great this movie is.  Maybe next time they should let true Star Wars fans screen it or break the movie into two parts and tell a good story (you'll make more money to\\, which is all they care for).\\n\\nThey don't make them like they use to.","true":true}