{"101487":155530,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"my qualms with star wars\\n\\n\\n\\nleia:  not dying and then mary poppins'ing through space. I think she shoulda died\\, it woulda been good arc to have kylo not kill her and then her die to his wingmen. plus\\, carries dead so what are they going to do with that\\n\\nsnoke - who is he: it was cool that kylo betrayed him but we didn't find out anything about him like who he was or how he was powerful. and to kill him off halfway through the 2nd movie which in my opinion should have been like the finale of the trilogy seemed odd\\n\\nrays parents - i don't think they're actually just random people\\n\\nspace battles - the fact that purple hair'd lady just jumped to light speed in her cruiser and destroyed one of the first order's biggest ships makes such a flaw in space battles for me. why haven't they just always suicide runned a giant ship\\, or like fucking autopiloted ships to do that? It cheapens all space battles past\/future\\n\\nphasma - wasn't developed at all\\, the character was irrelevant\\n\\nluke fake dying: when they revealed that he was a mirage I was like cool! good trick! they're not just repeating obi wan's sacrifice. but then he did die... so what was at the point even. I also don't believe that luke\\, who like believed there was still good in darth vader\\, would even consider killing his nephew. so that irked me.\\n\\nknights of ren - still didn't give any other info\\n\\nackbar - died off screen and nobody cared\\, it should have been him suiciding the ship if they were gonna do it\\, not some a new random character\\n\\noverall the plot with finn seemed very flimsy and unimportant\\, it literally didn't effect the movie at all because they failed and I didn't really care about that little side plot. \\n\\nso now the resistance is like 400 people in a galaxy of 100's of billions. theres walmarts with more people than that. also they started calling each other rebels which.. you're not the rebels.\\n\\noh and also the fact that this whole movie took place over like less than a day. so the whole trilogy right now is spanning like less than a week or something\\n\\nThings I DID like: \\n\\nthe throne room fight scene was awesome. i didn't love that they killed snoke but it was a awesome how they did\\n\\ni liked the kylo character a lot and their connection\\n\\ni liked that yoda was in it as a force ghost but i thought the puppet looked bad\\n\\ni kinda like that the lightsaber broke and now rey will have to make a new one. \\n\\nother than that idk\\, i thought it was alright. I'll be interested to see where 9 goes. i didn't mind the jokes and there was some decent action. but i don't think it was as good as TFA or even rouge one. or the prequels or originals for that matter. and definitely not like a 9.8 or scores thats its getting.","true":true}