{"101487":199106,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow did this movie not work for me. While it looked great. The plot was all over the place and didn’t do anything. So many characters were teased in the first movie and they just killed them off with no answers. It’s like Rian felt he didn’t create the characters\\, who cares about them. The most powerful person killed while sitting down. Remember how captain phasma was going to have a huge role in this film. Nope - didn’t even need to bring her back\\, kill her off. Then the characters we love - Leia she can live after being in space and can use the force to fly? So sad they ruined her final movie. Luke - old man who hates the word and is no longer the hero of the skywalker saga. Great he came to save the day and be a distraction\\, but peace out after that. As Mark Hamill said “Jedi don’t give up” but it looks like Rian said they do. I’m surprised Mark went through with this. I am actually happy Han didn’t have to be in this movie. Remember Rey? Well she doesn’t need full training and her role was to follow Luke on an island\\, move Rocks and skype with Kylo Ren. Let’s spend the entire movie on one slow moving ship and an island. Add a subplot with Finn (which was pointless and was ended because of a parking violation) to break things up. They tried too hard to make a Star Wars comedy\\, when the funniest parts should just happen. The first half was too slow and the last half was too rushed. The movie didn’t answer any questions and only created one. What the F did I just watch? Walking out I felt like I watched a movie with Star Wars name added to it. I didn’t watch a Star Wars movie. Hopefully JJ can save this train wreck somehow and they don’t let Rian do a new series. ","true":true}