{"101487":130606,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-24","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I didn't love the film but not for the same reasons I've read from other reviews. \\n\\nFor starters\\, what was up with the codebreaker arc\\, they went in looking for a guy with a flower on his lapel\\, found him then were arrested because they illegally parked their ship? After which the ship wasn't repo'd\\, or booted or whatever the starwars equivalent is. Then in jail they happen to find a guy who could do exactly what they needed\\, then that guy breaks out of jail with little effort. Why was he in jail in the first place if he could do this? I feel like they could have just said he lost the flower on his lapel in a gambling match and he was the guy they were looking for all along. Or maybe they did and I just missed something.\\n\\nLuke's death\\, while I'm not upset about the event I'm confused about the circumstances. He gave no indication that he was sick or weakened in any way (aside from the throwaway that he \\\"cut\\\" himself off from the force.) If Snoke could make Rey and Ben see eachother from anywhere in the galaxy why did Luke have to die from essentially doing the same thing? Also who the F was Snoke? Why should we care\\, how the hell did the first order come into so much power right after in episode 6 they defeated the empire? \\n\\nThat last part is most likely explained in a book or something. \\n\\nLet's talk about Luke's arc\\, he was going to kill his nephew for something he hadn't even done while he was able to forgive Darth Vader having done so many terrible things. That doesn't make any sense. \\n\\nAs far as the filming goes\\, sure it was pretty but there was a lot of awkward transitions\\, and dialogue.","true":true}