{"101487":164872,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"Request permission to jump in an x-wing and blow stuff up.\\\"\\n\\nMore like a Guardians of the Galaxy-esque sequel to Spaceballs than an entry in Star Wars canon.  Mark Hamill turns in a completely wasted best ever performance\\, with a character betrayed by the writers\\, left to mope around making idiotic decisions and contradicting his own motivations.\\n\\nThere are countless ex-machinas and pointless diversions for no reason other than to setup a gag or pad out the running time.  No end of potentially interesting plot lines just fizzle out.\\nIt's like the writer(s) had too many good ideas and instead of picking a few and developing them properly\\, they just decided to thrown them all in and see what stuck.  The trouble is\\, none of them really do and to wrap things up the writers have taken lazy shortcuts that stand out terribly\\, with character inconsistencies and painfully convenient plot contrivances abound.\\n\\nPurple haired \\\"Admirals\\\" might appeal to the Hunger Games fans in the audience.  General Hux is reportedly fully booked for this years pantomime season (and those for the next 10 years I hear).  Rose is the new miracle adept\\, going from a maintenance worker \\\"behind the pipes\\\" to a kick-ass pilot with zero training\\, able to pull off precision life saving aerobatics.\\n\\nIf you enjoyed Spaceballs\\,think Star Wars is dumb fun and aren't concerned with plausible continuation of the story\\, you will love this movie.  If you were looking for a course correction to get the Star Wars franchise back on the right tracks after Force Awakens ... move along.  This is not the Star Wars you've been looking for.","true":true}