{"101487":110776,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"BORING! There was no Star Wars magic in this episode. Rian Johnson is given too much credit for \\\"twists\\\" in this movie. They were predictable and carried no excitement or emotion. In episodes IV\\, V\\, VI\\, and VII there were always \\\"mystery boxes\\\" to open: IV\\, the entire movies was opening one mystery box after another; VI had the \\\"this is no cave\\\" exogorth and Luke moving the light saber in the ice cave and \\\"Luke I am your father\\\" and Vader's \\\"we'd be honored if you would join us\\\" just to name a few; VII had \\\"the garbage will do\\\" and Han\/Chewbacca reentering the MF and Rey taking down Kylo after using the force to draw saber from the snow just to name a few. These were moments where the audience at the theatre gasped and cheered. There was no gasping or cheering at the theatre for episode VIII (at least the full theatre where I saw the movie). How the story was told\\, i.e.\\, Rian Johnson's writing and directing\\, fell flat. Was I surprised that Snoke was cut in half? No. Was I surprised at Finn not carrying out his suicide mission? No. Was I surprised by any of the \\\"twists\\\"? No. Not because I'm good at guessing what will happen next\\, but because they carried no weight. I got to the point where I just didn't care anymore. Yes\\, some things were cool\\, like Luke's force projection of himself. But that moment carried no surprise! We all knew he wasn't killed by the barrage of gunfire. If he had died it would been even more flat than the poor delivery of the actual outcome. Leia's revival from outer space\\, floating like a Wizard of Oz witch? Pathetic. And no surprise either! I haven't seen any of Rian Johnson's other works\\, and they may be great. But this was a flop. Ugh. The last two years were a waste of time waiting for something special only to be dealt this boring waste of time in the theatre. I feel at peace that JJ Abrams will be writing and directing episode IX\\, if such is true. I think Rian Johnson should have watched JJ Abrams' Ted Talk on the \\\"Mystery Box.\\\"","true":true}