{"101487":168644,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"Sometimes feeding the fan base isn't that bad\\\"\\n\\nIt is what makes The force awakens work! This movie does not do this. It kills everything that the original story is and for one purpose: To make more movies; Did we expect less? Where the first in this trilogy serviced the fandom and played on nostalgia this movie rips it all away in the name of pushing politics and creating a new fan base. Yes\\, this movie had high expectations\\, but by doing what they have Disney has solidified the future of this franchise with it's PC message and killing off all links to the meat and potatoes of the Star Wars universe. Goal of making money accomplished. \\n\\nThis move will make you enjoy the prequels! At least the Star Wars feeling is there and the homage to the importance of special individuals being picked (Jedi Council) being chosen to protect the order of the Republic by being gatekeepers of freedom. \\n\\nThis episode literally says: The Jedi were the defenders of nothing and that they were not special and that everyone is special... ugh.... puh-lease.... Along with forced comedy with characters that cannot pass it off as natural enough\\, it worked for Han Solo because of the Actor and the role in which he was. A space Pirate\/smuggler\\, would you expect anything less?\\n\\nThe action sequences were the only redeeming quality\\, but it is 2017 so no surprises there.\\n\\nEpisode IX has so much ground to make up and really has the power to make or break this for the future of the franchise. The only way to move forward would be to explore the POSSIBILITY that by using both the light and dark sides of the force only then can the galaxy reach balance. I hope this is what they were attempting to explain with the moral conflict in Rey and Kylo\\, but with a film this shallow I doubt it.\\n\\nSee it once and hope for IX to be the reboot to revitalize deep characters that you actually care about and are invested in.","true":true}