{"101487":166712,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Sets were high quality as were special effects. That is literally all the good I can say about it.\\n\\nWorried that your favorite character may be in danger? DON'T because the writers\/director will break continuity within the scene itself in order to make sure no real damage is done to anyone with a name. The writing for most of the scenes is on par with the prequels - as in nonsensical and cheesy at the best moments\\, and on par with seven year old's skill MOST of the time. If you've been thinking \\\"WOW\\, I love what they're doing with new superhero movies where 3\/4 of the \\\"plot\\\" is pretty explosions that NEVER even badly injure anyone important or have any real impact on the story and roll call of fifty characters.\\\" Than you'll probably love this move. Logic in the scenes and \\\"plot\\\" feel like they were no more polished than twelve year olds going \\\"Wouldn't it be cool if then they had NINJAS\\\" ect ect\\, without any regard to sense\\, pacing\\, or continuity. Lots of convenient \\\"we couldn't possibly make plans and communicate like adults\\\" because if we didn't arbitrarily leave you in the dark\\, you wouldn't be where you needed to be for the deus ex machina. That's the closest thing to a \\\"plot device\\\" in the movie. Also felt like it was setting up to make movie 3 for Star wars into \\\"SPY KIDS IN SPACE\\\" soo I guess we have THAT to look forward to. \\n\\nThe shit that Disney has ALWAYS put out in their live-action movies has definitely permeated this movie\\, and I am really disappointed because the first was pretty good and there is opportunity for real complex characters and stories in base there. It feels like the original writer handed in the script and then a panel of twelve year old's got to make all the final editing and direction decisions. :\/","true":true}