{"101487":180113,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The worst SW movie ever. Period.\\n\\nSW has been ruined in the name of cheap\\, emotional thrills and political correctness.\\n\\nRose? Please explain to me her role. One minute shes sobbing over her sister 'guarding' escape pods and the next shes qualified to pilot a light craft against first order armor units? What? And what the heck was the whole freeing of the horse creatures? How very PETA of Rose. Who cares! This is SW.\\n\\nPurple hair admiral lady. ???? Words cannot describe how much I despise this character. I don't remember her name because A.) shes not memorable for anything\\, B.) .... I'll just stop here. Simply awful.\\n\\nLeia becomes mary freakin poppins. #IpreferJarJar\\n\\nSnoke? Welp\\, really got to know you well. No plots holes here other than the fact he just fused the empire into the first order and turned lukes apprentice. But yea\\, killed off nice and easily. Thanks SW.\\n\\nRey. Still don't know jack about her. End of story. Literally end of story.\\n\\nThe resistance is gone. Theres like twelve dudes left. That's called the end. Its called odds. Game over. Oh another plot hole here. During the final battle a bunch (like hundreds) of rebels are in the trenches. But just disappear. Thanks Disney. \\n\\nMaz? WTF is this thing and why is she important? Why do I even have to ask this question at this point? sigh\\n\\nThe stable boy at the end. WOW Disney! How emotional and strong! NOT. How cheesy. %$&*#@ Seriously?\\n\\nGoodbye SW. But you got one thing right...LAST. This is the end\\, so fitting name.","true":true}