{"101487":169136,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spaceballs 2 would have been a better title.  Too many jokes\\, not enough substance.  The Poe\/Hux joke in the beginning went on too long\\, which made me cringe.  That was when I knew the movie was going to suck.  Poe's character\\, the hothead flyboy got away with too much\\, his decisions killed lots of people\\, and his attempted mutiny was just laughed off???  I usually like Oscar Issacs\\, but found his character annoying.  The entire casino sub plot was embarrassingly dumb and excruciatingly long.  When they were riding the animals around the city I thought to myself\\, \\\"Am I still watching a Star Wars movie?\\\"  The inclusion of Rose's character seemed forced\\, and she seemed miss cast.  Benicio Del Toro's character's stutter was distracting and unnecessary.  The First Order chasing the fleet didn't seem like they were really trying to win\\, lobbing lasers from a really long distance.  That was the best they could do?  The First Order is not a menacing villain\\, but just a bunch of idiot buffoons (i.e. Spaceballs).  That's what I think is really wrong with these new Star Wars movies.  You're not fearful of the Dark Side or the First Order\\, you're just laughing at them. The only BIG reveal of the movie was that the people making weapons are making them for both sides\\, blaming the war on the profiteers.  Which is not really anything mind blowing\\, and seemed like a tired cliche premise.  Rey's was performance was flat and uninspired.  Snoke's demise was too quick and anti-climatic.  Leia's Mary Poppins fly-by was another cringe worthy moment.  The Yoda puppet looked really dumb too . Just another Disney money grab.  There is no more \\\"hope\\\" for Star Wars.  Life long fan\\, officially no more.","true":true}