{"101487":136675,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm not a critic\\, nor claim to be one. \\nHowever\\, this film is garbage. \\n\\nLets start with the largest of Disney's sins. \\n\\nThey gave complete Narrative and Directive control to Rian Johnson. A rookie director\\, whose best example of directing was a fairly good episode of Breaking Bad. A self proclaimed \\\"Fan\\\" of Star Wars. He made quite a few missteps here with Fans. To the point of argument. My biggest question is: Did he even care to have a Lore-Master go over the Script with him? Or was he too confident in his own writings to completely miss aspects he couldn't afford to.\\n\\nOn top of that:\\n\\nEverything JJ Abrams set up in the Previous Installment is just disregarded. \\n\\nThis film is just mired in mediocrity.\\n\\nAny attempt at deep storytelling is passed over. We're left with shallow characters\\, cheesy clichéd dialogue\\, and unresolved subplots. I've heard the term \\\"Trigger Happy Flyboy\\\" (or thereabouts) in too many Hollywood films.\\n The Codebreaker subplot just stopped the story dead\\, and ultimately failed to resolve. It begs the question as to why it was even included. \\n\\nAnother thing was how bad certain Cameo looked. I couldn't tell if it was CG or Puppetry. It just looked very off-putting and unrealistic.\\n\\nThis film didnt connect with me\\, I was excited to see where this franchise was headed\\, even after the previous installment took a very odd direction. \\n\\nDisney screwed the pooch. I dont know if they'll recover from this.","true":true}