{"101487":169531,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(spoilers) Shockingly bad. As a huge fan of the Star Wars saga\\, I feel personally offended by Disney's treatment of the new trilogy. (Without even mentioning Disney giving battle front rights to EA) \\n\\nThe first issue of the movie is the lack of character development. Kylo Ren is the only interesting character in the movie... And that says something. As Snoke was used as a mere plot device and killed off\\, kylo is the main villian  of the trilogy. AND HE ISNT EVEN THREATNING. It took Darth Vader 3 episodes to lose a battle. Kyle loses a saber battle to Rey and the stormtrooper\\, when they have had no official training (force awakens issue). This issue is more an over complaint about character Handling. \\n\\nFin is a boring character\\, and Rose was even worse. The movie would have been 100% better if that relationship and adventure to the casino critism of capitalism planet wasn't included. If holdo just told everyone her plan\\, that whole planet could have been avoided. There relationship and character building wasnt needed and felt extremely forced. I mean\\, if they really had to keep it in the film for diveristy reason\\, they should have let Fin die and the end and prevent the door from being blown open. \\n\\nSaving the animals was also lame..it's a star wars movie\\, not PETA. The line 'it was worth it' once they saves the animals was Soo idiotic. Was it worth it! You just doomed all the rebellion because you were busy saving a couple of camals! Like how can they say it was worth it.  Also for such a seedy planet\\, where TF are the Huts. The main crime family! Like why wasn't there a HUT!\\n\\nNow on to commander holdo. Why would you have her and not admiral Akbar. They just killed one of the most iconic characters off in the most disrespectful way\\, for some purple hairs smug lady to come in and being counter-productuve. \\nWhy not have admiral akbar take control of the bridge and then sacrifice himself to have the rebellion. It's like no one at Disney has actually seen star wars or understands it's fans. \\n\\nLuke projecting himself as a hologram was also shit.  Should have had him there in person deflecting off the AT-AT fire. Would have been cooler. And then sacrificed himself for the rebellion. \\n\\nThe comedy did not have to be there. I didn't. Realise slap-stick was still a thing. I'm sorry\\, but people running over and falling isn't funny. It felt like I was watching the avengers. That level of humor. \\n\\nLeia using the force to fly through space was so stupid as there has been no evidence of her using the force. Just have Kylo push her back into the ship\\, at least that would show his conflict more. \\n\\nOverall. The movie had some huge plot holes and no common sense. Zero character development\\, especially in regards to Snoke. \\nPushed to much of a political agendas. And felt like a marvel movie with the shitty humour. \\n\\nDisney.... I could write a book about how bad this movie was. Please go find some diehard fans\\, and listen to what they have to say. You might actually make movie that people will never forget. Instead of a shitty sci-fi comedy.","true":true}