{"101487":116443,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disney killed the force with this film... They really did. This movie was so\\, so\\, so bad. The plot holes are enormous and most of the movie is wasted on storylines that go nowhere and are made even more meaningless by idiotic plot twists that leaves any adult viewer frustrated with a sickening feeling of whiplash. Seriously\\, your kid could have written this script and he\/she wouldn't have had to be a very bright or clever child either... Characters that you have grown up with are completely changed for no explainable reason other than to get a cheap laugh or to fill in for the laziest of storytelling. As Fisher passed away before release\\, it makes the way her poor character is treated as idiotic as the stupid plot. Disney totally destroyed a solid franchise\\, and I'm talking way worse damage than any Jar Jar Binks ever did. Every other scene has some marketable furbee animal or gadget that Disney will sure to have at a mall near you. The performances by Driver and Ridley are fantastic\\, which is the only redeeming quality in a script clearly targeted at middle school aged children. Boyega\\, whose character promised to become stronger and less goofy at the end of Force Awakens\\, is sidelined with horrific lines that doom his character to never be taken seriously and to never develop further than a hapless Rey fan boy. Even the new character Rose is so ridiculous that you cringe for half the movie. As much as I deplored Tran's acting\\, I'd like to give her a bit of a pass for such a disgusting script that took neither the fan base nor the franchise seriously. A diverse cast of Hollywood hopefuls can't make up for this mess in storytelling in what is obviously a slip-shod job by Disney to earn some big Lucas bucks. It is so unnecessary as Star Wars has a solid fan base that I'm sure flocked to this movie hoping to feel the classic films were about to go galactic in a new saga that would inspire generations to come. Instead\\, all that's left at the end of The Last Jedi is remorse at the money you wasted to see this film as well as shear disappointment for the story and quality actors that were tied down by the horrific plot. This movie could have been so much better with even a little effort and a mindful editor that actually read the horrific script. I'd like to hope Disney can redeem itself\\, but all I have left is a numbness and a horrible dread that Star Wars will be dragged into some Marvel misadventure because no one at Disney cared enough about the legacy of this fantastic franchise. Disney already has countless big blockbuster movies that are riddled with jokes\\, kiddies toys and spotty scripts. They didn't need to buy up Star Wars via LucasFilms to create more of what movie goers are tired of. I recommend you wait till this is out on DVD and on sale... This movie showed me that Disney is definitely on the dark side\\, way darker than Sith level. Don't support those jerks.","true":true}