{"101487":149214,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"la pelicula contiene humor suspenso alegria y te quedas con ganass de seguir viendola una y otra vez comprende asuntos antiguos de la saga como dije hay emocion por todos lados reencuentros etc tanto como la actuacion de las actrizes y acctores esta dedicada al maximo especialmente mark hamill y daisy ridley la emocion de los fans con cada momento que pasa de la pelicula y querras verla por segunda o tercera vez para captar detalles bastante importanates y que diciendolo de este modo te puede sorprender lo que sea que haya visto. ADVIERTO LO QUE VOY A DECIR A CONTINUACION ES SPOILER NO SIGAS LEYENDO SI SOLO QUIERES SABER MI OPINION SIN SPOILERS en la pelicula tantas cosas maravillosas pasan luke encontrando se conleia los momentos epicos de este frente a los caminantes gorila y su deslumbrante batalla con kilo ren vemos como rey lucha por hacerle entender a luke que la galaxia lo necesesita pero este por su fracaso con ben solo esta decepcionado de si mismo cuando kilo ren mata a snoke apenas ves que comienza a mover el sable skywakersabes que lo dirige hacia el pero que aun no te puedes creer lo que va a pasar snoke cotado a la mitad realmente sorprende y por ultimo la union de luke con la fuerza luke alcanza otro estado el cual sin necesidad de una muerte fisica sabe que la fuerza lo esta llamando y asi es como vemos que el gran maestro jedi luke skywalker se convierte en fuerza misma sin embargo siempre esta ahi ahora es mas que nada la misma fuerza que rodea a toda la vida","true":false}