{"101487":116950,"Last Jedi":"Last Jedi","2017-12-15":"2020-05-23","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Don't believe any audience reviews about the Last Jedi.  Critics are right!  \\n\\nThe Last Jedi and Rian Johnson does a wonderful job in bringing new fresh to something old and familiar.  The story was great and the new force abilities are awesome as well.  Rian Johnson was able to expand the universe we all have come to love and give disney the ability to write spin offs for it (Broom Boy).  If you are the Star Wars fan looking for something spectacular and fresh\\, The Last Jedi is the movie for you!  \\n\\nSPOILERS Ahead!\\n\\nMost people I have spoken to express how they hated how Rian Johnson wrote Luke Skywalker\\, but when you actually come to think of it\\, Rian Johnson had to follow in the foot steps of what was developed in Force Awakens.   The question he had to answer is why is one of the most powerful Jedi living in exile on an island?  Why is Kylo Ren looking for him? Which are all answered within Rian Johnson's writing.  Questions are NOT left unanswered\\, and characters are NOT destroyed. \\n\\nKylo Ren cements himself as a powerful force\\, while Rey continues her journey of trying to find her place within the story.  Rian's decision of making Rey a \\\"no body\\\" was Rey's worst fear.  Much like in Empire\\, Luke's worse fear was that his enemy (Vader) is his father.  It was the last thing Rey wanted to hear\\, but it is satisfying in a way because great power does NOT have to come from Family Lineage.  \\n\\nThe only negative about this movie is that the Canto Bight sequence was a little too long.  I feel like including the whole space horse scene was unnecessary.  It was like Disney was forcing Rian Johnson to include something about Animal Rights.","true":true}