{"101487":196409,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While George Lucas was an awful writer and many of the subsequent changes to the OT were terrible  to see\\, at least he had pretty decent ideas( peppered with childish concepts and the willfull ignorance of the age of the actual fandom\\, but still). This Rian Johnson however seems more concerned with subverting expectations( so his movie could  look deep by proving the audience wrong and therefore less smart than his writing) than with telling a story.  This movie is 2h :30' of pointless wanking on the nature of the jedi without making any real point (SW: kotor 2 criticized many concepts of Lucas canon without being  full of anticlimaxes and without being something that looks like a movie Kevin feige would produce) littered with an insipid subplot that looks even aesthetically like something outnof the many chick flicks of the last decade. Add in many plot holes\\, stupid jokes\\, and scenes far beyond the campiness of the OT ( mobile suit leia  is the tip of the iceberg) and you got a film that is dire to disappoint the honest fan and delight the fanboys in self denial and the steteotypical millennials that need \\\"everything geekish\\\" to be watered down and changed into a parody to be not embarassing for them to watch.\\nP.S. even if star wars was born as a modern fairy tale for children it is pretty obvious that the guys who held the boat afloat were the older\\, adult fans( the children who watched the OT). To attack them as out of touch with reality and with what sw should be is pretty idiotic.","true":true}