{"101487":164773,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Regardless of anything \\\"star wars\\\" within this movie\\, it's terribly written. Extremely poor plot with a ridiculous amount of plot holes and terrible pacing. 2 hours of the movie were structured around a capital ship chase scene - a ridiculous concept that destroyed any suspension of disbelief. Why didn't the First Order call for more ships\\, or send some star destroyers ahead of the way (through hyperspace) to box in the resistance? They had apparently 6-18 hours to work with. When else has fuel been a problem within the rest of the films? Why play in a casino and worry about animal abuse when you've got the entire resistance depending on you? Who is Snoke? And why does he only have melee body guards? Does nobody think a gun might be useful to have in his throne room? Nothing about this film was believable\\, every aspect was poorly written. Disney has also added too much humor in an attempt to please all ages\\, but it's awkwardly written and terribly out of place. As a second entry in a trilogy\\, and 8th in a saga\\, it spits in the face of the established universe that other directors & writers have created. A major issue deals with hyperspace being utilized as a weapon - something we've never seen before in any Star Wars. If that's possible\\, why didn't rebels do that on the Death Star\\, or any number of other space battles? How did the first order become so powerful\\, if the empire was defeated in episode 6 and supposedly there was a good republic around for 30 years? Where did they come from? Why is the resistance so small? Now\\, it'd be fine to be \\\"subversive\\\" in a spin-off movie and make all the points the director wanted to (e.g\\, arms-dealers are bad and the galaxy is systemically broken)\\, but not episode 8 of a 9 episode series. Finally there's the issue of Luke acting far outside of his character. It's completely ridiculous. I am incredibly disappointed in the direction Rian Johnson went here\\, and am very worried that he's now working on his own Star Wars trilogy. I didn't think Star Wars could get any worse than The Phantom Menace\\, boy was I wrong.","true":true}