{"101487":98619,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Absolute trash of a movie\\, one of the worst sci films I've ever seen. Bombs are not supposed to drop in space\\, people aren't supposed to float around: you would be sucked inside out or something like that\\, I cant believe either they just opened a door to let Leia back in the ship\\, as if the vaccumm of space doesnt apply so all was well no harm done. In tjis case then everyone might as well just spaceswim onto the first order ships and kill everyone? Could of had rose and Finn do it as it would a been a lot more entertaining although completely ridiculous than there storyline. Ridiculous I say just like the rest of this film. Luke gets his lightsabre back finally when he sees rey whats going to happen? Oh okay. Reys gonna train with luke.. Oh maybe not then. The scenes where rey was force speaking with kylo\\, nope i did it says snoke. Kylo kills snoke and teams up with but nope he still bad. They could of even made him temporarily good until the next film when he turns evil again after kicking huxs ass. Dumb really\\, all so we can see erm nothing really happen between kylo and luke not even a proper fight just a silly hologram. Noone seems to have took this seriously and its like b movie grade stuff at best\\,or a fan film or a parody not a main installment of a great franchise. Its also rendered force awaken completely obsolete and I thought that was an excellent\\, compelling and exciting film but I won't watch even that again knowing what comes next and I don't care what comes after either. Why p*** all over something if your going to deliver something mediocre in comparison? So dumb.","true":true}