{"101487":136365,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm a lifelong Star Wars fan. I've been anxiously awaiting The Last Jedi for 2 years. Not in my wildest imagination could I have envisioned this disaster they dare to call a movie. What Disney and Rian Johnson have done to this franchise is simply tragic. The Last Jedi is a total failure of basic storytelling. It does nothing to bridge plot lines or further expand character development already established in The Force Awakens. In fact\\, it ignores everything and acts as though the previous movies never existed. Luke Skywalker is now a cynical old hermit who tells stupid jokes and milks the teats of space dinosaurs for nourishment (I'm not joking).  Rey\\, the protagonist gives a lifeless performance (particularly at the beginning) and further becomes an enigma in this film. We learn nothing new about her. Princess Leia now flies in space like Mary Poppins (SMH). Rian Johnson conveniently forgets that bombs can't be dropped in the vacuum of space because science shows us that there's no gravity in space (I learned that in the first grade).  Snoke\\, the all powerful bad guy\\, was just time filler. There's no back story\\, not even an attempt to let the viewer understand more about this powerful evil character and his motives.  So what do they do...they kill him off\\, and then do the same with Captain Phasma. The attempt to try to make this film socially relevant by pushing a (peta \/ green peace) social agenda (save the space animals at the casino) made this movie cringeworthy. Not to mention the blatant pandering to Asian Americans like myself by forcing us the totally unnecessary PC story line of the Asian girl teaming up with the Black guy to do only god know what. It was a total waste of time. From the onset\\, they made General Hux look like a fool with his bad acting and the misplaced humor that totally distracts from the story. Bad on all fronts. Laura Dern gives a performance that would make a cadaver proud. Rian Johnson took a dump on the Star Wars legacy and effectively destroyed it. This movie represents the end of the franchise\\, at least for me. I will no longer pay good money to watch anything related to Star Wars.  Great effects will never cover up bad story telling. TLJ is bad storytelling at it's worst. FU Disney & thanks for destroying a treasured story from my childhood. You made Luke Skywalker look like a fool and then you decided to remove him from the franchise. FU times infinity!!","true":true}