{"101487":148140,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just as the OJ Simpson inspired chase that takes up most of the films lengthy runtime this plot goes nowhere. The mistake was made in setting this movie up moments after the previous film. The characters havenï¿ 1\/2 1\/2 1\/2 1\/2(TM)t grown thereï¿ 1\/2 1\/2 1\/2 1\/2(TM)s no connection or progression. They are the same flat canvases we met earlier and theyï¿ 1\/2 1\/2 1\/2 1\/2(TM)re still wearing name tags like bad high school reunion. Then we are introduced to new characters who are actually more intriguing than the stars but they are quickly turned into causuaties either literally or figuratively. Iï¿ 1\/2 1\/2 1\/2 1\/2(TM)m not so upset with the Luke arch though it seemed cheap and unwarranted and losing Carrie Fisher makes Lukeï¿ 1\/2 1\/2 1\/2 1\/2(TM)s  death extremely inconvenient. The movie is as George Lucas has stated\\,ï¿ 1\/2 1\/2 1\/2 1\/2ï¿ 1\/2 1\/2 1\/2ï¿ 1\/2 1\/2ï¿ 1\/2Â?Beautifully made!ï¿ 1\/2 1\/2 1\/2 1\/2ï¿ 1\/2 1\/2 1\/2ï¿ 1\/2 1\/2ï¿ 1\/2Â? Of course some scenes miss the mark a lot of the characters of the Canto Bite sequence do not feel like Star Wars some liken to Star Trek and others to lesser sci-fi fodder. Luke was a farmboy and we waited 40 years to see him milk something I couldï¿ 1\/2 1\/2 1\/2 1\/2(TM)ve waited another 40 years to see that. So that is The Last Jedi","true":true}