{"101487":134297,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I just have one question to everyone here; what happened to just enjoying a movie? I've seen many reviews of people hating on the movie for both legitimate reasons\\, such as certain characters not being done the justice they were promised to have\\, and I've seen some pretty dumb reasons such as\\, certain characters not being done the justice they were hyped up by the audience to have. Yes\\, most people\\, including myself\\, would agree that Star Wars has risen from a \\\"just a movie status\\\" to an experience. But no The Last Jedi isn't a bad movie by any means. But that doesn't mean that I wasn't a little disappointed because of what both my mind and marketing had built up this movie to be. But that doesn't mean that what I still got wasn't fantastic. I could go on about things that annoyed me about the film and what I liked about the film for hours but I'm going to go back to my main point of writing this review. Firstly\\, what is the difference between a film critic and a movie goer? A critic will watch a movie like a hawk. A critic will spend every resource his mind has on analyzing what he is seeing on a much deeper level and his judgement on wether he likes a movie or not is almost purely based on his deep analysis. But sometimes a film isn't meant to be analyzed. It's meant to be watched and enjoyed. And that's where the world of the movie goer comes into play. A movie goer is much more bias but at the same time he is more opinionated in that he doesn't have the influence of \\\"professionals\\\" affecting his judgement. When he likes it it's because he had fun. Now\\, I can honestly say that I am a both a good critic and movie goer. In the recent year I have watched movies like a hawk. I have a fascination with film and the inner workings of film. But I like movies because movies are fun. I don't like them because they're a career for me. I am currently 15 years old. I don't need to worry about that right now. I know when to just sit and watch. 2 years ago\\, I saw The Force Awakens for the first time and it was possibly one of the greatest experiences of my life. I knew little to nothing about the inner workings of film and I still had an innocent eye when it came to movies and I freakin loved it. Then the next year came with Rogue One. Now by that time I had developed an eye for some things. I had begun my transformation into a monster. I was excited to see a new Star Wars movies s be able to judge it with new vision. And I HATED it. I saw so many glaring issues I never would've even noticed if I hadn't spent the last year watching and analyzing any movie I could. I know for a fact that if I still had my innocence I would've probably liked it more than The Force Awakens. And now it's the last Jedi. I can say I have become at least a mild pro when it comes to movies. But watching it with critics eyes just felt wrong to me. It felt off. Half of me was having the time of my life and the other was noticing things that were ruining it for me. Then I just turned my brain off and started enjoying where I was. In my favorite theatre watching the 8th (or 9th) installment of my favorite franchise since I could remember. I was watching people with a mystical power holding a sword made of light taking on a faction hell bent of bringing tyranny to a galaxy with no laws of physics. After turning off my brain I was returned to a better and simpler time. A time when I could just sit and have fun. Yes I still didn't agree with some choices the story made but who cares. I was watching a YouTube review of the movie and he brought up a good point. In 10-30 years\\, who's going to care what we were saying about this movie. Who's going to care what score it got on rotten tomatoes. All that people will care about is that The Last Jedi is fun and that it's freakin awesome. Is it perfect? Oh hell no but no Star Wars movie is. Star Wars at this point lives off of nostalgia and cool stuff. Even the most generally liked Star Wars movie\\, Empire Strikes Back\\, has its flaws. But who cares. When you're watching a movie you can judge it by its script or cinematography all you want but if you can watch a fun movie and honestly say you didn't like it then your opinion matters. If your problem with The Last Jedi is because of a personal reason or a legit problem with you not having fun with what you got then you have the right to complain. But if you're going to complain about something either do it to get something off your chest or if you're going to complain about not having fun. Otherwise shut up. Now\\, as to why the critic score for this movie is good while the audience score is horrifying I don't know. But I had fun watching the movie and if you had fun that's all that matters. See you around kid (mic drop).","true":true}