{"101487":129692,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am\/was a huge Star Wars fan.  Going all the way back to the original trilogy.  I grew up in the 80s\\, so it meant a lot to me.  I very rarely have a problem with changes and modernization.  As long as they make sense.  I never have a problem with female characters as long as it makes sense.   The problem with the Last Jedi isn't that there is a female lead.  It isn't that she has no Jedi Lineage.  The problem with The Last Jedi is that its an awful\\, terribly written movie that completely disrespects the original trilogy\\, it's characters and fans.  They turn every male character into a clown\\, including the most important character to the story\\, Luke.  What they did to the Luke Skywalker character was reprehensible.  There is an obvious aspect of unnecessary social commentary throughout this film.  It's not one of equality\\, it's one of men can't do anything right\\, woman are the real Jedi.  The Rose character is worse than Jar Jar.  Whoever wrote this and made these decisions for characters needs to find a new career.  Snoke?  The possibility of a great villain down the tubes.  All for shock value.  Wow\\, surprising the audience doesn't automatically make a good movie.  It can also be a cheap way to sell a movie.  The obvious political agenda aside\\, this movie was just nonsensical.  Finn was wasted\\, so was Phasma.  Sure\\, it was visually stunning.  That is meaningless in a classic romantic saga like this.  Without a soul\\, content\\, substance and a story\\, all the visual hoopla is meaningless.  Rian Johnson and the folks at Disney in charge of Star Wars have ruined one of the greatest sagas in modern history.  Things were looking promising after Episode 7 the Force Awakens.  And then The Last Jedi sends it all down the toilet.","true":true}