{"101487":134473,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I know this sounds dramatic or like an over reaction but I swear it's not. I will not tear this movie apart point by point because there's plenty of that going on already. I want to say what this film did to me personally. This movie killed Star Wars for me. I have been a life long fan for 40 years. There is literally not a day that goes by I do not quote a line or bombastically belt out the Star Wars theme. Now I count myself among the so-called \\\"fan boys\\\" but I am not the cliche' stereotype that Disney would like to poo poo away. I am a forty year old man\\, married with 4 kids and a mortgage. I'm not some pimple faced\\, over obsessive man-child living in my parents garage playing video games next to a wall covered in toys. But that makes me no less a fan. I love Star Wars. I grew up with Star Wars. Star Wars is a part of me and it has been my greatest joy to share that love with my own children. I am part of the fan base that is the engine that drives this franchise yet Disney\\, specifically Kathleen Kennedy and Rian Johnson has destroyed everything I love about Star Wars. The film itself is an utter affront to me as a fan but the dismissive way they are belittling the fan reaction and not recognizing our honest disappoint is an outrage. The media spin on the movie reaction and complete lack of acceptance that they may have missed the mark with so many fans is contemptuous. What Disney is failing to realize is that by alienating and discarding its loyal\\, hard core fan base it is dumping all the fuel out of it's engine. The hype will be gone. The excitement and energy that generates online article viewing and advertisement \\\"clicks\\\" will diminish. The word of mouth turns to a trickle or even worse negative and resentful scorn. Toys stop being bought and this multi billion dollar franchise crumbles. It may not be today or tomorrow but watch how the next movie opens and how the toys sales plummet. The hard core fan base\\, the fan boys are the fuel and engine of these giant tentpole franchises. How anyone could think that taking all their hopes and expectations and throwing them away for the sake of being clever or for change is a good idea is monstrously arrogant. NO BODY asked for that! For these reasons I am sad to say - Star Wars is dead for me. I will not go to see another Star Wars film. I will not bring them into my house for my children to watch. I will not buy the toys for them. I will not view the articles or go to the theme parks. This is not a flippant or hot headed decision. I have spent the last two weeks wrestling with this. I seems like an over reaction to cut out Star Wars all together but I can not enjoy Star Wars after the way Disney has destroyed it. I have loved Star Wars as long as I can remember but it is going down a path I can not follow. \\n\\nI am breaking up with Star Wars.","true":true}