{"101487":139641,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-06","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw this movie 3 times so I could truly apply logic to it and not have it based on emotion.  The cinematics were very good and the movie had it's very good points.  Overall though it was so very disappointing how Disney has the golden goose of backstory and lore and decides not to tie in and connect to it.  So much time was wasted on scenes that were completely irrelevant not only to the movie but the overall star wars universe.  A film that had 3 hours of our attention yet didn't provide us with character background\\, left us hanging with character storylines that don't make any sense.  The storyline for every character in this movie was disappointing.  Great characters were created and I like them all but their storyline and the overall writing and presentation of this movie was a huge let down.  The cinematics were great but everything relating to the story was terrible.  I liked Force Awakens and thought it provided a great base which this did nothing to build on.  Disney CAN make a good star wars movie as i loved rogue one and liked The force awakens\\, but the overall storyline\\, character development was terrible and so much could have done with the screen time that was wasted on the casino scenes.  Now with all the political comments Kennedy\\, Johnson\\, and Abrams are making\\, it makes me dislike the movie that much more and makes me worry about the future.  if you want to be political then run for political office\\, you are paid to write\\, direct\\, and produce a good movie.  How about you focus on that which is your job instead trying to create a political agenda and throw out terrible negative social accusations that don't even make sense.","true":true}