{"101487":167506,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Snoke - wasted\\nLeia - Mary Poppins\\nHoldo - Doesn't explain anything. This results in the creation of an additional 1\/3 of the movie which was not required. Also\\, didn't think to use autopilot or a droid instead of her finale? Sigh\\n- Bombs dropping in zero gravity. There is probably an explanation in the wider canon but to the wider audience this looks even more implausible than explosions in space.\\n- Haldo is ok to sacrifice herself but Finn is not? I'm confused.\\n- Rose and Finn a couple. After 30 minutes together? Really? Seemed forced and unnecessary. Took Han and Leia 3 movies. \\n- Luke Skywalker: Pretty bad uncle\\, brother\\, teacher. Changed from legend to loser in the space of a few hours. \\n- Rey seems flawless. Not only best pilot\\, warrior\\, user of force without any training but also inherently good. Surely someone with her background and upbringing would have some resentment but no\\, 100% lawful good. The other characters are shown to have some flaws (Finn - cowardice at times\\, Poe\\, arrogance for example).\\nForce lighting has always been from the dark side. Now Yoda can use it from beyond the grave. I'm confused.\\n- Admiral Akbar. Wasted. Seems to have been killed off\\, off screen solely to have Holdo take over. \\n- Phasma wasted? Irrelevant? \\n- First order didn't think to maybe send a ship ahead turn around and destroy rebels rather than follow for 18 hours? We are shown later on that small light speed jumps are possible.\\n- No one thought to use the other ships as weapons much like the largest was. Instead they just let the fuel run out and the pilots go \\\"down with the ship\\\". So so dumb.\\n- Disney has tried very hard to make this movie very PC. Crossing fingers episode 9 is not Star Wars and the Disney princesses.\\n\\nAny point raised in TFA was made null and void from TLJ (Snoke\\, probably Rey's parents\\, Luke doing some decent stuff after being found).\\n\\nI also can't believe the contrast between audience and reviews here. It shouts corruption and points to Disney's deep pockets and power. If this trend continues\\, critics won't be necessary anymore.\\n\\nWhat a crock.","true":true}