{"101487":170326,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars The Last Jedi Review\\n\\nTo begin this review I will first off say that I did not hate the movie\\, there are some aspects I found enjoyable but this movie overall is a mixed bag. Researching some of the aspects behind the scenes are beginning to make more sense. \\n\\nThe Good\\nA handful of shots are incredible and iconic in their look.\\nThe Rey and Kylo dynamic becomes intimately stronger.\\n\\nThe Bad\\nCharaters and characterization are completely disregarded.\\nLackluster anticlimactic ending.\\nThe entire film is inconsequential\\, ultimately serving little purpose in the overarching story. (Mind you thats with the death of 5+ substantial characters.)\\nMessy writing with plot holes throughout. \\n\\nBeyond those bullet points I can say this is a very mixed movie that \\\"is not going to go the way you think\\\" but let us examine why that is. Currently the climate towards any SW fan saying they didn't love this movie seems to be that expectations are unattainably high\\, or that the film didn't unfold the way you would have preferred and similar. Personally I find that largely inaccurate\\, my dislike of this film has nothing to do with the movie not being what I wanted it to be though the film seems to be disappointing to many.  Rain Johnson takes existing character development and essentially throws it out and in many cases leaving confused characterizations to remain. Many characters feel more like a Spaceballs counterpart than anything. Humor is at a Prequel level of childish and forced. Dialogue is mostly poor sans a few good moments and the flow of the movie is all over the place. I like practically everybody didn't like the Casino scene whatsoever and could have done without Finn\\, Rose and DJ even being in this movie. Luke is inconsistent and changes his demeanor abruptly but ultimately Luke serves no purpose in this film other than stalling Kylo. Really this film is largely a waste of time\\, I've seen it twice and returned tickets to see it any further\\, it just doesn't give you any real substance other than the Kylo Rey dynamic. Rain Johnson wanted to make a Space Samurai movie and that he has done in style. Reports are than Johnson wouldn't agree to do this film unless he could throw out Lawrence Kasdans draft and do his own thing. This was a major mistake on Lucasfilms part. The original trilogy worked so well with 3 directors because the story was all coming from the same source\\, same with Harry Potter\\, and ALL other movie franchises. This movie is ultimately a misstep that I have no doubt will become a financial and receptive disaster. Rian Johnson your overly cockiness and ego got the best of you.","true":true}