{"101487":186065,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was a great addition to the Star Wars franchise and all the people who complain about the movie are just Original Trilogy Elitist who don't care about anything Star Wars unless it has to do with the original trilogy. These are the people that have been actively searching for things to hate about Star Wars ever since episode 1 came out in 2000. Star Wars VIII\\, while not perfect\\, was still an amazing addition. All I can say is episode VII was made for people who have been complaining since I so the writers made it somewhat similar to IV. Not Exactly the same\\, but with similar elements and fans complained. Now they make a movie that is \\\"Too Different.\\\" Just stop complaining about every little tiny thing. For the people who \\\"Claim\\\" to be Huge Star Wars fans\\, and then say \\\"Im done with Star Wars after watching this film\\\" you clearly aren't huge Star Wars fans if one film you didn't care for just ruined everything for you. How about stop complaining and enjoy it for what it is. It doesn't have to be your favorite\\, but everything isn't perfect. Overall this movie was a great addition in the Star Wars franchise.  \\nSpoiler alert:\\n\\n\\n\\nA couple of the flaws:\\n1. I didn't care for the Rose story\\, her character wasn't bad but it wasn't good. And the whole Finn and Rose side story was very unnecessary. BUT it didn't ruin the film. It wasn't anymore unnecessary than other scenes in Star Wars such as being in the worm in the meteorite for 20 minutes in V. And C3PO and R2 spending an hour in IV on Tatooine. It wasn't necessary but it didn't ruin the film. \\n\\n2. About the only flaw in the Funny side of the movie was when Luke threw his lightsaber\\, probably the only dumb funny part.\\n\\n3. One thing I have to address was Leia is alive still\\, yet she is the only OT actress who actually died in real life. To me this doesn't really make a lot of sense. And for the overuse \\\"Mary Poppins\\\" thing. No that is a movie ruiner\\, Leia was alway powerful with the force\\, we even knew that she had the force abilities back int he OT. The fact that her son had the force as well tells you that it flows through her. She was bound to be able to use it eventually. \\nA few of the things it did well:\\n\\n1. Likes death. Yes as a fan of Star Wars I would have loved to see a lightsaber fight from Old Luke\\, but what we got was much more amazing. Luke literally force projected himself across star systems to stall Kylo Ren and let the Resistance escape. That is something even Yoda was not powerful enough to do. Luke died redeeming himself. What happened with him and Kylo Ren literally killed him. And no\\, despite what some idiot said\\, he disconnected from the force\\, that is why he didn't know that Han died. Luke did something that was even better than Anakin did in VI and that is force project himself. That is a true Skywalker thing to do and I think he was the real hero for this. He died from exhaustion from using that much power. \\n\\n2. Snokes death was well done as well. To quote VI \\\"Your over-confidence is your weakness.\\\" Snoke was so confident in his abilities that he was clouded by the fact that Kylo was moving the lightsaber towards him. His death was quite epic. If you would remember when VI came out\\, we had zero clue who the Emperor was. We didn't even know his name was Palpatine until later on. All we knew about him was that he was evil\\, we didn't know his backstory or anything. So why is it such a problem that we don't know Snokes backstory YET? Give the writers time to cannonize his backstory before you completely bash it. \\n\\n3. Probably one of my personal favorite scenes in all of Star Wars\\, the entire scene with Yoda. This scene was amazing. Ive heard many people whining about Yoda destroying the tree with the books. He had to do it because Luke was tied to the books. He had to break Lukes ties to that to get him to see the real reason why people are Jedi's. If you remember\\, Luke didn't go through the Jedi order to become a Jedi. He became a Jedi just because Ben Kenobi gave him a lightsaber and he went to Yoda to learn the force. Yoda had to teach him what it really meant to be a Jedi and that is that the books did not define what a Jedi was. Once Luke was broken from that\\, he was able to see more clearly. This scene over all was amazing with really funny SmartA** jokes from Yoda.\\n\\n4. The whole Rey thing and not receiving training. If you remember\\, Luke didn't really receive training on how to use his Lightsaber\\, he received training on how to block bullets\\, not fight. He received training with the force\\, so why is everyone complaining that Rey didn't receive training on how to fight? At least Rey actually had her staff that she was quite great with. It is the same concept it is just a different weapon that she is wielding. It isn't like this is her first time ever picking up a weapon. \\n\\n5. Lukes portrayel. I thought his character was just fine. He was upset with himself for not only failing at being a Jedi master and training new Jedi\\, but he failed with his own sisters son! He truly felt like he was a failure and that is why he tried to distance himself from everyone else. This isn't a bad character choice for him. There is about 50 years in between VI and VIII and that is a long time for people to change. Obviously everyone does not stay exactly like they were when they were 20.","true":true}