{"101487":186766,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was not a bad movie on it's own but as a Star Wars film... it butchered the franchise lore. It actually destroyed every bit of hype and theory building surrounding Luke\\, Rey's parents\\, Snoke\\, and even Captain Phasma. There is absolutely no reason to invest in the world of star wars from here on out because the writers have basically said \\\"lol it's not that deep\\\". My biggest gripe is that they made Luke Skywalker so jarringly out of character I was removed from my immersion in the film. It reminded me that these films stories are being created by people just looking for a paycheck. We have tons of good movies with bold new ideas that break the expected formula of a story\\, but Star Wars is a world that belongs to the fans now who only want to escape from their own reality. Be honest\\, if you are jumping all in emotionally for a fictional series it is because you wish to escape the depression of life. This movie took the self insert hero character Luke from the original trilogy and made him flawed\\, mortal\\, and weak well after he conquered his \\\"trials\\\". It's a slap in the face to everyone who became attached to the legend they wished to be like. The new direction is about Rey I get it but as a character she has no struggles to overcome and succeeds at everything she does. Any foreshadowing in these movies is immediately a red herring so that now all expectations\\, all speculation\\, any reason to wish to follow this story further has evaporated. I enjoyed many moments and liked the risk taken with the main villain but I have concluded this was not made with the fans in mind. My advice would have been to make a new unrelated series instead of rewriting well established characters from scratch.","true":true}