{"101487":139404,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I recently upscored the Last Yedi. And i think you should too. The thing is that rotten tomatoes seems to not include scores below 1\\,5 Stars into its Audience Score. I had the feeling that 47% is way to high for such a steaming pile of shit so i went through 400 user scores and forced them into an Excel table. (NOTE: I did not include \\\"-NOT INTERESTED\\\" or \\\"+WANT TO SEE\\\" into my table).\\nIn the end if you take every single score into account i endet up at 25.70% Audience Score.\\n0\\,0 - 5\\,0 Stars - 25\\,70%\\n0\\,5 - 5\\,0 Stars - 26\\,16%\\n1\\,0 - 5\\,0 Stars - 32\\,05%\\n1\\,5 - 5\\,0 Stars - 50\\,44%\\n2\\,0 - 5\\,0 Stars - 61\\,07%\\n2\\,5 - 5\\,0 Stars - 77\\,62%\\n3\\,0 - 5\\,0 Stars - 85\\,15%\\nThese are the numbers i ended up with. To be fair there is a big discrepancy between 50\\,44% and 47% so take these numbers with a grain of salt. One thing is clear thow.  They most likly do not include scores below 1 and likly socres below 1\\,5 into their ratings. Thats why i gave it a 1\\,5 Star rating this time. Just so this wonderfull masterpiece gets not the voting we want but at least comes closer to the voting it deserves.\\nI think most of you already did a good job in pointing out the flaws\\, lacking logic\\, bad pacing\\, horrific characters and character development (that is if the character had a personalitity in the first place\\, i am looking at you Mary Sue.) that this movie featured.\\nI will boycott both the Hansolo Movie and Star Wars IX and I'd recommend you to do so too.","true":true}