{"101487":114608,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Dear JJ Abrams - for the final installment of Star Wars episode IX - can you please finally tell the story of how Rey and Kylo joined forces in the attempt to rid the Star Wars universe of Kathleen Kennedy and Rian Johnson. Working Title: Revenge4Skywalker #NotMyStarWars #DisneyRuinedLuke The galaxies most powerful Jedi master. Taught by Yoda and Obi Wan. The guy who protects his family and friends at all costs including surrendering himself to Vader in both Empire and Jedi. Surrendering to the Emperor himself to try and bring his father back from the dark side because he see's the light in everyone and how it is the most powerful force in the galaxy. This is the guy who we are told gets concerned that Kylo Ren is having dark thoughts and decides to murder him in his sleep - his nephew and the only child of both his Sister AND his best friend! Rather than be the true Jedi master and working with Leia to bring Kylo back he sets the course by trying to slaughter him in his bed. Sorry Last Jedi but you truly messed up even the most basic traits of these beloved characters. Not to mention - who is Snoke\\, nobody!?!?!?Significance of Rey’s parents...none!?!?\\, anakins lightsaber\\, the knights of ren\\, Leia floating like Mary Poppins through space\\, Rose kissing Finn\\, Poe fucking up about 4 times in the film\\, the entire resistance is so small they can now all fit on the Falcon\\, chewie got a limited role and Rey stood in front of a Force mirror and (careful spoiler) only got her own reflection Also why couldn’t Admiral Ackbar have the heroes moment instead of the “nobody” Amilyn Haldado self sacrificing by driving the cruiser through the first order ship!!!! ","true":true}