{"101487":156680,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"No story to it\\, story telling is dead and I certainly cant expect good story telling from disney any more. This movie is all about the visuals and explosions but the story is awful. Dont go to the movies expecting to see a real star wars movie\\, star wars from our childhood is dead. The audience score is well deserved\\, this is the worst and weakest movie of the series. Yes\\, worse than even the phantom menace. There are a lot of parts that are intended to be funny but the theater was dead silent. It was bad\\, and the humor not only felt misplaced but most of it detracted from the content of the movie. If you are watching this movies for answers from the last\\, you will be disappointed. There are very few answers and it leaves you hanging with many more questions. They could have taken out half the characters and most of the aliens and you could cut the movie down to about 20min and you would end up with the same movie. Disney goes out of its way to throw it's political agenda in your face. I was very disappointed by this movie and after this I have lost all hope that Disney can make a good star wars movie. I probably wont see another star wars movie in theater\\, I cant wait to borrow the han solo movie to see how bad that one is. I never thought I would say this but I want Lucas back\\, at least he knew how to tell a good story. \\n\\nDon't pay to see this movie\\, wait till its out and borrow it. It is not worth paying to go see.","true":true}