{"101487":194616,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well thanks a bunch Disney. You have absolutely murdered the soul of probably the greatest movie franchise ever . What an absolute embarrassment of a movie. I have loved Star Wars all my life \\, the original 3 were amazing\\, groundbreaking and masterful cinematography of their time. The Sith ones\\, well\\, they were ok. The first one Disney bought out a couple of years ago was good and I've watched it a few times. But then came this \\\"Last Jedi\\\" tripe. I really wanted to see this movie and I have Never been more disappointed in a film. It is quite obvious Disney are just looking to claw back a load of their money they spent buying the rights to these films. It's just an advertisement for new characters that they can bring out on pencil cases\\, socks\\, key rings\\, pound shop chocolates and other mass produced cheap rubbish that they can make a buck on. Since they bought the franchise you can buy any old tat with a \\\"Star Wars\\\" logo on. They really have cheapened a prestige brand. On top of that the film is frankly garbage. Luke is made to look a sad\\, pathetic loser. The plot is awful\\, the film bounces around with not a lot happening. Didn't a couple of directors pull ou5 of making this film? Probably after realising what a joke Disney was turning it into. But they managed to find this Rian Johnson? Who quite obviously said \\\" Show me the money\\\" I'll make any old b8llox.  £30 we spent on 2 of us seeing this tripe\\, if Disney or Rian is reading this then they should at least donate our money to charity as if I had known this film was gonna be this offensively bad we wouldn't ha e wasted ou4 evening. I will not watch another Star Wars movie again. Disney you really have made it obvious that you are all about profit only and nothing about keeping the soul of a movie franchise going. Please please please don't buy any other classic film rights and turn them into the same cheapened embarrassment thet you have scraped together here.","true":true}