{"101487":152936,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Many are saying there is a vast conspiracy to negatively review Star Wars\\, RT has explained they are monitoring their site and it is secure. So maybe it’s actually that this is just a bad movie that lets down the super fan as well as the casual fan. I’m not a Star Wars super fan\\, maybe that’s the problem\\, this movie had no plot\\, no premise\\, and seemed to forget that it was a sequel that had to fit into a larger story. It trashed everything that happened in the first film (the force awakens) and makes you feel stupid for having watched it because now none of it mattered. Then on top of trashing the force awakens it proceeds to lead down a monotonously long path that takes you absolutely nowhere leaving you wondering why the hell you came along for the ride. The film has bad dialogue\\, bad special effects\\, bad acting (there is a reason Hamill and Fisher did nothing after Star Wars) and its not that it’s a bad story a bad story would have been an improvement it’s that it had no story. From the opening screen crawl the movie goes off the tracks (spoiler?) the screen crawl lists that the first order is now on a tear destroying the galaxy and the Republic is in shambles. Hold it right there a republic filled with 1000 planets has three-thousandths of a percent of their population destroyed and the much smaller first order has their entire base and fleet wiped out in one movie but now they are the dominant force in the galaxy??! Absurd plot to begin with. But wait it gets worse\\, the resistance is now scrambling to retreat (right after their huge victory!) and this unstoppable force that is the first order\\, swoops in to wipe out the last of the troops. But wait this unstoppable force is suddenly stopped by a single pilot (and part-time comedian) Poe Dameron. He proceeds to wipe out all the guns on the first orders most powerful ship i order to make way for quite possibly the slowest ships in the Star Wars universe. For dramatic effect I assume they have these bombers that move at the speed of cold snot\\, and what do you know all of them are destroyed\\, except one. That’s right another single ship which manages again to destroy the most powerful ship. Ridiculous. Then Luke Skywalkers character ends up being a total twat\/douche. They have him make a joke of throwing away his fathers lightsaber. Then he proceeds to walk around doing weird things like squeezing green juice out of a monsters teat and drinking it. (Not a joke) no explanation is made as to why he came to this planet\\, what his goals are or what he’s been doing. He ignores Rey most of the time and after R2D2 shows him a clip from the original movie he gives her exactly one lesson that teaches her what the force is\\, not how to use it just what it is. She then proceeds to be the most powerful Jedi ever. Even though Luke and Anakin the previously most powerful Jedi had to have years of practice before they could do anything with the force. This review has gone through maybe the first 20 minutes of the film and its already to long-winded but there is so much more. There was no point no reason for intrigue. Save your money if your a super fan wait for the DVD not even Blu-ray worthy\\, if your not a super fan don’t even waste your time. ","true":true}