{"101487":194684,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well...where to start!\\n\\nI guess with The Force Awakens (TFA); here we had a movie that needed to be the most Star Warsiest movie to ever War a Star so that fans and newcomers could feel the magic of the original again. Perfectly valid from a Hollywood perspective. What did that do however? Well it put the store right back where it started. After decades the rebellion is no better off\\, the Empire is no worse off and our plucky heroes have disbanded. Now they're using the new trilogy to being us back to the point where we ended 30 years but with the added bonus of crapping on the old characters. With that said\\, the plot is slow\\, uninteresting and shoehorned in. The suspension of disbelief needed is astronomical. \\\"We're out of gas so we're going to cruise to stay just ahead of the Empire\\\". \\\"We could turn the engines off\\, we're in space and we'll sail at a constant speed even witho--\\\" that's when Leia and Purple hair chastise you for having no faith.\\n\\nThis is long winded let me wrap up *****Spoilers Below******\\n\\n-Snoke is a nobody....great\\n-Reys parents were nobodies\\n-Rose Tico is worse than Jar Jar and she blew Finn's character development.\\n-Finn is a stagnant character\\, should have let him go through with his plan at the end.\\n-Luke got a crappy send-off and his character is unlikable.\\n-Its not because this movie is too different\\, it's because it's not different enough.\\n\\nThey reached a real turning point in the throne room to legitimately make it new and fresh and they poo-pooed that so they could do the same story about rebellion vs empire and light vs Dark. \\n\\nHalf a star is being generous.","true":true}