{"101487":173784,"Last Jedi":"Last Jedi","2017-12-15":"2019-10-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The counterargument that this is a children's film and thus is unwarranted for any criticism is false. All films are worthy to be scrutinized\\, criticized and praised. The Films Christopher Robin\\, An American Tail\\, The Lego Movie and Ernest and Celestine are examples of excellent Children's Films and storytelling which involve issues of the day and are still relatable. But unlike those films this film falls flat\\, below expectations with its unrefined storytelling.\\nThis film fails due to the following reasons.\\nA travesty due to shoddy storytelling. Heavy handed author's voice that comes off as preachy and shows director's incompetent skill in weaving social issues and politics with no subtlety. Lack of creativity with still no progression of technology in the established universe. The writer's complete disregard to the previous film shows the writer had no intention of continuing the plot points set by The Force of Awakens(previous film) and the writer's outright refusal of team collaboration and also highlights the lack of foresight by executives in creating a coherent and consistent trilogy that flows from beginning to end. The film depicts previous established characters as if polar opposites. Terrible rushed uncoordinated fight scenes. Forced Marvel humor as if the audience is not cultured enough to understand it's a scifi movie. Insulting jokes such as yomama which is now not appropriate and outdated in this day and age of film. No thought put into military tactics which shows the creator's lack of interest in providing compelling battle scenes. Foolish and inept antagonists. Uncompelling  main protagonists that comes off as silly and\/or overpowered with no true inner conflict  or sense of struggle and trial. A true hero finds the courage to get back up when they fall. A character that never struggles and wins without trial or error is not worth watching. With no real sense of struggle there is no feeling of accomplishment felt by the audience nor the character. Because perfection is not an attainable state. Flaws is what makes a believable human character. The abscence of flaws in a character shows the writer's hand in wish fulfillment and playing out their fantasies. Which thus makes the character feel inhuman and alien. This film is a glorification of martyrdom which is a disgusting ideal and one not worthy of praising and is a redundant trope. Because the falsehood that you can inspire people with your death is destructive to society. You can inspire more people with living your full life rather than seeking martyrdom in death. This film exposes the falsehood of Hollywood\\, the media and its shills in pushing for a film the majority of its audience obviously does not like and has fully rejected.","true":true}