{"101487":146414,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I warned everyone after the Force Awakens was released. Disney was going to turn Star Wars into \\\"Frozen in Space\\\". It has happened.\\n\\nThis movie is perfectly aligned with Disney's vision for Star Wars' future. No hope\\, no empire\\, no rebellion\\, no good\\, no evil\\, no love\\, no friendship.. just an endless meaningless run around with deliberate miscasting to impose reverse racism\\, poor acting\\, plot holes\\, hollow action sequences which never get you to believe anyone is in any danger\\, all sprinkled with an overdose of mom jokes and product promotion for the next toy sensation made by Chinese slave labor.\\n\\nBut wait! there's more! How about we insult the intelligence of ticket paying audience by lecturing them on issues dear only to people living in the story writers' delicate bubble while the movie rolls on! \\n\\nWhat they did with the legacy of Star Wars?? This was Star Progs. Well done Ruin Johnson... you actually made the prequels look like cinematic triumphs. \\n\\nThis movie was like Ruin Johnson defecating on everything that we hold dear about Star Wars while Kathleen Kennedy and her feminazi band of story writers knocked on the door for him to hurry up and get it over with already. If you have to kill everything Star Wars at least give it a proper burial. Instead we got this turd.\\n\\nThe shills are in full force. Five star reviews asking us to watch it five times. Yeah like I'd let Disney see a penny from me. Fool me once... shills claim.. \\\"you were expecting this.. or that\\\". Yes! When you make $1b off of garbage like this you know it was only cuz you waved Luke in front of the rubes. Let's see Mary Sue and emo Ren open in theaters on their own without OUR Star Wars heroes. You think people pay money to hear lectures on misogyny from Vice Admiral gender studies?? Shills will say.. \\\"it was unexpected\\\".. No idiots .. if you remake Godfather where the five families are run by moms\\, made men are eating veggie sandwiches and through three hours no one is whacked cuz that will trigger snowflakes.. that's not unexpected... that's garbage!\\n\\nLeia Poppins is alive but Projection Luke died? When did the force work that way? Ever? Dead can now use lightning strikes in the living world..  ( nice sneak in of the book burning.. well done comrades). So next stop Force ghost Wars?.. Ben\\, Yoda Luke against Emperor\\, Snoke and Vader? Come on.. you know Ruin got all excited just thinking about the ways he could Ruin that too!\\n\\nI'm done .. yeah I know I said that two years ago but Disney has now blatantly displayed its hostility towards the original fan base.. I've received the message loud and clear.\\n\\nOne Star.. only cuz Disney Damage Control convinced RT to throw out 1\/2 star reviews as \\\"outliers\\\". That's why this stinker has a 49% score where the real number wouldn't crack 20%.\\n\\nBut of course it made a shit ton of money so what's not to like. Carry on Disney.","true":true}