{"101487":169407,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS BELOW......BEWARE!\\nI am surprised at the low audience rating on this site\\, this was a very good move that took Star Wars in a new direction. I wanted to address a few points that I have seen in the negative reviews. This is coming from an old school Star Wars fan\\, it's time too fight back.\\n\\n1. Quite a few people are mad because questions were not answered or their theories did not come true. First off\\, why would you answer all of the questions in the second movie of a trilogy? It's not over yet and since Star Wars is known for twists and turns\\, the next episode will probably be where you get your closure. \\n\\n2. People are mad because they didn't like what happened to Luke\\, they wanted Luke to go crazy with his lightsaber and chop everyone down. It's time for you to grow up....ummm....just like Luke did. Luke accomplished something that no other Jedi Master had accomplished in any other Star Wars movie or within the Star Wars universe period. This means that he learned his lesson(Yoda would always be on his case for being foolish). Also his father Anakin would be so headstrong that he would make bad decisions. Not Luke\\, he learned from his mistakes and ended as one of the greatest Jedi masters ever and his legend will be felt across the whole galaxy. This is more important for the character and the next movie.\\n\\n3. Snoke is dead. Why kill the bad guy in the second movie? There is no way they are moving forward with Kylo and Hux as the bad guys. You took the bait I guess. There are probably some surprises coming your way. \\n\\n4. Too much humor at times. I agree with this point and I hope they scale it back in the next movie. Especially with the bad guys. Yes\\, there are jokes in Star Wars\\, but I thought it was too much. But hey\\, no movie is perfect.\\n\\nI must admit\\, I was very confused when I left the theater the first time I saw this movie. I was still processing what I experienced the whole next day. Then I went back and saw the movie again\\, and it made sense. If you have the same weird empty feeling that I did\\, I recommend you watch it again.\\n\\nThis is one of those movies that history will be good too. Over time it will hold up as one of the better Star Wars movies and it will be important to the story. It really is great fun and I am pretty sure that the passive Star Wars fan or non-fan will love this movie at face value.","true":true}