{"101487":140396,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-13","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It had it's moments for sure which I won't mention in fear of spoilers for those of you yet to see.\\nNostalgic with a fresh new start\\, some amazing twists and real moments of awe.\\nFor all this the comedy got stretched beyond what it needed to be\\, the originals had humor yet it was well timed and not the focus\\, it gave value to the characters.\\nIn this one it was trying too hard and lost the balance.\\nAs a kid from the mid 70\\\"s this is till a religious experience for lack of a better term after being out all night and reviewing a movie\\, and not just any movie\\, a star wars movie!\\nI really wanted to feel the force again and at moments I did but whether it's the change of the guard on the business decisions and licensing agreements or that may just grow on me after I take my 2 young daughters to go and see.\\nI saw the 3D version tonight and that in itself was a bit overdone at time and had random short cameo's in between that were more disturbing than anything. If they used that time to develop the new generation and create more attachment to the story and be involved in the development then let that be the focus as it was for every original Star Wars fan. You can't tell me we don't all have favourite moments or favourite characters from the Star Wars universe?\\nMoments yes moments but please turn down the hollywood and give us more raw instead of a something that needs to be dressed\\, it is Star Wars after all and it's all about balance.","true":true}