{"101487":133677,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have been a SW fan and collector since I was a little boy. I've seen all the films on opening day\\, and to me these are more than just movies. So after the 'pretty darn good' Force Awakens\\, I had a new hope for these films once again.\\n\\nThat hope is dead. As Kylo Ren put it so eloquently: Let the past die. Kill it if you have to. \\n\\nAbout an hour into this movie I was still getting worried that I wasn't going to like. Thoughts were running through my head: \\\"when is this going to get good? And is it going to get good?\\\" I found myself not really into it. The beginning scene with Poe joking with General Hux was painful and out of tone for Star Wars. \\n\\nThis movie has a few big issues: First\\, it throws out everything we had invested from the previous film. It's as if they didn't even have a story arc written\\, and brought in some new writers and they basically said to each other \\\"How much can we mess this up?\\\"\\n\\nWe had burning questions like:\\nWho is Snoke? Who are Rey's parents? How is Finn connected to this? What will Luke be like as a Jedi Master?\\n\\nWho cares apparently\\, doesn't matter exclaimed Rian Johnson\\, the writers\\, and Disney.\\n\\nWell the fans care. And the fans made Star Wars what it is today.\\n\\nSecond\\, it relies too heavily on humor breaking the tone for serious moments. \\nThird\\, characters we have grown to love don't even act like the characters we love. \\n\\nThe first part of this film (well most of it) is a slowww chase scene\\, the middle is bogged down with a useless venture to a CGI ridden planet\\, and the third act doesn't do enough to make up for the slow and boring plot.\\n\\nAll in all\\, it just didn't feel like Star Wars. They threw too much out and tried too many new things\\, that just didn't work. In trying to modernize it and do too much they lost the magic that is Star Wars. Now basically Episode 9 needs to rectify and make up for this slop show. Thank god Abrams is back at the helm. It feels like there's no arc and no one knows where these characters are going or why.","true":true}