{"101487":195755,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What is the difference between The Last Jedi and Valerian and the City of a Thousand Planets?\\n\\nThey are fundamentally very similar. Both science fiction fantasies suffer from static characters meandering through uninteresting storylines encumbered by numerous plot holes that are surpassed only by the sheer amount of absolutely stunning visuals that the producers were hoping would be enough to supersede the complete lack of cinematic substance. \\n\\nOne of these films will be remembered for all time. The other would be forgotten weeks after its release. \\n\\nOne of these films made profitable gains after one week. The other was a financial disaster. One of them is preceded in its title by Star Wars. And that's the only real difference. \\n\\nThe critics seemed to be overly protective of their scores.  Forbes\\, Variety\\, Vanity Fair\\, Polygon and others have been rather childish in their name-calling of Star Wars fans who don't like this movie\\, calling them \\\"cry-babies\\,\\\" and \\\"misogynists.\\\" \\n\\nI didn't disapprove of this movie because of its politics.  I didn't have any squashed expectations about Snoke or Rey\\, as I didn't really care about either of them from episode 7.  \\n\\nWhat killed this movie for me was the treatment of Luke's character.  The people involved with this film have no understanding of Luke.  It's not character development...it's a different character.  It is Jake Skywalker.  \\n\\nAnd that hyperdrive stunt.  Visually amazing\\, but so ridiculously stupid.  If this is a thing you can do in Star Wars\\, why not travel to an asteroid belt\\, attach a small navigation system and warp engines (they're small enough to fit on an X-wing) to hundreds of asteroids and warp an asteroid field into a Death Star or capital ship?  \\n\\nIt's not that fans are afraid of something different\\, it just has to make sense to the already flimsy laws of physics set forth in the earlier films.","true":true}