{"101487":131314,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't usually leave reviews on movies as I generally like most movies to an alright degree. It was quite beautiful in many parts but it was in service to little substance. Virtually everything went nowhere. Basically\\, everything introduced in force awakens is rendered moot in this movie. Very little in the movie makes sense as presented.\\n\\nIt's very good at telling you one thing they really want to tell you but if you stop to think about it they end up being the other. Male heros are brow beaten and told that they're irrational and cost the resistance loads\\, but you find out later that their decision saved the resistance but they're still told they made the wrong choice. All the leaders of both sides are incompetent and half of the story relies on someone who's supposed to be a great leader to be one of the worst leaders I've ever seen.\\n\\nIf you can turn off your brain and hold it in your hand you can probably enjoy the special effects\\, but if you actually ask any questions you'll be maddened because hardly anyone makes rational decisions in service to the plot and the plot is simply riddled with plot holes\\, it doesn't really have any relevant character development. The more I think about it the worst it is. Watching critiques of the movie are far more fun\\, but I have yet to actually find a critique that encompasses all of the issues of this movie and the longest one I've watched is over 4 hours long.\\n\\nSpoiler:\\nThe kamikaze scene while absolutely gorgeous essentially invalidates much of starwars canon with how such situations are handled and any case where you're handling something large and expensive should be dealt with in the same way. The star destroyers\\, dreadnaughts\\, death star\\, star killers...etc...etc. All should be handled by light speed enabled drones","true":true}