{"101487":184478,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is a slap in the face to SW fans.  I've never made a movie review before\\, but I also never left a movie upset before.  \\n\\nAbout the movie:\\nNo character development.  TFA's setups are completely dismantled with little explanation other than to \\\"let the past die.\\\"  Ok fine\\, you want to be fresh then why have Luke\\, Leia\\, Chewie\\, the Millenium Falcon and a plot that poorly borrows elements from TESB and ROTJ.  Rey somehow turns into a Jedi with only 3 days of training; nonsense.  The Mary Sue is strong with this one.  Leia pulling a space Marry Poppins stunt was ridiculous.  The chase scene made no sense. If Finn+Rose can hyperspace away and then come back\\, why can't the FO have a few ships hyperspace and flank the rebel fleet?  Finn+Rose side quest added little to the story.  Actually\\, if Hablo had just told Poe what the plan was then basically half the movie becomes pointless.  Bombers in space?  There's essentially no gravity in space so that doesn't make any sense!  The Hux \/ Poe prank call opener was really stupid and tacky.  Why did Hablo have to sacrifice herself?  Could they not have remote piloted the ship and\/or have a droid handle it?  Phasma was a complete let down.\\n\\nOther gripes: this SW clearly inserted politics into the movie\\, something that other episodes were a lot more subtle about.  Definitely over-the-top SJW theme going on.  1%\/anti-capitalist scene at the casino.  Animal rights.  I think Chewie is now a Vegan.  Finn running from \\\"the cops\\\" (words never head in SW before).  Overt feminism.  Female leads are great and actually a nice change since the originals were male heavy.  It's only an issue in that the females are overly powerful (i.e. Rey) with no real track record.  It doesn't feel authentic.  Take a cue from Game of Thrones.  Plenty of women in power\\, but their positions were obtained by more natural causes.  Further\\, why do you have to make males look like bumbling idiots just to make females look better?  White males and the token Asian in the dreadnought are the bad guys.\\n\\nI have no idea why the critics are so far off from the audience.  Most of the periodicals covering this seem to be making a lot of excuses as to why the audience's opinion should be discarded.  The bot argument also seems to be bunk (could it be Disney setting up a fake account on FB for damage control?).  Mark Hammel warned us (though he retracted; I imagine thanks to Disney's legal team).  \\n\\nThis movie is so bad it makes the episodes 1-3 look increasingly better. Poor acting and a mountain of flaws\\, but at least there was a clear story line and some character development.\\n\\nI won't be seeing another SW movie in theaters.","true":true}