{"101487":121445,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First time leaving a review but felt compelled after seeing the Last Jedi.\\n\\nI am a huge Star Wars fan and like many loved the original movies but found the prequels to just be ok.  After seeing the Last Jedi I want to apologize to George Lucas for some of my feelings on the prequels.   At least those films were innovative and had heart.  I also loved Rogue One and liked the Force Awakens\\, thinking that it was a great setup movie for the next to films. \\n\\n    I felt that Rian Johnson's only motivation here was to tear down all that had come before to launch his new vision of Star Wars.  He was totally disrespectful to Luke Skywalker's character.  He took no input from Mark Hamill in the development of the older Luke Skywalker and used non of the previous movies to form the present character.  The fact that Disney signed off on this 180 degree spin on Luke Skywalker is highly disappointing.  Another example of Hollywood's fascination of the broken hero.\\n\\nThat being said the unnecessary spin off plots\\, bad CGI\\, and  horrible pace of the movie were also a huge issue.  Character development is no-existent and characters like General Hux and Poe become slap stick comedians with no depth.  JJ Abrams did a fantastic job setting up dramatic possibilities for this movie.  All those things that were setup were either not answered\\, answered in one sentence or just turned into a cheap joke.  The humor in this movie was also cringe worthy and felt like a Marvel movie ripoff.\\n\\nI hope that Disney learns from this movie that when you are creating a triliogy based on a larger saga that there should be a story outline for the grander story.  To allow one director to completely disregard story points that came before is irresponsible to the overall franchise and disrespectful to the fan base.  \\n\\nI am hoping that JJ Abrams can pick up the pieces that are left of the Skywalker saga and attempt to put them back together again.  However\\, RIan Johnson did such a good job of destroying this saga that he will have his hands full.","true":true}