{"101487":128305,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Horrible movieReasons why I hated Star Wars the Last Jedi\\n\\nSpoilers\\n-\\n-\\n-\\n-\\n-\\n-\\n-\\n1.The way the film first starts in this life and death scenario with big tension and they ruin it with shitty humour by antagonizing husk.\\n\\n2.The side story with Finn and Rose was pointless because at the end it did not progress the story at all.If the New commander who took over for Leia had told everyone the plan to escape the First order.Poe\\,Finn and Rose wouldn't have had to go rogue in order to save everyone\\,which they only made things worst and brought a shitty code breaker who later betrays them and costs a lot of rebels to die.\\n\\n3.They bring up this political point on how profit is being made by selling weapons to both the first order and the rebels but they don't expand on it.Same goes for slavery and animal cruelty.\\n\\n4.Rey goes to Luke asking him for help....Luke is a coward and is very much out of character and is sabotage over by the writers.Even Mark says he hated the film.It's reveal that Luke wanted to kill Kylo because he sensed Darkness in him.This is the same Luke who went on a suicide mission to try and save his father and bring him to the light side.It's NOT in Luke's character to try and kill his family member.He has a saving complex ??\\n\\n5.Despite Rey having almost no trainning what so ever\\,she's a natural with the force and lightsaber and holds her own against Snokes guards.Even luke wasn't this powerful and he's a Skywalker. \\n\\n6.Rey parent's are no one and they sold her for money.What a wasted opportunity.\\n\\n7.Phasma was going to play a bigger role in this movie?She had a couple lines and died again ?? being engulfed in flames.They never established how she escaped star killer base before it exploded.Wasted character.\\n\\n8.Who is Snoke? let's kill his character and give the audience no answers.Wasted character.\\n\\n9.Leia can use the force...It's no surprise but when did she learn how to use it?She somehow doesn't freeze to death and manages to pull herself back to the ship but oddly enough the shields are not up at the time making it possible for her to go back.??\\n\\n10.The first Order has a massive arsenal of ships and ect but take their time and just wait until the rebel shields go out?Makes no sense whatsoever.\\n\\n11.Luke uses projection to save the rebels\\,instead of actually physically going to help them.He dies either way. \\n\\n12.In the force Awakens luke leaves a map to his location.Why did he do that when he wanted to be left alone and basically die.Makes no sense","true":true}