{"101487":128579,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"How can a director with three flops to his credit helm a Star Wars movie.  It's all in who you know I guess... This made allot of money because there was high expectations after The Force Awakens\\, Carrie's last movie\/last depiction of her as Leia\\, Luke\\, and curiosity.  This movie alone has depressed expectations of Solo which is a fine movie.  I'm sure moving forward Rian has killed high hopes of future efforts as political correctness and social engineering is always going to be at the back of someone's mind when seeing future Star Wars.  Sad day.  \\n\\nThe key things here that kill this is the lack of respect for the Star Wars story.  Luke should not end up this way and it's like watching another person or an alter reality.  Something JJ Abrams loves and who may have gotten Rian this gig.  Yoda is a joke\\, the Jedi scrolls is a joke\\, the force is a joke.  Females are smart and the men are idiots.  Unbelievable happenings with Leia in space willing herself back on a ship.  A rehash of the Empire yet nothing is explained\\, the whole film is reactionary.  Ships can't escape other ships although they have the whole universe to fly to.  The new rebellion isn't fleshed out\\, their just there.  The films plays out like a bad video game online that plops you into the middle of a skirmish and the camera just floats along through it all.  You may as well be on a Disney ride watching all this.  This looks to be the future of Star Wars now as Rian J is not a passing fad.  He has three new Star Wars movies approved for him to helm.  The word is the fans can go chuck it. Totally different approach than what we are seeing with Stan Lee and Marvel.  It's hard to be mad at Disney as it is George Lucas who watered down Star Wars with the prequels.  Stan Lee never did that so they had to respect is vision.  Lucas lost his fire and now that he's sold it movies like this can be made with no push back from the original creator.  TLJ is a bad movie that single handedly changed the trajectory or the franchise.  We all hoped this would not happen but it has.  It will be funny to watch the theaters attract less and less audience with future movies.  The suites at Disney running around scratching their heads as to what happened.   Arrogance happened\\, Rian J happened (a director with no resume)\\, and a lack of serious concern for story telling happened.  Real talent has to be brought back to Hollywood.  I won't hold my breath waiting for that to happen.  It's more about who you know versus how good your gift really is.","true":true}