{"101487":148339,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just got back\\, so these are fresh thoughts. Hence\\, let me fanboy out a bit and then I'll get to the nitty-gritty. HOLY FUCKING SHIT! This was so amazing! I think I teared up in two scenes: one out of nostalgia and the other because\\, while The Force Awakens was supposed to be \\\"the passing of the torch\\\" movie\\, that moment with Rey lifting all the rocks was actually the one that I personally felt that really shifted the tide. Oh god! There are so many \\\"holy fucking shit\\\" moments that I couldn't even comprehend!! I was thoroughly amazed by some of the philosophical aspects that Rian has pulled off. \\nI am in love with every single character that is going to take the new trilogy forward. Yes\\, even Kylo Ren because he feels like the bad guy this trilogy deserves. I was very very very very very afraid that there'll be a complete turnaround but YES! because they didn't. OHHH!!! I was thrilled. I had goosebumps! There was so much powerful stuff in this movie and the music\\, the direction\\, the cinematography\\, the acting all came through in a very grand way. I loved it.\\nAlright. Now the actual stuff. There are three very major things that I didn't like. One\\, is the whole movie is taking place while the Resistance cruiser is being shot. That became too implausible after some time. I know all of it was happening simultaneously but come on! That was a really big big stretch.\\nTwo\\, was Snoke. That was utterly wasted. I understand that he had to die to make Kylo the ultimate villain but that execution was piss poor! He was talking about being all sensible and shit and he couldn't detect Kylo spinning the bloody light-saber. Although that technique was pretty awesome but I expected Snoke to show some hellish tactics there.\\nThree is certainly Phasma. I was ecstatic about the Finn VS Phasma fight\\, but the time and the place was again\\, a stretch. A bloody ship went through it. And also\\, the execution just took way too long. And Finn doesn't even KILL her. She just falls in. Bleh!\\nAlthough I think that the Finn-Rose plot-line won't be like and I am not a sucker for romantic relationships\\, but I give it a pass. They look cute together. But Benicio... eh!\\nOkay\\, now the stuff that I liked. Well\\, basically everything else. The cinematography was mindblowingly gorgeous and the way each of those pivotal moments meshed it was ORGASMIC! Everyone was so on point with their acting man!! Hamill probably gave the performance of the century. And although I think the late Carrie Fisher is a little wooden when it comes to emoting\\, but she had some good lines and holy fuck she is fucking strong with the Force. Oscar Isaac and John Boyega always gives it their best and they continued to do the same here as well. OHH! I am in love with Daisy Ridley's performance as Rey. Whenever someone says Luke\\, Hamill's face comes to my mind. IMO\\, years down the road when I'll be old and someone will mention Rey's name\\, Daisy's face will instantly come to my mind. And Adam Driver is at par with Ridley and maybe better. I can't say.\\nThe Porgs were fine. Chewie was a little side-lined but HOLY fuck\\, he redeemed it by maneuvering through Crait's mines. BB-8 was the show-stopper with some really fun and amazing moments\\, and it's a great successor to R2-D2. C-3PO was pleasant as usual.\\nI had made a little prediction about Holdo and that came true for the most part but I am glad that that was subverted. And that brings me to the point that Rian Johnson and his group of writers has done an excellent job of subverting tropes and predictions and cliched shit. The dialogues were great\\, and as I love over-lapping lines\\, I loved it. Rey's Dark-force-scene was pretty surreal. I am really glad that he decided to go with animatronic Yoda and his interaction with Luke was pretty nostalgic as well. I liked the fact that he kept the theme of conflict throughout the movie. The movie also made it very apparent that Rey and Kylo (the pillars of the both sides of the Force) are inexperienced. They are kinda immature and that's why they're susceptible to mistakes and childish emotions\\, and yeah\\, I loved it.\\nI also loved that even though I thought that I all know all about the Force and what the characters can do with it\\, but we don't. It reminded me of Blockbusted's explanation of how the MCU works. It just keeps adding things and adds to the lore in such surprising ways.\\nSo\\, all in all\\, I give it a 9\/10 for me. I have to have to have to watch it again. I don't think I've able to express all my thoughts\\, but I've done my best. Ah! I am still buzzing with excitement.","true":true}