{"101487":128459,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Horrible trash. I could write a thesis on how many things were wrong with this movie but I am too tired and irritated to do so. The plot made no sense\\, turned Luke Jaywalker into a coward\\,  and did not answer hardly any questions from the previous film. I am saddened for the next generation of fans who will never feel the drama and storytelling that I grew up with. I have been a SW fan since 1977 when I was 6 years old\\, but this travesty of a film may end my love for these movies.  K.  Kennedy and R.  Johnson should be fired\\,  rehired\\,  and fired again for this trash. How I wish Lucas had not sold out to Disney.  Get a descent writer and director like Steven Spielberg or \\nLucas for God's sake. What they did to Luke's character is unforgivable. How the hell can you take a guy who was willing to give up his life and the entire galaxy to try to save his father and turn him into a potential murderer of his own nephew is totally unforgivable.Nevermind the too many unfunny jokes\\,  the horrible plot\\,  killing off the main villain and treating Leah as if she is superman flying back into her ship after somehow surviving being in the \\nvacuum of space for so long. I could go on and on\\,  but what is the point? Disney\\,  K.  Kennedy and R.  Johnson do not give a rat's ass about anything but money and political agendas...and so the greatest space opera of all time will die because of lazy storytelling\\, character assassinations and lack of interest in giving fans what they promised 2 years ago. \\n.","true":true}