{"101487":146241,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wanted to enjoy this film. I am a huge Star Wars fan. I read the books\\, I watch the tv shows\\, even waisted money on the atrocity that is Battle Front 2 because of the supposed original story (that took all of 4 hours to play through). I just couldn't look past the flaws in this movie. Who is Snoke? What is the First Order? They completely waisted the opportunity to shed some light on the new world that we are in post Return of the Jedi. Though it seems the return of the Jedi is something that Disney had decided against seeing as Luke was a colossal failure in hiss attempt to bring them back. Without the Jedi and Sith conflict Star Wars seems lost at the moment. Snoke did nothing for me. He only had a few scenes with no explanation of who he is and what his motivations are. Is he a Sith or just someone who uses the dark side. In the end I didn't care when he died. Reys parentage was a complete let down as well. They set the question up in The Force Awakens\\, spending ample time to make this seem that it was very important\\, only to let us down with the fact that they were some junkies that sold their daughter for a fix. Wow what a shitty answer to a question fans have been speculating about for 2 years. I could go on and on about the plot holes in this movie\\, but others have already done so. Disney is destroying the lore of Star Wars and the reasons why so many of us love this world. Put someone who knows the lore and world\\, like Dave Filoni\\, over story decisions because they are making the wrong ones.","true":true}