{"101487":129566,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am not sure what can be said other then what has already been said. It is a mix of the Empire Strikes Back and Return of the Jedi except you don't care that much about the characters. I suppose one should have cared about Luke and Leia but the way both of those characters were portray hardly caused them to be endearing to long time fans of the series. The subplot with Finn and Rose almost seems like it was thrown in so that Finn had something to do and the First Order slowly destroying the Resistance\/rebels was slow and repetitive. The movie was drawn out way too long. It would have been better had they focus more on Luke training Rey but sadly\\, the new direction in Star Wars is that one simply has to believe in oneself and everything will be fine. Much of what people thought would have been answered from The Force Awakens has not been answered and Ben Solo is still as whiny as ever and an emotional wreck. It is hard to take him seriously as the main villain. Even though Snoke background is not elaborated on\\, he would have made a more interesting villain. However\\, I guess anyone who does not like this movie does not count simply because Disney made it and everything Disney make is suppose to be good. I honestly was not a fan of TFA to begin with but I could tolerate that one despite its massive flaws. Sadly TLJ makes me no longer care about the Star Wars universe anymore. Not until they show us that they can create a proper Star Wars universe. However\\, I guess it means nothing to the new and upcoming generation. I have never written a review until now and this movie just irks me to the point where I want to make a review. Luke's characterisation is the worse part about this movie but enough has been said on that already. However\\, Forbes and other media outlet are trying to convince us that we are wrong even though they keep saying that people can have different opinions. However\\, despite saying that\\, they are hypocrites. We have to believe the official narrative. This is how Luke is suppose to be like or he is better this way\\, blah blah. If I could give zero to this film\\, I would. I find it interesting that RT puts all the super reviewers reviews for all to see and they all happen to be super positive. 0\/5 if possible.\\n\\nJL","true":true}