{"101487":133716,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have hemmed and hawed for a long time about writing this review.  I have never reviewed a movie before\\, but I need to say my peace about this one so I can put it out of my head - hopefully.  I am going to do try to do this without any spoilers.  \\n\\nFirst off\\, I am a lifelong fan.  I saw A New Hope when I was 6.  It was the first movie I ever saw in the theaters and I was in love within the first 5 minutes.  I adored all of the subsequent movies in this series....yes\\, the prequels were not exactly quality\\, but they stayed pretty true to what I expected out of the story I followed for decades.  \\n\\nI knew this movie was going to disappoint me within the first 10 minutes.  When Poe was engaging in the telephone holding gag\\, I felt that the humor was wrong and I was worried about the tone of the movie already at this point.\\n\\nI was looking forward to seeing Luke again.  All I'll say is that there is a good reason that the #notmyluke is trending.  Character assassination is maybe too harsh a term\\, but his script was written by someone who has never seen the original trilogy.\\n\\nI grew to really like Rey\\, Poe and Finn in TFA.  I was anxious to see how our new trio of heroes developed in TLJ\\, but that does not happen.  The chemistry between Poe and Finn and Finn and Rey is wasted and instead Finn is paired up with a new character named Rose.\\n\\nFinn and Rose go on a really long and pointless journey.  This was the weakest part of this movie.  Rose is not a good character and there is zero chemistry (romantic or friend) between her and Finn.  I wish Finn would have gone on this outing with Poe instead.  Poe's character was poorly scripted too.  He was portrayed as brash and reckless.  Again\\, not the direction that The Force Awakens pointed these characters.\\n\\nRey spent this movie \\\"training\\\" with Luke and had several scenes with Kylo Ren. I found those scenes to be some of the best parts of the movie.  I thought that there was an interesting dynamic between them and the actors were superb. \\n\\nThis movie had some really terrible scenes.  I won't go into them here\\, as I'm trying to minimize the spoilers.  There were a few times that I found myself shaking my head in disgust\/bewilderment at what I was seeing and hearing in this film.\\n\\nThe last thing I will say about TLJ is that there was quite a bit of blatant politics at play.  The attempt to create a diverse cast was so obvious and I think a detriment to the movie.  Diversity is good\\, pandering is not.  Some characters seem to only serve a checkmark in the diversity box (how else can you explain Rose?).  The feminist message was overtop and I find it amusing and ironic that Disney (a billion dollar corporation) had language insulting capitalism and wealth in their movie.  Other messages - men are dumb\\, eating meat is bad and war is usually for profit for the 1%.  Some of these gems were blatant some more sublte than others\\, but they were there for the duration of the movie.\\n\\nI rarely see movie in the theater\\, about 1 a year.  If I view a movie I don't care for\\, I forget it soon.  I loathed this movie\\, but for some reason I cannot get it out of my head.  I guess that is because I truly cared for a long time about this story.  For the people calling anyone who didn't like this movie a \\\"hater\\\"\\, \\\"racist\\\"\\, \\\"crybaby\\\" or \\\"fanboy\\\" - that is insulting.  We care about these characters.  Many of us fans have followed this saga for our entire life or close to it.  I care about the direction these movies go.  The movie that I saw a month ago slaughtered everything that has built up.  I can't get over it\\, I wish I could.  I am just so saddened and disappointed by this.","true":true}