{"101487":114407,"Last Jedi":"Last Jedi","2017-12-15":"2019-09-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Critics will pander to it\\, fans like myself will despise how lazy and cheap this is. Force awakens was ok but this shoots down any plot or ark that any of the new characters have. Rey is a Mary Sue at best and a bland character at worst\\, she goes through no struggle with learning the force and is stronger than the main villain who has been training to be the most powerful sith for years\\, but no can't have logic in this new trilogy. \\nLuke skywalkers character is butchered in this film and I feel sorry for Mark Hammil watching his most beloved and iconic character being turned into a grouchy old hermit that lives on a rock and does nothing but bitch and moan this entire movie. His death scene is a slap in the face to fans\\, instead of dying like a hero\\, coming to aid his friends and family and sacrificing himself like obi-wan in a new hope\\, he instead force projects himself across the galaxy to fight kylo (never explained)\\, and makes a dad joke when he fades away\\, only to wake up the hermit planet and fade away and die again\\, why!!!??  \\n\\nI've also noticed that the only reason that the OG cast were in these films were to trick old nostalgic audiences into coming to see this crap only for their characters to be butchered and killed off in the laziest way possible. \\n\\nI would go on more about what I hate but other commentators on YouTube have given more entertaining and better reasons to hate this movie. \\n\\nSo yeah this film sucked. ","true":true}