{"101487":105946,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As someone who has followed the books both EU\/Legends and the current ones leading into TFA and TLJ and the shows Clone Wars and Rebels\\,  this movie was a complete let down on all levels. Every character digressed from TFA to TLJ. As BvS got Superman wrong\\,  TLJ got Luke wrong as well. The hero he was is no longer as he contemplates murdering his own nephew\\,  something uncharacteristic to his character and his refusal to fight and just plain give up on his friends is just sad and a disservice to his character. Phasma is Boba Fett 2.0\\, Finn being robbed of a heros death was mind-boggling\\,  after Phasma is defeated his character arc was over and the most fitting way for him to go was with what he first decided to do. Finn is now like Daryll from The Walking Dead\\, his arc is over but now he serves no purpose.  Kylo Ren hailed for his lineage which defines why he should be powerful gets thwarted once again by Rey who we come to find out has no lineage but for some reason is able to duplicate feats with the Force to rival Kylo.  I didn't want to believe it before but now she is even more of a Mary Sue for not having lineage. Snoke is a complete let down\\, coming inti this film we were given a set up for a good backstory that never came.... Who knew Jar Jar Binks had more depth than Snoke. Why show us Lukes X-Wing if he wasnt going to go rescue his friends? Luke dying from Astral Projection is a cheap way to kill a hero of his magnitude Count Dooku who was far older than Luke is in TLJ took on Anakin\\, Obi-Wan (in his prime)\\, and Yoda (also in his prime) and he didnt die from exhaustion. Kylo and Lukes he said\/he said about why Kylo betrayed the ordered is anti-climatic. Where are the mythical Knights of Ren? General Hux becomes a punchline in every scene and no longer can be taken seriously. For those that say this movie is too smart for people\\, let me say\\, this isnt the type of film that is smart...Interstellar is too smart for people not this one. Kylo seeing Luke in front of him and the audience seeing 1) Luke isn't leaving red footprints on the ground and 2) he ignites a lightsaber that Kylo knew he destroyed a few scenes before but yet fails to realize it with Luke in front of him.  Does this film ruin the main core of the SW lore for me?  Yes\\,  I won't see another numerical SW film.  Star Wars Rebels cannot be telling a better story than the main core movies but Disney found a way. It's a shame because even now\\, JJ was left nothing to work with heading into the final movie and its a sad thing to see.","true":true}