{"101487":132566,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If you enjoy this movie\\, that is ok.  If you do not\\, that is ok.\\nIf you do not agree with me\\, that is ok.  All I am saying is that there are things in this movie that I do like.  Here is a short list.\\n1) Rey\\, although she may be a bit overpowered\\, I can look past that. Suspension of disbelief and all.  She is a great character although the \\\"mirror of erised\\\" in the chamber of secrets scene tested that with me.\\n2) Yoda schooling Luke.  Even Masters have something to learn.\\n3) Poe and the opening scene proving how great of a pilot he is.  Everything after that in the scene is utter garbage. Nice slow moving bombers that get wiped out.\\n4) Got to see a character that looks like Luke Skywalker on the screen.  Does not act like Luke in any way.  Even though he has been disenchanted\\, after years of exile\\, he would have decided to do something about it.\\nThere are a few other things.\\nThat being said...\\nThose are FAR outweighed by the amount of canon destroying garbage that have been blended into this work. It has Star Wars THINGS in it\\, but it is NOT a work that positively contributes to the SW universe.\\nUtter garbage.  Here is the short list.\\n1) Canto Blight.  THE WHOLE THING.  Especially broom \\\"boy\\\"\\, but I will come back to that.\\n2) DJ.  Dumbest character ever.\\n3) Maz Kanata's shoehorned \\\"appearance\\\".  A VERY strong character wasted.\\n4) Wasted Finn.  Is he still FS?\\n5) Holdo.  Despicable character.Leia \\\"taught her everything she knew\\\"?  Really? Leia is a strong character that CARES about people and acts like it.  Holdo cares about her authority and protects it instead of sharing what is going on.  Waited until almost the ENTIRE flotilla of escape shuttles was wiped out before doing the \\\"Holdo Maneuver\\\".  Really? What is up that that name? NO ONE IN THE ENTIRE HISTORY OF SW EVER THOUGHT TO RAM ANOTHER SHIP WITH YOUR SHIP JUMPING INTO LIGHTSPEED?\\n5) Ending the film with Broom \\\"boy\\\" using the Force to sweep the floor and looking into the sky.  That entire epilogue was unnecessary.\\nToo many more issues  to list.","true":true}