{"101487":176006,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The lowest & worst \\\"attempts\\\" ever to make a SW movie! SW fan films with no budget have far better stories that fit canon better. Luke Skywalker is a worthless bum that tried to kill his own nephew in his sleep. Rey gets no proper Jedi training yet she is unstable as long as she manages to get a lightsaber in hand & wields it even if she has just gotten the saber. Finn is all but a joke. Leia is turned into Mary Poppins! The First Order are buffoons. Who is Snoke? Some dead guy! What's up with Kylo? Who knows\\, he seems to wanna cry all the time. SJW rules the galaxy now\\, very bad female characters everywhere that are not heroes but gets people on their own side killed. Expecting an epic duel? Nowhere to be found. And don't get my started on the meaningless casino planet! The Force is a joke now\\, anyone can be a Jedi now without taking real responsibility for it. Force Ghost Yoda uses lightning to burn down trees. Did anything in TFA or any of the previous 6 films matter here? Not at all! The Holiday Special was awful in every sense of the word BUT the OT characters at least remained in character back then! They don't here. Lots of shit happens but the film ends where it started\\, lots have died but that is just shrugged off. Everything is meaningless. SW is pushed down a shithole. This is beyond embarrassingly bad! You wanted payoffs? You wanted to see epic battles & duels? Luke teaching Rey the ways of the Force & together they fight against Snoke & Kylo? Get ready for the biggest disappointment in your SW life! Absolutely nothing what you wished for or what the marketing seemed to promise us is in here. There's no magic. The score is not good\\, the editing is all over the place. SW has been around for 40 years. it took only 2\\, 35 hours to tare it down. Ep 9\\, who cares now? SW is meant to take you to a galaxy far away & make you feel good\\, the perfect escapism. TLJ just makes you uncomfortable\\, at best. Those that demand nothing from their SW will enjoy this\\, they will enjoy the pretty surface. But for us that demand meaning\\, story\\, character development\\, a red thread connected to previous films\\, wonderful score\\, epic action\\, we must look entirely elsewhere.","true":true}