{"101487":103321,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Anatomy of a Social Justice Warrior (the people who liked this abortion of a movie)\\n\\n- Bleached hair: More common in females\\, bleached hair to show everyone how \\\"special\\\" and \\\"different\\\" they are compared to \\\"white male scum\\\". (SEE Admiral Lesbo Purple Hair Holdo)\\n\\n- Fat: Because obesity is not a medical condition\\, nor are STDs. They are special features to carry with pride. Also being fit is a privilege! Shoo! (SEE Fatty Ugly Stupid Diversity Girl Rose)\\n\\n- Portable ballsack: Having failed in any department of male roles\\, they carry their masculinity as a weight\\, and blame \\\"toxic masculine culture\\\" for their inability to get anything done in their life. (SEE Rian Johnson and also his caricature of Luke Skywalker)\\n\\n- Cultural Marxism Studies: Always into arts or social studies because they are unable to deal with anything in the STEM fiels\\, due to the fact that \\\"logic is a patriarchy construct\\\". You won't find two SJWs with different opinions on any subject\\, let alone politics or Disney-produced Star Wars movies. (SEE Kathleen Rich-as-Croesus Kennedy or Di$ney)\\n\\n- 1% Lean Mass: Because muscles are symbolic of \\\"toxic male culture\\\"; a real man doesn't need to be in shape. But mostly because they never worked a day in their life.\\n\\n- Veteran keyboard warrior: SJW never debate in real life unless there is nobody to contradict their conspiracy theories\\, so they spend their time acting macho on the Internet to compensate their lack of masculinity in real life. Some direct movies for the same reason. (SEE Rian Johnson)\\n\\n- Trust Fund: SJWs had a very privilege start in their life; trust funds and permissive parents letting them leech off them until at last their mid-30s. SJWs have no idea what \\\"earning\\\" means; they want everything handed to them (SEE Rey as Mary Sue)","true":true}