{"101487":105082,"Last Jedi":"Last Jedi","2017-12-15":"2017-07-20","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a huge Star Wars fan I was pleased. Now this film is not perfect. Now it has great action\\,acting\\,characters\\, and effects. Now the Finn and Rose  subplot is the worst part of the movie. I drags the story down and leaves me wanting to see more of Luke and Rey. Luke and Rey have a great dynamic between each other. Also Mark Hamill is great as Luke in this film. You can see that he is a damaged man after the betrayal of Ben Solo.\\nKylo Ren's character is one of the greatest strengths of this film. He is a conflicted person to the core and that's what makes him interesting. Him killing I have mixed feelings about. On one hand for I love it because it's a big moment for his character and shows that he is trying to destroy all connection and go on his own path. On the other hand though it completely destroys the backstory of snoke that we wanted to know. We also find out who Rey's parents are and they were drunks and terrible people. I love that because someone in star wars for once does not have to be a skywalker. Poe Dameron a character I loved in the force awakens \\ngets to shine more here which is a good thing because he really did not have that much scenes in the last film. Leia using the force I had serious issues with. I loved the idea of leia being a jedi but in the context of getting blown out into space she should have died. But Carrie Fisher is still very great in this film and it is sad to not see her in any more. Rose Tico is not a bad character by any means but one that I didn't care for. However Kelly Marie Tran does a decent job. Rey is still my favorite character in the new trilogy because she is a caring brave person. My favorite part in the film is Luke confronting Ben. I was shaking during that whole sequence and it was a proper send off to Luke's character. Over all this movie is pretty good and I would highly recommend it.","true":true}