{"101487":113589,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Complete disaster that leaves one wondering if irreparable harm has been done to Disney's Star Wars franchise. By \\\"irreparable harm\\\" I mean diminishing returns for all SW movies going forward and being left out of the cannon by Star Wars fans forever. \\nThe Force Awakens was a disappointment mainly for its lack of originality and for taking the triumph of the ending of Return of the Jedi and making it a hallow victory in nearly every sense. Outside of that tough pill to swallow\\, TFA was at least a funny movie with two likable new heroes and bad guy who was pretty awesome until he took his mask off. (You might be able to argue that the entire trilogy turned for the worse in that very act.) TFA also had a couple great scenes as its climax\\, both in the tragic though heroic death of Han Solo and the moment Rey first lit a lightsaber - the billion dollar scene for Disney\\, you can practically hear the cash registers going off as soon as a lightsaber lit in a woman's hands. \\nUnfortunately\\, The Last Jedi has none of those things while continuing to destroy the OT in ways that TFA only hinted at. Rey has virtually nothing to do until the final 10 minutes of the movie. Her backstory is presented as a middle finger to all the Star Wars fans who wasted their time theorizing who she might be. (Personally\\, I still don't buy it. I still believe Rey is Kylo's twin sister.) Finn has NOTHING to do and is thus given a side quest with as much relevance to the rest of the story as Monty Python's Quest for the Holy Grail. Oh\\, Finn has a character arc. The problem is it is the exact same character arc as in TFA. Poe Dameron has a character arc. The problem is it is not only demeaning to men but also pretty insulting for the guy who practically single-handedly blew up Star Killer Base in the last movie. In this movie he is to realize he is a reckless moron and should stop being a reckless moron. Kylo Ren isn't even a character anymore. He is a plot device that does whatever the plot needs him to do at that moment. That essentially makes him similar to BB-8 without being cute or funny. \\nThere are plotholes abound you can fly a Star Destroyer through. Frankly\\, if I only talked about the plotholes\\, the list would be longer than this entire review. Numerous attempts at humor that are cringe-worthy. Even though the very galaxy is at stake\\, no one seems to be taking it very seriously. The new characters introduced - Rose and Admiral Holdo -  both seem to be nominees for the Jar Jar Binks club. And don't even get me started on Luke Skywalker. Forget his character being consistent with the OT. His character isn't even consistent with TFA. \\nThis is the first Star Wars movie that I will not see multiple times in the theater. It is the first that I will not buy. Frankly\\, I don't know where Star Wars goes from here. If I was JJ Abrams\\, I would treat this installment with the same amount of respect that Rian Johnson treated TFA... none.","true":true}