{"101487":196248,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where do I even begin.... I am just going to write as I think haha Poe is trash. TRASH. I love Oscar Isaac I think he is one of the best young actors in Hollywood\\, but he becomes less interesting by the minute. He is a whinny character that literally does nothing but get in the way of Laura Dern\u0092s \u0093plan\u0094 (that if she just had told everyone at the beginning a lot of time and lives would be saved). And bro what the ACTUAL HELL was the Leia space scene about!? That has never been how the force has worked and I refuse to buy into the fact that the force has just all the sudden evolved. In the prequels and OG trilogy nothing even remotely close to that has ever taken place. And the fact that Leia\u0092s death was teased so much and she never died was done in extremely bad taste\\, considering Carrie is tragically dead in real life. AND OH MY GOD THE DIALOGUE WAS ABSOLUTE TRASH. It was like the director felt he had to hold our hands through even the simplest of plot points. Something would happen and then a character or two would audibly describe what just happened. It seemed like a poorly made anime tailored for an exclusively 6 year old audience. CASINO WORLD(if you have seen the movie then I need say no more)\\nSnoke was given ZERO reason to even remotely matter. He was not given any back story. They didn\u0092t show us how he came into power or how he allegedly corrupted kylos mind. And I actually thought that he was the saving grace for the first chunk of this movie. Then he is just cut in hAlf because he wasn\u0092t paying attention while he was rambling about how he is all powerful and always know what kylo is thinking. And then their is Rey...Rey literally had become one of If not not my favorite characters after 7 and that was because I assumed that all the answers to how she was so powerful would be answered in the last Jedi....boy was I wrong. She is just the daughter of a drunk who sold her for a quick fix. DUMB. I was not on board for her to be the daughter of any previously mentioned or seen characters\\, but I expected something. The whole idea of \u0093Anyone and everyone can be special\u0094 in this movie is total CRAP. If everyone is special or everyone can be a Jedi then that makes no one special. Everyone special=No one Special. And boy did they ruin Finn. Wish he died. Truly. What a waste of a truly interesting idea of a storm trooper turning good. And his \u0093Love Interest\u0094 that literally comes out of NOWHERE AT ALL. at no point in the movie was there any type of foreshadowing to that moment. NONE. Laura Dern and Benicio Del Toro are great actors I love most things they are In. They were ALSO a waste. Kylo showed no progression what so ever as a character. NONE. He was a whinny baby when we met him and he still is. He was also ALL OVER THE PLACE. I am evil. Now I wanna be good. Jk I am evil. I understand there is an internal struggle but like show SOME progression. And all that brings to me to by far the most unforgivable sin. The treatment of Luke. It started early when he tossed his fathers lightsaber off a cliff. the same light saber he used to save the universe. Then he was a paranoid sarcastic dickhead the rest of the movie....until Hologram Luke. YIKES KILL ME. are you kidding me. That was such crap. Apparently the force has changed a LOT (completely) in 30 years. Then Luke just dies cause he decides to?? Even though he said like 30 minutes before that he was \u0093waiting to die\u0094 ?????? WUT... Horrible treatment to one of the most BELOVED characters in modern film. The reason go on and on and on. I literally am thinking if 4-5 right now that I could write about but I think you get the point. If you want to like this movie that is fine but people need to see this movie for what it is and that is a significantly flawed movie that struggled to execute all of its big moments. The state of Star Wars to me personally is in BIG TROUBLE. like WOW. It might genuinely be my least favorite Science Fiction movie I have seen in a long time.And apparently the dark side is a whole in the ground on an island filled with mirrors that literally reveal very little if anything about the character.And the NOT so subtle \u0093Save the animal message\u0094 ??????\\nKill me.There is literally a scene in which a guy reaches down and picks of the dirt(salt) and then spits it out and goes ...\u0094ew salt\u0094 KILLLLLLLL MEEEEEE","true":true}