{"101487":139930,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Is The Last Jedi worth watching once? Yes.\\nIs The Last Jedi a worthy Star Wars canon movie? Hell no.\\n\\nI'll try to articulate my points.\\n\\n[Spoilers Below]\\n\\nMark Hamill gives an excellent performance\\, and likely is the key that saved the film for me. While others hate what Luke Skywalker has become and does in the film\\, I am fine with the director choosing not to commit fan service with his character. Luke was a whiny\\, reactionary man in Star Wars and Empire Strikes Back\\, and gave in to his emotions for a brief bit in Return of the Jedi\\, so I find his portrayal in the Last Jedi well within the bounds of his character.\\n\\nOnly Rey\\, Luke\\, and Kylo's characters seem to have any depth to them. So much so that it almost feels like the director was annoyed he had to include any other characters. The plot decisions made echo the choices made by one who has no interest in anything that has happened before in this universe\\, and all but poops on every decision made and question invoked in the Force Awakens. For example:\\n\\nKylo's cool helmet and voice? Get rid of it.\\nKylo's scar? Move it.\\nRey's parents? Answer it in passing.\\nMaz? Have a quick\\, mostly meaningless cameo.\\nFinn? Invent a new character and send them away to spin their wheels.\\nPoe? Give him one-dimensional dialogue to keep him busy until the next fight.\\nHux? Trivialize his competition with Kylo and turn him into a toady by the end of the film.\\nPhasma? Use her enough to include in the marketing\\, then get rid of her.\\nSnoke? Use him as a McGuffin\\, then get rid of him.\\nHyperspace?  We can track that now and also use it to destroy entire Imperial fleets easily.\\nKylo's torn insides? Yeah just kidding he's totally evil and one dimensional.\\nMiniature Death Star Laser?  Has difficulty with 10 feet of metal.\\n\\nThis was a movie made by a typical Hollywood director who didn't want to be constrained by any tradition or prior choices in the ongoing saga.  The entire Finn arc seems to exist only so the director could show a boy grabbing a broom.  The director seems so dumbfounded and unable to do anything with this ensemble of characters\\, that his instinct is just to reduce the extended cast to typical film tropes or eliminate the characters entirely.  The plot and direction just seems rushed and lazy\\, with the exception of Luke's and Rey's arc.\\n\\nI'm not upset that this movie made a few bad choices.  I'm upset that Star Wars is a saga that has traditionally been about lore and storybuilding.  This movie is a cookiecutter blockbuster that really doesn't seem to care what came either before or what comes after it.","true":true}