{"101487":155836,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Never posted here before but sick of reading that all the negative comments re this movie are from bots\\,trolls and total fanboys none of which I am. To say I am very disappointed with this film is an understatement. It's not that the movie is bad on all fronts the cinematography\\, sound and music are great but the plot and writing of this film are awful.\\n1. A lot of it is a rehash of significant parts of TESB and ROTJ ( some of the throne room dialogue is almost identical to ROTJ. We have a battle in salt plains rather than snow in TESB  -seriously.\\n2. The whole Canto Bight thing is a total waste of time. That 25 minute subplot puts the pacing of the movie on it's rear\\n3. Killing of characters without the audience finding out anything about them is stupid. Maybe someone should tell the director\/writer that story twists do not always a good story make. Who was Snoke don't know probably don't care. \\n4.The Leia superman scene was farcical-it was almost like a parody in fact too much of this movie was. \\n5. Rey has super force powers even though she has had practically no training in the force. why how -who knows and in my case I probably don't care.\\n6. Most importantly what totally spoiled my enjoyment of this film was the characterisation of Luke. I waited almost 35 years to see Luke Skywalker back on the big screen and we get this. Our brave Jedi master the only one who could see good in his mass murdering father Vader and risks all to save him  has rum away to an island after almost nearly killing his nephew Kylo because he might turn dark. Seriously!!!!. As well as that he doesn't use the force anymore so doesn't know Han is dead. He also throws his old lightsaber that Rey gives him away. This definitely ain't my Luke Skywalker!! Granted he eventually helps the resistance in a quite spectacular scene but even that is a con as he doesn't really leave the island and it's an astral projection we see and then he dies of exhaustion (but never mind little kids can use the force now to move brooms- so everything will be fine). You can tell this is now a Disney movie. I could go and on with the problems I have with this movie. \\nAll I will say to finish is that as we now have Super Rey versus Whinney( Kylo Ren) who is no way near as scary as Vader or the Emperor there is little to interest me in seeing any future films.That is a shame as although I thought TFA was a total rehash I liked RO a lot. but don't think Junior Jedi Knights or whatever is for me.\\nI give this film 2 stars for Mark Hammill's performance and a half for cinematography. Such a shame it could have been so much better. Don't think alienating older fans like me will work well for the future of the franchise.","true":true}