{"101487":190902,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Unfortunately for Rian Johnson - this review is not going to go the way he thinks it is. The Last Jedi is not only just the worst Star Wars movie in the franchise but it is just a bad movie in general. It comes across as a B-movie that whilst having great special effects\\, contains a storyline with no substance and dozens upon dozens of plot holes. There are literally hundreds of videos on YouTube that go through all these plot holes so I'm not going to rehash them here. Suffice it to say that this film spectacularly manages to not only destroy the course of its own trilogy but of those that came before it. It's a complete betrayal to Star Wars fans insulting both their intelligence and essentially disrespecting them on many levels. The Star Wars Xmas Special was better as at least it had a feel good factor. \\nI'm giving it a half star just because of Mark Hamill's performance (otherwise it would get zero) who despite the total evisceration of his character Luke Skywalker\\, played this altered ego with utter professionalism. I was genuinely excited when it was first announced that the late Carrie Fisher\\, Harrison Ford and Mark Hamill would be reprising their roles but the way they have been depicted in this new trilogy has just been very disappointing. Disney said that each movie was to be a story about each of the OT characters - err no - it's a method to kill each one in turn whilst extracting cash from mislead audiences. \\\"Let the past die\\, kill it if you have to\\\" - well no actually that's such a dumb philosophy. Are blockbuster movie writers so weak nowadays that they can't interweave characterisation's and storylines with both new and old characters. Ask yourself - just why exactly do the original characters need to die? To make room for new ones and for the story to progress is nonsensical. I used to be so excited about hearing about new Star Wars movies (Rogue One was excellently done). Look where we are now - the whole of the resistance basically fits into the Millennium Falcon which according to Wookiepedia suggests a max capacity of about 16. In a galaxy of trillions of sentient beings\\, billions of planets and thousands of massive space armadas we're left with a resistance band who can fit into my front living room. Episode 8 tells us a story about one of most powerful Jedi that the galaxy has ever known bested by a girl with absolutely no training and then later on fades into nothing because he's depressed. A man who left a map for people to find him because he doesn't want to found. Really? This is the best you could come up with? I really don't see what there is to look forward to in Episode 9 and beyond.","true":true}