{"101487":130477,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I did not like this story.   The visuals were great\\, but the story is a disgrace to the Galaxy far far away. Look\\, I'm a black male and while I struggle to explain Privilege to some of my white male friends\\, this SJW crap is a turn-off.  Shoot I dont need to see a black man to relate to a character\\, please trade me a black character for a good one.  I'll take a great character over a pointless\\, non-heroic black janitor who is always running and just head over heels over the white female who is not even into him.  There is so much to be disappointed by with this movie.    PLEASE show some black characters in the first order\\, this image of a white male dominated space nazi group is horrible\\, well when you consider that the only white males are either \\\"fly boys\\\"\\, old \\\"get off my lawn\\\" hermits\\, and\/or evil.  We dont need this.  Nobody wants this.  My son doesn't even care about these characters.  Rey doesn't earn anything.  She is a MARY SUE\\, she is the epitome of it from here on out.  The type of humor in this movie has no place in a SW film.  The \\\"save the animals\\\" crap\\, is horrible.  I dont want that.  I rather prefer my carnivorous diet as a matter of fact. \\n\\nI had an open mind\\, I was open to anything besides making Luke a beta boy who dies of force exhaustion.  Give us a heroic Luke\\, LightSaber battles etc.  Heck\\, he can lose and die\\, thats fine I can accept that. BUT I cannot accept Luke creepily suckling a space cow? What?  What movie did I watch? Who wrote this? \\n\\nThis movie is a propaganda piece to push this \\\"girl power\\, boys drool\\\" leftist crap.  We dont need it.  We dont want it.  I can't think of one character I'd want my boys to relate to and look up to in this film. That is a statement for a SW film.  So sad.","true":true}