{"101487":167810,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So... Full opinions... Avoiding spoilers...\\n\\nAhem...\\n\\nThe Last Jedi is *The Worst* Star Wars movie ever.\\n\\nIt didn't quite kill Star Wars for me. It did kill any interest in the Mary Sue - er I mean \\\"Rey\\\" Trilogy.\\n\\nI will not be seeing Episode IX unless some MAJOR course changes happen.\\n\\nLike any movie this had good and bad parts.\\n\\nThe good: There were some absolutely gut-busting scenes. The fight scenes were dynamic. The film did great scene and technical composition shots well.\\n\\nThe bad: the movie relies too much on comedy to break up tense moments. There are too many fast cuts. The scenes don't maintain tension when they should be tense. That ruins the atmosphere of some dramatic moments.\\n\\nThe writing is bad if you have half a brain and take two seconds to analyze it. Characters say things that make no sense and a supposedly great military Commander has absolutely zero ability to understand the risks of morale drop among her crew.\\n\\nThe (bleep)ing bad: the parts that REALLY bothered me were the sections that relied on \\\"rule of cool\\\" rather than \\\"if things could do that it would be weaponized\\\" and that just annoyed me.\\n\\nRey IS a Mary Sue. Period. (Bleep) that character. She sucks so bad. I want her gone. I hate her with a passion.\\n\\nI felt the film intentionally insulted me as a real fan. Repeatedly killing off beloved OT characters for no reason while repeatedly telling me to\\, \\\"let the past die.\\\"\\n\\nWell (bleep) you Rian Johnson\\, I hope your career dies.\\n\\nCharacters act in ways that aren't consistent with how they should. Other statements are made that\\, on examination are outright incorrect. As if we are too stupid as an audience to realize it.\\n\\nThe symbolism in the film is heavy handed. Johnson pushes a political agenda that I don't disagree with\\, but he pushes it in such a clumsy heavy-handed manner that I wanted to grab certain characters who were trying to be\\, \\\"strong and independent\\\" and throw them out the airlock. I was actually begging Poe Dameron in one scene to pull his blaster and put a bolt right between a certain Admiral's eyes.\\n\\nCharacters are killed casually\\, in throwaway scenes wasting a ton of potential. Other characters are marginalized to the point that they shouldn't have been in the film at all.\\n\\nIn short:\\nGood technical work\\, good\\, but sometimes out-of-place comedy\\, but brainless execution of maintaining verisimilitude. The pacing was terrible with too many needless scenes. The movie failed at creating a consistent atmosphere. Imagine if Luke Skywalker started cracking jokes while facing the Emperor in return if the Jedi.\\n\\nThe film answers nothing and completely contradicts and invalidates huge parts of episode 7.\\n\\nIf you're a casual fan\\, go see it in theaters and you'll like it. If you're a die hard? Skip this steaming pile and catch it on Hulu next year.","true":true}