{"101487":175578,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi manages to disrespect all of the lore and foundation the saga has set up to this point just for cheap wow factor. There are great scenes\\, but there are just that -- scenes. The movie as a whole suffers from being focused on too many things at once. Think the opening battle of The Phantom Menace but for the entire film and more boring. Did the movie throw a ton of fan theories out the window? Yes. Was it entertaining? Yes. That's why I gave it higher a 2 1\/2. The other 2 1\/2 points are for substance and this movie has little to no substance.\\n\\nSPOILERS AHEAD!\\n\\nOnly one of the three or four subplots the movie has is interesting (the Luke & Rey plot) and even that plot is plagued by an out of character Luke Skywalker who was comfortable with murdering his sister's son in his sleep because there was some darkness in him. This is not the same Luke that tried to save his Jedi-murdering father. I will say that Mark Hamill did a great job with what he was given. Finn's subplot is almost meaningless in the film and Poe's was by far the most frustrating. Laura Dern's character\\, Holdo\\, who seemed to be introduced just so they didn't have to have an important character sacrifice themselves withholds information from Poe for the entire film. Then after he attempts to lead a mutiny against her and he ends up getting stunned by Leia\\, she says that she likes him. There was really no logic to this entire subplot. Kyle Ren shows promise but director Rian Johnson never really has the confidence to pull off a daring plot twist as far as both Rey or Ren is concerned. And if you're expecting anything from Hux\\, Snoke\\, or Phasma in this film...don't. Hux is reduced to a buffoon right at the beginning\\, Phasma is killed\\, and Snoke is cut in half. Yes\\, Snoke getting killed is a good plot twist. But did it actually benefit the story other than making the audience gasp? I don't think so. Snoke\\, as well as Luke\\, who actually never returned to the fight against the First Order and projected himself across the galaxy instead\\, should've both died in Episode IX if it was absolutely necessary to kill them both off. The lack of backstory for important characters or political setup for the Sequel Trilogy continues to be a problem.\\n\\nOut of place humor ruins several moments in this movie. Whoever came up with Rey's first connection with Kylo (these segments were good scenes) being interrupted by island nun-janitors and a scene where Luke milks an animal in front of the audience should no longer work on a Star Wars script. Every Force user in this movie is incredibly overpowered with no explanation and I'm sure it will leave a ton of casual Star Wars fans utterly confused as to what is going on on screen. Leia in particular has a cringeworthy moment where she survives space despite the only Force power she's shown before being her connection with Luke. Lastly\\, Yoda returns and shows us that Force Ghosts can cause a thunderstorm with the lift of a finger. This\\, along with other things in the film\\, create so many plot holes in the saga you almost have to consider this film non-canon to take the tension in the first six films seriously.\\n\\nIf you're a fan of George Lucas' first six films\\, there's not a guarantee you'll like this film. You may enjoy watching it\\, but liking it is another story. If you liked The Force Awakens\\, you will be disappointed by the way that Rian Johnson throws any promise the film had in the garbage just for the sake of plot twists. Did this movie ruin my childhood and is it one oft he worst movies of all time? Absolutely not. The Last Jedi is entertaining and has great moments where you'll say \\\"wow.\\\" But I expect more out of my Star Wars films than just entertainment. I expect substance. I don't dislike this movie because it subverted my expectations. I never read a single post-ROTJ EU book and I never came to this side of the forums and read the fan theories (though Rey being a no one as the main character of the last chapters of the Skywalker Saga makes no sense whatsoever). I just think that the film failed to see itself in the bigger picture of the Star Wars universe and just tried to make a shocking movie. In my opinion\\, it is the worst Star Wars movie to date.","true":true}