{"101487":131316,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don’t usually rate movies but I felt I needed to say how disappointed I was with TLJ. I actually really liked TFA and was really excited to get answers to the questions that were left for the audience to speculate about for 2 years. As many others have stated\\, nothing was answered. It was ignored. Luke didn’t do a damn thing but project a hologram? And now he’s dead? Terrible. Oh\\, there’s Snoke...aaaaand he’s dead. What’s that midget with the giant glasses even doing? And you can just call her up? Her and Finn are pals? The slow speed spaceship chase? Awful. Oh there’s Captain Phasma...aaaand she’s dead. Why even save her for this episode? Rose was an awful character. The casino shit was terrible. Code breaker bla bla. Bad. They infiltrate a ship and wear the bad guys clothes? Haven’t seen that before lol. And the worst of the worst is Leia Superman-ing back into the ship. Wtf. Or was it Luke milking the thing and catching a fish. I cannot decide. Awful. Just awful. Ruined TFA and shit on Luke. Oh and we f*cking get it. Rebels are awesome. Sparks of hope and rebel shit. Cool. We get it. It’s been shoved down our throats already with Rogue One. Some people talk about it and some people are about it. If they’re so cool. Just make them be cool and do cool shit. They seemed like a bunch of dysfunctional whiney babies that talked about how cool being a rebel is. Here’s an idea: show Luke in a lightsaber duel or using his force powers. Have a lightsaber duel at some point period. Make Kylo more of a bad ass if he’s the villain. Make Rey’s parents reveal more eventful if you’re going to rub it in our faces for years. Make Snoke something worth a shit since you made him such a mystery only to kill him immediately. And have someone say “I’ve got a bad feeling about this”. Stop shitting on everything. I’m done. It was straight muff cabbage","true":true}