{"101487":193246,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"**************WARNING SPOILERS AHEAD******************\\nStar Wars: The Last Jedi review (Contains Spoilers)\\n**************WARNING SPOILERS AHEAD******************\\nIf you do not want to see any spoilers for Star Wars: The Last Jedi stop reading in;\\n10\\n9\\n8\\n7\\n6\\n5\\n4\\n3\\n2\\n1\\nI went to see The Last Jedi last night and the general consensus seemed to be that it was ok\\, but very inconsistent. \\nThere were elements of the movie that were quite good. As a kind of geek for things like naval warfare tactics I enjoyed the element of the resistance ships trying to stay out of range of the The First Order's big guns while they are running dangerously low on fuel. \\nUnfortunately this led to the weakest thread in the movie\\, the Finn\\, Rose\\, and Poe storyline. First of all this story line committed one of the biggest sins in storytelling\\, it was meaningless. In the end whether they succeed in their mission or not was completely insignificant in whether or not the resistance would be able to escape. \\nThis was likely meant to further develop Poe's character and his impulsive nature. But it did not even manage to do this. And this plotline could have been saved had their mission ended up dovetailing with Rey's or in some other way been significant to the plot. But they simply could have not bothered and it would not have mattered to the outcome of the story. \\nAnd it wasn't even saved by being a particularly entertaining storyline. What could have been a fun heist was a dull side quest that left us with underdeveloped characters and very little entertaining action. \\nKey among the underdeveloped characters was DJ. I can only hope that we'll see more of DJ in the future because the role was simply a waste of the talents of someone like Benicio Del Toro. \\nRose poses another problem. When we meet her she seems to be a mechanic when she says she's been \\\"stuck behind pipes all day\\\". But yet she seems very knowledgeable about the sensor technology The First Order are using. The way the story delivers this runs very close to becoming a \\\"Mary Sue\\\". But this could have been fixed by giving us just a moment to show us that even though she has a menial job she is a big geek who just enjoys learning about technology.\\nThis is very similar to a problem I have with Finn. When we first meet him he is just an average Storm Trooper\\, he even comments about taking out trash and sweeping floors. Yet he seems to have a lot of information about experimental First Order technology that would be unusual for someone of his rank to have. But this was a problem in The Force Awakens too.\\nThe other issue with Rose is her seeming to fall in love with Finn. When did this relationship develop? She's star-struck by him when they first meet and they have a bit of an adventure together but when does she fall in love with him and what did he do to earn that love.\\nBut if we take away\\, or fix\\, that storyline there aren't many other big problems with the movie. I would have liked to have learned more about Snoke before he died but that could always come later. \\nI actually loved the Rey\\, Luke\\, and Kylo storyline. And this is certainly what drove the movie. It gave me the answers I needed\\, even if they weren't all the truth\\, and pushed the characters forward. Unlike the other storyline it was satisfying\\, enjoyable\\, and meaningful. \\nSo overall how would I rank it? C\\nAnd where in would it fall in the pantheon of Star Wars movies?\\n1. Empire Strikes Back\\n2. Rogue One\\n3. A New Hope\\n4. The Force Awakens\\n5. The Return of the Jedi\\n6. The Last Jedi\\n7. The Revenge of the Sith\\n8. Attack of the Clones\\n9. The Phantom Menace\\nSo it wasn't bad and if you're a Star Wars fan you'll be going to see it regardless but it's certainly not one that will last the ages.","true":true}