{"101487":146082,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've seen the film twice and I firmly believe it's the entry Star Wars needed to branch out\\, even if our own pre-conceived notions around a few mystery box setups lead us to temporarily imagine our own stories instead. \\n\\nRian Johnson has found a new timeless fairy tale within this universe and it's just as toxic and subversive as the original's. A genocidal madman magician wanting to lure his peaceful\\, kind\\, good-natured son toward evil was at the heart of the original trilogy and it was\\, of course\\, explored beautifully. Rian Johnson and Kathleen Kennedy agree and that's reflected in the decision to not make this sequel trilogy a carbon copy of what happened in the Original Trilogy (OT) with cousins instead of father\/son. The result is a brand new dynamic that's never been experienced in Star Wars before but has been explored in myth and fairy tale since the dawn of time. Yin and Yang. Anima and Animas. Adam and Eve. Men and women. Dark and Light. Opposites attracting for reasons that are difficult to explain is a daily occurrence and often when it does it slowly develops into a battle of wills regarding which opposite will compromise themselves more to make the relationship work. This new dynamic is at the heart of this new trilogy and it's surprisingly effective. Cynics and fanboys with change-issues will be downright dismissive of the change and try to deride it as fan fiction but it casts a spell to anyone with empathy willing to go along for the ride and that's in large part due to the strangely believable performances of Adam Driver and Daisey Ridley. Driver has long been uncommonly gifted at making people both hate him and like him. There's something magnetic about him that's hard to pin down and he can maneuver from off-putting to somebody you sympathize with in the same scene. He's remarkable in this and is showcasing the slow descent to the Dark Side in a way that I now wish the much maligned prequel trilogy could have delivered. Daisey Ridley is equally compelling here. This is a character who's backstory seems crafted by Dickens himself. We care about Rey and are astounded by her gifts but forget she's still coming of age and has displayed a considerable amount of naivete around people from a life lived on Jakku that few children could relate to. She seemingly survived by fighting when she needed to and by finding hope in the most dire of circumstances. Johnson recognizes that Rey has reason to be over-confident in this story. She's been on quite a roll since the Force awakened within her. Not only in taking her already formidable hand-to-hand combat skills acquired from years of fighting for food -- Something Luke didn't have to do from his more comfortable life as a moisture farmer -- to the next level but also in her ability to get others to see the hope she sees. She convinced Finn to stay. In this film she ultimately gets through to Skywalker. It's believable to me\\, based on what we know of her\\, that following a vision she had of Ben Solo turning on his master with her in that same room\\, that she'd believe again that things would work out for her. Oh\\, how wrong she was though and this is a significant setback for her psychologically as a character. It isn't her only one. Ben Solo has developed into a master manipulator. Not only of the Force itself but of people. We believe that he does care about her not only because of what he's said to her at times but also because of his actions. She is different to him and he is alone. It's believable that he would want to bring Rey to his side and form one of the most powerful unions ever seen on-screen before. So\\, it's unclear if he's hoping pain over coming to terms with the people who raised her is something he's hoping will bring her closer to the Dark Side\\, or if he simply believes it's something she needs to heal. It may be both and that nuance is one of the many strengths of The Last Jedi.\\n\\nThe nuance continues with the 30+ year update to the character of Luke Skywalker. Have you checked in on your Facebook friends lives since you knew them in High School? How many years ago was that and how much change has occurred? How much loss have they endured. How many positives? We meet Luke Skywalker as a man conflicted and deflecting. He's come to the island to live out his days surrounded by water after an adolescence surrounded by sand. Luke has always been more of a pacifist and peaceful proponent of the Force. Even in his youth. If he'd simply chosen to live out his life off the land for reasons unrelated to grief\\, guilt\\, or issues plaguing his subconscious it would be believable enough. That he is doing this and is also struggling with each of those things is one of the many reasons why The Last Jedi is one of the best films in the Star Wars franchise. This is an exploration of mid-life crisis\\, guilt\\, the stages of grief\\, and self-punishment and family that few if any blockbusters have the guts to dig into. Skywalker\\, like all men in his family\\, heard a call from the Dark Side. However\\, where he'd previously been able to define himself by how he'd failed to answer the call... in a daze... succumbed... very briefly and answered that call. When any of us defines ourselves in any one manner through our egos and loses that\\, even briefly\\, it can be very damaging and this is especially true for Luke because of what happened next. That moment had consequences and the Last Jedi explores another timely theme that we all can unpack and learn from. It's not always how we perceived an event but how the other participant interpreted the same event. Perception can vary and Luke had not fully considered that his nephew's perception of the same event could be very different than how he had perceived it. Johnson channels a Lucas-inspiration in Kurusawa to terrific effect by showing us both perceptions and allowing us\\, and Rey\\, to choose what we feel truly happened. Rey\\, having been cast aside by Skywalker originally\\, sympathizes with Solo's perception of the events and may even be thinking that if she can get him and Luke back together\\, with her as moderator\\, they could work this out\\, heal\\, and restore peace. It's a naive thought from a character who's biggest weakness may be that\\, but it's within character and while some might think Rey is sidelined in this. I think she takes up the call to action to end this war in her own way. She's hoping for peace and this is how she thinks it will happen.\\n\\nThe biggest reason some fans seem to be angry with this movie has a lot to do with Johnson's interpretation of Luke. To those same people I'd encourage them to remember that Luke Skywalker jumped off a ledge to avoid his problems the moment Darth Vader told him who his father really was. Luke Skywalker struggled to deal with the issues within him and was more focused on the horizon to lift up his own X-wing from the muck. Thankfully\\, and wisely\\, Rian Johnson brings Yoda back to help remind us of both of these weaknesses within Luke. Yoda's scenes are delightful with some of his best dialogue since Empire and plenty of quotes worthy of memes for the rest of time. Hamill pulls of a remarkable feat opposite Frank Oz\\, R2D2\\, and Chewie in this film. Each interaction with them brings him closer to his old self. It's the performance of Hamill's career and loaded with as many nuanced character choices and dialogue delivery choices as Johnson has peppered into his script.This also isn't the first time Skywalker has cast aside a lightsaber. Johnson is a bigger fan of these characters and myth and of storytelling than his critics seem to believe. Luke's journey across the ocean via a fishing rod seems designed to remind of his swing across the chasm on the Death Star. Yoda knew that Luke was projecting his internal problems onto the Order as a whole. it's something all of us do when we are unwilling to accept our own faults\\, brief as they may be. Eagle-eyed viewers will note later that Rey has slyly \\\"scavenged\\\" the Jedi texts\\, perhaps out of fear that Skywalker won't train her as much as she'd like\\, and Yoda is also aware of this. His dialogue about how the girl has all that she needs from within the tree is one of many that improve the experience on repeat viewings. Yoda knew that Luke needed another X-wing swamp moment to help him overcome his block. The tree on fire and thought that the Order might truly be gone was Yoda's way to get Skywalker to realize that while the Order has flaws\\, his issues went deeper than that\\, and from there on Luke regains a sense of enlightenment that sees him through to the stunning finale.\\n\\nOn the way to that finale are some of the most remarkable scenes in Star Wars history. For any fans of the saga who've almost looked on with envy at some of the things that other science fiction stories have explored with regard to protecting civilians\\, and chain of command issues\\, and being hunted\\, The Last Jedi brings forth some of the best qualities of Battle Star Gallicata. It's only fair given how many other pieces of work have been inspired by Star Wars and Johnson delivers the Poe subplot with just enough Star Wars-ness to keep it feeling fresh. The Canto Bight subplot is this film's Cloud City equivalent for those interested in comparing story beats. Cloud City was the heroes abandoning their military to hide and survive and being betrayed with devastating concequences. The Canto Bight storyline is instead a couple soldiers coming up with an inspired idea that could turn the tide of the war enjoying the perks of minimized chain of command formalities and hoping for a hail mary. They nearly pull it off but just like Cloud City... they are betrayed and there are consequences. Unlike Cloud City though\\, Johnson lets us truly take in the sights and sounds of Canto Bight and what a spectacular location it is. The Falthiers will immediately resonate with any fans of anime or 1980s fantasy films and the moments with the stable children\\, in their own Dickens-eque story looking up to the heroes\\, is one of many moments of world-building that had me marveling at Johnson's juggling ability to balance the epic with the intimate. \\n\\nIt all builds to one of the most stunning climaxes in the saga with each individual thread combining to form a tapestry of shock\\, awe\\, and childlike delight. The Pratetorian guards fight sequence is one of the best in the history of Star Wars. Those complaining about a lack of light sabers formally clashing seem to have been too focused on formality to appreciate the formidable weapons that were on offer. Did you ever think you'd see someone wrap a saber up like a lasso\\, pulling their victim closer? Did you ever think you'd see that lasso whipped against a red tapestry that then burst into flames behind the participants? Did you ever think you'd see Kylo Ren and Rey fight along side each other? Neither did I and each of these moments\\, and so many more\\, are not only visually magnificent but spectacular moments of drama and conflict. From this point of the movie to the end all bets are off. This is new terrain for all of us and it's exhilarating. As a kid I remember wondering what it might have looked like if Luke had taken up Vader's original offer. We get to experience an aspect of that in this. I always loved the Emperor's guards but they never did anything. Not the case for Snoke's guards. I've left Snoke until the end for good reason. Johnson\\, as he does throughout the movie\\, seems keenly aware of what we expect of Snoke and utilizes this against us the way all good storytellers do. Motion capture master\\, Andy Serks\\, brings Snoke to life in this film and he's a delight to behold and one of the most formidable Force users on screen. However\\, those gold robes reveal a deep character flow. Snoke is vane and arrogant to the point of weakness and Kylo Ren revisits his blaster bolt frozen animation moment from the Force Awakens to show yet again just how special he is at doing two things at once. Snoke is so blinded by his desire to feed off Rey's fear and Kylo Ren has become so adept at doing two things at once\\, he catches Snoke off guard in a death that is one of the most memorable I've ever seen in all my life of watching films. The sequence ends with the saber flying directly into the hand of Rey without a single edit. These are the kinds of moments you pick up on and enjoy more on a second viewing. The directorial choices that Johnson makes -- moments like handheld shots of plant life and water when describing the Force -- seem more like welcome additions to the film language of the saga and the visualizations of its characters than the distractions they were initially. The same thing happens with humor. There are some terrific moments of humor in this movie that may have had some pulled out of the movie on the first viewing. They get better with repeats and in the theatres I was in landed successfully far more often than not. \\n\\nLuke Skywalker's return is well-earned and careful attention is given to indicate that he's not really there which only becomes clear on a second viewing. The closest thing to true interaction comes from Luke's interactions with Leia. A person he has a much stronger Force bond with than any other. The rest is Luke doing what Luke has always wanted to do. Help win wars without killing people where he can help it. He uses self-defence and illusion to buy his friends time and to become the spark the Resistence need to inspire new followers through a story of magic that will live on for decades just the same as his original exploits did. The twin suns moment had people around me crying through their 3D glasses. I know because I was one of them.\\n\\nIf Star Wars fans can let this entry into their hearts and accept that there will be plenty more happy stories for Luke to explore in the many expanded universe stories that will likely follow this film I really think they'll come to terms with just how excellent this space opera is. It's not exact space opera we grew up with and that's precisely the point. Star Wars needed to hyperspace jump to some new terrain to avoid resting on its laurels and becoming stagnant. With Johnson steering the ship that's exactly what The Last Jedi delivered.","true":true}