{"101487":133797,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have never hated a star wars movie. Not in my entire life watching them. My most disliked one was Attack of the Clones\\, but that was before the new trilogy came out. Force Awakens took that spot\\, and now the Last Jedi dropped below that. Its not the killing of Luke\\, the casino sub plot\\, or the Laura Dern plot holes that ruined this franchise for me but the idea of where this series is supposed to go. The idea of these directors and writers not knowing where to direct this franchise is so dumb. TFA builds up Snoke as a villain on the same level as the emperor if not stronger. Going to the point of bridging minds from across the galaxy\\, but he can't tell a lightsaber is moving beside him? So now the main villain is gone after a whole movie of solidifying him as the major threat that one would think all the characters would have to team up and destroy. Then Kylo and Rey have their predictable argument over joining sides. You had the opportunity to make one of these powerful characters switch sides to create a intensely powerful duo but instead it turns into another predictable plot point. The scary part is that that's the climax. That's the most important part of the movie\\, and they dropped the ball like Dez  (sour Cowboys fan) and couldn't recover to save their life. Now of the climax is garbage you can imagine how bad the rest of the movie is. I honestly hate this movie and I can't promise I'll watch the next one. It sucks man.","true":true}