{"101487":129603,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am sad to say that I was very disappointed in this movie. while the film is flawless in special effects\\, visuals\\, and CGI\\, it lacks emotion\\, theme\\, and plot. The amount of plot holes in this movie are incredible which is understandable for only true Star Wars fans to see. Like for example: How come the force ghosts can physically touch and feel things. How come Snoke could not sense the lightsaber shaking next to him despite having incredible force powers? How come Princess Leia Organa all of a sudden was using force powers\\, not to mention the terrible scene where she magically flew threw space. How did Poe Dameron flawlessly take down the guns of the Dreadnought? Do they not have shields? I mean if star destroyers have shields then why doesn't a dreadnought? These simple things in the movie bothered me a lot and left me very confused. But these are only a few of the plot holes that I had noticed throughout the film.\\n\\nOther reason's why this is not a very good film was the humor. The jokes were not very funny to me at all. I might of laughed at one or two jokes but the rest were necessary and felt mostly out of place. But the things that disappointed me the most was what I was looking most forward to. Like who are Rey's parents? Who is Snoke and how is he a significant character? How will Luke train Rey? The answers to these left me almost angry. Not to mention the film had little emotion and really didn't get me to care for any of the characters such as Rose\\, Princess Leia(who had a terrible role)Captain phasma\\, snoke\\, and many more.","true":true}