{"101487":193073,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Visual\/Special Effects\\, B\\nStoryline\\, C-\\nCharacter Development\\, D+\\nDialogue\\, D+\\n\\nGaping plot holes\\, characters acting irrationally\\, long useless sections; this movie had a lot going on. Even the really epic scenes were wasted due to short-sighted writing. For instance\\, the most visually epic sacrificial death in SW history is performed by a chick we don't know or care about. Snoke's murder is really cool; but we still don't know who is at all. Luke pulls one hell of a magic trick that was really unnecessary and resulted in his pointless and unexplained death.\\n\\nNot to mention\\, Chewy just watched Han murdered by Kylo and is just treated like a fluffy comic relief. Benecio Del Toro? Why? Rose and Finn's trip? Needless. Luke tossing the light saber? Seriously? Rey defeating imperial guards with (by my count) less than 3 hours of Jedi training. \\n\\nAnd as for Rey\\, she is the most engaging SW character in a long time. Absolutely should be the face of the this trilogy. And the only bit of her backstory we get is a highly suspect fact from Kylo. She got almost no new character development.\\n\\nThis script was written as if dialogue\\, acting and character development were the least important parts of a movie. May I please remind everyone (especially Rian Johnson) that it wasn't the robotic shark that won Jaws best picture. It was the 10 minute scene in the boat where Richard Dreyfuss\\, Richard Shaw and Roy Scheider compare scar stories before Shaw tells them why he'll never wear a lifevest again. In that scene nothing happens\\, but we learn so much about those characters and get completely invested in the story. \\n\\nTLJ is so busy trying to give you a bunch of new poorly developed subplots that it never slows down and lets you develop empathy for anyone.\\n\\nExtremely poor writing for such a storied franchise with so many resources at their disposal.","true":true}