{"101487":134040,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-27","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have to start by saying I'm mostly a purist when it comes to my Star Wars appreciation. I loved episode 4\\, 5\\, and 6. But I also enjoyed episode 2 & 3. I gave episode 7 a chance. It was ok. But the last Jedi\\, although a visually stunning movie\\, fell way too short of expectations.\\n\\nI believe that Disney\\, Kathleen Kenedy\\, and Rian Johnson really missed the mark on this one. The way Luke Skywalker is portrayed is disgraceful. As Hamill himself has said in interviews: \\\"luke was the most positive and optimistic guy in the universe\\\".  How Rian Johnson found this new character in Luke in his screenwriting is unconscionable. It ruined the whole movie for me.\\n\\nAside from luke\\, the character of Rose Tico is annoying as well. I assume they were trying to make us all forget about the original cast by killing them off one by one. With the excuse that \\\"they were standing in the way of the new story and new characters\\\". But honestly\\, I really feel no connection to these new cast memebers.\\nI also hate the character of Poe Dameron. He is full of 80's rapist machismo that is far to reaching in the area of knuckle dragging and head clubbing.\\n\\nAs for the love story between Rose & Finn.... Hahaha \\n\\nThey should have condensed the whole casino part into 5 minutes. That would have provided much more time for luke and Rey. But no. Disney has decided that the main focus of the new Star Wars trilogy will be a \\\"Mary Sue\\\" character type. No training needed. Feel the force once and Yoda proclaims \\\"she has everything she needs now\\\".\\n\\nI really feel like the studios have failed when fan fiction youtubers like Stupendous wave & Mike Zeroh have better ideas about future Star Wars lore and story construction. \\n\\nIt's too bad. Maybe Kathleen should step down. Personally\\, I think Pablo Hidalgo has been doing a much better job with his animated Star Wars series than the new feature films have been with JJ and Rian creating abominations under the Star Wars marquee.\\n\\nThis movie sucks.","true":true}