{"101487":158706,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Obviously spoilers contained. \\n\\nThis one just ...: fails. It had some good moments\\, but overall it just lacked ina lot of areas. \\nThe good: the character actors did a great job with what they were given\\, and the effects were impressive. I especially liked the open sequence with Poe \\\"stalling\\\" and then his cool u turn maneuver was nicely done. \\n\\nThe not so good:\\nLuke was wasted. He never really did anything\\, and flip flopped between helping Rey\\, and ditching her. I can understand his emotional issues - and they did well exploring that\\,  but it felt forced and anti climatic. \\n\\nRey just kind of ... showed up at the first order fleet and surrendered herself. No plan\\, no real reason except a vague hope of turning Kylo. I get they wanted her to face off with snoke and that whole sequence out of context is great. But how we got there and how we left was just ... lacking in energy. Oh she's here. Awsome scene. Now she's just gone - escaping off screen. Just so she can ex machina in later. What a waste. \\n\\nThe porgs. For flipping sake. After the chewie scene that should have been it. That screech the rest of the movie was pointless and just to sell toys. Totally worthless. \\n\\nFinn and rose. Talk about a tacked on lame brain extra. It would have been better if they were not in the rebel fleet initially\\, and heard the distress call\\, then made the plan and had to get the guy etc. Instead it was a forced on\\, illogical waste of time. And their romance was so forced it was face palm inducing. \\n\\nThe bad:\\nSnoke was just... wasted. He had an awsome sequence and was \\nset up to be this ultra big bad ... and instead goes out like a chump and we got zero story regarding who he is\\, what he wants or anything. \\n\\nKylo and the red hair general just ... seemed like bratty kids throwing a tantrum. \\n\\nThe dreadnaught. An amazing ship never seen in real Combat aside from Jedi\\, and it got its ass kicked by fighters. Seriously. The potential for a non Death Star kind of super ship that brings doom and death was there. Instead it was a first scene in and out worf effect. \\n\\nFinally - lukes final scene. Yea it was badass when he just took ALLof the gunfire and just brushed it off. Amazing tactic and great rope a dope move.  But then they wasted it by having him somehow die from exhertion? Why have the fake out only to Jill him? It would have been better if he had done an Obi wan and died fighting ren. It felt cheap and forced. As did the whole yoda cameo. \\n\\nAll in all this one just never got going. It never really had a middle act crescendo\\, it never made us really fear the first order - they just kept tripping over themselves. The rebels running out of gas... picking off the transports and every time it looks like almost all are gone\\, but nope still more. Just really a laggy non start of a fail. Don't waste your money.","true":true}