{"101487":133950,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have seen the film twice now\\, the second time fully aware of the fan consensus and critiques. The 3 most common complaints are the humor\\, the depiction of Luke\\, and Canto Bight. Many fans have stated the humor is too Marvel-esque\\, or that it breaks the tone. I disagree. The humor isn't used to interrupt poignant moments mod scene. There will be quips between characters before things really start going. The film has darker elements\\, and appropriately directs the tone in that direction when required. But we aren't locked into a somber affair like some seem to want or expect. Second\\, Luke is where he needs to be emotionally in this movie. He even has instances where he explains himself. Other characters even comment on his current disposition\\, and yet fans still say he is out of character? Remember when he failed to lift the X wing in Empire\\, and sulked alone in the corner? Now imagine the gravity of his failure and what he wants to do about it. Others have claimed that he left the map with Lor San Tekka in order to bring him back into the fight. As such they think it's a plot hole\\, but they are working off of an assumption. Finally\\, Canto Bight. I won't deny this could have been done better. The criticisms Rose has against the population of the planet were told and not shown to the extent I wanted. The sequence devolves into mindless action in my opinion. Had potential but didn't quite fit. Overall the movie is definitely good\\, and definitely Star Wars.","true":true}