{"101487":158932,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Okay. Here goes. I didn't like it. Not quite \\\"Attack of the Clones\\\" didn't like it\\, but the more I think about it\\, the more I realize I just didn't enjoy the film at all.\\n\\nThere are some elements that are good: Love Poe. Even though every decision he made was wrong\\, at least he kept fighting for something. Laura Dern? Excellent. Rey and Kylo having late night Force texting\/FaceTime sessions also kind of fun. Some excellent acting (though I'm still not sure if Mark Hamill was good or awful). The last 3 minutes of the film were wonderful.\\n\\nI don't care about Snoke\\, Captain Phasma or Rey's lineage. They can go away. Fine.\\n\\nNow we jump right into the not so good and outright bad:\\n\\nThe reduction of Luke Skywalker to a wild-eyed\\, cowardly hermit was awful to see as a 40-year fan. I get why Hamill said he disagreed with everything Rian Johnson did to the character. (Ah! But Luke became a hero and gave his life to save \\\"The Resistance\\,\\\" didn't he?! Well\\, no. He wanted to die and found a way to kill himself while\\, at the same time\\, not actually leaving the island and fighting for something. That's not heroic.)\\n\\n\\\"Star Wars\\\" actors have for years complained about the stilted Lucas dialogue\\, but I think this went too far in the other direction. It was too modern. It wasn't a \\\"galaxy far\\, far away.\\\" And the frequently ill-timed comedy was terrible. It's okay to be funny\\, but not every...single...scene.\\n\\nThe space-stalking tension was completely thwarted by the meaningless Finn\/Rose\/Fenster escapade. I just didn't care. I got about 2 minutes into the casino and went to the men's room.\\n\\nTwo shots in particular were just awful: The flying space Leia thing and the Luke \\\"bends backwards like everyone in every film since 1999 in order to dodge some sort of deadly object\\\" shot on Crait with Kylo. I rolled my eyes.\\n\\nPeople give J.J. Abrams some weird retroactive grief because \\\"Force Awakens\\\" was so\\, so similar to earlier \\\"Star Wars\\\" films. But he pulled off a stunning thing in his film: He brought back the great old characters as supporting players yet also cultivated a whole new batch of lead characters that I totally cared about. I was hooked.\\n\\nThose new characters after Johnson's \\\"The Last Jedi?\\\" Meh.","true":true}