{"101487":161780,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"People criticized The Force Awakens for being too similar to other Star Wars films - People will criticize The Last Jedi for being too different.  That's just the way it's going to be\\, it'll split people right down the middle.  Some will hate it\\, others will love it.  Me\\, I'm on the fence.  I loved some of it\\, I didn't like other parts of it.  I might need to see it again to truly decide. \\n\\nGood things - It's very different.  It takes risks.  It subverts expectations.  You can't predict any of it.  It really does throw a spanner in the works.  There are really memorable moments that will be talked about for years.  Great visuals.  Great sound.  Good performances\\, especially from Mark Hamill and Adam Driver.  \\n\\nBad things - Some of the decisions made\\, while I appreciate the director for taking risks\\, didn't pay off for me.  Certain plot points are completely unnecessary and slow the film down massively.  There's a new female character introduced that takes up a large amount of screen time who feels completely shoe-horned in.  Certain established characters never get their \\\"day in the sun\\\" so to speak and disappoint.  Too many characters spend the film sitting around with nothing to do\\, almost as if Rian Johnson was forced to give them screen time but really wasn't interested in developing them.  There's humour in places where it's not needed.  \\n\\nWithout spoiling things that's all I'll say.  Like I said I wouldn't mind seeing it again to think about it more.  But yeah\\, while I appreciate risk taking and trying new things\\, it's a mixed bag for me.","true":true}