{"101487":157307,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"NOTE: SPOILERS\\nAs just a movie it's mediocre\\,but as a STAR WARS movie it's god awful.This movie makes the prequels shine.Bringing no real new plot points to the table(at least each of the prequels did that).When the movie finally takes off it gets separated into 3 subplots and 2 of them are pointless not in just the entertainment aspect\\, but in the story also.They take the plot nowhere and just pad out the run-time.FINN's subplot being used as comic relief delivering jokes that ruin not only the muddled tone of the movie\\, they are even lesser compared to the comic relief of the MCU which balances its tone fairley nicely.This movie is a disappointment to STAR WARS fans because it creates more plot holes then before\\, even affecting what we know in the OG trilogy by doing things like giving Leia Organa powers.This movie writes itself into way to many ridiculous corners even seeming like it's supposed to be intentional on an annoying level seeing what they can get away with.This movie suffers greatly from the direction the new director went with\\, screwing with points that should have been explored in this movie.The Force Awakens might have put most of its bets on nostalgia and references to the OG trilogy\\,but even in that movie\\, director J.J. Abrams added new things to be explored EXAMPLES:What's Kylos' backstory? Who's Snoak? What exactly happened during the training Luke gave to the new group of Jedi younglings? Why did Luke give up so easily and go into hiding? Who's Rey and who's her parents? The director of the Last Jedi though didn't answer these questions and cut off some of these plot lines like killing off Snoak (May I mention WAY to easy) and making the backstory of what happened at Luke's temple\\, a he said she said between him and Kylo.This film is a product of a director instead of continuing with already set up plot lines as a guide\\, instead trying to get rid of them to make his own version\\,but in the end ultimately wasting time\\, and making the biggest sin this movie committed copying the franchise itself in areas.Things like Luke's death being like Obi Wan Kenobi's(even that wasn't done right).This movie carries too many sins with it to mention\\,but they're mostly sins to the franchise itself. I would be lying if I said it was 100% crap\\,some scenes by themselves offer sci-fi enjoyment only STAR WARS can offer and the movie itself is beautiful\\,but that's the reason why I would even give this movie a star rating.","true":true}