{"101487":177547,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The new Star Wars movie fails and fails hard. There is so much wasted potential. Most of the time it felt like four episodes of a Star Wars TV show with how many useless plots they have going on. They had Star Trek techno babble. Star Trek techno babble does not belong in a Star Wars film. Many times it was cartoonish. It wasn't grounded. Were there some things I liked in the film? Yes. But the awfulness far outweighs those things. It's not that they messed up a thing or two here or there. The basic structure of the film fails. The character arcs fail. So much of the movie wasn't just bad\\, but simply wrong. It was mostly glorified fan fic. I have not been so disappointed in a movie since Phantom Menace.\\n\\n What we should have gotten: \\n\\n A good death for Leia. And we actually got one! But then they punked out of it. How did her character further anything in the movie thereafter that could not have been done by someone else? Nothing. The only scene that needed Leia after that was a the scene between her and Luke. And that scene could have been placed prior to what should have been her good death scene. Further\\, Carrie Fisher is dead and nobody wants CGI Carrie Fisher in the next film\\, but she has been built up in this film as a central character that needs to be in the next film. How do they give her a good death in the next film? \\n\\n Luke in the role of the master\\, teacher\\, and wise sage. No. At the end of his life he was still a student. For most of the movie he was whiny Luke. They even robbed his character of the agency of destroying the scrolls. Mark Hamill is a) alive and b) able to act circles around Carrie Fisher. They needed him for the third film. \\n\\n One of the things people give the original trilogy a hard time about is how little time Luke had to train with Yoda. Here Ray wasn't even able to train with Luke and she was able to have that long fight scene as a full Jedi. This was the massive opportunity for them to rectify that. This should have picked up a year or two down the road with Luke having spent that entire time training her. The lesson? Training doesn't matter. Whereas there were consequences for Luke running off before he was ready in Empire Strikes Back\\, there are no consequences for Ray. \\n\\n Uses of the force consistent with what we have seen in the past. But here we have people using the force across vast distances in space. Snoke with that business on the bridge and Luke at the end of the film.\\n\\n Not invalidating things from the Force Awakens.  The Ray from the first film was direct. Why was she not direct with Luke about her being able to use the force?  Fans had huge expectations for Rays lineage. And every installment of the movies from 4-7 involved new revelations as to family. Where was the new revelation?  The First Order was not in a position to take the galaxy in the Force Awakens. They we on something of an even footing with the Republic. They might have decapitated the Republics leadership by taking out those five worlds\\, but the Republic has to be constituted of hundreds of other worlds with the bulk of its fleet scattered amongst them.  Another thing invalidated about Force Awakens is Luke leaving the map and where he went. Why leave a map if you don't want to be found? Why seek out the original Jedi Temple if you just want to die? Those were huge elements of Force Awakens. What makes a lot more sense is that a) he wanted to be left alone for a while and b) he wanted to learn what he could from what Jedi lore could be found so that he could do a better job at teaching. Why else would he seek out the original Jedi Temple?\\n\\n Having battle scenes make sense.  When Star Destroyers come into range you know what they should do? Open fire.  Poe should not have been able to take on that Dreadnought by himself. His character already should have died in the first film. He should have died in that first scene.  Battle scenes in Star Wars do not last days. They happen quickly.  Star ships\\, when they run out of fuel\\, do not loose momentum in space. All the fuel expenditure is getting up to speed.  Of course the Star Destroyers would be able to see the smaller ships. They are within visual range.\\n\\nAnd on yet another level\\, it shows they don't have a plan for the trilogy. Nothing of substance happened with most of the characters. How can you have a three movie character arc when there is no character development in the middle installment? This movie not only fails by itself\\, it also sets episode 9 up to fail. That doesn't happen when things are planned out. How can episode 9 pull the story out of this nose dive? I wouldn't want ot have to be the one in charge of that.","true":true}