{"101487":172815,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"the 8th film in the star wars saga simply doesn't live up to the hype built up by the (frankly mediocre) Force Awakens. Instead of simply retreading the earlier movies like JJ Abrams Force Awakens Rian tries to do something a little different and falls on his face. Literally zero explanation on how a terrorist organization managed to conquer an entire galaxy in a few hours. Sure they blew up a few planets but they no longer have their super weapon. Why would ever planet fall into line after that? Yet another rag tag group of rebels are on the run from the evil \\\"not the empire\\\" First Order. They are slowly running out of fuel in space. Rey has left to train with Luke and some Porgs on some island planet. Luke isn't in the mood and Rey has to wait around for him to help...though really this only takes about 18 hours in total\\, so Luke comes around pretty quickly. Rey's mary-sue status is unchanged as she is automatically great at everything and even Ghost Yoda mentions she has nothing left to learn. \\nIn an unrelated Subplot Finn and Rose go to Space Vegas and look for a codebreaker\\, id explain more of this plot but it goes no where and doesn't effect the rest the film.\\nThe film was highly praised by critics who i assume have never seen another film but overly bashed by fans. To be honest its basically just as good as Force Awakens\\, which is to say its \\\"average\\\". \\nEvery scene with Mark Hamil is great and he gives an amazing performance. Rey\/Kylo bits are also very well handled.\\nIt has a lot of filler and the run time is too bloated.\\nMaybe Disney should have planned on a trilogy instead of just winging it\\, Letting JJ do \\\"star wars greatest hits\\\" was annoying but a reason relaunch for the series but then Rian just gives JJ a huge middle finger and just messes up everything he set up (which wasn't great in the first place)","true":true}