{"101487":136640,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm literally as big a Star Wars fan as they come. I left this movie deflated\\, depressed and (I know it sounds silly and overly dramatic but) honestly felt hurt. I can't help but feel that this film marks the beginning of the end of Star Wars.\\n\\nI didn't expect this movie to be perfect or fulfil all of my expectations (I actually tried to keep my expectations to a minimum) but this movie disrespected and came very close to destroying the character of Luke Skywalker; that's probably what hurt the most... I can forgive a lot and I understand that things needed to be shaken up and changed (and I think most of us can respect that intention) but the way Luke's character was handled was unforgivable. It's hard to put into words just how sad it is. Luke throwing his father's lightsaber (or \\\"laser sword\\\" as Luke calls it one point) over his shoulder gave me a sick feeling that never quite left me and ended up both symbolizing and setting the tone of the entire film.\\n\\nA lot of people are saying 'it's a great movie but it's not a great Star Wars movie' and I actually think that might be giving this movie a little too much credit. Even taken by itself\\, as a film --- the tone is off\\, the 'comedy' is often forced\\, many sequences drag on and become monotonous while others feel rushed with direction feeling scattered\\, the plot is messy and feels kinda rootless and though visually stunning\\, often felt like a B-movie.\\n\\nWere there things I liked? Absolutely. Could it have been worse? Yes\\, of course. But did it leave us with characters we care very little about and leave us with a feeling that our heroes have fought in vain? Yes to that as well.\\n\\nRight now\\, Episode 9 feels pointless. It's hard to care. I'm sad ya'll. Very sad. :(","true":true}