{"101487":182015,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is\\, by far\\, the worst Star Wars movie ever created. A group of talented writers with a mission of ruining every opportunity this movie provided could not have done a better job. I am willing to look past the obvious political\/SJW insertions\\, even when they are contradictory\/distracting\/detracting. I am willing to look past the ridiculous events that interrupted my suspension of belief (such as Snoke being killed by his very weak apprentice while allegedly reading his mind). I am willing to overlook the missed chances to have made this an emotionally stirring movie by allowing Princess Mary Poppins to die. However\\, I am not willing to overlook the absolute\\, intentional slaughter of Luke Skywalker. The entire first trilogy focuses on developing this character. Luke is destined to be the strongest Jedi in history. There are at least a half dozen ways he could have been made the last Jedi while showing his true power\\, something the original trilogy never got to as he was still a novice at the end of Return of the Jedi. I will tell you when the whole movie was lost to me: When Luke \\\"fights\\\" Kylo and then dies of exertion or whatever that was. What. The. Heck. What he should have done (again\\, there are a half dozen ways this movie could have fulfilled its destiny) was use the force to a degree never before seen\\, like crushing those ATATs together in one fell swoop. Of course\\, my expectations were a bit dampered when Rey discovers Luke had wasted decades of time we all thought he had spent training by disconnecting from the force. I could write a ten page review about how badly they messed this up. I feel like a 7 year old kid could have done a better job writing a script that fit the story. My goodness.\\n\\nHonestly\\, this is perhaps the worst movie I've ever seen in terms of difference between potential and actuality.","true":true}