{"101487":134638,"Last Jedi":"Last Jedi","2017-12-15":"2017-05-01","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I liked it\\, but didn't love it. Kinda how I felt about this years Blade Runner 2049 (2017). There was just too many misses for me here to even go against my own biased and pretend it was a masterpiece. I guess after getting two very solid films this one just didn't stick for me. Anywho\\, this is going to be a spoiler free review\\, so don't worry about anything if you didn't see it yet. The film takes place right after the events of Star Wars Episode VII The Force Awakens (2015). Rey (Daisy Ridley) has found Luke Skywalker (Mark Hamill) and is attempting to have him train her in the ways of the Force. Meanwhile\\, Kylo Ren (Adam Driver) and the First Order continue to snuff out the Resistance. Poe Dameron (Oscar Isaac) and Princess Leia (Carrie Fisher) are being chased down and are stuck in a bit of a trap themselves. And then we have Finn (John Boyega) recovering from his injury from Kylo Ren. Finn meets up with a young mechanic named Rose (Kelly Marie Tran) who has some plans of her own. That's all I'll basically say here. So first the good. The movie is shot really well. There's some particularly beautiful shots especially of the planet that Luke is on. There's some great action sequences that are really well done as well here. There's also some great character development for Poe\\, Rey and Kylo. Here's the bad. Hmm to keep this spoiler free I'll say that there's a whole section that could have been removed from the film that involves a Casino. It just doesn't flow that well and introduces a character that really doesn't matter. Truthfully\\, Finn & Rose's story is the weakest story out of everything because the payoff just doesn't feel like it ever mattered that much to me. Poe and Leia basically getting chases in a straight line the entire film didn't help pacing either. I felt like 20 minutes shorter would benefitted this film big time. There's a huge twist near the end as well (or heck maybe two) that I just didn't enjoy. I felt like director Rian Johnson was trying to retcon a bunch of J.J. Abrams creations. If you'd like to know a lot more check out my Podcast The Movie Pals Pod where I will be going way more in depth on this one! Overall\\, I still enjoyed it\\, but it fell flat way too many times for me. I felt like it was aimed for more casual fans and hard core fans (like me) just won't like it. (And by Hard Core I mean if you can't name every species at the Boonta Eve Race in Episode 1 then you're probably a bit more casual than some people.) Regardless\\, a ton of people will catch this\\, but here's to hoping that Episode IX and Rian Johnsons trilogy are just written a bit better.","true":true}