{"101487":149380,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Last Jedi took the \\\"science\\\" out of science-fiction. If any movie needs a Special Edition makeover it is this one.\\nFirst off - I never write reviews but I am seeing a lot of \\\"news\\\" by bloggers trying to dismiss the bad reviews by attributing it to bots and the alt-right. So I have to stand up and be heard against nonsense. These \\\"reporters\\\" clearly have an agenda and cannot accept the fact that fans simply do not like this film. They want it to succeed because star wars is a major cultural influencer and they want the obvious political tone to be accepted in a good light. One reviewer gave this movie 5 stars because it passed the Bechdel test. Ask yourself - is a feminist litmus test your only consideration to regard this a good movie?\\nFor me\\, I could easily dismiss any political leanings if this was at least a good movie. It isn't.\\nThe main thrust of this film is a slow chase between the opposing capital ships. The Resistance is trying to escape the larger and stronger First Order destroyers. And the Resistance are outrunning them and apparently the First Order can't catch up or use hyperspace to catch-up or flank them. Right off the bat\\, there is no logic. The very first scene in the very first movie (1977)\\, a Star Destroyer chases and catches their smaller nimbler rival. So the main premise and reason we are watching is flawed. \\nSo they are trying to escape and apparently they need to get to a planet so they can call for help. But then Poe makes a call to Maz who conveniently knows how to disable Snoke's ship. This whole scene felt like I was watching a scene from a video game and getting player level objectives. How about -\\\"Hey Maz - help us NOW!!\\\" - Then the audience can save a pointless one hour long subplot. But that would make sense and there would be no reason to continue with the film. All the problems would be solved. Convenient.  \\nPeople being exposed to space in the opening battle but apparently don't die\\, Leia in her eye-rolling Mary Poppins scene\\, Rey knows all and can kill elite guards effortlessly. The list goes on...just grab a one-star review - they will tell you.\\nThis movie is beautiful and stunning. But to be honest - lots of movies look good today. That means nothing if there is no storyline to capture the audience's attention. This felt like a Michael Bay film at times. Suspend logic\\, convenient plot points with lazy storytelling that requires you to completely shut your brain off.\\nAsk yourself if you like those terrible Transformers movies. If you can stare at a screen and smile at every explosion and not care about any of the characters then this movie is for you. Just don't try to think too hard.","true":true}