{"101487":111790,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Call me crazy\\, but I hope to see something NEW and DIFFERENT when I see a film\\, not a complete rehash of the same ideas over and over again. This is just what Star Wars needed\\, a sharp left turn down a new road. Force Awakens was great for what it was\\, a reintroduction for old fans and launching point for a new generation of fans. But if I want to watch the same old familiar Star Wars I'd watch the original trilogy. So I am glad this gave us some unexpected turns. If you want to rehash the same old story I can see where you could be disappointed. \\n\\nWas Luke what I expected? No. Nor should he be. Thanks for surprising me Rian Johnson! Thanks for not retreading the same old story\\, breaking the mold\\, and giving us a great point from which episode IX can launch from.\\n\\nIf you're a fan\\, try watching it without pre-conceived notions of what should happen. I hated midichlorians. but then again I'm not creating these movies so I got over myself and learned to accept it. I'm an \\\"original\\\" Star Wars fan\\, having seen Episode IV at the drive-in at age 5 during the 70's\\, and I loved this new movie.\\n\\nWatch the film for yourself. A good deal of reviews on here are blatant trolls so make your own decision. And for the love of God if your complaints about the film have to do with how many strong women roles there are or the like you may want to take a good look at yourself and evaluate your life choices.","true":true}