{"101487":133040,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I give this film one star because the visuals are amazing and all of the battles are fun to watch. The message of this film however takes the original Hero's myth that has existed since the beginning of time and it takes all of humanities favorite archetypes and tears them apart. \\\"The Wise Old Mentor\\\"  is supposed to teach our hero something from their past that they can respect and be proud of so they can use that knowledge to progress humanity. Instead we get a bitter nihilistic man who's best advice he can seem to offer is to burn the old texts. What a bitter message. Forget thousands of years of stories that we've told about ourselves to help explain our human nature. \\n\\nThen our Hero Poe has no journey\\, nothing to learn. Her original convictions are right and then continue to be right. She's already great at everything and has no room for development. She in my view doesn't represent a hero she represents an idea of Utopia that we expect from ourselves now. Be perfect \\, have all the answers like that's anything like a reflection of reality? Do any our lives play out like that? No. We learn from self reflection and from our ancestors. This movie suggests the opposite. \\n\\nI could go on and on but it's a demonization of hero's who try to do the right thing and it's an attempt to vindicate a specific narrative. We don't want a message crammed down our throats. We used to look to star wars to help explain what we should strive to be like\\, what ideal we should hold and work towards. Now we get this. If we think that the youth wont watch this an internalize the messages that they should throw away all of the systems that gave them the freedoms they have.....\\n\\nA Hero's Journey of losing their mentor","true":true}