{"40636":"23973","TLOU2":"TLOU2","2020-08-05":"2020-06-27","10":0.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"how stupid game! I hate a horrer game. because I am very scary of all horrer media. but player review was aware of this game for me. and i know that it is sucks! Naughty Dog give ours making a villian by force. we are not villain. and this CD ROM File makes me crazy. and then I heard someone was manipulating user scores. this is a big problem about ours. what the hell's going on thishow stupid game! I hate a horrer game. because I am very scary of all horrer media. but player review was aware of this game for me. and i know that it is sucks! Naughty Dog give ours making a villian by force. we are not villain. and this CD ROM File makes me crazy. and then I heard someone was manipulating user scores. this is a big problem about ours. what the hell's going on this situation. we know revenge is very wrong behavior. but Naughty Dog want to make player villain. Dog make joel and ellie a villain too. but we are not villain. joel and ellie are not villain too. Dog want to make a player evil person. but we are not evil.\r\rironically\\, abby has all her's anything. but ellie hasn't. abby was kill all her's enemy.   and she has many colleague. but ellie hasn't. so we are know that onething about simple truth.\r\rWe must have A REVENGE!. abby has revenge all her's enemy. but ellie wasn't. This game show ours that  OUR LIFE  MUST HAVE REVENGE!! what the **** game scenario.\r\rI caution about the world's game players. save your money. and please Don't PLAY this at home.… Expand","true":true}