{"101487":136566,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm going to keep this short:\\n\\nIf you like over 2 hours of Disney's prewritten formula\\, setting up for profitable spinoffs\\, and the marketing of stuffed toys that will be sold at Disney Resorts..... you will LOVE THIS MOVIE. \\n\\nIf you loved Star Wars Episodes 4\\, 5\\, 6\\, and tolerated 1\\, 2\\, and 3 for there story\\, even though the acting was awful.... you will HATE THIS MOVIE. \\n\\nThis entire movie was a marketing gimmick intended to lure 6-14 year olds to the corporate \\\"dark side\\\". Do not believe Mark Hamill when he said that this movie was \\\"darker\\\" than the rest. This made Episode VII look like Requiem For a Dream. Nothing about this movie was serious. Every single moment that attempted to be serious\\, or important to the story\\, was ruined by a joke or cliche moment shortly after. My friends are stoners and usually love movies like this. I walked out of the theater expecting to have to keep my mouth shut for fear of starting an argument. To my relief the first thing out of one of my best friend's mouth was\\, \\\"I AM NEVER SEEING THAT MOVIE AGAIN.\\\" And the floodgates were opened. The 4 of us spent the entirety of the car ride home complaining (but mostly laughing) about how awful that movie was. \\n\\nWhen we got home my buddy texted me a Forbes article about large groups of people who hated this movie. The article called it a\\, \\\"resistance\\\" of sorts. This is the only resistance I'm interested in after watching this thinly veiled bootleg of Episode V. \\n\\nPros:\\n- Great Filmaking and Special Effects\\n- Pretty Good Acting\\n- Rey is Awesome\\n\\nCons:\\n- Worst Script of All Time\\n- Snuffed Out Character Buildup \\n- Over Two Hours of Marketing\\n- Undeserved and Copied \\\"Deaths\\\"\\n\\nOverall: 3\/10","true":true}