{"101487":144543,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It was certainly different. That is both good and not so. Seems as though the overarching narrative is being treated like a pass-around story game where the first narrative is handed off to the next storyteller who decides to go in a completely different direction. George Lucas didn't have the luxury to fully plan for 3 movies when he released the original Star Wars. Disney does have that luxury now\\, but apparently didn't bother with any concerns for continuity or the trilogy's arc of all the characters.\\n\\nThere are no monumental story lines to follow in The Last Jedi (TLJ). TLJ resolved or dismissed most of what The Force Awakens handed it and there isn't much to look forward to. I appreciated that it wasn't a retread of The Empire Strikes Back\\, but it could have use the same tone and perhaps left the audience with characters that needed another movie to resolve their arcs. Han frozen\\, Luke defeated and truly questioning his identity\\, the rebels under a serious threat of destruction\\, this is where we were when Empire ended and I had an emotional response to those conditions. Shoot I still get choked up years later watching the movie again. I left TLJ emotionally uninspired and I don't have a dire need to see where these characters end up.\\n\\nThe challenge with the Star Wars universe\\, at least with this Skywalker story line\\, is that it is build on the \\\"hero's journey\\\" from Joseph Campbell's The Hero with a Thousand Faces. It is a very specific narrative that if followed correctly with inspire many because it touches on themes of the human condition that everyone can identify with. If a story strays to far from that narrative\\, you run the risk of losing the shared mythos that attracts many people. And since Star Wars is based on this narrative\\, departing from the \\\"hero's journey\\\" makes TLJ not feel like a Star Wars movie. Campbell's philosophy is very powerful and resonant\\, but it is also very restrictive from a storytelling sense. I don't see dozens of Star Wars movies trying to replicate the success of the original trilogy because that story has already been told. And it was due to the great telling of the hero's journey.","true":true}