{"101487":133895,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have now seen the movie twice. I am a huge Star Wars fan. I had the privilege of being 6 years old when the original film came out and remember everything changing when that star destroyer came over my head and never seemed to end...\\n\\nI was lucky enough to fly to New York to watch the Phantom Menace when it came out as in those days the UK got the films a few months after America. The prequel trilogy have plenty of faults but it had been so long that I enjoyed them for what they were and they did at least progress the story.\\n\\nThe news that there were to be new films a few years back\\, I was in heaven. JJ directing with practical effects and the original cast coming back... it was dream land.\\n\\nForce Awakens... awesome movie (even though it basically re-did 'A New Hope'. There were some great questions to be answered. Who was Rey\\, who and what was Snoke\\, what had happened to Luke. What was this new 'connection' to a lightsabre...\\n\\nEven killing of Han (the best character from Star Wars ever) seemed to serve a purpose and I think Harrison Ford only came back if they agreed to kill him off as he wanted in the original trilogy.\\n\\nRouge One as stand alone film was so good too\\, new characters and the sight of Vader in his full pomp was what all star wars fans had hoped for.\\n\\nSo there I was\\, midnight showing for a film I had been waiting for what seemed an eternity... \\n\\nOh my god!!!! what have they done? \\nIt was like a bad Battlestar Galactica episode. \\nSnoke... no answers. \\nConnection to the lightsabre. Nothing\\nKnights of Red. Nothing\\n\\nAnd the most criminal thing. Luke\\, what did they do to you. You were light\\, the hero the master\\, and they turned you into a miserable\\, grumpy tramp. At least Obi was in exile for a reason. It could all have been so much better. A complete missed opportunity. How much better would it have been if we had seen Luke raise the X-wing (to come full circle) and when all hope was lost\\, Luke lands in front of gates and stands there (as he did but for real) and with a gesture topples the walkers\\, showing that he really is the Master we all know he should have become after 30 years since Return of the Jedi. \\nI could even take him sacrificing himself (the same as Obi Wan) to Kylo Ren to come back and help guide Rey.\\n\\nI was so disappointed\\, I watched it again as I thought it would be better the 2nd time but its worse\\, I can't remember the last time I felt so underwhelmed. The whole Casino side story was horrible. I honestly feel like the writers and director just took a dump on my child hood. \\n\\nGutted... so gutted.","true":true}