{"101487":178405,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There is no debate that this movie is a disaster.  It is titled Episode 8.  It throws away\/ destroys or changes anything relevant or set up by Episodes 1\\,2\\,3\\,4\\,5\\,6 & 7.    The plot is quite possible the slowest car chase in the history of movies.  The characters grow so little.  Rey receives almost no training.  Finn is used in a pointless side quest simply to get him onto snoke's ship so that he can one shot Phasma and have her fall into a giant fireball.  Poe is stuck on the main carrier for the entire movie complaining non-stop.  Luke is a weakened\\, hermit who has no interest in helping the galaxy even though his friends have been killed and are going to be killed by his own apprentice.  Snoke is Darth Maul 2.0 without any actual excellent scenes with lightsaber battles against jedi.  No reason for his character to even exist since he has a total of 10 minute screen time across TFA and TLJ.  He is force throwing Rey around like a child and he doesn't realize a lightsaber is spinning towards him and gets turned on?  Then cut him in half like Darth Maul?  Please!    Leia survives a direct explosion and the deep vacuum of space by floating back to the ship?  ridiculous!   Every movie and every jedi in history would have found that ability useful!  Luke on Bespin\\, Yoda against the emperor\\, Master Windu when he gets blown out of the window!  Anakin and Obi Wan during the fight with General Grievous.  Even the emperor himself when vader throws him over the railing in the Death star 2.0!  Not even Marvel was stupid enough to have Gamora (daughter of Thanos) be able to survive deep space.    I can only give this movie one star and that only because the visuals were on par with what's expected from star wars.","true":true}