{"40636":"23404","TLOU2":"TLOU2","2020-08-05":"2020-07-01","10":3.0,"The Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not thisThe Last of Us 2 represents how games should be made. The gameplay is beautiful\\, there's so much attention to the detail\\, the graphic (for PS4) is impressive\\, i can't even imagine on a version for PC. The story is compelling\\, unfortunately it has been criticized for his LGBT content inside\\, and yes\\, it seems to be politically deployed\\, but who cares? We are talking about the game\\, not this kind of stuff. Trust me\\, this game is a MUST PLAY\\, and the bad score that has from the User became from the \\\"spoilers\\\" that went on the game.… Expand":"This review contains spoilers. So I got the game early and played it. I read or saw no spoilers before the release. I never do.\r\rSo here is what I think:\r\rPros:\r- gameplay\r- graphics\r- atmosphere\r- sound\r- music\r\rAll those parts are undeniable very good. Its top notch. Sure the controls sometimes feel weird but they do in most of the games. It would be unfair to say this game isnt up to date in terms of all those points I mentioned.\r\rCons:\r- story\r- character design\r- character development\r- plot holes\r\rSo\\, even with all the pros this game is really really bad. It makes NO sense that Ellie act how she acts in certain parts of the game but that isnt even the biggest thing about why its bad.\rThe reason is: character development.\rIf you kill one of the most beloved characters early in the game (Joel) and want to bring in new main playable characters like Abby\\, you HAVE to bring WAY more backstory in order to make the player feel with her.\rI mean she KILLED Joel!\rHow do you make the player like her? Bring more and more backstory before she does that. Let the players play 2-10h as Abby when she was a child or whatever. The backstory of her is basically told in 10minutes and then her dad is being killed. Thats it? And now I have to feel with her and understand why she killed Joel?\rHell no!\rThat is weak story telling. Really really weak.\r\rThen there are all the other new characters. Nobody is likeable. Like really. They all feel empty. They are only shells without any meaning.\r\rThis game is just bad. Do yourself a favor and dont buy it. The reviews the journalists wrote are either bought by Sony or ND or are heavily politicly influenced. Sad thing is: because of that same journalists will most likely make this game GOTY. What a joke.\r\rSafe your money and buy something else.\r\rAnd last but not least: this is technically a very good game but the story\/characters is\/are SO bad it just doesnt matter how well the rest is done.\r\rYou want a good revenge story? Watch \\\"Oldboy\\\" then you know how to make a good revenge story that shocks everybody to their core.\r\rThis game right here? Its garbage.… Expand","true":true}