{"101487":130097,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I can't put enough words down to describe my disappointment with this film. It's bad when I go to see a deep highly  anticipated  film I've waited for 2 years to see\\, and coming out asking yourself \\\"so was that \\\"The Last Jedi\\\"? Or \\\"Spaceballs 2\\\"? \\nLiterally started out the first lines with a prank call demeaning the character I  refer  To as \\\"Hitler Reincarnated\\\" to the point where I will never care for his character again. Then they turn the most powerful Jedi master into a fat old angry farmer with no care for life. Then they force a rushed romance between two couples  down your throat so fast you won't know what hit you before they are smooching and having finger sex. \\nThen they will made one couple irrelevant and the other meaningless. \\nThe last Jedi literally took every character involved and stripped away  what made them an interesting character in the first place. The big bad villain is dead Galway through the movie. And by the end of it the last Jedi dies and I literally do not have an ounce of remorse because that was not the  \\\"Luke\\\" I've known since I was a child. \\nDon't get me wrong\\, the acting was amazing! I am in love with Adam Driver and Daisy Ridley and their chemistry was great! \\nBut Rian Johnson needs to never direct a film again unless it's a comedy. I was cringing the entire way through the movie. \\nI actually can't stand to watch it again. \\nThe last Jedi was aweful. \\nIf you can imagine watching a star wars film staring jar jar binks that was this film.","true":true}