{"101487":126630,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Great visuals\\, other than that extremely disappointing. I waited so long for this movie to come out and was so excited to see it opening night. After a month or so to sort out my feelings about this movie\\, I can honestly say I hated it. \\n\\nRian and JJ didn't collab on where the story was headed in this episode. Okay\\, fair enough. But JJ handed Rian a whole bunch of setups (Rey's parents\\, Snoke\\, knights of Ren\\, Luke\\, etc.) and Rian just threw them all out the window. \\n\\nYou can't tease an audience for two years with all of these incredibly interesting plot points and then give them a middle finger and say \\\"Well you shouldn't have watched so many fan theories on Youtube hehehe\\\". We had all of these hints and points of intrigue dangled in front of us\\, of course we were going to try and solve them. It seems like he did all of this just because the audience wasn't expecting it. Rey's parents are nobody (boring)\\, Snoke an extremely powerful force user gets killed by a simple lightsaber trick (what was his purpose?)\\, Luke is turned into a whiny old man (did you see episodes 4-6??)\\, and Knights of Ren aren't even mentioned.\\n\\nI think my biggest frustration with Rian was his handling of Kylo. This stupid chase through space takes place immediately after episode 7\\, which ended with Kylo officially choosing his path and turning to the dark side. Okay\\, great - that was awesome setup IMO. Kylo is no longer conflicted and is a full on dark side user. Why the hell would he hesitate to kill Leia then? It makes no sense by Rian - he makes Kylo out to be this weak conflicted \\\"villain\\\" again this movie and it's so frustrating because Snoke would have been much more interesting. I would have been fine with Kylo killing Snoke if he didn't still have this weak conflicted persona. \\n\\nThe casino chase was just the biggest waste of 30 minutes of my life. Rian Johnson recently spoke on Twitter in response to criticism of this movie and said that he \\\"wouldn't change a thing\\\" if he had the chance. Seriously? All Star Wars fanboy critiques aside\\, you REALLY wouldn't take out this unnecessary capitalism bashing sequence that does literally nothing for the plot development? C'mon Rian\\, it's okay to admit a mistake\\, and now you just look stubborn. \\n\\nFinn's character arc is ruined\\, he contributed nothing this film. Same goes for Phasma.\\n\\nWhy were Holdo and Rose even in this film? Holdo's sequence especially was so frustrating. She could have saved all her troops by sacrificing herself earlier\\, or she could have\\, you know\\, just told Poe and the rest of the crew what the hell was going on. It makes no sense. Rian seems very adamant about having as many diverse and female leads as possible\\, but being stubborn and not relaying information does not make someone a good leader. Ackbar should have been the one to fly the ship through the First Order.\\n\\nThink I'll end this review with the Leia Mary Poppins scene. Seriously\\, I laughed out loud when that happened. Just absurd. Rian Johnson does not respect nor understand the Star Wars universe.","true":true}