{"101487":169782,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars fan - no spoilers. Like many me and my family had been looking forward to this movie for the past two years. We loved Rogue One and hoped this installment to the franchise would take its cues from that film to continue the Kylo\/Rey\/Finn storyline. And some of that expectation was met and some not. I think the fact that this new trilogy is a “reboot” for a new generation of fans and our classic hero’s of Han\\, Luke and Leila are mere anchors to this trilogy can get lost. Don’t get me wrong - I LOVE episodes 4\\,5&6 and have seen them more times then I can count. And I also know the prequels inside and out and even the animated series. What this movie does is follow its own path\\, it’s own timeline\\, while still keeping within the SW universe. The negative reviews on this site make me laugh - people complaining about some of the humor - have they not rewatched 4\\,5&6 recently? Those three movies - as classic as they are - are filled with cringeworthy classic quips and uncomfortable one-liners that are eye rolling and that’s awesome - that to me is SW too. The Last Jedi is visually spectacular\\, emotional\\, funny\\, and a great installment to the franchise. I know upon a second viewing I’ll love it even more. And the fact that my kids LOVED it and were so excited chatting away on the car ride home\\, we saw it as a family with friends and made a night of it —- that doesn’t happen with any other movie or movie franchise (sorry Marvel) that is out there. And that to me makes this movie an 10\/10. ","true":true}