{"101487":187969,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was a very bad movie for a number of reasons.  First\\, director Rian Johnson's overarching goal in this movie was simply to discard what JJ Abrams constructed in The Force Awakens and that is not something that can sustain a movie.  Luke throws away the light saber offered to him by Rey.  For what?  It hardly advances the plot or develops the characters of Rey or Luke in a meaningful way.  Poe was portrayed as a hothead.  Snoke's character is not developed at all.  Maz is basically nonexistent.  Rey's parentage story is discarded.  Johnson aggressively turned his back on important threads left by The Force Awakens lending a schizophrenic character to the new trilogy.  Bad move to pull that after how wildly successful The Force Awakens was.  In general\\, people loved The Force Awakens.  Build off of that.\\n\\nSecond\\, Johnson devoted important screen time developing themes that had no bearing on the central characters and mythology of Star Wars.  Kamikaze self sacrifice was a major theme of the movie.  It happened in the opening scene when Rose's sister sacrificed herself bombing the Dreadnaught\\, Holdo sacrifices herself in a kamikaze attack\\, Finn attempts it on Crait\\, and Luke sacrifices himself to buy time for the rebels to escape.  Why was this theme so important here?  Another theme that took a lot of screen time was the grey area between good and bad that was shown in the Canto Bight plot line.  Another was the theme that anyone can be a Jedi.  Of course they can\\, just like all of the many Jedi who were killed at the end of the prequel trilogy.  But so what?  It is only a justification to make Rey unrelated to Luke or others.  It does not move the story forward. \\n\\nThe movie tried hard to defy expectations as an end in itself.  The trouble is that it is not a satisfying goal of a story.  There needs to be underlying plot and character development that is accomplished in defying expectations.  I'm just not compelled by watching Luke milk a space walrus and watching Rey not get any training.  Instead of showing the strange Jedi island caretakers\\, the porgs\\, Benicio del Toro's character\\, Canto Bight\\, the character of Rose\\, Holdo - none of these things were compelling or advanced the story of the main characters in an important way - Johnson could have delved further into why Luke turned his back on the Jedi and his friends\/family.  He could have spent more time on Rey and Finn developing the characters.  \\n\\nFinally\\, I agree with Mark Hamil that the Luke in this movie is not the Luke that George Lucas created.  Luke did not give up on his father.  He didn't lose hope.  He was strong. \\n Here he is a grumpy man who refreshes himself from a space walrus and doesn't care that his friends and family are dying.  It's too much of a stretch.  It just doesnt feel right.","true":true}