{"101487":156211,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"No justice for Star Wars Fans\\n\\nIn the summer of 1977\\, at 5 years old I watched history unfold and became a Star Wars Fan.\\nI've seen this franchise grow\\, Get butchered\\, and reborn twice...and I can honestly tell you after viewing episode 8\\, and after processing my reaction I can tell you that at first I was in denial..then disgust...then flat out angry at what was done here. \\nI haven't felt like this since episode One when I lied to a news crew and said episode one was \\\"a great flick\\\"????but I digress...a lie it was\\, but the fact is like so many of us is that We simply Wanted it to be Great and loved this franchise so much we didn't want to say anything to the contrary...well Not This Time.\\nEpisode 8 did no justice to our old school main characters...Luke would NEVER behave the way he is portrayed...so do I blame the Writers?...heck Yes...there are so many plot holes and nonsense thrown into this you would have to spend 2 hours on u-tube Fan spoiler reviews to digest it all and hash through it all.\\nDo I blame the Editing?...heck yes...let's face it there ARE some epic Cinematic Footage shown here and the direction is Well executed...but to be truthful Editing a story is crucial to telling a story which is WHY \\\"Star Wars\\\" Received an Academy award for 'Best Editing' and Started a legend????and oh by the way \\\"thank you Marsha Lucas\\\"...because she deserves that for episode 4...although George never seemed to give her credit and butchered her academy award winning Footage originally edited.\\nThis was Simply an Editing flop in my opinion..so much so I can't believe Disney after 52 billion to acquire Fox movie rights would let it happen...i mean it's so obvious\\, and so simple..it's Called \\\"Story Telling\\\" and wherever these bozo's got their credentials is beyond me...????but hey I'm just a Fan and expected a little professionalism...Not A Moshpit of characters making mistakes a 5 year old would do with multiple story lines that have nothing to do with Star Wars lore or character....if I want to see grown ups act like 5 year olds with multiple storylines I'll watch re-runs of the \\\"Love Boat\\\"????????LOL!!!\\nSo yeah...I've seen a lot with this franchise(to much to be honest) but after just Abrams decent reboot you would think episode 8 had an easy setup????NnnnnOPE!!...they just Ruined it...and The Agony and triumph of the franchise continues...(and oh yeah over half the jokes tank Fyi)\\nAll and all it's definitely a must watch for fans but they will find as I did that it didn't need to be a near 3 hour flick as they could have told a more impactful story\\, staying true to the characters and limiting it to 2 story lines like episode 5 did...and even that can be tough.\\nOnly my opinion but it's definitely a 2 and 3\/4 star deal in this Fans Opinion????\\\"May the Force Be with you\\\"...But try not to throw popcorn at the screen...Disney charged theaters a premium to even shown this Bantha Fodder.","true":true}