{"101487":105298,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a movie\\, The Last Jedi is a great\\, exciting film that doesn't ever give you a chance to catch your breath. This would have been a great standalone trilogy movie\\, but its not. This is a part of the star wars skywalker saga\\, and therefore needs to be able to fit with the lore of the other 7 movies.\\n\\nThis movie does nothing to explore the questions raised in TFA. Rey's parents either are not explained or are random nobodies\\, which really makes no sense. Her force vision in TFA is not explained further at all in this movie (Obi Wan saying her name...her left on Jakku screaming to her parents). The Knights of Ren are completely ignored and not explained.  Snoke is killed out of no where after doing nothing but talking about legacy. How did he became surpreme leader? How was he so strong? Who was he? He literally died with no explanation and basically his character was pointless. All fan theories were wasted because it turned out apparently Disney didn't really care about the backstories or how they tied into the other movies.\\nThe new characters were pointless\\, Finn's casino scene was completely pointless and meant nothing in the overall plot\\, and Rey and Luke's training was way too short and he basically taught her nothing. He teased about the failures of the jedi to never explain them\\, and then died without ever really redeeming himself or giving a good reason why he hates the jedi. \\n\\nOverall\\, it's a great movie\\, but it feels like they didn't even really stop to think how this movie effects the others and how it fits. It sure took risks and that's a lot better than remaking another movie like TFA but it had so many missed opportunities to expand on the lore of the franchise.","true":true}