{"101487":182925,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the first movie in a very long time that just made me mad that I spent the money to see it. I have been a massive Star Wars fan since I was a child and I grew up with the entire universe. As a result\\, our kids have become massive Star Wars fans as well. We have gone to all of the opening night showings since that was an option and while we enjoyed Episode VII a couple of years ago we were disappointed that the story was a repeat of Episode IV\\, just with a new cast and better CGI. But\\, we had heard so many good things about Episode VIII that we were champing at the bit to get into the theatre to enjoy what we hoped would be a fantastic movie. SPOILERS AHEAD\\n\\nTo put it bluntly\\, \\\"The Last Jedi\\\" made the prequels look like Oscar contenders. It was a mishmash of scenes cobbled together in a sort-of sensible order that didn't answer any of the questions raised by Episode VII all while completely obliterating any chance for exciting story arcs with new characters because they were simply killed off. The so-called plot was ridiculous at best even in an imaginary world where we have come to suspend belief for the best viewing pleasure. I thought perhaps I was the only one as disappointed as I was\\, but when we walked out to the car my entire family felt the exact same way. How the \\\"top critics\\\" rated this movie as highly as they did must have involved some sort of back room payoff. Either that or they ere all fed laced popcorn before the opening crawl. Do you want to know how the First Order came into power after the destruction of the second Death Star? No idea. No answers. Want to know anything about Supreme Leader Snoke? Too bad\\, he's killed off. Want to know who Rey's parents are? Well\\, there's sort of answer given in this film\\, but it is completely unsatisfactory. And apparently Rey is so gifted in the Force that she doesn't need any sort of formal training to do far more than Luke could have imagined when he was training. And if you love space adventures\\, be prepared for the slowest and lamest space race ever. Are you serious that a massive Star Destroyer couldn't catch up to a resistance ship? Come on. And why is Poe suddenly a completely different personality than he was in the last movie? Admiral Ackbar\\, one of the best memes of all time\\, is killed off with no fanfare and Leia has more power than Darth Plagueis could have ever imagined. We were excited to see the new Praetorian Guard in action but they were meaningless. Captain Phasma is back\\, just long enough to get killed (really again since she never left Starkiller Base in Episode VII). We get to see the battle of Hoth again\\, but this time with sand instead of snow...oh\\, and some crystal dogs and there is an incredibly lame added in scenario of going to a casino to find a code breaker who does nothing in the end. Then there is Luke Skywalker. Luke who ran off to help Han and Leia in Episode V at risk of his own peril\\, and was so certain that he could turn his father back to the light that he met with Emperor Palpatine with no backup and no help. Why did this Luke \\,who in the end was so strong in the Force\\, give up on Ben Solo so easily? And why does this Luke say he will train Rey and then not do it? And Vice Admiral Holdo? Pointless\\, though her ending action is one of the coolest looking scenes in the entire film. \\n\\nThere are some absolutely beautiful moments visually and there is far more humor than in any other Star Wars film to date\\, but the humor really doesn't fit. I just can't understand how anyone thinks this is a good addition to the Star Wars saga. If you need to see it on the big screen try to catch a matinee showing so you can save a few bucks or just wait until it's out on DVD. Or go watch Episode V and VI and just pretend that's where the story ended.","true":true}