{"101487":159573,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"One of my most cherished early memories as a child was watching the Star Wars trilogy with my sister. As a fan of this universe it pains me to say this\\, but after that film I am final done with Star Wars. This film was simply terrible. It quite deliberately destroyed the established lore and contrived a way to destroy Luke Skywalkers character and kill him off in the most ridiculous circumstances. To what end? To free up the story for Rey. The problem with this is that Rey is a entirely ridiculous Mary Sue. She is absurdly over powered for no discernible reason\\, has done nothing to earn her power\\, made no sacrifice\\, required no training etc etc etc. Perhaps this could have been justified by giving her an interesting backstory or family history. But no. She's just omnipotent and incredibly dull. \\n\\nAnd this\\, I think\\, is the main problem with this movie. You can talk about the plot holes (you could write a thesis on the plot holes)\\, the poor writing\\, and the bad acting but many fans would have forgiven that all if the movie had found a way to give Luke\\, Han and Leia the epic send off that their characters deserved. After waiting 34 years\\, it was simply heartbreaking to see how poorly these iconic figures were treated by the new franchise. Han killed\\, but no reaction from Luke and barely a flicker from Leia. Luke reduced to a pathetic coward who abandons his faith his family and the entire universe and gets killed off having achieved nothing. Leia is now Mary Poppins. \\n\\nThe theme of this story seems to be that everyone ultimately fails - the Jedi failed\\, Luke failed\\, Leia failed\\, Poe failed\\, Finn failed etc.  So Rian gets half a star for commitment to this theme by so abjectly failing himself. \\n\\nIf he directs the next Indiana Jones perhaps the story will be Indie being arrested for historical sex offences or imprisoned on charges of looting or something equally uplifting.  \\n\\nAlas\\, it's too late for Luke. Not even the Force can save him now. I'm afraid this and all future Star Wars movies won't make it into my internal cannon. I might watch them for free one day but certainly wouldn't give any money to Disney.","true":true}