{"101487":182104,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-12","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is going to be a bit different than the usual post I write.  Typically I seek to connect the things we love with the God who loves us.    The Last Jedi had a lot of deeper meanings and truths in it\\, and in the future I will write about how this movie has faith and scriptural connections.  However\\, now my intention is to share why I love The Last Jedi and why I think it is such a great Star Wars movie.     I loved it so much that it just might be my favorite of all the Star Wars movies.  I am not alone in this opinion\\, but there are also a lot of people who feel the opposite.  One of the tendencies of the Internet is that the negative tends to be emphasized and amplified.  I have deep feelings about The Last Jedi\\, and I want to add my voice to the conversation in a positive way\\, so here are all the reasons why I absolutely adore The Last Jedi.  \\n\\nIf the Last Jedi is to be my favorite Star Wars it will be bumping The Empire Strikes Back off the top spot.   I appreciate that both movies share a similar story telling device.  Both movies essentially tell different stories that weave together in the end.   Empire Strikes Back has the story of Han and Leia as well as the training of Luke.   The Last Jedi ambitiously tells the stories of Rey\\, Poe\\, and Finn.  I found all three stories to be equally compelling.  \\n\\nThe biggest of the stories being told is Rey's story.   I love what they did with Luke.  Luke has always had an interesting mixture of heroism\\, cockiness\\, and pessimism.  It was a surprising turn to see a defeated Luke that had the pessimistic streak win out.   Luke was not the symbol of hope that everyone wanted him to be because he was defeated and he was resigned to defeat.   Watching Luke struggle with that and then face his demons by confronting his biggest regret was powerful storytelling.  I was absolutely in awe with Luke's story ending with the sunset.  This clearly called back the famous binary sunset scene from A New Hope.  These two scenes create footing bookends to the character of Luke Skywalker and it truly does feel like he fades away at peace.   \\n\\nThe interaction between Rey and Kylo Ren is also incredible.  They are opposite sides of the same coin\\, dark and light rising to meet it.  This gives them an undeniable bond and attraction while forcing them apart. These scenes were portrayed very well.  The attraction and repulsion between the two characters was tangible.  The scenes with Snoke were some of the best in any Star Wars movie.  I am fairly sure that I audibly gasped when he was killed.  I know that this is one of the points of contention with the movie\\, but I am fine with it.  Snoke was never the big bad of this trilogy.  It is Kylo Ren\\, and in this movie he claims his place.  It was unexpected and it worked well because it turned the standard plot conventions on their head.  It made watching the movie extremely exciting\\, because I had no idea what was going to happen.  Would Kylo Ren turn and join Rey or would Rey join Kylo Ren.  After Snoke was cut in half\\, it all seemed possible.  When I took my son to see the movie\\, he said \\\"No\\, Rey\\\" when Kylo Ren made his join me offer.  I was with him.  I do not think any movie has ever had me on the edge of the seat in anticipation of what was going to happen next\\, like the Last Jedi did in that moment.  \\n\\nI also really enjoyed the story arc with Poe.  Poe was one of my favorite characters from The Force Awakens\\, and I have been faithfully reading the monthly comic book series that features the character.  Poe\\, the hotshot hero\\, had to learn a tough lesson in leadership.  The way this played out was masterful storytelling.  Vice Admiral Holdo was a fascinating character.  The movie immediately sets her as a foil against Poe\\, and it naturally has the audience on the side of Poe.  However\\, Holdo is not a villain.  In fact she is far from it.  The character is only ever portrayed as a paragon of Resistance virtue.  There is a lot of criticism about Holdo's \\\"bad leadership\\\" of not telling Poe the plan.  But why would she?  Poe\\, especially after being demoted\\, was not a member of senior command.   The mission plan did not concern him.  Poe's orders were to wait at his post\\, and like most of the crew on the ship that is what he was supposed to do.  However\\, he can not do that.  He can not be part of a team\\, he is driven to be the hero. He formulates his own plan\\, and does not tell Holdo.  Poe essentially does the same thing that the audience is mad at Holdo for but the audience gives him a pass. Holdo has valid reasons not to tell Poe\\, but Poe is just being a hot-headed hero.  This is why the storytelling is so brilliant.  The audience fails right along with Poe.  \\n\\nThe final story arc in the Last Jedi might be my favorite\\, and that is Finn's arc.  At the end of The Force Awakens\\, Finn is left unresolved.  He helped bring down Starkiller Base\\, but he is not a hero.  His motivations were still mostly selfish.   At the beginning of The Last Jedi he is still being selfish and cowardly.   Finn is shown extremes.   He experiences the desperate plight of doomed rebels and then at the casino  he sees what blissful ignorance looks like.   Rose shows him what it looks like to live for a cause and DJ shows him what it looks like to life only for one's self.  The source of Finn's selfishness is fear.  He confronts this fear in his fight for Phasma and then he chooses his side as \\\"rebel scum.\\\"   At the end  he becomes a true hero as he learns it is about saving what we love.  By the end of The Last Jedi\\, Finn has changed a lot from the scared stormtrooper he was at the start of The Force Awakens.    \\n\\nThe reason why I loved The Last Jedi is because all of these wonderful characters grew dramatically throughout the movie.  I especially liked that what caused them all to grow was learning from or confronting failure.  This was one of the great moral of the Last Jedi\\, and the filmmakers had Yoda state this just in case it was missed.   \\n\\nThe Last Jedi brilliantly continued The Force Awakens.  It did so in a way that left the principle characters more mature and sets the stage for Episode IX.  For the majority of my life I have loved the Star Wars universe.   However\\, it is the characters not the universe that makes the movies.  I love the Last Jedi because it puts the characters in the forefront\\, and I get to join them on a difficult journey of personal growth throughout the movie.   The movie is a compelling journey to a galaxy far\\, far away and it is a worthy addition to the growing Star Wars canon.","true":true}