{"101487":167934,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So it has been 5 weeks since I saw The Last Jedi on opening night and I am still bothered by this movie.  I have walked out of movies before and didn't give it a second thought.  This film is different.  There is so much that is bad about this film.  The humor is cringe.  Rey is a Mary Sue on steroids.  Kylo Ren is boring.  New characters are boring and annoying (I'm looking at you Rose).  There are huge gaping plot holes and questions  from The Force Awakens left unanswered or answered so stupidly I ask myself what was the point?  \\n\\nHowever I think all of that could have been forgiven if they had not assassinated\\, desecrated then discarded Luke Skywalker like day old rubbish.  I really believe  what bothers most people\\, myself included\\, is what they did to Luke Skywalker.  He is unrecognizable.  They had the once in a lifetime opportunity to bring back Luke f@#$ing Skywalker in all his glory and they botched it!  They took the most powerful Jedi ever\\, a beacon of hope and optimism\\, and turned him into a total loser.  What?!  Why?!  It is so confusing.  I am sorry to tell those who want to move on from the Skywalker story but...Star Wars is... Luke Skywalker.  He is ever present.  The main title theme is Luke's theme.   The force theme plays for him as well but it plays when the force is present for anyone as well\\, Obi-Wan\\, Yoda\\, Rey etc.  Luke IS Star Wars.  If you don't like it look elsewhere.  Clearly people like it or this would not be the most famous movie saga ever.  Star Wars is not just a movie but a cultural phenomenon that has been passed down generations for decades. We will never see the likes of it again. \\n\\n I have been a fan for 40 years.  40 years!  Luke Skywalker was my childhood hero.  I know I am not alone.  This is why so many people are bothered by this movie.  You cannot fundamentally change the character.  Zack Snyder tried to do the same with Superman.  We do not like a brooding Superman.  It fundamentally changes the character and people will reject it.  So they desecrated Luke Skywalker then they killed him.  I know Luke Skywalker can't live forever but his death should have come 2 or 3 movies from this one and his death should be so epic that it leaves a black hole in its wake.  That is what he deserves.  A death so grand the whole galaxy will feel it and never forget it.  Can you image seeing that version?  Instead we get the worst scene ever.  Even the binary sunset couldn't bring the feels.  Worst of all he dies alone.  Alone!  Luke Skywalker dies alone!  Why?!  \\n\\nOne would ask why they would do this?  Where is the continuity between the OT and this sequel trilogy?  Where is the continuity between The Force Awakens and The Last Jedi?  The answer to both is there is none.  Why you ask?  Because this new trilogy is not a sequel.  It is a reboot.  They are systematically trying to destroy the old and bring in the new.  That is why both the Force Awakens and The Last Jedi are rehashes of Star Wars\\, Empire Strikes Back and Return of the Jedi.  I am sure the remaining few beloved characters will be slaughtered by the end of the next movie.  The transition will be complete and the history erased.    I am confused by this.  Disney usually knows where their bread is buttered.  Yes this movie made money but the future films will suffer because they have alienated the fan base.  There is no way this new generation will care for the saga the way my generation did.  Star Wars will not survive this.  I am sad for it.  The saga is hemorrhaging.  It will be dead in 10 years at this rate.  \\n\\nAgain I am confused by all of this.  Disney knows where their bread is buttered.  Look at what one Darth Vader scene did for Rogue One.  Can you imagine what a similar scene with Luke Skywalker would have done for The Last Jedi?  The world will never know.  \\n\\nLastly\\,  I am so sorry Mark Hamill.  You can see how affected he is by this new trilogy.  He is completely and utterly heartbroken by what they did to his character and story.  Mark deserved better than this.","true":true}