{"101487":169652,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Stars Wars: The last Jedi is the latest installment in the Star Wars franchise. It is also the weirdest (and not in a good way). \\nNon-Spoiler summary-The movie suffers from many problems. For one\\, tone-whiplash. One minute it's a super serious drama and next it's trying to be super quippy like a Marvel Studios movie. The tones very often clash and ruin very emotion scene. Said humor also feels very forced and often immature like a six-year-old wrote it.\\nAlmost all the characters are written poorly. Some characters feel so useless to the plot that you could cut them out and the movie wouldn't change. And some beloved characters are written so bad that it feels like fan-fiction written by someone that hates Star Wars. Many new characters are constantly propped up and made to look \\\"awesome\\\" with no reason for the audience to like or agree with them. it's like the director just expects you to instantly like these newbies just because. And some characters are hardly even fleshed out.\\nNot to mention countless scenes that are so weird that it makes you wonder how anyone looked at it and said \\\"yep\\, that looks fine and not goofy and stupid'. I can't tell you what they are\\, but they are things i would not expect to ever see in a Star Wars film. Said inappropriate scenes range from disgusting to cheesy. \\nThe fighting scenes are very Christopher Nolan. For some this may be a huge issue\\, for others not so much. \\nOn the positive side\\, the effects look really good. And the soundtrack is also really good. And the movie had some cool concepts.\\n\\nOverall though\\, the movie felt very disjointed. Trying to do to juggle too many things that often clash with poor dialogue. Overall not as good as the Force Awakens.","true":true}