{"101487":104295,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"An unfocused\\, contrived\\, and inconsistent dumpster fire of a movie\\n\\nHERE'S THE MOST IMPORTANT THING TO KNOW BEFORE SEEING LAST JEDI - Rian Johnson has said he wrote Last Jedi while Force Awakens was filming and that he never spoke with JJ Abrams about where he planned to take the characters he introduced in Episode VII. And it's painfully obvious when you see this movie. I'll save the specifics for the spoiler section of my review but see below for the spoiler free section.\\n\\nHere's the general theme though: \\nJohnson - Figure out where you want to take a story\\, THEN find PLAUSIBLE reasons and methods for getting there. If you can't do it yourself\\, the job should go to someone who can.\\n-I want a story\\, not just people talking.\\n-Star Wars Rebels is a Disney cartoon and manages to tell insightful and intriguing heartfelt stories for 4 seasons. Get these guys for future Star Wars movies. They \\\"get it\\\" and they already work for you. Make them the boss of anyone else hired to direct.\\n\\nNow onto the review...\\nNO SPOILERS SECTION\\nSome people like this movie\\, some don't. I haven't found any rhyme or reason behind whether you will or won't. I've seen this movie twice so far and all I can say is that I hated it less the second time. But it's the first episode of Star Wars I won't be buying when it releases and it makes me seriously question the competence of Disney execs to continue to make promising entries in the Star Wars universe.\\nThis movie is spectacularly inconsistent with itself and all of the other movies that have come out before. If this movie were just in the Star Wars universe and not about well established characters\\, it might be ok. Not great\\, but it might be ok. The reason I say might is that it doesn't go anywhere. It doesn't tell an interesting story. It doesn't tell a compelling story. And it doesn't make any real statement that makes you sit back and really think about what you just saw. Instead it dabbles in lots of different things but never brings them together.\\nInstead it feels like one of the Transformers sequels. Optimus Prime and Bumblebee are still there\\, but what they are doing and why doesn't really make much sense and isn't really an Autobot thing to do. Unfortunately\\, when your movie is one part of a 9 part series\\, you have to be consistent with what's happened. If you don't like that\\, you need to find a reason viewers will accept for why everything is suddenly different. Empire Strikes Back did this. It was dark and had no hope at all. The bad guys won handily in the end and everything seemed without hope. But it took the story in a direction that made Return of the Jedi better because you suffered the same hopelessness as the characters. It's darkness allowed Jedi to shine.\\nThis isn't dark. It's just campy. The writing is awful. The smart people don't do anything smart. Many have gotten remarkably dumber since the last episode. The reason people do something rarely has any rational connection to what they are doing\\, let alone the outcome. Johnson just has points he wants to hit in telling HIS story\\, and hammers square pegs into anything but square shaped holes for 2.5 hours. Johnson teased a directors cut with an extra 20 minutes of footage on top of the two hour movie. Frankly I'd like one with about an hour less of footage.\\n\\nHumor - The humor is actually good. But it's overdone and misplaced. It ruins far more than it enhances. Humor in Star Wars is a garnish. It's the sprinkles on top of the donut. This movie just dumps sprinkles on everything. In the first 5 minutes of the movie\\, there's honest to God a \\\"your mom\\\" joke. It's a funny one. But it's just out of place. \\n\\nDiversity - this is an incredibly diverse cast. And that fact alone is great. But a diverse cast of a bad movie is still a bad movie. And people don't pay to sit in a movie theater to watch bad movies. I've seen so many arguments about SJW vs the Alt Right and any number of conspiracy theories trying to justify why this movie is receiving such poor reviews and it just comes down to it being a bad movie. It added nothing good to the previous 7 and ruined most of what the previous 7 did. \\n\\nThere are good scenes. There are moments that really make you sit up and have hope that something good is coming down the pipeline soon\\, but they are always wasted. See below for details.\\n\\nAnd the biggest self-inflicted wound of Last Jedi? That if any series can disregard what came before it for the sake of cleaning the slate for a new director\\, then nothing in any movie in that series actually matters. If nothing is kept consistent\\, then none of it matters. It's all inconsequential and not worth watching. Game of Thrones lets essential people die all the time. And when it does\\, they're treated like real people were genuinely lost. They have an impact on the characters\\, the story\\, and the audience. This movie barely hints at that. Oh\\, an established character is dead? Bummer. Moving on\\, we've got a story to tell. I don't know what that story is but there's lots of words in it and the clock is ticking.\\n\\nSkip this movie. Don't reward Disney's laziness or Johnson's ineptitude. Make Disney and whoever is next do their damn job. Everyone will be better off.\\n\\n\\nSPOILERS SECTION\\n\\nQuick hits in no order:\\n-Bombs don't drop in space. There's no gravity. Science.\\n-Fighters flying cover\\, don't just sit next to the bombers and hope for the best.\\n-Commanders\\, like Poe\\, are officers and don't disobey orders. In the military\\, you follow orders. Period. If not\\, you are executed. Mutinies are a hackneyed attempt to create drama by Hollywood people that don't know better. If people start doing whatever they want any time their life is in danger then there's no point in them being in the military because the point of  a military is to have people willing to go into danger. If the chain of command doesn't matter\\, it's just really expensive dress up.\\n-If a ship going into hyperspace could be used as a weapon\\, people would have been doing that at everything since the invention of hyperspace. Death Star? No problem. I'm gonna hyperspace my Pontiac Firebird at it. Take that Skywalker.\\n-The Falcon\\, and DJ's ship both hyperspaced in right on top of the other ships in this movie. Yet the First Order can't do this? They have an entire empire at their command but decide to just slow chase the Rebels until they run out of gas? That's genius. If that word didn't mean what it actually does.\\n-Multiple Star Destroyers\\, the super ship\\, hangar bays full of fighters and capital ships\\, a galaxy of reinforcements\\, and the genius idea is just wait until their gas runs out because typically one force is aware of the other's fuel tank? See above.\\n-General Hux is a moron. Morons don't usually make general.\\n-General Hux is a coward. Cowards don't usually make general.\\n-Generals typically command units on the ground (General Veers from Empire). Admirals command the space ships (Admiral Ackbar\\, Admiral Piett\\, Vice Admiral Holdo was IN THIS MOVIE and you still got it wrong)\\n-Don't use Hux as comic relief anymore. Don't prank call him. Don't throw him into a bulkhead for being sassy. This is a Galactic Empire with access to billions of brilliant people. Go find one. If you had Admiral Thrawn enter at the beginning of Episode 9 and kill Hux\\, I personally guarantee applause. Possibly standing.\\n-Everyone but Snoke lacks menace. Villains without menace aren't intriguing villains.\\n-The Republic lost 5 planets in the last movie\\, so after 30 years of fighting the old Empire\\, the celebrations at the end of Jedi\\, the Rebels managed to get 5 planets on their side? And after Episode VII there's only a few hundred people left now? What the deuce? Where did they all go from the last episode? If you aren't sure about this\\, ask Google how many planets are in a galaxy. It's a lot.\\n-Mark Hamill said he couldn't play Luke Skywalker like the script called for\\, so he acted him as someone else\\, Jake Skywalker. This is 100% accurate. You should have listened to the guy that built the character Johnson. You're out of your depth.\\n- Luke would never give up on his friends. The guy lost his adopted parents\\, Obi-Wan\\, Yoda\\, Han\\, and his father. But one naughty nephew and he throws in the towel and goes to die? If you don't understand how failure feels\\, and you clearly don't\\, find someone that does. It will help you improve as a writer and human being.\\n-Everything with Luke was awful except his first lesson on the Force. The cheese was strong and pungent\\, in the Kung Fu shoulder dust at the end\\, the bad jokes\\, the random lightsaber dodge action shot\\, the milk\\, the fish\\, the angst\\, the aimlessness. We spent all of Episode VII looking for him. What was the point? Was this a postmodern joke?\\n-If you can become a Jedi by just hanging out with one for a while\\, what was the point of the Academy or the Jedi Order as a whole? Bureaucracy? These are important questions you left sitting on a floor somewhere Johnson.\\n-JJ Abrams teased that Rey's parents had never been shown on screen in Star Wars. Frankly this was refreshing. Family dynasties get old and trite. This one you got right.\\n-JJ Abrams also said Phasma would play a key part in episode 8 and you would learn more about her. Nada. You don't deck someone out in chrome armor and then not talk about the shiny one. It's literally the elephant in the room.\\n-Finn does nothing. DJ does nothing. Somehow BB-8 avoids detection from a robot that detected him\\, got out of his trash can\\, and climbed into a walker without being spotted\\, yet waited to save his friends until he could get a dramatic entry. People need believable events. It's not that this stuff shouldn't have happened\\, we just needed more scenes showing why.\\n-I liked Finn. I liked Rose. But they were equally pointless and could be cut without anyone noticing.\\n-If Rose could fly faster than Finn the whole time\\, why didn't she fly faster and shoot the gun?\\n-Who drops a super gun from space far away from where it's needed? I don't drive someone home and drop them off a mile away.\\n-Who is Snoke? What\\, where who\\, how about this big bad guy and where he came from\\, what he means\\, nada. Doesn't matter. Dead. You're killing me here Johnson. We didn't NEED to know about Emporer Palpatine because a few lines hinted at what he did and who he was: Vader's master\\, more powerful than him\\, cunning enough to overthrow an entire political system\\, ruthless in ordering a man kill his son. Snoke gave us nothing. How did Snoke come into power? Who are the Knights of Ren? Where are the others? This is important stuff you tossed in the trash. Not only because I wanted to know but because Episode VII asked the bloody question!\\n-Vader was fearsome. Kylo Ren is pouty. If you want to tell Twilight stories\\, go do it\\, but don't use Star Wars characters in an established decades long story for it. Kylo smashed his helmet because Snoke made fun of it. He sniffled when thinking about killing his mom (dad's ok apparently) but then lets two other pilots do it for him. He wants power to make a better galaxy to do what with it? Just be his? None of this follows any logic or has any point. What kind of weak nitwit are you trying to create here? \\n-Vader had real anger. Malevolent anger. Kylo has temper tantrums. Figure out the difference. Don't use tantrums anymore. No one listens to tantrums.","true":true}