{"101487":199329,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow... Star Wars.. where to begin ? I've been a fan of the series for the last 25 years. Saw all of the movies\\, played most of the PC video games of the 90's (X wing\\, Tie fighter etc). Needless to say - I'm a SW fan. I have a complete and utter respect to George Lucas and the cast of the series. Having said that - it is with a heavy heart to come back from SWTLJ and give it a one star review. It's not that it's that bad\\, but it's simply not a 8.2 or even 8.0 movie. Probably 7.2 or less. It is hard to say it but it must be said: \\\"Greed had poisoned too much of the galaxy in the star wars universe\\\". Let's start with the pro's and cons:\\n\\nPro's:\\n\\nPretty good cinematography - Some shots are spectacular and do evoke feelings. When Kylo reaches his hand to ray (I won't say much...) and there's a close up\\, you can see and experience the emotions. Also when When Kylo ren makes his attack in the beginning - It is well shot and conveyed his inner conflict in this situation. The people behind the camera did a good job.\\n\\n\\nSpecial effects : Nothing short of amazing. The Ships\\, the Cruisers\\, ATAT\/ STAT \/ STST walkers and the planets are just eye candy. This movie has a lot of action scenes in it (Space battles mostly) which looks and sounds what we might expect from a star wars film - a spectacle to behold.\\n\\n\\nThe cast - Very good performances across the board. All looks believable. I have so much respect for Mark Hamil\\, that not only played in the movies' industry \\, but also gave his voice to the Joker character in the animated series\\, the video games that followed (ahh... Arkham asylum.. such good memory) and also acting as Col. Blair In the Wing Commander series - he is amazing. I really liked him in that movie as well - though I would expect a larger part of him even as just a mentor. I wish I could have seen more of him in this movie. They had barely scraped the surface of his talent. The rest of the crew does a pretty good job as well. I liked Adam driver as well\\, you can sense that his character are in turmoils deep inside. Good performance by the late Carry Fisher - though I do wish they showed her character more as well. Also liked Oscar Isaac (Poh Demron). He plays the character so believably... Poh is the renegade I would like to have on my side when things get rough. Daisy Ridley is pretty good too\\, but the character of Rey feels a bit shallow to me. I want to root for her\\, but she seems almost too perfect. No known flaws\\, which makes her inhuman and hard to relate.\\n\\n\\nSome underlying messages were good and inspiring: It is not a secret that the Star Wars universe supports some positive themes. Women are courageous leaders\\, people of all shapes sizes and colors are mixed together and treated with respect as they work together to battle tyranny and evil. I really liked it. It's really a feminist movie - which is good. Keep on the legacy.\\n\\n\\nAnd now to the Cons:\\n\\nThe plot and the writing: The plot is an insult to intelligence. I feel duped (as the title might suggest). There is no sense of Catharsis at the end\\, It feels like you wen't on a roller coaster only to end at an anti Climax. In episode V (The empire strikes back) - it was obvious what needs to be done (rescue Han) and you felt shattered by the relations of Luke and Darth Vader. I can still see in my mind Luke screaming in the City of the clouds Scene - \\\"That's Impossible !\\\" when Darth tells him the truth. That movie had a sense of order in it and inner logic. This movie leads you to a sh*t hole with a vague premise under its feet in the end. You expect more of the heroes in this flick but it just not what you hoped for. We are left of no real hero to root for. Thus\\, we must rely on characters that we don't know yet. It just feels illogical. I really really didn't like this direction. I really can't understand the need to kill the people that made this series a legend yet applying similar plot lines to a different cast. (ok\\, I'm gonna raise the tone here) - WHAT THE F*ck are you doing DISNEY \/ LUCASFILM ??? Where is the hero in this series ? It feels messy. You would think the director and writers would leave us with an ending that will entice us to look forward to the next episode\\, but instead we are left with very vague answers as to what is going to happen. It feels like this whole movie is leading us to ... Nothing. There are no heroes in this flick\\, only cowards.","true":true}