{"101487":120030,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Fair warning\\, there will be spoilers in my review. It's a good movie but I am not a fan of this one. I enjoyed it but didn't like it that much. I'm torn between 2.5 and 3 but since I love Star Wars and it did have 2 to 3 scenes that were amazing and forever remembered as all time great moments in Star Wars surrounded by WTF were they thinking moments.  Before I get into the big spoilers a general overview was it was too long and too slow moving with whole parts that could of been removed without hurting the story and maybe even helping it. No reason this had to be longer then 2 hours and be 2 and half. Main reason for my dislike is big parts didn't have the star wars feel\\, the whole casino planet could of been removed. This was all Harry Potter like and not not star wars. The first half of the movie jumped around too much and too slow. The last hour\\, was great. Yoda appeared\\, made me smile\\, the starship jumping into lightspeed to rip a star destroyer in too was genius\\, The Snoke fight scene had 2 awesome deaths by lightsaber. Luke was good but the moment of him wanting to kill is not him nor a jedi and hurt the story. Him becoming a force ghost in the end was cool\\, since Force Awakens I said they needed to end his character too and I'll glad they didn't keep him limping along. I love the original trilogy and always will but all the characters need to go but it still has to feel star wars when they do. I'm scared for R. Johnson new Trilogy. He took the star wars aspect away from the movie. It was too much Potter or Percy Jackson magic and not Sci Fi. Too funny and cute and dry witty humor that sneaks up on you. Poe's characters seems like a totally different character from the first film to this one. Not in a good way either. Laura Dern was amazing\\, Finn needs to stop saying everything he does as he does it.  And they need to remember Jedi's are not wizards. Will I buy the bluray\\, hell yes. will i watch it again and again at the theater like some\\, no. The count down for Solo begins.","true":true}