{"101487":175432,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi isn't quite as good as The Force Awakens\\, but it's close. I don't know how die hard Star Wars fans will feel about The Last Jedi\\, but as someone who loves cinema this film really impressed me. The performances and action scenes in this film are the best in the entire saga. The amazingly choreographed action scenes utilize wide shots with few cuts. All of the cast is top notch. Carrie Fischer has so many scenes in this film as Leia of just being a badass. Kylo Ren played excellently by Adam Driver is still a complex villain that evokes a lot of sympathy. Daisy Ridley as Rey is still the strong hero we all love\\, but she has chances in the film to show some real vulnerability. Oscar Issac as Poe is given a lot more to do\\, he goes through a very interesting arc where he has to grow as a person. The performance that steals the show\\, however\\, is Mark Hamill as Luke. Hamill is brilliant in this film. He is a broken man who is tired of being the hero\\, and is just looking for a way to find peace. The main focus of the plot is to evoke emotion\\, and it succeeds at most attempts. The emotional weight of this film is its greatest strength. I've never felt this emotionally invested in a Star War's film before. The score by John Williams and special effects are what you expect\\, they're incredible. The only flaw this movie has is a subplot involving Finn played by John Boyega and Rose played by Kelly Marie Tran. The actors do a good job\\, but the entire subplot is pointless to the main plot. You could cut Finn and Rose from the film and nothing of significance would change. There's also a development involving their characters that I just didn't care about at all. Besides that subplot\\, this was a masterfully crafted film. With the magnetic action\\, terrific performances\\, and unprecedent emotional investment I can confidently say that Rian Johnson has created one of the best films of the year.","true":true}