{"101487":101605,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Although I understand the negative critics on this movie\\, I myself really liked it. I walked out of the theater feeling satisfied\\, stunned\\, and a little overwhelmed. \\n\\nLet's start with what I didn't like. In my opinion\\, there was too much going on. Several characters and subplots were really unneeded. At some points\\, it retracted from the overall plot. it seems as if there were just a lot of ideas for moments that they had\\, and instead of choosing\\, they just used them all. This allowed for a lot of cool moments\\, but was overwhelming. \\n\\nAnother thing I was so-so on: the humor. The jokes and style were really great at some points\\, but occasionally it went over the top. Many jokes just didn't fit with the overall theme or feeling of the movie. \\n\\nDespite these negatives\\, there were a lot of things I did like. The acting was really good in almost all the scenes. I thought the acting in the Rey (Daisy Ridley) and Kylo Ren (Adam Driver) scenes was absolutely brilliant. \\n\\nI also really liked what they did with the story. I think this is the thing that people don't like. Disney is literally killing the past\\, which many people were not ready for. But i think this sets up the new characters well. The torch has been passed on\\, and now our new generation has to take the lead. I also really loved the new perspective on the light side and the dark side. It was what I really wanted from the movie\\, and I was very intrigued by that aspect of the movie. \\n\\nThe visuals were brilliant\\, but occasionally didn't fit. A lot of the jokes were good too\\, despite the fact that some of them just didn't fit. The conflict was brilliant. I loved the idea that many of the characters were extremely flawed and not who we expected them to be. \\n\\nOverall\\, the move was a bit flawed but very interesting; I think most of the problems could have been solved by a bit of simplifying and shortening. I really loved the characters and the ideas presented\\, and  it was overall a good movie.","true":true}