{"101487":146064,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've seen it twice and have enjoyed it both times. I actually thought it felt more like Star Wars than TFA did. There are problems with the film (which is why I didn't give it a 5\/5) but I think the film's strengths and character outweighs them. Questions set up in TFA were not answered in the way many of us have speculated in the last two years\\, which I think contributes to all the bad reviews its been getting. What this film does is manipulate the preexisting mythology of Star Wars that we've had with us since 1977 into a new one that is still familiar. I don't think TLJ \\\"destroyed\\\" Star Wars like many have claimed. I think it's set up a good basis for ep. xi to build on by establishing that the world is not white and black (something that people had NO PROBLEM WITH in Rogue One) and that you don't have to be a Skywalker to be the main force sensitive character in the films. \\nSPOILER\\n***\\n***\\nThe realm of Star Wars was already in trouble when the Hosnian System was destroyed in TFA\\, so I liked the idea of a key figure like Luke starting off hopeless and discouraged but then returning to a mindset akin to that of the ROTJ at the end. A point of the movie was to reestablish hope for the Resistance\/Rebellion and the galaxy and Luke finding his own purpose again at the most dire moment (and kicking Kylo's butt) helps project this. Yes\\, he pulls a Yoda on us\\, but that doesn't mean he won't come back in xi as a force ghost!\\n\\nI thoroughly enjoyed this film and I think if people gave it a chance others would too.","true":true}