{"101487":199523,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow. What can I say? This movie utterly sucked. There were a few cool scenes but the story was complete garbage. The director took a huge misstep by trying to make this like Guardians of the Galaxy or something from the Marvel Universe. But Star Wars hasn't ever been a goofy\\, silly\\, stupid type of film. I knew something was off when Luke tossed his light saber and 50% of the audience laughed like imbeciles. In the end its just a movie\\, but it sucks that the PC culture and SWJ ideologies have ruined another potentially good movie with their \\\"Mary Sue\\\" perfect female lead. Rey is by far the worst character in all of Star Wars. No one can connect with a character without flaws and she doesn't even have an arc. There isn't any room for improvement because she is perfect. Kylo Ren is a whiny\\, double-minded\\, child. Adam Driver blew the climax with Luke with his drawn out dialogue. Like a scared kid in school talking about how he's going to beat up the other kid\\, to pump himself up. Finn is a Jar-Jaresque character with his unbearably juvenile humor. I was preparing to applaud when I thought they might kill his impotent\/white knight character off\\, only to be disappointed by the asian girl rescuing him. She wasn't noteworthy either. Laura Dern absolutely sucked. Chewbacca was only there briefly and they messed Yoda up by showing him as both a CGI and muppet characters. I only liked Snoke\\, and his story was completely dismissed when he died in such a pathetic fashion. It was similar to Darth Maul's death in Phantom Menace (which also pissed me off). Where are the legit villains????? This movie sucked and you can see the clear division between the 93% fresh rating from the bum critics compared to the actual fans giving it an abysmal 56%. I'm sure these are the same morons who rated that horrendous Wonder Woman movie as the highest rated blah\\, blah\\, blah film. Don't pay to watch this movie. It is painfully obvious that they aren't interested in story\/character development and just because it makes money doesn't mean it's a good film.","true":true}