{"101487":176812,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie i think overall is disappointing. It attempts to try and show respect for the old and exchange it for the new but fails in this. As a result of this failure it comes across as not respecting the source material and the already existing characters in order to promote new characters that generally do not go down well. Rose In particular just comes across as a character that is simply there to eat up screen which could have been used to develop other characters like finn a lot better. Talking about characters that deserve more screen time another thing I would say is a problem is the lack of captain phasma. She could have been much more developed and also would have lead to other characters being developed batter. The best developed characters i would say is ray out of this film. One of the main criticisms from the force awakens is how unrealistic rays abilities are which have lead to people calling her a mary sue character. In this film she shows a bit more venerability as well as showing some well needed flaws to her character. \\n\\nFor the films credit its looks and feel are on point. The music draws you in and you feel like this is a proper star wars film even down to the sounds the machines make and of course the use of props as well. \\n\\nIn short though the film has the feel of a star wars film and captures the spirit of it. I just wish they didn't beat the established lore and established characters over the head to try and make the new characters more appealing","true":true}