{"101487":103470,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"An enjoyable if clunky stand alone film. Comes across like they filmed the rough draft of the script rather than working it through properly. Though it has some great fight scenes\\, and good basic story\\, overall the film is lacking in finesse.\\n\\nAs part of a film trilogy though it didn't continue the story lines established in the great first part Force Awakens\\, it seems to deliberately throw most of the plot points out of the window in a fit of peek. They seem to have made a film that had 2 main objectives: 1 kill off the original rebellion leadership in a crass manner\\, and 2 do everything possible to subvert any expectations on storyline. \\nIt would have been much better to focus on making the second part of a trilogy and setting up the third film. The way it is at the moment it's just undermined Force Awakens and the new characters and wasted the opportunity for a really good story arch.\\nIn terms of the new trilogy the plot has been left in a limbo: no overall bad guy (just a flip flopping teenager)\\, a heroine that is just too conveniently powerful (the Charmed ending)\\, another new character that they have turned into misogynistic jock with no regard for anyone's life but who we are supposed to still like and trust to lead the rebels. \\nI get that you need to move the franchise towards the new sagas about the younger characters\\, but you really wasted the opportunity here by lack of consistency with your own reboot\\, use of cheap plot points and poor story and script development. \\nShame because the basics of a fantastic film are all there.","true":true}