{"101487":138686,"Last Jedi":"Last Jedi","2017-12-15":"2017-07-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"I pretty much fundamentally disagree with every choice you've made for this character.\\\" -Mark Hamill AKA actor who plays Luke Skywalker. \\nThis is what the actor said in an interview about his character and man I couldn't agree more except I wouldn't just say it is just Luke but the whole direction this movie took this narrative. Disney has done a disservice to this franchise\\, these actors\\, and the lifelong fans of this series. This movie tops the prequels as the worst Star Wars movie. It honestly doesn't even deserve to have the same franchise title of Star Wars as all things that Star Wars represented is completely trashed. Trust me director Rian Johnson we all now agree with your mantra that you set for this movie that the Jedi need to end....well at least your version of it. It's pitiful\\, disgraceful and just plain disappointing. I think you allowed that idea of the Jedi dying become the reality of the movie because I don't know how anyone could save this. At least the prequels felt like real Star Wars movies no matter how poorly some of the actors were or how terrible some of the animation and CGI was executed. This movies only plus was as a visual it was appeasing. That's it. Literally that is all that is good about it. Oh and Mark Hamill's acting. It makes me sad too because while I had issues with The force awakens it left us with a lot of hope of new beginnings and interests in new characters and made so many of us create theories and try to find possibly who Rey was\\, who Snoke was\\, why was Luke on this island? Was Rey a Kenobi\\, daughter of the emperor\\, or a daughter of A Skywalker? Does Luke want the Jedi to end because he is realized that the problem with the Jedi is that it is too secular that there is such thing as a grey Jedi that balances both the light and the dark... yet out of the millions of directions the story could have went it ended with the most boring forgettable and idiotic ways. ***SPOILER WARNING**** I mean come on Rey's parents were nobodies... While I can understand your trying to make it so everybody feels like they can be a Jedi...it isn't true and it isn't Star Wars. That's like saying everybody is a winner in a sports game. The worst part is we were set up to believe she was someone special in the story line of the sky walkers...which is what these movies have all centered around...yet she literally is just some girl who can defeat a dark side user with years of experience in the first 3 hours she realizes she can use the force. I mean please can that get anymore unrealistic. However the sad thing was how this isn't even the most disappointing aspect of the film. Luke's whole character arc is nothing like what the Luke Skywalker from the first three movies that we know and love would ever act like and Snoke...don't even get me started on Snoke. WHAT WAS THE POINT OF EVEN HAVKNG HIM IF YOU ARE GOING TO KILL HIM OFF WITHOUT EVEN EXPLAINING WHO HE IS OR WHAT RELEVANCE HE HAS TO THE STORY.  The villain of Darth Vader was a trademark character while The villains in these movies are utterly disappointing and forgettable. Disney has ruined what makes Star Wars what it was. I believe Disney tries too hard to make this into a politically correct movie trying to target specific audiences and tell specific messages instead of sticking to what made the Star Wars films so magical. We all loved watching and seeing this great space epic telling stories of an exceptional family that combats a great evil. There is no real point to these movies. What makes the idea of the force and these movies so awesome is the fact that there is an exclusivity to this story. Movies are supposed to be about something in particular however by making the force into this thing that everyone is capable of is like saying everyone is a winner in sports. It's simply not true. Stop trying to make these films into a propaganda and stick to the lure of the films. The film is appeasing to watch if you have no desire or care at all for Star Wars. Even then though the whole plot of the film is pointless like you don't fall in love with these characters...All in all don't waste your money on seeing this movie in theaters","true":true}