{"101487":184565,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is bad on so many levels that it would actually be difficult to cover in one post\\, but here goes.\\n\\nPlot holes: The Force Awakens set up several plot lines that never got developed and then where later dropped or tossed aside in the movie. The two biggest ones being the killing off of Snoke with no backstory and the second finding out that Rey's parents are no one and had no point to the overall story. It serves as an insult to previous movie and also serves as lazy writing. There was further plot holes left unanswered such as the discovery of Vader's mask and Luke's saber\\, absence of the Knights of Ren\\, and Luke with his search for the first Jedi Temple which served no point to the plot as well (he just went to the island to die apparently). It felt downright disrespectful to everything set up by JJ. \\nTerrible script and acting: Rose is basically a next generation Jar Jar with that terrible acting. What a career killer this movie must be for her. Wow that was bad. To be fair all the acting was pretty terrible. Which leads into my next point that the script must be at fault also. While I know these are not academy award winning actors I honestly thought the characters of Rey and Fin were acted fairly well in the previous movie. Some of the dialogue was so bad I was left speechless as if I was in a state of shock unable to comprehend the ridiculousness of what I just witnessed.\\nUnoriginality and boring story: Let's face it. The movie was basically a rip off of Empire Strikes Back and Return of the Jedi in one. Big reveal about Rey's parents mirrors Luke's father big reveal\\, Return of the Jedi like Throne room scene in which Kylo like Vader kills his master\\, Rebels\/Resistance on the run\\, a stab at mimicking Han and Leias romance with Rose and Fin (which didn't work by the way)\\, and Rey being trained by a reluctant hermit master on a remote planet (which didn't work either). Also\\, the story itself was boring. It has the rebels on the run in a spaceship in outer space. It's a slow motion chase scene in space for the majority of the film. Wow that's about as boring as you can get. There was some other story elements like the Casino planet which was the worst part of the movie and also ended up serving no purpose to the plot as well.\\nDispreset to Luke Skywalker: I had to made this its own point because of how much it bugged me. Luke skywalker was my childhood hero and was the main hero from the first trilogy. They turned him into a babbling idiot who sucked at all things Jedi. On top of that they made him extremely pessimistic which is the exact opposite to what his original character was like. The torment they put Mark through was awful to watch. In interviews Mark stated he fundamentally disagreed with virtually everything that was decided for his character. I agree with him.\\nUnexciting action: The Millennium Falcon chase scene on Jakku in The Force Awakens was about a billion times more exciting than basically every action scene in The Last Jedi. Not once was I on edge of my seat or excited for anything. Also\\, this is the very first Star Wars movie in history to not have one valid lightsaber battle. Just let that sink in.\\nNo new mysteries or lore: Since snoke is dead\\, Rey's parents mean nothing\\, and we were given nothing new to hold onto\\, there is basically nothing to look forward to in episode 9. It's almost as if Star Wars has lost all excitement or build up.\\nRidiculous force powers: I'm sorry but there is something about Princes Leia reincarnating in the vacuum of space that just ergs me to no end. How about Snoke connecting Kylo and Rey's mind together over the distance of millions of light years so they can communicate. How about having Luke Skywalker force project himself millions of light years away. Force powers were just thrown around random like this was a marvel movie. It was stupid and upsetting to say the least. \\nHumor: There was humor everywhere and it was awkward to say the least. I enjoy a few laughs\\, but the humor was so bad I wanted to groan. They literally used a your momma joke. I can't even list all the bad humor. Not only was it not funny\\, but it also ruined any ability to enjoy any of the deep moments or action.\\n\\nI'm sure I could list more if I really thought about it more\\, but I think I got out my main points. The funny thing is\\, the more I look into it the more I find out I don't like. I feel like this movie could be put into a college film class study on how to make the worst movie ever","true":true}