{"101487":155400,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My honest belief is that this film ranks the worst star wars film so far. And I increasingly believe that the critics who scored highly of this movie is being paid to make the rating so high. Shame on them all for being a dishonest bunch. The film doesn't make any logical sense and it feels that it is disjoined from the Force Awakens. Killing Luke in this films tell most of the audience who grows up with it \\\"FUCK YOU\\\". Old people has no place in the star wars. If you are old\\, you die is basically what this film is about. I am not even getting on the perspective of that ridiculous purple vice admiral. The way she executes a plan is trying to enforce the concept women are ridiculous in decision making or something else entirely\\, I don't know. What I do know is the plot is stupid\\, not logical\\, ill thought out. The way to fix it could be saying that she thought theres a spy on board and hence she had to keep all plans to herself but we didn't see that writing anywhere. So what actually went on that purple head\\, absolutely no idea. Anyway\\, Snoke was kind of stupid. He didn't learn from history or from himself. When you got old\\, you got killed by your apprentice. It might be a sith tradition but should he actually guard against this Ben Solo? And Snoke probably was the only Sith Lord who never wielded a lightsaber. Whats going on there? We had never seen the weapons he used either. There you go\\, such rotten stupid movies.","true":true}