{"101487":176555,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie has so many flaws beside not feeling like a Star Wars movie. The cheap attempt on the 1% with the casino scene (I don't like em either but that was bad) the unnecessary story lines with Poe (was out of his Episode 7 character) and Rose (bad acting) that lead nowhere and didn't push the story forward one bit beside just stalled THE slowest chasing scene in film history. Kylo Ren who either is bi-polar or the person who wrote his scenes forgot half way what he did in the first act. The fact that they have space ships yet one person has to stay behind when everyone else is evacuated. First Order\\, whatever happened to tractor beams? Who is Snoke? Why is the First Order so big when they just got started in the last Episode. Didn't seem to be a time gap as Finn just woke up from his injuries. Rey - really no back story at all? Total shortcut. Despite all that\\, it compared nothing to my two biggest pet peeves\\, Lea and Luke's scenes. Does Rian Johnson know how space works? Despite that your body would mummify or freeze\\, you can't make up new story rules. We've never seen Lea using the force and he makes her float back like Mary fu*** Poppins knocking on the door. More shocking.. they just open it\\, ...and let her in... open a door in space.. let that sink in....and nothing gets sucked out...they were all just standing there. WHY is no one bothered by that? Like opening my front door! Ok\\, next: If you watched the Return of the Jedi and followed Luke from start to finish\\, (as I did in my childhood) you know Luke would NEVER say: I'll teach you the ways of the Jedi\\, and why they need to end.\\\" That's so out of character. He was the one who believed in the biggest movie villain of all times\\, Darth Vader\\, to the very end! He would not try to kill his nephew while he was SLEEPING! That would never happen. Not even getting into his mediation appearing. Again. Change of rules. We have never seen Jedi's do that. Sure I had complains about Episode 1-3 and some at 7 and Rouge One but all of them at least felt to be in the same universe. The last Jedi does not. I haven't felt that disappointed since Indiana Jones and the Kingdom of the Crystal Skull.","true":true}