{"101487":99886,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After Rogue One really let me down I was hoping for another hit as I really enjoyed The Force Awakens and it almost met my expectations.  It looks spectacular of course\\, the lightsaber fights (one scene in particular yep\\, best in the film imo) and First Order-Rebellion scenes were terrific.  Acting from the main cast sold me completely and Mark Hamill especially impressed me considering he hasn't played Luke in a few decades.  Rey confused me a bit with how her determination seems to shift to different priorities a few different times quite suddenly but Daisy Ridley gives such an earnest performance i can't help but like her character no matter how much of a Mary Sue she may be.\\n\\nGotta say\\, I really wish that the \\\"humor\\\" was cut back heavily in this film.  Can really tell this is a Disney feature who looked at the success their recent Marvel films have had with Guardians 2 and Thor: Ragnarok and I suppose decided to do so here as well.  I don't see Star Wars as a comedy  though.  Occasional jokes are fine\\, though Force Awakens did a fine balance there but The Last Jedi really throws more in here and it can be hard to feel the emotional impact in certain scenes where there are jokes bracketing it.  Tolerable in Thor which was more jokey in the first place.  Not so with Star Wars.  I find it hard for instance to feel the menace in Kylo Ren when he is being constantly mocked and made to look so pathetic.  I can go with a more nuanced villain but it seems the film wants him to be so dangerous yet also so childish and I can't mesh the two well.  He is certainly an interesting character on his own but as an antagonist?  Not so much.\\n\\nAlso wish the entire Finn-Rose subplot was removed entirely\\, too dull and felt completely out of place with the rest of the film\\, could have save a good 15min from the runtime.  Then there was those stupid Ferbie looking things.  Clearly just a ploy to sell toys they were an irritation every time they appeared.  Curious lightspeed physics here too\\, has me wonder why things weren't done differently in past situations\/films given what happens in TLJ don't care for it at all.  Female stormtrooper captain a letdown again too.  And is Poe a bit of a loose cannon?  Not sure even a rebellion desperate for personnel would necessarily want him given the way some people act towards him.  Guess its like an 80s cop film\\, gives his superiors headaches but he gets results dammit! \\n\\nJedi are curiously overpowered too.  Seriously watch the film and tell me they haven't been made seriously OP.\\n\\nWas entertaining overall though.  Just a shame that annoying humor\\,  a boring subplot and an erratic Rey dropped it from the incredible experience it could have been.  A fun action film in space naturally and will try to catch it again in the theater before it leaves as a film like this just won't be the same on a television.","true":true}