{"101487":198645,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars movie ever(yes it is worse than the prequels). While the special effects were cool the plot was horrible and made no sense. The worst part of the movie by far was Luke Skywalker death. We waited 30 years for Luke to return and all he did was be grumpy the entire movie. Then when he finally uses a cool force power he dies. For no reason at all. Like 30 years of waiting for this. A complete disappointment. And the whole plot with the Resistance is just as bad. Could the First Order think of nothing better to do then wait for the ships to run out of gas. And having to find the code breaker is the most ridiculous thing ever. The Last Jedi doesn't even feel like a Star Wars movie and I mean this in the worst possible way. I would say only see it if you really want too. If you don't really want to then you probably won't like it. The only good plot in the entire movie is Rey and Kylo Ren. Their connection is very cool and unique and the best part by far of the entire movie. The only reason The Last Jedi is getting a 1 star is because of Rey and Kylo's connection and the cool battles. To sum this review up I think that the main problem of this movie other than plot is how it ruins Luke's character. It makes him a murderer\\, a coward and a hopeless old person. That's not the Luke anyone wanted or was expecting. Although Mark Hamill's performance was excellent along with everyone else's. While I think that The Last Jedi is one of the worst Star Wars films (if not the worst) there are still plenty of entertaining\\, memorable and funny moment. I just hope Luke comes back fully and powerfully in episode 9 (and not as a force ghost). Good luck to JJ Abrams you have a lot of work to do.","true":true}