{"101487":138779,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really don't get all the hate for this movie! It does so well to be a fresh take on the saga. It's new and innovative! People are hurt that it didn't play out the way they expected and I say good! Go see the movie! Don't let these blind nostalgic fans tell you otherwise. Then decide for yourself!\\nSPOILERS AHEAD!!\\nSTOP HERE!\\nA lot of the anger I know comes from Rey's parentage and Smoke. To start with Rey\\, I'm so GLAD that her parents aren't connected some how to people we know! The fact that her parents are nobodies makes her that much more interesting! We've gotten way too much \\\"I'm your father\\\" crap. NOT EVERYONE HAS TO BE CONNECTED! This shows that the force isn't just inherited\\, but granted itself to those who seem worthy by the force! We also see this with the kid at the end. For Snoke's death\\, I can kinda see some frustrating in not know who he is\\, but I was shocked to seem him die and I'm so glad for it! This allows us to get rid of the Palpatine clone and focus on a much more interesting and broken villain like Kylo! The villain does not always need to be the most powerful person cliche. Some of TVs or movies best villains are conflicted people who have been shaped into the way they are! I never found Palpatine interesting for this reason! He just seemed evil for the sake of being evil!\\nI just really don't get all the hate! I do have some problems with it myself\\, like the Finn and Rose side story just kinda went nowhere\\, but overall\\, it was extremely well executed with some GORGEOUS  visuals\\, thrilling plot\\, and excellent character development. Well done Rian! Can't wait for your follow up trilogy!","true":true}