{"101487":188293,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was quite literally the worst Star Wars movie ever. Rian Johnson tried to make this movie into a comedy which the saga has never been. Jokes are ok when done appropriately but not every 2 seconds or when the mood should be more serious. The most egregious error in my opinion was what they did with the force. Disney is trying so hard to have likable characters in Rey\\, Finn\\, and Poe except that they are not likeable. Take Rey for example\\, she simply is simple force sensitive in TFA yet without any training she becomes so powerful with the force that she can defeat not only Luke in battle but trained Praetorian guard. She had never even wielded a lightsaber and magically becomes a master. The idea behind all of this is that anyone can have a connection to the Force. But as all die hard fans know thats always been the case. Everyone is connected through the Force some are just more sensitive to it and with training can become Jedi (at thesame time somforce sensitive beings fa in their attempts to become Jedi). Moving along\\, the whole plot of the story is just stupid and really just seems like Rian Johnson wanted to make you laugh and think about visual effects so yo  can lose focus on all the glaring plot holes. The are two good scenes in this movie and that is the fight scene with Kylo Ren & Rey against Snoke and the Praetorian Guard and secondly the scene where Vice Admiral Holdo sacrifices her life. Last and not least killing off Luke Skywalker was the most idiotic move even. Idk why this focus on Rey and having a female lead is so important","true":true}