{"101487":196783,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While the visual effects are great\\, as is the acting and cinematography\\, The Last Jedi's plot is about as deep as a puddle with a trash story that seems to serve no purpose in driving the narrative forward or promoting character development other than our good girl becomes more good and our bad guy becomes more bad. There is some inner conflict in-between when they work together against a common enemy and have some introspection about why they are good or bad respectively\\, but nothing meaningful ever comes of it. None of it ever matters or ever feels real.\\n\\nIn the meantime\\, answers begged for to questions raised in The Force Awakens are never entertained. Not for a moments notice. Supreme Leader Snoke? He ends up serving literally no purpose in the story except to make way for our bad guy to be more bad. Where did Snoke come from? Why is he supposedly so powerful? Why is his face so scarred? How did get control of the First Order and why did we never hear anything about him before? Was he related to Palpatine in some way? We'll never know. None these questions are answered and even the director himself admits Snoke is a plot device. It is shoddy writing\\, pure and simple.\\n\\nLastly\\, the overarching plot of TLJ makes next to no sense in the grand scheme of things. We are expected to believe that the rebel alliance in the ENTIRE GALAXY has somehow been whittled down to ~400 people in a handful of ships. How does something like this happen after the absurdly monumental victory at Starkiller Base? TLJ ends with a handful of surviving rebels in no ships escaping from thousands of Imperials with half a dozen walkers and an entire fleet. We are led to believe that this \\\"victorious rout\\\" will inspire people across the Galaxy to take up arms and join the rebellion. I have to wonder why someone would suddenly join a rebellion now when it just had it's ass handed to it and not earlier when it destroyed literally the biggest super weapon ever known with just a handful of tiny x-wings. \\n\\nEverything about this movie just screams absurdity. Nothing important happens. No questions are answered. And nothing ultimately matters because the doomed rebels were doomed from the moment we're told there's only 400 of them left\\, because the good girl simply becomes more good\\, and because the bad guy becomes more bad. End of story. You don't need 2+ hours to tell me that flatline story arch. Forget about the rebellion. Forget about Luke or Leia. They're all just background noise. This movie is a waste of time.","true":true}