{"101487":197028,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Why I hate \\\"The Last Jedi\\\". WARNING SPOILERS!\\n\\n- no back story on how we get from the rebels \\\"winning it all\\\" at the end of The Return of the Jedi\\, to New Republic is dead with First Order taking over. \\n\\n- The fleet battle tactics were moronic compared to the original movies. Supposedly the first order bested the New Republic. Think about it\\, the New Republic would be filled with hardened veterans from the war with The Empire. The First Order would have a bunch of green fringe divisions\\, as the creme of the crop was lost at the Battle of Endor. It doesn't add up to anyone with half a brain. Letting a single X wing take out a \\\"fleet killer\\\" dreadnought. Never mind that there a million star destroyers with infinite tie fighters. Like so many tie fighters they could just form a wall and just ram the rebel fighters. No shooting required. \\n\\n- The physics of the space battles were all wrong. The bombers in the opening scene were ripped straight from WWII. And when they got shot up they would fall like they were losing lift. It's outer freaking space! They would just explode in the direction they were accelerating or whichever way the internal explosion blew. Shields were just not existent? Y-wing bombers cannot damage a normal star destroyer without taking out the shield domes. Your telling me a fleet killer dreadnought doesn't have stronger shields?  \\n\\n- NO explanation of who Snoke is. And there should be 0 onus to read books to figure this out. He is seemingly more powerful than the previous Emperor. Yet he just appears out of thin air at the head of the first order? That's just bad story telling. A 5 minute history sequence would have at least established the provenance of his character. Snoke dying has little to no impact on the viewer because they never understand who or what he is to begin with. WEAK FRIGGEN SAUCE. \\n\\n-   Speaking of powerful Jedi\\, Kylo and Ray are the two most powerful force users ever. Somehow. Kylo's is understandable\\, but Ray's parents were junker no-bodies. With 0 training\\, Ray becomes an expert lightsaber wielder and does incredible force feats. Luke Skywalker couldn't do squat without intense training. Doesn't add up. Also \\, in none of the previous movies were force users able to project visions or holograms long distances. At most they mind talked and that was within the same planetary system. The Jedi in this movie are \\\"super jedi\\\" even though Skywalker should be more powerful than them both. And who knows what level Snoke was at because we know nothing about him. \\n\\n- Every scene in this movie is more fantastic than the last. Jumped the Shark. I'm all for Star Wars adventure. But when you can't even take a piss without having the toilet blow up and you have to aim in 0 G as it's floating away to get across\\, \\\"wow\\, this is a star wars movie!\\\" then something has gone wrong. Like the writers were like screw it\\, no original story so lets Michal Bay this thing up. From the opening X-wing scene\\, it's non-stop amazing miracles.\\n\\n- Seemed like the movie had to make a point that all high ranking bad guys were white dudes\\, and all good guys were either women\\, aliens\\, or ethnic. Bad guys: Snoke is white male\\, Kylo white male\\, Hux white male. Good guys:  Leia is lead general\\, next lead general is a woman\\, Captain of medical frigate is black man. Ray is white woman\\, Finn is black man\\, Rose is Asian woman. This casting mirrors the liberal interpretation of power in America today. I'm all for diversity as long as it fits with the story. This seemed contrived to fit popular liberal agenda. \\n\\n- The ending scene is the battle of Hoth with some twists. This draws me to my biggest complaint. There is no story here. The movie almost feels more like a video game. We just need the barest semblance of plot to get us from blowing one thing up to blowing another thing up. And most of the story was stealing from old movies and creating a narrative of The old star wars is dead. The Empire and the Rebels\/New Republic\\, they are gone. There is now the new First Order and The Resistance. And they basically are starting off with the narrative that a New Hope started off with. \\n\\n- There was one scene that almost redeemed the movie for me. I would have gotten over everything I listed here. When Kylo and Ray defeat Snoke\\, and Kylo asks Ray to join him in forging something new. No more Empire\\, Sith\\, Rebels\\, or Jedi. Just him and Ray defeating all. That would have been epic. The last two Jedi defeating a galaxy with no Jedi. That would have been so fun to see. Instead we have Ray facing off against Kylo. Both will train there own Jedi and Disney will draw this conflict out for how many movies? \\n\\n- Finally\\, I understand why Mark Hamilton didn't like the movie and why he was so disappointed with Luke's character. His character didn't make any sense. The island he was on didn't make any sense. The tree temple and books didn't make any sense. Yoda ghosting in and nuking the tree didn't make any sense. I hated this movie\\, it didn't make any sense.  \\n\\nCongradts Disney! You took one of my favorite childhood franchises and murdered it. I like that you greased the critics palms to get a 91%\\, but the truth shines through with the audience score standing at 49%. \\n\\nEpic Fail Disney\\, Epic Fail!","true":true}