{"101487":137069,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm the biggest Star Wars fan known to man. I have several full size star wars arcades in my basement\\, all black series figures\\, posters and portraits all over the walls\\, kitchen and bathroom filled with star wars accessories etc etc. So please take this rating critically!\\n\\nFirst\\, we never got any idea of who Snoke was and how he became in leadership of the ENTIRE first order. Was he an officer before? An apprentice to emperor palpatine or related somehow to take leadership upon his death? Or did he just bully his way in with the force... which would be horribly disappointing and sad for the first order... Then he just dies??? And the way he died was too easily. They worked him up to be massively powerful with the force and then a simple trick and he's dead??? And now the main villain in charge of the entire first order is Kylo Ren??? A boy who is even declared by Snoke as weak and conflicted as to whether he wants to join the light side or not. Garbage...\\n\\nThen there's Rey... we FINALLY get to know who her parents are they they're nobody's? Really? Just junkers that sold her for money and booze? That's ridiculous. I get the whole wanting to make the star a something from nothing\\, but for her to be so gifted like Ben (who DOES have an extensive force history in his family)\\, is a bit much.\\n\\nThen there's the porgs.... UGH! I even thought I'd like these guys. Even bought a talking one for my daughter\\, but in the movie\\, they were annoying. The most annoying part is that they replayed the SAME SOUND BITE OVER AND OVER AGAIN! Birds don't play the same tune over and over again. Dogs don't bark the same bark over and over again. PLEASE pay attention to details like this! I understand it's not easy to make different tunes for a new species that was just made up\\, but it's doable once you have the general vocals. Come on guys!\\n\\nThen Luke's character in this movie was very poorly done. They made Luke look like a lunatic. Luke would never kill a child in their sleep. Especially his NEPHEW. And wouldn't Han and Leia be pissed about this fact? Yeah\\, he tried to kill my son\\, oh well\\, we need his help now and need to find him... what the actual heck... And then there's a big scene where he's fighting Kylo only to find that he's an illusion. All well and good\\, EXCEPT that they killed him off after he used this force ability???? What??? What was the point in using force illusion if he was just gonna die anyways? Why not have him actually be there with his green lightsaber and use force shield to prevent himself from being killed by the walkers\\, and then have him sliced dead by Kylo? That made no sense. And then Yoda and the lightning? Since when can ghosts influence the force? And I know someone might say\\, the force just willed the lighting to come down and strike the tree\\, but they made it look like Yoda did it as a ghost and that's crazy. Also\\, Yoda taught younglings for years. They had a whole library of books to stimulate the minds of young Jedi. No way would such a devote teacher ever say to destroy the Jedi or that the books were boring and not \\\"page turners\\\".  And they described the Jedi as vain? No way... They are the opposite of vain. That's like saying monks are vain because they hold themselves to high standards. They don't think they're better than anyone else\\, they just do it for themselves and because it's right.\\n\\nI also thought it was stupid that Luke chose a spot that was a Jedi temple being upheld by an indigenous species. That made no sense either. Like how did Luke know if its existence? Did Yoda mention It? Was it in texts? And if Luke knew of its location\\, how did nobody else know of It? Surely this is something you share with the Jedi you're training?\\n\\nAnd what the HECK happened to the knights of Ren? Kylo took a few Jedi with him\\, when he left and they became the knights of Ren\\, right? We saw glimpses of them in the first movie\\, but it was like they were non-existent in this movie. Where are They? Do they just never show up to talk to Snoke like Kylo does? Are they always on ANOTHER mission? It's weird... I'm sure this will get wrapped up in the last movie and hopefully it turns out better... :-\/","true":true}