{"101487":135999,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I love Star Wars. This movie was absolutely an improvement on Force Awakens\\, but for me\\, ranks just above the prequels. The fights (both space and lightsaber\/blaster) were AMAZING! There were some really important moments that were done really well\\, but the reason I can't bring myself to rate this film above a two are as follows (mild spoilers):\\n\\n- Kylo Ren is still a loser. Perhaps even more of one than he was in the first film. Because he lacks the dread of Vader (which he's called out for in the movie)\\, it's hard to take the \\\"bad guys\\\" seriously. \\n- THEY THROUGH AWAY GWENDOLINE CHRISTIE....AGAIN!!!!! I cannot overstate how infuriating this was for me (I love her in game of thrones). \\n- Snoke was lame.\\n- Finn's motivations STILL don't make sense! \\n- This all feels like Leah requested a LARPing session to relive the old days. It all feels pointless.\\n- CGI was TERRIBLE!!!\\n- They broke the fourth wall to make fun of fans for having theories and wasted time on \\\"plot\\\" that did nothing. Had they not banished the expanded universe\\, they'd have a treasure trove of plots\/characters we all love. Unfortunately \\, they made that call\\, and then realized they didn't have an original thought in their heads\\, so they cherry picked from the EU\\, spliced it with the original trilogy\\, and said\\, \\\"good enough.\\\" \\n\\nI'm looking forward to the completely new trilogy (since Rogue One was awesome)\\, where they won't be forced to use characters and timelines they clearly aren't able to work within.","true":true}