{"101487":164681,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Really wanted to love this movie and some scenes and some acting in the movie is phenomenal. But so many just weird plot holes and weird script issues really pulls this movie back to mediocrity.\\n\\nS P O I L E R S - A H E A D   B E W A R E !!!!\\n\\nOn Achc-To : When the tree is burning Luke is told to go teach Rey what he knows and to trust her. He never sees her again.\\nRey Training: So apparently she is the first Jedi in history that needs no training at all to do amazing things with the Force:\\nPrincess Leia: Best use of the force in her life (which was kinda weird in my opinion) and then she never uses it again.\\nDJ: Weird name\\, bad acting\\, and how the hell does a person who is not known or trusted by the Rebels know their most secretive plan that only the Admiral and Leia know so that he can provide the info to the First Order.\\nI could go on and on. Last one - obviously Luke's death is completely weird. When it happens it comes right after he apparently survives a remarkable situation and the movie theater cheers. 1 minute later he apparently is dead and it just happens. Noone is sure until they confirm it with some anti-climatic dialogue.\\n\\nSo disappointing. Loved Mark Hammill's acting a badly written character\\, Daisy Ridley\\, and Adam Driver. Poe's first piloting scene amazing. Rey and Kylo's fight scene stunning visuals and good battle. But overall scenes and acting not enough to make this a truly great movie.","true":true}