{"101487":127522,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Here’s the thing: there’s very little truly awful about TLJ. There’s very little even bad about it. In fact\\, some bits are utterly brilliant. But it all adds up to not much at all. While the original films were broad epic adventures on a galactic scale the new trilogy seems a narrowly focused journey with very little outside it. The new universe just isn’t very interesting. You never get the sense that this is part of some broader struggle or a small piece of a wider universe. They’ve done a much better job at creating complex characters\\, but they haven’t given those characters a plot or world worthy of them. I was amazed at how little of this film was necessary for the plot to work. Finn and Rose’s entire subplot was nothing but filler. Remove it and you get the same result. The issue is that everything feels so empty. TFA wasn’t big into mysticism\\, but it did set up some mysteries very well for this film to pay them off. Well\\, we do get payoff\\, but only in the sense that the film rejects mysticism almost entirely. That ending scene with Luke? The culmination of an entire film’s dramatic arc? Discarded in a single comedic moment. Not even a pause\\, direct from Luke appearing to a comedic moment undercutting everything. The mystery of Rey’s origin? Oh\\, did you want something mysterious about that? The murky Supreme Leader Snoke and his origins? Was that supposed to matter? The question is answered in the most mundane manner possible. In fact\\, the entire film seems to go out of its way to reject or undercut every one of the ideals underlying the movies. In some ways this is a good thing. Disillusionment is the order of the day\\, for Luke’s quest and others. But in a lot of ways this seems to just take everything cool that they set up in TFA and throw it out the window. And I think the biggest issue of all is that the series has utterly lost that sense of importance and grandeur it once had. Even the PT recognized the importance (sometimes even self-importance) of the films and embraced it. This film rejects it utterly. And I’m left wondering... what’s left? I couldn’t care less about the Resistance or the First Order by this point. They’re boring retreads of the Empire and Rebellion from the OT only with the cool bits removed. Hey\\, why don’t we take the Galactic Empire\\, full of millions of people occupying millions of worlds\\, and remove all that scale while simultaneously treating them as the same type of threat in every way. Right down to their ability to massively outnumber the heroes\\, which you wouldn’t expect to associate with an insurgency. Speaking of the Rebels\\, the Resistance is a parodically small version of the Rebellion. You thought Rogue One casualties were bad\\, wait until you see TLJ! The situation is comically and artificially hopeless. I gave TFA a pass because it was an establishing film which didn’t go into much detail. But this was the point in the franchise where they needed to expand and go broader. They’ve done the opposite. I think this is really a case of the problem with giving the fans exactly what they want. The fans wanted the OT Mark 2\\, and we’ve got it. A little diluted\\, a little smaller\\, a little more cynical\\, but still basically the same ingredients. Which is why the series can never move on. They need to be different\\, to pave their own path. Give us something we haven’t seen before. Give us change. Not some eternal battle between plucky rebels and an unkillable Empire. Why not evil insurgents? Or a group of Jedi vs. chaotic self-taught Sith. Or a weak Republic struggling to drive out its own rebels. Anything. It needs to be more than just different characters and slightly different settings. I dunno. It’s really not a bad film. But it’s just so underwhelming. And that shouldn’t be a word that I can use in the same sentence as Star Wars.","true":true}