{"101487":191575,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Very disappointed! 1 Star. \\nI first watched star wars as a little boy in the early 80s and have loved it ever since! Dressing gowns and make shift lightsabers took me and my brother on many an adventure. I absolutely loved the original trilogy (and yes the prequels too) Darth Vader was truly scary villain and Luke the most valiant of hero's. He was an idol for me and many others growing up in those early days\\, when tv hero's actuelly made an impact on peoples lives and genuinely were role model's. So when episode 7 came around I was exited to see the saga I loved so much continue\\, it met pretty much all of my expectations with that unmistakable star wars feel\\, new interesting characters and pondering rich plot Lines. So after waiting now 2 years to find out where 7's literal cliffhanger would take us and to finally see my childhood hero now the fully developed and powerful Jedi Master he would undoubtably have become. Then episode 8 happened! and I've got to say it was bad\\, I mean really bad! JJ Abraham's had set up an amazing new villain in Snoke and a real keep you guessing back story in Rey both of which Ryan Johnson took absolutely nowhere! And gave absolutely nothing to the fans that had been eagerly anticipating the growth of these characters and their storylines! But what got me the most was what they did with Luke Skywalker?! I mean they must have wanted to Sabotage the character and his Legacy\\, because there's no way you would desecrate a well established and beloved character that way unless it was on purpose.\\nAs for the main plot for me it was a completely stagnant and just a bit lazy.\\nThanks for reading and may the force be with you.\\n#Notmyluke","true":true}