{"101487":178494,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There is so SO so much wrong with this movie. First off; Leia was never a Force user; Force sensitive but NEVER a user of the force so that whole being blown out of the bridge is total garbage. Secondly why was she not ripped to pieces from the explosion. Next; how the world does a ship that is faster than an Imperial Start Destroyer not have the ability to outrun said Start Destroyer?! Can someone please explain the physics of that. Next\\, for the LOVE OF THE FORCE stop ripping off scenes and character bios from the originals. Luke is NOT YODA. It's the same stupid thing here; Yoda banishes himself due to his failures\\, Luke banishes himself due to his failures and lives on a deserted planet. Next; what was the whole point of not letting anyone know they were headed for Crait!? I mean they had several Start Destroyers on their tale so it wasn't like it was a secret they were headed STRAIGHT TO A SMALL PLANET!!! Secondly\\, if you have a shuttle that can do lightspeed; wouldn't it be best to get Leia off the doomed ship ASAP and to safety?! Did no one seriously think about this?! Also if you have the technology to travel the galaxy\\, build droids that can pilot AT-ST; why in the galaxy do you need a HUMAN to pilot a ship for it to be destroyed!?! In the Force Awakens; Kylo's \\\"daddy issues\\\" was tolerable but COME ON! If he can willy-nilly kill both Han and SNOKE he is man enough to be a big boy like Vader. Then there was the whole heaping pile of garbage of the Luke\/Kylo fight scene. If they were going to steal so much from the originals\\, they might have just stolen the script and had Luke say \\\"Strike me down and I shall become more powerful than you can imagine.\\\" This movie the more I think about it the more it turns into a HEAPING PILE OF OVERPRICED GARBAGE. I have seen fan films that had more character development than this monstrosity.","true":true}