{"101487":163550,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Pros:\\n\\nVisually\\, production and cinematography is one of the best of all star wars movies;\\n\\nGreat battle and fight scenes;\\n\\nCons:\\nStorytelling is inconsistent with gaping wide plotholes and many throw away plots;\\n\\nCharacters non-compelling and bland; \\n\\nOld characters potentials are wasted;\\n\\nGotcha moments that makes no sense or dont fit mood of the movie;\\n\\nBadly placed humour without any point just for the sake of it;\\n\\nDoesnt ties up almost nothing from the force awaken;\\n\\nOriginal Lore is thrown away the window dozens of times;\\n\\n\\nConclusion:\\n\\nI watch it and even not being a die hard star wars fan I know the lore and watched all the movies. And upon seeing the movies I felt nothing much just cheap enjoyment and after reflecting upon it the flaws are too big to be ignored not as Star wars itself but also as a movie and storytelling as someone who loves RPGs and books. The inconsistencies and double downing on bad backgrounds for everyones is off the chart.\\n\\nSomeone who doesnt know star wars will enjoy the movie because generally is like watching a good sci-fi movies with explosions and cool fights and funny scenes. You can even watch it by not seeing Force awakens and makes just as much sense as if it was standalone.\\n\\n\\nTLDR: Nice\\, cool\\, transformers movie. Too many inconsistencies and flaws to be anything other than cheap entertaiment. Thinking makes your head hurt so just ignore the flaws and its the best movie 2017.\\n\\nHalf a star because this was half a movie.","true":true}