{"101487":99823,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After getting an entertaining Star Wars place setting in the Force Awakens\\, the franchise takes its first bold leap forward with Last Jedi.\\nRian Johnson deftly weaves the established lore with expert filmmaking. At the same time\\, it is not a perfect film and suffers from being crammed with too many \\\"messages\\\" that the central theme sometimes gets lost. The fact it will be polarizing is undeniable but in a way that will invite conversation. You want to love this film and question it then dissect it. This is a thought-provoking\\, thrilling and visually exciting entry.\\n\\nAnd now SPOILERS REVIEW:\\n\\nOpening with a thrilling set piece we are thrust into an actual star war. This is where Johnson shines. Interesting camera moves always keep you in the moment while never losing the sense of where you are or the scope of the action. It is clear and precise visual storytelling\\, deftly using score and the absence of sound to moving results and it permeates the rest of the film. Last Jedi is as different in tone and style from Force Awakens as New Hope is from Empire. This is not a bad thing. Cons? I actually left the movie not feeling as emotionally moved by the characters as I did in Force Awakens or even Rogue One (with the exception of seeing Carrie Fisher on screen). The story and situations were compelling enough and I have to chock it up to pacing. Which brings me to the Fin\/Rose\/DJ story arc. While we are still wrapping our brains around Luke's conflict and the Rebels plight It just stopped things abruptly and heads us in another direction. The casino scene and message of class inequality\\, animal cruelty and corporate greed were just too much in a movie already handing us heavy concepts. It almost deserved its own movie where the characters of DJ\\, Rose and her sister could be fleshed out better. My other small gripe concerns the humor. I loved and laughed at the jokes but the conversation between Poe and General Hux played a little to much like a scene from Spaceballs\\, but I still laughed. In the end we are left with an enjoyable movie that began and ended without cliffhangers or compelling questions to be answered. Episode 9 will be a complete mystery and that is exciting in its own way.","true":true}