{"101487":126911,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"had to update this review because Rotten Tomatoes scrubbed it for whatever reason... probably because I gave it half a star.... it deserves No star... What happens when you hire someone with a dysfunctional 8 year old mentality that has deeply rooted emotional issues with male adult role models. I can see why Rian Johnson had a hard time being accepted into film schools until finally USC broke down and let him snivel his way through their doors with a handful of cash.... The Last Jedi was probably one of the most incompetently written attempts at surprising the audience.... The blatant disrespect of Star Wars canon\\, characters and story lines was absurd and the ridiculous manner in which all the female characters were lifted up to pedestals left me wondering.... is Disney trying to sabotage their meal ticket? The 91% critic score only shows how out of touch critics are in terms of reality... The audience has spoken... Will Disney listen? Will they realize that Kathleen \\\"The Force is Female\\\" Kennedy has a disturbingly deranged agenda of promoting \\\"girl power\\\" in a way that is seriously going to affect women in real life in a very unfortunate way? Poe has been reduced to a \\\"Whipping Boy\\\"\\, Finn is nothing more than a sad joke that gets bossed around by a useless\\, fill in character. Luke has been distorted into a ruined projection of angry\\,.disenfranchised millennials who view adults through a broken lens of everything they think is wrong with the world. His ideals\\, his courage\\, his optimism and his hard earned Force abilities were obliterated in the wake of a smug\\, self-absorbed\\, narcissistic man-child who wants to rip apart the promise of a great conclusion for a noble hero because he didn't get what he wanted for Christmas.... Leia's ridiculous Force recovery and space flight just doesn't fit with the ideals of the Force... Vice Admiral With-Holdo is a useless character that has no business being in any kind of military leadership... Rey continues to become even more of a Mary Sue character and Rose is just a complete eye sore of weak character development\\, an underwhelming romance distraction and a pointless sub plot that in the end accomplishes nothing more than getting more people killed for the sake of setting a bunch of llama-mules loose through a high end casino to show that rich people are bad and should be punished... Meanwhile Luke slurps milk from an alien walrus' nipples and throws a temper tantrum of  adamant non-involvement with the problems of the galaxy because his nephew went to the dark side... Seriously?  It's as if Rian only saw a bunch of trailers for all the previous Star Wars movies and was told to come up with a story based on what he'd seen... This was just a lazy and disrespectful finger to all the fans that have made Star Wars what it is today. Johnson is a joke\\, Kennedy is a glorified secretary with man-problems who has no clue whatsoever about film making or story telling and Disney is nothing more than a financial vampire intent on draining the life-blood out of previously successful movie franchises because they lack the ability and talent to create their own ideas to promote!  I have absolutely no further interest in this series any longer\\, what was once a great concept based on Zen Buddhism and the way of the samurai has been reduced to a toxic deluge of uber-feminist fascism and forced diversity without substance... Rian\\, Kathy and Disney have created a universe where men are reprimanded for being heroic and women are glorified for their abuse of men and apparent lack of competent decision making! Star Wars has become a shame\\, a waste and an utter failure in terms of creative imagination and good story telling! Well done Rian! Well done Kathleen! Well done Disney! May you feel the Force for years to come!","true":true}