{"101487":188411,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was the first Star Wars movie that I was extremely frustrated with since the prequels. The prequels had Jar Jar and little Ani\\, The Last Jedi has equally irritating characters with Admiral Holdo and Rose Tico and Benicio Del Toro's character (his constant lip smacking is like nails scraping a chalkboard). Jar Jar and Ani were just annoying\\, but the cumulative function of these three in the narrative is to make Finn and Poe look like idiots. Why take characters that we have just come to know and like from the Force Awakens and then turn them into fools? Many of the characters make very frustrating choices for reasons that don't add up. Gen. Leia is supposed to be a revolutionary who never lost her fiery passion to fight the Empire. But in this she's depicted as very cautious and more determined to maintain order than fighting the New Order aggressively. TLJ changes Luke's character\\, but in a way that made more sense given all that is supposed to have gone wrong for him after the fall of the Empire. Even so\\, for this to work we need to see a lot more of Luke's failure to train Ben Solo\\, in flashback. That should have been the first third of the movie. Both plots of the mutiny and the scheme to get a hacker from the casino world should have been cut out entirely. This movie was an opportunity wasted and it left nowhere to go for the final film in the trilogy. The conclusion of TLJ is a narrative dead end and that is a fatal blow for a trilogy. Rian Johnson should have been put in charge of a stand-alone Star Wars story like Solo (he couldn't have done any worse!).","true":true}