{"101487":146183,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I walked into the Cinema with my family feeling the childhood wonder that star wars evokes. For months I've been talking with fans theorizing about all the possible ways \\\"The Last Jedi\\\" could turn out. Unfortunately it turned out to be one of the greatest blunders I've seen in all my years of watching movies.\\n*spoilers*\\n\\\"The Last Jedi\\\" destroyed the star wars cannon. The story's plot had more holes than a net. The pacing was terrible most likely due to the length of the film. However\\, these things don't come close to the horrible characters.  \\n\\nThis film utterly destroyed Luke Skywalker character. Luke was all ways the hopeful one who could shine in the darkness. He followed the hero's journey\\, been through the fire and came out strong and still hopeful. He was the perfect Jedi who was exposed to the temptations of the dark side yet resisted them! *SPOILER* For him to become a cynical hermit who just wants to be forgotten make 0 sense. Mark even is quoted at saying the he personally disagreed with every aspect of his character in this film. And I unfortunately agree. Luke Skywalker would never act like that!\\n\\nReys character was over powered and underdeveloped I would call her a Mary sue if I ever seen one. Fin gos through the same character arch as the last movie. Poes character arch is to learn to run away\\, which can be ok if not for him making every right decision in the movie. Roses character is nothing but detrimental to the plot. And literally nothing happend to kylos character he didn't develop...\\n\\nMary poppins is in the movie.\\n\\nAll in all the movie seemed to just make it up as it went. There was no continuity from the last one. Leaders of both the rebellion and first order are incompetent. The casino sub plot did nothing to the plot but criticise capitalism.\\n\\nIf you love Luke Skywalker! DON'T WATCH!!!","true":true}