{"101487":181458,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This has the ignomy of being the first Star Wars film I did not walk out of the cinema feeling exhilirated and excited for the next installment. \\n\\nA second viewing helped me enjoy it for what it was\\, but still so ulitmately disappointing. \\n\\nI have no reason to care about what's next for these characthers and given Rian Johnson's track record for films that I've really enjoyed\\, this was underwhelming.  \\n\\nThe motif of the film was to 'let the past die' and I find it very interesting that ther original Star Wars generation have been despondent about the latest entry\\, whereby the younger audience have more positively recieved it.  \\n\\nI would dearly love to praise this film blindly\\, but it's flawed in so many places. I totally get why Rian Johnson took his own direction of the Star Wars films\\, but ultimately it didnt hit the notes to resonate with me.\\n\\nPositives were:\\n\\nBeautiful cinematography.\\nStrong female figures\\, we need more of these!\\nMark Hamill's best ever performance as Luke.\\n\\nThings that I really didn't like:\\n\\nMary Leia Poppins\\nDJ - What was the point? Echoes of Lando with no redemption.\\nHux - Turned into a figure of fun and denotes no threat\\nPhasma\\, was she really that busy filming GOT S7? A strong female villain taken out for a gag.\\nWorld's slowest car\/spaceship chase and the logic behind it.\\n\\nI'm hoping repeat viewings will find me more to love about it in the nuances\\, but for now I'm just hoping JJ Abrahams can bring things to a satisfying resolution in Episode 9.","true":true}