{"101487":121311,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"first of all i loved this movie. (spoiler alert)\\nhave been a star wars fan ever since i was a kid. loved the prequels as a kid and still like them although i do see the bad of it. also love the OG trilogy. then came the force awakens and loved it as well. although a bit to much of a rehash. \\nnow the last jedi after seeing it it left me astonished. the visuals were amazing. parts of the story were really good. but some of it was bad and should have been different or left out all along. \\nthing i loved were the action between rey and luke. rey and kylo. the fear from the resistance when fleeing. acting of mark\\, daisy\\, adam\\, carrie\\, was on point. best acting of mark i've ever seen. \\nthe part on crait was awesome. altough even there some stupid things. \\nthe final showdown of holdo was awesome. and final clash between luke and kylo amazing. \\n\\nthen the bad things. \\nhated some decisions in this movie. why was poe so stupid in the beginning risking al those lives. entire subplot of canto bight sucked  i hated that part so much puting maz kanata in the movie felled forced. fin and rose (was that here name) sucked so much never hated a character so much since jar jar binks. their forced loved story sucked aswell. really was hoping her to die. there story was pointless didn't make sense and was just stupid. hope JJ sees the mistakes that were maked with here character. \\noveral movie would have been better if there had been more luke and rey and less forced finn and rose. \\nJJ has a lot of work to do for episode 9\\nhave to see this movie again so i can think about it more. \\noveral i loved it but. some parts should have been different.","true":true}