{"101487":174674,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Good: \\n- Many visually stunning moments\\, especially Admiral Holdo's jump to light speed as well as the fight scene with Snoke's guards.\\n\\n- Porgs: cute and funny.  Much\\, much better than Ewoks.\\n\\nThe Bad:\\nQuite a lot\\, unfortunately:\\n\\n- Too long and too many inconsequential events.  Two unpolished\\, unnecessary subplots that took too much time away from the more important story.  They obviously didn't know what to do with Finn and Poe.\\n\\n- Bad character development -- I'm not the type to insist on what characters should or shouldn't become\\, but this one was very weak in setting up the motivations for most of the major characters' actions.  Most of their decisions and actions seem to come out of the blue with very little support.  It seemed the movie put a premium on making surprises than telling a convincing story.  Example: Kylo hesitates to kill his mother.  Later he wants to kill everyone anyway for no apparent reason.  The story between Luke and Kylo and his turn to the dark was also totally unconvincing.  There's quite a lot of these twists that just came out of nowhere without any credible basis.\\n\\n-  Humor:  Too much of it and a lot of it was out of place.  Honestly this is probably the only Star Wars movie that feels a lot more like Mel Brooks' Space Balls.  It was really bordering on parody.  Kylo Ren and General Hux were quite scary villains in TFA as young\\, if inexperienced zealots.  In TLJ they were more like Dick Dastardley and Muttley.\\n\\n- Contrivances: Holdo keeps her plans a secret from Poe Dameron resulting in one unnecessary coup and more wasted screen time.  Such incompetence by the writer and the Resistance.  Finn\\, Rose\\, BB-8\\, and DJ spend about 30 mins of the movie achieving essentially nothing.\\n\\n- Lacking in set-up for many important events: we really never know what made Snoke so powerful.  They only demonstrated that he can fling anyone and anything much better than any Force user\\, but apparently his power comes from reading people's minds.  However we only find this out seconds before he was killed.  And so the supposed brilliance employed in killing him could not be appreciated.  I can see why they didn't bring this up earlier as it would've exposed so many plot holes.  This is such an important plot element that was not well thought-out at all.\\n\\nMinor quibbles:\\n\\n1.  Carpet bombing in zero gravity.  Stupid concept but pretty visuals.\\n2.  Salt-flat-skiing space ships.  Stupid concept but nice visuals.\\n3.  BB-8 doing a lot more EFFECTIVE fighting than most major characters.\\n4.  Zero gravity Leia.  Stupid concept and bad visual.\\n5.  Rey flustered by topless Kylo (so she wants to turn him because she thinks he's hot?)\\n6.  Rey looks for her parents and finds... herself!  Huh?\\n7.  The slow-mo chase in space.  Makes no sense at all given there must have been a thousand (fast) TIE fighters in between Snoke's ginormous spaceship and those Star cruisers chasing them.\\n\\nSo they fired Chris Miller and Phil Lord for making the Han Solo film a comedy but gave Rian Johnson his own trilogy for doing the same?  At least be consistent\\, Lucasfilm.","true":true}