{"101487":139703,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw TLJ opening weekend and needed a couple of weeks to process the movie.  My ultimate conclusion is that this movie is crap.  They took the best things about Star Wars and TFA and made the worst decisions imaginable.  I saw every Star Wars in the theater since ROTJ at least twice and this one I will not even rent\/buy let alone watch a second time in the theater.  I won't even see Episode IX unless I hear JJ fixed all this crap storytelling by Rian Johnson.  I like Looper and his other movies just fine\\, so I had high hopes that this movie would be decent.  The previews made it look awesome\\, but the details in between ruined it.  My mother\\, who I saw it with\\, even didn't like it after liking all the others.  And she is not a big Star Wars fan at all.   I don't think Rian or those other people who approved this movie even saw TFA.  SPOILERS AHEAD!\\n\\nThe first thing they ruined was Luke Skywalker.  The most powerful Jedi left the Resistance a map to find him.  For what?  Rian's version of Luke states he just wanted to hide from everyone.  THEN WHY LEAVE A MAP?    Then we get that Luke tried to kill Ben Solo in his sleep....but the version changes 3 times during the movie\\, so I was confused whether he or Kylo is the bad guy.  Plus\\, Luke would NEVER kill a kid who seems evil.  I was pumped when it looked like Luke would destroy the First Order walking out the cave at the end\\, but no....Let's make him have a moment with Leia\\, absorb all the firepower from the new AT-ATs and brush it off like a bad ass\\, dodge a few blows from Kylo\\, and then show he was really never there to begin with.  WTF?!!!!!!!   Then he dies from exhaustion (or peace with the force or whatever)?!  WTF?!!!!!!!!!!!!  Luke ended up being a total hermit and a normal old grumpy person.\\n\\nThe second is with the new characters.  Rey was good in TFA\\, but she is shown to be a total badass without any training or experience whatsoever.  She cannot lose to anything and is brought up as have an important past.  Nope....Rian shits all over that too by stating she is No One.  This is not Game of Thrones Rian.  I could see past her perfection is she was Luke's daughter biologically or Leia's\\, but just drunkards who sold her for money shows me you were lazy with storytelling and went with a crappy backstory there.  JJ did not mean for her to be nobody based on TFA.  As for Finn and Poe\\, you might as well have just thrown them in the garbage.  Finn has a useless role in the entire movie up until the very end.  Let him make that sacrifice and I would have respected his character.  No\\, Rose has to save him at the last minute.  Then she kisses him and dies (at least that was what I thought\\, but most people say she passed out).  Sloppy storytelling there!  Poe is made to look like a hotshot idiot and I actually hate his character after watching this movie.  Laura Dern (don't know her SW name) should have just said I have a plan and you don't need to know it right now.  Captain Phasma is just a waste of Gwen's talent and should not even be in the movie if that is all they would do with her.\\n\\nThird\\, Leia was good.  The flying bit was unexpected and silly.  I thought they decided to kill her character there\\, although it seemed too soon.  She should have replaced Laura Dern's character at the end for a self-sacrifice.  Leia lives at the end...yet didn't Disney state they had to change the ending for her character since Carrie died?  WTF?!!!!!!!!!!\\n\\nFourth\\, Kylo Ren is a whiny teenager who gets no respect and wants to bully everyone.  I liked his arc in TFA\\, but he is just pitiful here.  Darth Vader would do circles around him and spanked him with a force push.  I actually liked the helmet Kylo wore\\, but he doesn't have it now.  Also\\, what about the Knights of Ren?!  Nowhere to be found......\\n\\nLastly\\, the worst decision was to kill off Snoke.  WHY?!!!!!  He was the best and most interesting character throughout until that cheap parlor trick by Kylo.  Snoke can do almost everything better than the Emperor according to the story telling\\, but you kill him easily in the 2nd movie of the trilogy?  WTF?!!!!!!!!!!!  Who is left to actually be a good character to push the next movie forward?  Not Kylo.\\n\\nIn summary\\, it was an okay Syfy movie.  BUT\\, not a good Star Wars movie at all.  It is making money because we all went to see it thinking it would be awesome\\, but it is just the opposite.  I truly have no idea how the critics could have liked this trash unless they wanted Star Wars to fail.  Reboot this movie with JJ at the helm please.","true":true}