{"101487":121285,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Firstly I'm no BIG star wars fan so I don't want to be labelled as some kind of \\\"fan boy\\\" or sexist bigot or arrogant artard who simply didn't appreciate the politically correct messages within the film. This is all blown out of proportion and I don't understand how critics and seemingly intelligent people of modern society don't get that the movie simply isn't that good...\\n\\nStar Wars through my speeder goggles has always been the triumph of good over evil with an underdog digging deep to overcome a mighty evil that is seemingly unstoppable. The original episodes 4 - 6 have this hell even the original 1 - 3 have this (1 having possibly the coolest and most underutilized Sith Warrior in Darth Maul). \\n\\n\\nIn short the movies have always been menacing with a terrifying evil overlord putting the protagonists through their paces\\, through sacrifice and heartache. This is truly devastating for the heroes who are flawed in their own ways and make the best decisions they can for the fate of the galaxy and to defeat the ultimate evil... Then you have this...\\n\\n\\nA menacing villain in Snoke who is snuffed out before being given any intricacy beyond the term \\\"some bad guy\\\". A hero in Rey who just naturally has a strong affinity with the force who doesn't need training\\, guidance\\, development or any kind of requirement to improve as a character. The Rey you get in the first film (7) is the one you will see in 9 without having to conquer any kind of trial of heroes journey. If someone tells you that you can use the force just try it I bet it will work.\\n\\nI don't get how the critics don't see that this kind of storytelling is flat because the character does not go through any kind of arc (that is a storytelling device that shows them develop as a character). \\n\\nThe real sad thing is none of the characters do beyond being political archetypes to push cultural ideals into the forefront.\\n\\nI will say this\\, fans are not complaining because you picked a woman to be your stories hero figure nor that you introduced racial characters. They are complaining because you haven't given them a good story with good characters... its that simple. No more no less.\\n\\nWhy will anyone turn out to see the 9th film if there are no stakes in it for Rey? She will kill Kylo Ren like flicking a bug from her shoe do you know why? Because she already beat him in the first film (7). Hes not a menacing villain either and just acts like a spoilt child which is no doubt how these people see the supposed \\\"fan boys\\\" of this series.\\n\\nI liked Luke but like everything else in this film he's just a feeble old man with nothing to say. Write this trilogy off and don't give these people money unless the invest in some true character development and invest in very simple narrative devices that propel the story and its characters.\\n\\nStay away.... I know I will.","true":true}