{"101487":178314,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The reasons this movie sucked have already been expressed.\\nBut I want to point something out: There are Thousands of pages of audience reviews for Last Jedi but RT won't let you read past the first 51 pages. I believe this is to prevent anyone from doing a TRUE calculation because the actual score is much lower than 50%.\\n\\nRT should know\\, WE'RE NOT FALLING FOR IT!\\nBelow\\, I've CUT and PASTED the comments of other reviewers who know whats going on:\\n\\n**********************************************************************\\nPaul W:\\n\\\"Is anyone from 'Bent-tomatoes' going to actually address the fixed audience score here that is being capped at 50%.\\\"\\n\\nThomas R:\\n\\\"Second I need to say the score on here ( currently 50%) seems high. I have been reading as many reviews as possible and the numbers do not seem to be in line.\\n\\nJames T:\\n\\\"By the way\\, I think it is obvious Rotten Tomatoes is no longer updating the score for the movie. I see many negative reviews overwhelmingly and it has been holding steady at 50%.\\nUnless this is some new math concept I am unaware of then either it is not being updated .. or worse..it is being kept at 50% to not attract the wrath of Disney.\\\"\\n\\nIain M:\\n\\\"Disney must be bankrolling the executives at Rotten Tomatoes to ensure that the reviews don't fall below 50%. No other explanation would suffice.\\\"\\n\\nEstaban G:\\n\\\"RT appears to have FROZEN the Audience Score. \\nI'm guessing Disney paid RT not to allow it to go below 50%.\\nWell RT\\, you may make money in the SHORT TERM but in the LONG TERM you'll LOSE TRUST and CREDIBILITY and audiences will look elsewhere (e.g. MetaCritic) for serious reviews.\\\"\\n\\nPaul Z:\\n\\\"Have to agree with others: There's something ROTTEN about Rotten Tomatoes' score for this film! \\nI can't prove critics were bribed but the *audience* score is CLEARLY lower than 50%\\\"\\n\\ntoukolou t: \\n\\\"how does the score still remains at 50% and not going down is beyond me!\\\"\\n\\nJ .Scott P:\\n\\\"It seems that Rotten Tomatoes won't let this film fall below 50%.:\\n\\nJames J:\\n\\\"Proof that Rotten Tomatoes is rigged.\\\"\\n\\nEli N:\\n\\\"This movie obviously has much less than a 50% rating on Rotten Tomatoes\\, but Disney must have coerced them to cap the score at 50%.\\nIt's been at 50% for days even though 90% of the reviews have been extremely bad\\, and yet it doesn't go below 50%.\\nFurthermore\\, they don't let you go back more than about 50 pages even though there are 1800 pages. Why do you think that is? It's pretty obvious - If you could see all the reviews\\, you'd KNOW they are lying about the 50% rating.LilJames C\\njust want add one thing: Rotten Tomatoes Audience Score is FAKE! \\nNo way\\, its has high as 50%!\\\"\\n\\nWayne G:\\n\\\"Still 50% Buuuushit\\, Rotten Tomatoes have lost the ability to count\\\"\\n\\nCloris G:\\n\\\"What a joke. It's been several days of this trash movie stuck at 50% even though most of the reviews are 1\/2 or 1 star. Stop manipulating the rating. You sold out\\, Rotten Tomatoes\\, and we will never trust you again.\\\"\\n\\nJake S:\\n\\\"I cannot believe it sits at 50%. Just take a bit of time to go thru the audience reviews. It would appear that it should sit around the 25 to 30% mark.\\\" \\n\\nMarcelo S:\\n\\\"How is it that with the ratio of good to bad reviews of this film that the audence rating is still hanging on to 50%?! \\nRotten Tomatoes not allowed to let the true rating show due to contractual obligations to Disney?!\\\"\\n\\nSarah P:\\n\\\"Equally insulting is Rotten Tomatoes pretending this film has 50% audience score when anyone can see\\, its more like 15%!\\\"\\n\\nWill F:\\n\\\"Rotten Tomatoes holding the audience score for said crapfest at 50% when anyone can clearly see it should be much lower.\\\"\\n\\nMatt C:\\n\\\"Disney most have payed off rotten tomatoes. No way audience reviews are at 50%.\\\"\\n\\nUlori F\\\"\\n\\\"How comes the majority of Audiance Reviewers absolutely condemn the film \\, but its still at 50% at Rotten Tomatoes? Only solution: REMAKE VIII !!\\\"\\n\\n\\nScowly X:\\n\\\"Edit: Notice that 50% audience rating not going down even though there are noticeably more negative reviews than positive ones? Gee... I wonder what that's about. \\nThose trying to rob others of their voice by claiming negative reviews are fake are fascist hypocrites who've become they thing they claim to hate. \\nFight back against this Orwellian garbage while we still can...\\\"","true":true}