{"101487":99761,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After all the glowing reviews from critics\\, I was excited to go and see this film opening night. At the credit roll\\, I was left wondering if I had seen the same movie. I'll begin by saying something positive. The visual effects and cinematography was stunningly beautiful. There were also some funny moments that felt in the right spirit of the franchise. However\\, the story itself and the character arcs fell flat. \\n\\n  The character Rey makes even less sense than she did in Force Awakens. She seems to know how to do all the amazing Jedi feats without any training to speak of and without any understanding of any of it. She still has no idea who she is and neither do we even when Kylo tells her. Even Luke is baffled by her and offers little training that would explain her abilities. She fails to really compel Luke to leave the island and the Luke we deserved to see come to the rescue\\, in the end resorts to trickery and an illusion to distract Kylo and the bad guys in a weird virtual reality form of forcery that leaves his character diminished rather than fulfilled. Come to think of it\\, all the characters seemed diminished in the end. Rey's confrontation with Snoke was poorly developed and anticlimactic. His throne room looked more like something out of the 1970s Flash Gordon or an old Hollywood musical. Enough with the red! All the other  subplots feel like unnecessary tangents and fillers. What was the point of Canto Monte Carlo other than an excuse for John Williams to write another cantina style number?\\n\\n After waiting decades for the Skywalker family redemption\\, we are left feeling like the director and Disney were more interested in scraping the old fans off their shoes like chewing gum. Our hero dials it in remotely and leaves us with a cheap illusion more aligned with the dark side than with the brave heroism of the light.","true":true}