{"101487":186227,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was an epic piece of garbage. Two years ago I saw that Rian Johnson was going to write and direct and had a terrible feeling he was not going to be capable of pulling this off . Looper was lackluster. This movie was a spit in the face of any true Star Wars fan. I felt nothing for the characters\\, they had zero story arcs. The fact that Rey is just the random kid of some junkies is mind-blowing. So now are we to believe that any random kid can just be born with the Force? Doesn't that throw away the entire origin story? How did Luke Skywalker become such a coward who gave up so easily? I also am amazed that Luke was an even more powerful master than Yoda. Luke had the ability to see exactly what a nightmare Ben Solo was going to to turn out to be but Yoda never had that ability when it came to Anakin. I also love how Ben Solo has zero redeemable qualities now. He couldn't bring himself to kill Leia at the beginning but by the end of the movie he was willing to kill literally anyone\\, Leia\\, Luke\\, etc. The movie treats the old characters like garbage. Admiral Ackbar was like a disposable extra. I don't even know why Chewbacca was in the movie. Since when does being a Jedi consist of teleporting and superhuman abilities? Leia can just levitate across space now. Snoke was an epic waste of a villain. After seeing the Force Awakens I assumed that Snoke was like Palpatine\\, a Sith Lord who was essentially a puppet master. Nope. Just a random villain that had no backstory and was easily killed off.  I have never been more disappointed with a movie in my life. I can only hope that Episode 9 somehow reverses the damage but it's not looking good. JJ Abrams was executive producer for this garbage movie so clearly he was okay with the story or lack thereof.","true":true}