{"101487":121233,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First\\, DO NOT believe the critics reviews! 93%?  They are all paid shills of Disney. They do not want the wrath of the mouse to rail road them out of the business. Believe the fans. Also I wouldn't put much emphasis on people rating this film 4 to 5 stars. Either they work in Hollywood and somehow touched this project and they are trying to prop it up\\, or they have almost no sense of what a Star Wars film should be.\\n\\nBelieve these low scores.  From start to finish this movie is a complete mess. Mark Hamill has said: \\\"I at one point had to say to Rian\\, 'I pretty much fundamentally disagree with every choice you've made for this character. Now\\, having said that\\, I have gotten it off my chest\\, and my job now is to take what you've created and do my best to realize your vision.' \\\" This is from the guy who brought Luke to life. Hamill knew this was all wrong. Luke is probably the biggest disappointment in this film. We've waited to see him back in action since 1983\\, just like Han.  We gave a pass to Han. Ford wanted the character to be killed off.  Han had a few good moments\\, and then BOOM\\, he's dead. Luke didn't even receive that much respect. \\nNow on to everything that isn't about how bad Luke was in this story. Well it's too numerous to list. To be honest the only reason I could give it a half star was because of Chewie and the Millennium Falcon. Thank god for these two\\, they are the only thing Star Wars related and they are hanging on by a thread.\\n\\nToo many characters with no development. Humor misplaced. Drama misplaced. Nothing seemed like Star Wars except the opening crawl.  I hope more people come out against this movie\\, we can't let Disney and Lucasfilm drive this franchise into the ground.","true":true}