{"101487":178843,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There will be spoilers here as I think anyone who is actually reading user reviews has probably watched the movie.\\n\\nLeia can fly.  This movie does not.  At about the 45 minute mark Last Jedi begins to veer into Phantom Menace territory.  It does pull up before crashing into the surface but this is Star Wars at its most insecure.  It takes too many pointless roads\\, has too many pointless characters\\, loads up on too many pointless critters\\, and feels like a kick in the shin if you ever as a child  thought the Force might be real.  Yoda laughs while he burns it all down.  The nostalgia is handled in a clumsy rough sort of way.\\n\\nLet's start with the good.  Mark Hamill did much better than I thought he would.  He puts in one of the best performances in the movie.  Daisy Ridley (Rey) is the best in this movie.  Thus\\, the scenes with Rey and Luke are the movie's best.  The movie is visually amazing and of course has the famous soundtrack. \\n\\nAnd now the bad... and there is much bad... the movie was made with little acknowledgement that this thing actually takes place in space.  Sure\\, a sci-fi movie like Star Wars takes liberties mostly for the benefit of making space action exciting\\, but in this movie at least two characters survive the vacuum of space in the first 30 minutes.  Operating in space actually creates quite a bit of tension because if a hull is breached everyone inside will get sucked into space and die.  Star Wars doesn't car about this anymore.  A bombardier survives in a bomb bay open to space which paves the way for Leia surviving and flying through space in a Marry Poppin's style moment that\\, among other things\\, looked totally ridiculous.  In-fact it's probably the worst moment in any Star Wars movie and that includes any Jar-Jar Binx scene.   Bombs \\\"fall\\\" from ships as if tied by gravity.  Cannons \\\"lob\\\" blasts across space which rise and fall ... also as if tied by some gravity source (rather than just flying straight like a laser).\\n\\nThe dialog is horrible.  Some sins include \\\"it's now or never!\\\" and \\\"I wish I could put my fist through this lousy\\, beautiful city.\\\"  Please...\\n\\nPacing.  The movie tries to do way too much.  The original Star Wars (Episode IV) is actually very patient.  In this movie love interest in kindled in moments\\, chemistry is not needed because it takes too long\\, it moves from one set piece to another\\, introducing toys\\, etc.  It never finds its pace or its soul.  \\n\\nThe plot is ridiculous.  There are four subplots going on\\, one of which (the casino planet) should have been removed completely and made no difference what so ever.  The movie should have ended at the throne room scene or\\, maybe\\, after blasting a hole into the rebel base and leave it hanging.  Most of the plot is retread (convert to the dark side\\, turn off this shield\\, an AT-AT attack that looks just like Hoth... etc).  No saber fights in this whole movie? Really?\\n\\nThe movie takes great pains to destroy the past. I get it.  Disney wants Star Wars to move on.  I don't understand how this was handled though.  The sacred Jedi texts can be destroyed.  Someone can become a Jedi in a few weeks of training.  Luke is self absorbed and bitter.  The original star wars wove a wonderful simple philosophy\\, future movies will have none of this.  \\n\\nCharacters... I hate Poe.  He just yells through the whole movie and thinks he's next in command and doesn't seem to know how rank works\\, etc.  Being in the military and everything wouldn't you know if you are second in command?  He just seems stupid.  Benecio del Toro shows up.... and he's stupid.  I hate when Star Wars tosses in actors. Let's give him a speech impediment. Star Wars loves that move.  Chewie\\, R2D2\\, C3PO are all some of the most likeable characters and has about five minutes of screen time.  Fin has no real purpose in this movie.  He wants to alert Rey\\, but then when they are reunited at the end of the movie they just kind of hug and move on.  Disney has created a new love interest for Fin by then.  Rey will probably have a relationship with Poe.  Of course\\, right?  She's smart and strong and a great character.  He's empty-headed and one dimensional.  It'll work.\\n\\nIt answers almost no questions posed in the first movie.\\n\\nThis is probably my last Star Wars.  I'm from the 80s.  I can recall how awesome this whole thing once was.  Now it feels like a Disney ride.  It's entertaining and I saw Luke through and thus it gets 2.5 stars.  I'm amazed critics are giving it 95% on here but they are cowardly and probably don't want to get shouted down.  It's easier just to salute and move on.","true":true}