{"101487":182028,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is BY FARt the worst Star Wars movie that has ever been produced. I'm 51 and was in the sixth grade when the first movie came out\\, and this movie is the worst made. The only reason it's making money is because of what LUCAS built. It doesn't hold up as a movie on its own. \\nKyle Ren and Snoke don't compare to Vader\\, Palpatine\\, or even Count Dookoo as far as that goes. They wasted the chemistry that TFA had built between Finn and Rey\\, and seemingly pawned Finn of on the worst character since Jar Jar (Rose). They didn't develop Finn\\, they demoted him. Kyle Ren is an unbelievable character. Why would he want to be like Vader\\, when Vader went back to the good side? This movies plot holes have been well documented. There's no reason to like ANYTHING in this movie. At least TFA had some sentiment when Rey handed the light saber to Luke. They even blew that! We waited two years for Luke to fight a meaningless battle as an astral projection. The planet itself is still under siege. There's now way for any of them to escape. They clearly don't have the balls to hook up Rey annd Finn\\, whchis what TFA was about\\, that and the return of Luke. Now it's about what? Kyle and Poe fighting for Rey? What's the next twist\\, Rey running of with Rose? This movie sucked. There's no reason to see the next movie\\, it can't be redeemed. I'll watch it\\, I just won't pay for it\\, or take my kids.  It made money\\, big freaking deal! they exploited what Lucas made as they destroyed it. Congratulations!!!!!","true":true}