{"101487":176536,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie has a weak script that counts too much on Deus Ex Machina to solve the plot...\\nLet's be honest\\, the porgs are useless and are there to sell toys\\, and I'm ok with that... but Holdo is a character created to sacrifice herself and save the day.... There's no depth at all in her character and the plot simply gives me no reason to care about her... Moving on... On The Force Awakens they did a good job introducing Snoke as a really mysterious and powerful successor to Darth Sidious\\, leaving a lot to be told about him in subsequent Star Wars movies.... but... he simply got killed without us knowing anything about him at all.. how did he learn the ways of the force? how did he got so powerful? how did he become supreme leader??\\nThe casino planet plotline shouldn't be in the final cut of the movie... it's useless and introduces an overacted Lando-like DJ... The main character's personalities did not evolve from the first movie... or worse... Finn got simple and shallow... just a coward doing whatever is needed for survival sake... and what about Phasma? She was an interesting character and her past relationship with Finn\\, which led to him killing her\\, is not explained at all...In my opinion the only point in which the movie succeeds is making the main saga more relatable with the Rebel's series form a storytelling point of view\\, but that's all... \\nThe weakest Star Wars movie to date... Hope they fix it in the next movies...","true":true}