{"101487":114389,"Last Jedi":"Last Jedi","2017-12-15":"2018-11-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Critics clearly don't know the difference between throwing in \\\"unexpected\\\" garbage that's meant to be \\\"new\\\" or \\\"exciting\\\" and actually good story telling. If this was a book series that I was reading I would have given up a third of the way through because of how disconnected from TFA and the rest of the entire franchise it felt. Any story lines started in TFA were messily wrapped up- like someone thinking that they can use gum to stick together pieces of wrapping paper on a package; sure it works more or less\\, but it's messy and disgusting and such a severe disappointment that by the time you get through it you're underwhelmed and annoyed by whatever was inside. I endured all this for what amounts to a heaping pile of dog feces? Yikes. The way Luke was handled was incredibly poor for starters. It felt as though RJ had never seen a Star Wars movie in his life but maybe glanced at a couple wiki pages and called it good. I'm almost surprised he even got Luke's name right! It wasn't character development (though I know not all character development needs to be positive)\\, it was more like character assassination. He didn't even remotely resemble the Luke we know from previous movies (and media in general). Then there was the poor attempt at making Kylo Ren a better\\, more fleshed out\\, villain. This was the only character RJ spent any time on and he couldn't even make me care about him. Not even a little. I was bored by his narrative and absolutely appalled at the use of Luke as his final catalyst towards the dark side. It was lazy writing to try to draw sympathy from viewers. Unfortunately it doesn't work like that: using a well defined \\\"good guy\\\" like Luke in a way that suggests he might even CONSIDER killing his own nephew rather than speaking with him first or attempting to get through to him in any other way is poor writing at it's most obvious. People like to suggest that Rey is a Mary Sue\\, but Kylo Ren fits that profile even better than she does in a lot of ways. They should have taken the ruthlessness of Kylo in TFA\\, toned down the whiny-ness of him\\, and let him move from kind of comically annoying villain to something more extreme\\, more RAW. We could have watched him follow the events of TFA with the realization that he needs to stop throwing hissy fits and show his power in a more stoic way\\, like Vader. No need for a sad backstory\\, either- offer us someone who doesn't care about right and wrong and maybe secretly never has\\, he was just trying to fit in. A true\\, psychopathic\\, villain who cared only about himself and his own agenda. Instead they tried to make us sympathize. I'd rather not have that\\, especially when it didn't work anyway.\\nFurther\\, Rey was taken from being a potentially strong female lead (like Jyn Erso in Rogue One) to a pathetic little girl who suddenly cares only about helping our villainous man-child Kylo. RJ blamed anti-feminists and racists for all the hate on this movie but I am both a feminist and\\, of course\\, completely against racism. TFA brought in some inclusion thay would have been fun to explore\\, but RJ sidelined all the diverse characters and instead focused on white-man-pain-Ren. What even was the point in Finn's and Rose's little side story? It was a mess. And Poe having a fiery temper and causing division among an already small resistance group like theirs only feeds into stereotypes of the \\\"hot headed latinx\\\". It was stupid. It was pointless. We gained nothing from it but sort of racist character development. And Rose- I was hoping I would love her but she was written so poorly. Has RJ never interacted with a single woman in all his life? Or does he get all his info on them from bad movies? That's legitimately what it felt like.  And Rey's parentage? She didn't have to be of Skywalker blood but giving her no connection back to the main story doesn't give a sense of \\\"anyone can be a Jedi\\\" (we already knew that!) it just feels like it was added to be a surprise so no speculations won out over others in the end. A poor decision that cuts her off from any possible meaning to the rest of the franchise and continues to make the sequels feel like they don't belong in the SW universe at all.\\nIt was lazily written and full of failed shock value under the guise of subversion from the formula of the franchise. It didn't feel like a Star Wars film at all. It would have been BETTER as a stand alone movie with no connection at all to the SW universe. But even then it would have been poorly written\\, racist\\, and sexist. It would have been a B-list movie at best without the major characters and drooling Kylo fan girls to help prop it up. People thought the prequels were bad\\, but this outdoes all 3 of them in how terrible it is. At least the prequels added something to the story and mattered to some degree. This movie was pure trash.","true":true}