{"101487":198562,"Last Jedi":"Last Jedi","2017-12-15":"2018-10-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars movie ever made by far. They claim it's good because it \\\"subverts expectations\\\" but that is utterly absurd -- all it did was demonstrate that they obviously did not map out a three movie story arc from the beginning. This is Star Wars ad libs\\, an absurd fan fiction. It is a movie that feels as if it was made with contempt for the franchise and it's fans\\, and Rian Johnson does his best to make that clear elsewhere as well. I'm not some star Wars super fan baby-raging about the movie not being exactly what I wanted... There is some good to it -- the visuals\\, the score\\, some of the actors. But the storytelling is disastrous and the actions of the characters make absolutely zero sense. This whole trilogy has been a farce.... How do you make a new Star Wars trilogy by just thinking it up as you go along?? Its absolutely preposterous. \\n\\nI could go into further detail about *why* the film is so disappointing\\, but there are countless articles\\, reviews and YouTube videos which already do so. Luke's character in this movie is jarringly incongruent (why did he leave a map if he never wanted to be found? How could a character who even saw the good in Vader decide to kill Kylo just for being influenced by snoke? Etc.) \\, the use of hyperdrive as a weapon causes sooo many problems\\, the bombers in the initial battle scene make zero sense\\, the Superman Leia scene\\, Rey's character arc or seeming lack thereof\\, etc. There is really so much more though. \\n\\nI'm just glad Rian Johnson's new trilogy was supposedly cancelled. Let's just hope somehow this isn't the end of the series as it should be : \/","true":true}