{"101487":139347,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I really wanted to like this movie.  But\\, there were just too many things wrong with it.  The characters were under developed.  It relied completely on the previous movie for character development\\, and you didn't see them develop at all in this movie.  And the new characters didn't fit well and seemed forced.  Especially Rose.  She was pretty unnecessary to the story.  Though I like the addition of Benicio Del Toro.  His character was good\\, and they spent a little more time on it.  \\n\\nThe plot also had major issues.  Why in the world would you not tell Poe what your plan was to escape?  Especially knowing that he might do somethign crazy.  And\\, they had so many chances to tell him so that he can stop.  But\\, instead his crazy plan to find the encryption guy ended up getting thousands killed.  And most of the scenes at Canto felt implausible and far fetched.  I like the parallel to Cloud City\\, but the action at Canto was just not realistic.\\n\\nAnd  when Kylo Ren reached out to Rey to ask her to join him\\, all she had to do was say\\, \\\"okay\\, but only if you stop the attack on the rebels\\\".  She could have saved thousands of lives right then\\, and then changed her mind later as they struggle for power.  That would have been a much better plot twist to see them together and then see them potentially back stab eachother later in a future movie.  \\n\\nOh well\\, here's my looking forward to the next one to hopefully redeem itself!","true":true}