{"101487":142591,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's been interesting to watch Disney's disaster recovery tactics evolve over the past month. From having reviewers post one-liners lauding the film with a 5 star rating\\, they have moved on to more sophisticated tactics. Now we can see reviews that are negative about the film yet rate it 3 stars or more. \\n\\nThis site aggregates the score by looking how many people rate the moviee 2.5 stars or less verus how many people rate is 3 stars or more. The Audience Score of 49% which the website display currently basically means that 51% of people rated the movie with 2.5 stars or less. So any review that is 3 stars or more is bumping up the score. \\n\\nHow nifty.. have a reviewer seemingly disapprove of the movie yet score it positively. \\n\\nDISNEY\\, people have become too smart for these tactics - we are all on the internet too much and see and hear too much. Stop with the nonsense. Stop with the justifications. Acknowledge this movie sucked\\, fire Kathleed and Rian and get on with it. \\n\\nMy origial review below: \\n---------------------------\\nDisappointing story line development... Star Wars is not a super hero movie\\, but Disney doesn't seem to understand that. I don't think they know what the actual appeal of these stories has been for so many years and so many generations.\\n\\nI walked away from the theater with a weird feeling of 'what did i just watch'. When a friend asked me how the movie was\\, knowing my excitement prior to the premiere\\, I stayed silent for a while before slowly responding 'it was Ok\\, but...' and not being able to finish. My initial review on Rotten Tomatoes was 2.5 stars - i liked the visuals and music\\, but was utterly disappointed with the story. Now\\, after having given it more thought\\, I can't give it more than 1 star. \\n\\nThere are major flaws in the basic premise of the action that is shown on screen - two spaceships chase each other for 18 hours waiting for our heroes to run out of gas ?! I can't believe how anyone tought that this would be fun to watch. Fast and the Furious movies at least make car chases exciting\\, this was literally a straight chase between two scape ships which took more than an hour of screen-time. I was sitting in the theater feeling bored and realized I had never ever felt bored watching a Star Wars movie. Even after rewaching them for the tenth time.\\nThen we have gravity in space? and the girl which needs to activate the bombs being exposed to space without it affecting her in any way? then Leia being exposed to space and freezing and somehow saving herself? I mean these are just really weird absurdities of the plot\\, but the thing that is the core of the problem is that this movie has no message for us whatsoever. \\n\\nStar Wars is a unique franchise which has in the past 40 years assembled a fan base of all ages. There is a reason for that. The Star Wars movies\\, besides being fun\\, action-packed and awe-inspiring grand scale theatrical feats\\, are movies with a profound story and a message. \\n\\nThe original movies raised the question 'what is evil?'\\, 'is all evil the same?'\\, 'how unconditionally should you love?'. It showed the difference between being evil (emperor) and doing evil (darth vader) and they showed us that unconditional love can redeem (luke).\\n\\nThe prequels showed how evil plays all sides for its own gain of total control and destruction (you have to admire the planning and plotting of palpatine to play everyone against one another). It showed that evil revels in suffering. It showed us to be wary of false praise and accept some limitations placed on us by those that are there to guide us toward adulthood. Even with Jar Jar Binks\\, and the clinical CGI of the prequels\\, its messages were profound\\, and watching Anakin fall to the Dark side still saddens me every time. \\n\\nThese are movies that as a mother I want to show my kids. So that we can have a fun family time\\, but also because it allows me to ask them to think about what the stories teach.\\n\\nWhat exactly is Disney's message to us with these new Star Wars releases (The Force Awakens and The Last Jedi)? They seem to think that Star Wars is another Marvel comic. \\\"Let's get the band together to blow some shit up!\\\" \\nNo! No! No! \\nDo they really think that anyone will show the Avengers movies to their kids in 40 years time\\, like people do and have been doing for decades with Star Wars? \\n\\nAvengers are fun and action packed-movies that I go and watch in the cinema as well\\, but they are so utterly forgettable. And they are made in that way. We are not there in the cinema to care but to be entertained. Star Wars is an entirely different franchise\\, and I can't believe how badly Disney has missed this point. \\n\\nI would like to sit down with Rian Johnson and Kathleen Kennedy and get their input on what the message is of the Last Jedi? It's so shallow. Rose and Finn are happy to free animals and make a statement about animal cruelty\\, while leaving little kids enslaved? Rose saves Finn because we should 'save what we love and not kill what we hate'\\, while by saving Finn she dooms all the other rebels hiding in the cave... yes\\, let's just be selfish and save only the ones we have a crush on and let the rest perish... wtf?! Are the good guys and the bad guys all the same because they all buy weapons to destroy one another? 'No\\, you're wrong' says Finn\\, and that's the end of that message. Very convincing... \\n\\nThe other thing that is so infuriating is how Disney just threw away the original cast. I mean\\, these are iconic characters\\, and this was the very last chance we had to see them together on screen\\, to send them off with a loving and grand goodbye. Instead Disney has brought them back on the screen to kill them off and disgrace them. There is not one scene where Luke\\, Leia and Han are together. We hardly get Chewbacca. The opportunity to do this right is now lost forever. I can't believe the sheer stupidity of the people writing the scripts.  \\n\\nThe thing that saddens me is that the magic which I felt thinking about Star Wars and waiting for the next release is completely gone. I see that this franchise is now owned by people who are out to earn money first and foremost\\, and it killed all the yearning I had to see the story unfold. I won't be seeing the next Star Wars releases in theater. If I watch it at all\\, it will be on tv. \\nI have thought about what could make me have hope again for this franchise and it would be to have Lucas on board with whatever the new releases are. But I think that opportunity is totally lost with the way his characters have been treated. So for me\\, this was indeed the last jedi. I am out.","true":true}