{"101487":170271,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi is the most disappointing thing since George Lucas sold the rights to Disney.  A hyped-up sequel to the \\\"A New Hope\\\" rip off\\, this movie is filled with cringe-worthy dialogue\\, an embarrassing story\\, terrible editing\\, massive plot holes\\, and a surprisingly awful film score. There are some good things about the film however\\, which confuses me because it's almost like watching two separate movies being smashed together. \\n1.\tApparently people can live in outer space now. In the opening fight sequence\\, the girl on the bomber lays on a beam that is open to outer space and suffers no consequences. Even though she later dies by explosion. \\n2.\tThe bridge of the ship that Leia is in gets hit by a shot and violently explodes and rips everyone into space. The next scene Leia is floating out and about and just wakes up and flies back to the ship. The doors open\\, and again everyone is exposed to space and nothing happens. Leia dies a very violent death and then just wakes up and goes back to the ship and takes a nap.\\n3.\tAs the movie continues you realize that all the buildup of Mark Hamill reprising his role as Luke Skywalker is actually a negative thing. When the anticipated moment has finally been reached and Luke is handed his old lightsaber\\, he immediately tosses it over his shoulder. This lightsaber was created and used by his father. His father fought with this weapon in the Clone Wars. It was given to Luke by Obi-Wan. Luke was trained by Obi-Wan and Yoda. He used this lightsaber to fight his father and save his friends. He turned his father back to the light side and defeated the Emperor once and for all. And in this moment in TLJ all of this history was thrown in the trash. I guess disregard everything that took place from 1977-2005. None of that matters. Luke is absolutely pathetic and behaves completely out of character. He hates the Jedi? He hates the Force? That's a great idea if I've ever heard one. After a quick visit from Yoda he is changed back to normal\\, but half the movie has passed by this point. \\n4.\tIf Luke hates the Jedi and the Force so much and goes as far as to say that it should all end together\\, AND exiles himself onto an island to die with no intention of ever coming back\\, then why does he continue to dress exactly like a Jedi every moment of his life? Why doesn't he go back to wearing the attire he wore for the first 19 years of his life?\\n5.\tLuke eventually states that he went into hiding because he failed his nephew\\, Ben Solo\\, and that Ben has a power that he has never seen before. However\\, Luke knew Darth Sidious\\, Darth Vader\\, Obi-Wan\\, Yoda\\, and himself. And so far in the past 2 movies in the storyline there has been no demonstration that Kylo Ren has any skills at all. Rey defeats him easily in TFA and she has never even held a lightsaber. In fact\\, Snoke even makes this point in this movie. You also see Kylo fighting later in the film against Snoke's guards and he is getting slapped around again. Isn't he supposed to be strong in the force? Yet some nobody puts him in a choke hold and almost stabs him. \\n6.\tAnother huge problem is the distractingly terrible CGI. Snoke is just obnoxious but it only gets worse. The annoying 'porg' penguins and later the giant llamas must have been created by an eager 7-year-old. And how many computer animated explosions can we see in this movie?\\n7.\tSo Finn and newly added Rose set off on a quest that takes most of the movie to accomplish. Sounds like a big deal but it is simply to find some nobody decoder to stop the 'First Order' from following them. Very nice ideas going on here. Along the way they spend a big chunk of time watching NASCAR pod racing and freeing CGI llamas. Rose tries to explain why this is a big deal\\, but no one cares about this forced subplot. They then get captured and sent to a jail cell where another decoder happens to be there and has been laying around in his cell with a key this entire time. What was he waiting for? Nothing. Actually\\, he was just waiting for the writers to tell him what to do next. Nice. \\n8.\tLater\\, Poe holds a mutiny against the acting commander and hates her\\, yet when he is stunned the commander and Leia both comment on how much they like him. I don't think so.\\n9.\tAfter they leave and arrive at the bad guys' ship Finn and Rose get captured. The villain\\, Captain Phasma does the typical stalling when it comes to execution and has to find a better way to kill them. In the meantime\\, a lady from Jurassic Park smashes into the ship and kills everyone in this room EXCEPT Finn and Rose. How convenient. Then Phasma and some troopers come walking up in a formation even though they were all just standing right next to each other. Phasma gets shot but her armor deflects the laser bullet. I think the \\\"First Order\\\" has the resources to make all their soldiers have this armor so why don't they? They have multiple giant space weapons that can destroy planets but armor that works is a little too much to ask? So Finn gets up and has a very anticlimactic fight with Phasma. Why would they have done it any different? \\n10.\tThe movie goes between Kylo\\, Rey\/Luke\\, Leia\\, and Finn scenes. Is Chewbacca just an extra in this film? Because he gets as much screen time as those frog costumed creatures on Luke's island. Kylo's scenes were all very entertaining and Adam Driver was very likeable. Rey's scenes were also interesting and I was waiting to hear what's been happening to Luke\\, but everything else in the movie could not have been less interesting. I don't think I've ever been more bored while watching a movie. This is why it felt like two separate movies edited together.\\n11.\tAfter the Snoke battle\\, Kylo Ren appears to have also killed Hux\\, but shortly after you see them both standing together. You also see a similar deal when Finn is about to sacrifice himself for the \\\"Resistance\\\"\\, yet Rose smashed into him to save his life\\, meanwhile jeopardizing her own. But no worries because everyone is invincible in this film. Except for Luke apparently. I guess using the force one more time was just a little too much for him these days. It was a very uneventful and unheroic death for the star of the original trilogy. \\n12.\tAll this buildup of finding Luke and he does next to nothing. He aides in the plot which is helping the \\\"Resistance\\\" keep running but other than that he does nothing. Except for complain and die. He doesn't even have a lightsaber duel. He uses the force to trick Kylo Ren and pulls out his blue lightsaber\\, except Kylo had just recently destroyed that one so why did he think Luke had it???\\n13.\tBefore transparent Luke shows up\\, all the rebel fighters were standing in a hanger with the blast door open watching the \\\"First Order\\\" stroll in and fire at them. Death and destruction could have easily been prevented and we're supposed to believe these are the people who have been fighting the bad guys this whole time? Are they as stupid as the writers? Oh. \\n14.\t  Even a lot of the dialogue from this movie was very childish and made me feel like I was watching a show created for little kids. Finn is sacrificing himself to save the 'Resistance' and Rose stops him. \\\"We're not going to win by killing the things we hate\\, but by saving what we love.\\\" Well Finn was about to save everyone he loved by killing the \\\"First Order\\\" but you just stopped him for no reason. And then she gives him an extremely awkward kiss and proceeds to pass out just like Leia did earlier in the film. How creative. Another childish addition is when they're looking for an exit in the cave and a CGI ice fox is conveniently standing in a doorway waiting to lead the people to safety. I'm not 9 so this doesn't amuse me. There's a lot of trying to lead you to believe someone is about to die\\, just to have a cheaply executed save. Boring.\\n15.\tAfter Rose crashes into Finn and is unconscious\\, Finn then had to drag her all the way back to the gathering of the \\\"Resistance\\\". However\\, they were right next to the heavily guarded \\\"First Order\\\" battering ram and could never have made it to safety. \\n16.\tThe plot of the movie is that the \\\"Resistance\\\" is trying to run away from the \\\"First Order\\\". The presented problem is that they are running out of gas and when they finally do\\, the \\\"First Order\\\" will be in range to fire on their ships. But the REAL problem is that the writers have no idea what they are doing. Is the \\\"First Order\\\" running out of gas too? Is there a reason that the all resourceful \\\"First Order\\\" can't cut them off by going into hyperspace? Or by summoning any ship in their possession? What are all the other \\\"First Order\\\" ships doing at this moment? It's supposed to be pretty important that they have the last of the \\\"Resistance\\\" on the run right in front of them but all they are doing is following them? \\n17.\tThey even couldn't resist having the droid BB-8 driving an AT-ST walker. I guess the children under the age of 5 need some entertainment too. \\n18.\t Disney is in dire need of a thesaurus. Can we get a word count on the word \\\"hope\\\" please?! Also stop with the \\\"never tell me the odds\\\" joke. That ended in 1980. Also why did C3PO have a red arm in TFA and not in this film? Why is the anticipated mystery of Rey's parents never laid to rest? \\\"Oh they were nobody.\\\" K thanks for the movie bye. Also who in the heck is Snoke? And why did he just show up out of nowhere in TFA and is supposedly the most powerful being and then just dies and we never hear anything about him or his motivation\/plans????\\nGeorge Lucas' Star Wars movies were told in a unique way that could easily have been told apart from any other writer. It was almost an art of its own. There's a style to making Star Wars and I could tell this movie came out in 2017. There used to be a purpose behind the dialogue\\, and now it's just schlock. It was like the way Obi-Wan described the lightsaber; \\\"an elegant weapon for a more civilized age.\\\" Now writers are clumsy and random\\, and people laugh at CGI penguins on the screen. TFA and TLJ both focus on what happened between Episode 6 and TFA\\, but the whole idea of training Jedi and Luke's interaction with Ben Solo sounds more interesting than the current movie's plots. Or lack thereof. At least Leia wasn't killed off in this movie so I'm really excited to see her return in full CGI....","true":true}