{"101487":147694,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wouldn't classify myself as a SW fan. I haven't been positing or engaged in fan theory's about Snoke or what Luke has been up to or where the the franchise is heading. I'm not as attached or invested into the characters as the many SW fans are. I watched the films\\, enjoyed (some of) them\\, and then forgot about them until the next film came out. I understand that SW fans would be jaded about stuff\\, but it's not as bad as superfans seem to say it is. \\n\\nAs a casual and somewhat objective viewer\\, I thoroughly enjoyed this film (and so did my 63 yr old mother and 28 yr old cousin). I was literally sitting on the edge of my seat\\, eyes agape. Yes\\, it's not perfect and things could have been done a little differently and different choices be made\\, but it was still certainly entertaining. I would love to watch it again to pick apart the cinematography\\, particular in one of the epic final scenes.  \\n\\nI loved Luke's character arc and Mark Hamill's acting. I understood his guilt and self-banishment and loved his final scenes in the movie. They were beautiful. \\n\\nI love that Rey literally comes from \\\"nobodies\\\". That someone ordinary could possess the force is game changing and exciting. The potential it gives to the Star Wars universe for story telling is exciting. \\n\\nI liked the philosophical undertones throughout it. I enjoyed Star Wars deconstructed. \\n\\nAgain\\, I know it's not a perfect film. I didn't get into the little issues I noticed\\, but none of them stopped me from being thoroughly engaged and entertained throughout it. It was an exhilarating\\, beautiful and sometimes messy ride.","true":true}