{"101487":127443,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"he Force awakens was not a bad film. It has often been criticised for playing it to safe and to have copied to much from the original trilogy. But everyone who is of this opinion has to bare in mind that so many years had passed since ep 6 was released. And to show the new generations how great the Star Wars saga can be and at the same time give the older fans a treat\\, it was a brilliant move. JJ Abrahams did a very good job introducing the new characters side by side with Han Solo\\, Leia and Chewie - that is not an easy task! And the questions JJ so nicely opened up\\, was probably the best cliffhangers in film making. Any director\\, would have been very pleased to get such nice material handed over to continue with the second part of a trilogy. But not Rian Johnson\\, he blew it all: - Who Reys parents were. - What Luke had done since ep 6\\, and what he could do to help the resistance. - Who was Snoke? - the most powerful villain in the Star Wars saga. What his background story was and so on.... -------------- And it was not just the unanswered cliffhangers that was a disaster. What about the plot holes and lack of story line. There were so many meaningless scenes that made the audience confused and disappointed: - What did Rays experience in the dark pit bring to the trilogy? - Whats the point making a long sideplot with Finn and Rose\\, when they failed getting the codes? ------------- Unlogical! The entire Star Wars saga has some facts and own logic. Rian Johnson crossed every line imaginable.","true":true}