{"101487":166771,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Shame...shame....shame...This film is the nail in the coffin for Star Wars as a franchise. I have no desire to see another Star Wars film that Disney produces ever again. After waiting decades to see Jedi freakin Master Luke all we got is a pathetic demented shell of a character who is closer to Jar Jar than Luke Skywalker. What an absolute disgrace this film is to everything we know and love about this universe.\\n\\nThe only reason this has 1 star instead of 0 is for the special effects and the music. The character development (or lack thereof)\\, story\\, script\\, etc. are all complete garbage. This film takes The Force Awakens and throws everything away. Forget whatever questions you had in the previous film because they are all for naught. Not to mention that this is a remake of Empire Strikes Back and Return off the Jedi into one movie. The \\\"humor\\\" in this film was so unbearable it was like watching Spaceballs or Robot Chicken. Completely unnecessary and the serious parts of the film were ruined because of the terrible slapstick comedy and idiotic jokes thrown carelessly about. The middle half of the movie was completely pointless and the ending was so jaw-droppingly bad I was left stunned. \\n\\n\\nLike many people here I made this account solely to review this film because I am so upset and frustrated with what they have done to this franchise. I have been a fan since 1997 when I saw the special editions in the theater as a kid with my dad and I cannot be more shocked and disgusted with the way Disney has chosen to take the greatest movie franchise of all time.\\n\\nIf you are looking for a fun sci-fi movie with explosions and laughs you will enjoy it. If you are a true fan that cares about the characters and the overarching themes (The Force)\\, stay far\\, far away.","true":true}