{"101487":162393,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Plot twists turned to plot anarchy. Ryan Johnson effectively throws out Chekov's gun principle in favor of the much more dictatorial \\\"all that matters is what the writer thinks matters in this exact instant; it might be forgotten or brushed off 20 minutes from now\\\".\\n\\nA lot of story logic and story direction was sacrificed to make the heroes as heroic as possible and the message the movie delivered as inspirational as possible. I appreciate the intent but Star Wars is a fantasy with some fable-like moments. Treating this movie (or any movie really) as a sacred text that teaches our kids morality is just presumptuous and unnecessary. There should be a balance here. \\n\\nMixing two generations of characters proved this trilogy's undoing. Not enough time was devoted to the new cast who got lost in the countless B-plot story lines and in the need to showcase Han. Luke\\, and Leia. Love all the new heroes\\, btw. \\n\\nThe SW OT was build on friendship and romance; the PT on family. Even with all the special effects and action\\, the relationships between the characters is what made these movies shone (some more than others). Our main cast in this movie has never spent any time all interacting with each other. Poe and Rey met in the last five minutes of the movie. The movie as a result is an emotional wasteland. Ditto for not thinking of a way for all the OT cast to get together for a scene in TFA\\, however short the scene might be. This movie was an emotional wasteland. The New Yorker used the following adjectives to describe this bold new SW world: \\\"abstemious\\, de-mentalized\\, militarized\\\". I couldn't agree more.\\n\\nI had no issue with how some classic elements from Star Wars were discarded or reinterpreted. However I have to say that putting such emphasis on these same elements (Anakin's lightsaber for example) in TFA and then literally tossing them aside was baffling to watch. I am not one bit surprised by fans angry about that just because of how these elements went from significant to who cares. If you really wanted to be bold\\, Lucasfilm\\, perhaps you shouldn't have brought these elements up in the first place. You can't have your cake and eat it too. Sorry!\\n\\nSpeaking of bold\\, there were some interesting ideas in this movie. But somehow we ended up with an evil man in black armor with a red laser sword who is in command of a faceless army bent on subjugating the galaxy\\, a rag tag team of rebels who resist him and all space tyrants. and a young inexperienced jedi who is helping the rebels. That sounds... familiar? Hopefully\\, episode 9 does something unexpected with that set up.\\n\\nThe movie was profoundly unfunny. The only thing the quippy one liners achieved was to undercut the tension and diminish the story's impact. And the funny parts were not meant to be funny. Leia flying through space is not bad\\, but the way they portrayed it was. The space chase was just Family Guy Star Wars or Space Balls level of absurdity. By all means show us new ways the force works! But the  long-distance yet tangible force hologram was just distracting.\\n\\nHeroes are as good as their villains. The First Order are caricatures. I guess that makes it more palatable for kids when they see the First Order ships carrying thousands of members of the First Order blow up.\\n\\nI had no problem with the death of Han Solo or the fate of Luke Skywalker. But know we know the OT trio led sad\\, strife-filled lives and never escaped the conflict that formed them as human beings in their youth. It's like their hope and dreams were crushed with age until it was time for them to pass. That's a very nihilistic statement that anyone who is currently under 25 will have the pleasure of discovering as they re-watch the movies in the future.\\n\\nI just can't see how the movie is nuanced. The bad guys are badder than ever. The good guys are more heroic than ever. It's good vs evil; light vs. dark. Nuance never did play a role in this universe. Lets not fool ourselves that it does now.\\n\\nThe special effects were very nice\\, but 99% of all the vehicles and even of many aliens were just tweaked designs we have seen before.\\n\\nRyan Johnson\\, I am still a fan :). Maybe both sides on this debate will reassess their position and we will meet half way.\\n\\nThat said\\, the entertainment media's reaction to any negative opinions about the movie has been sad to witness.","true":true}