{"101487":158893,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Oh Star Wars... how did it come to this.  Many previous reviewers have discussed\\, at depth\\, the mammoth\\, gaping plot holes in The Last Jedi so it hardly seems fair to delve into that again.  If you are a fan of the original trilogy\\, you probably will not like this movie.  Suffice it to say that it would have been better to kill off the holdover characters from the original trilogy than to humiliate them with the future created by Kathleen Kennedy and her team of mostly female writers.  You might be inclined to believe Kennedy just can't product a decent movie but she and her crew have seized any and every opportunity to push their feminist agenda during numerous interviews and TLJ is the sad result.\\n\\nMany people have characterized this movie as a total failure.  I do not agree because it certainly depends upon the stated goals of the film's creators.  Kennedy's vision for Star Wars was that it be led by strong\\, power women\\, that there be more diversity in the main characters and that more dialog be spoken by non-whites and non-males.  These goals have been openly and proudly proclaimed.  All of this was accomplished in TLJ and the film made a ton of money so it was a success!  It was never promised that the original characters would carry themselves with any dignity or purpose.  It was never promised that Star Wars cannon would be preserved.  It was never promised that it would be a good movie.  The goals were to push the progressive agenda and that is what was delivered.  Moviegoers\\, myself included\\, simply assumed they would also want to make a good movie.  We were WRONG!\\n\\nThe goal for the writers was never really within reach.  Star Wars is a story about compelling characters involved in a deadly conflict\\, in other words WAR (hint: it's in the title).  I'm pretty sure everyone knows this but wars are fought by men in massively lopsided numbers.  TLJ wants us to believe that women do all the fighting and men are hot-headed idiots.  There are scarcely any female admirals in the world\\, yet in the Star Wars galaxy\\, you simply can't find a man for the job.  Wait!  What about Admiral Ackbar???   Nope!  We're going to blow him into space so fast you'll hardly notice he's gone.  Not to worry\\, we have a purple haired lady in a cocktail dress ready to take over as Admiral.  She's tough\\, though\\, so you'll hardly notice she's a woman.  (Why doesn't she have a uniform??) The writers for TLJ want women to be strong and powerful but what they really want is for the women to be men.  More than that\\, they want these women to be superior to men.  In the first trilogy\\, you have Anakin Skywalker who receives training from Obi Wan and Yoda for a decade or so and goes on to be pretty tough (Darth Vader).  In the second trilogy\\, you have Luke Skywalker who trains for his entire life\\, brings down Vader and even starts his own school.  In the third trilogy you have Rey.  She's a girl\/women but she needs to be better than all the men so let's make her totally invincible without any training.  We'll make her an immaculate Jedi master who can fly space ships and even repair the Millennium Falcon better than Han Solo (the owner of the ship).  What about when Rey encounters Kylo Ren who has been in Jedi training from childhood and is the top disciple of Supreme Leader Snoke??   Not a problem for Rey because she's better than all the men because we say so!  Yay!  The writers so desperately want Rey to be the best that they elevate her to near God status.  This doesn't make for a  very compelling character and basically drives a stake thru the Jedi lore.  In the span of a couple of weeks\\, Rey went from a starving junk trader to possessing all that is the Force inside her soul.  I related to her more when she was the struggling junk trader.\\n\\nWhile all of this is bad enough\\, the really bad news is that under Disney\\, Star Wars is beyond repair.  Disney made the decision to hire a feminist (Kennedy) to head Lucasfilm.  Kennedy decided to put her politics above the franchise and hired a bunch of feminist writers to create this trilogy.  Somebody made the decision to have the heroes of Episode VI have a child that would become the bane of the galaxy.  There's really no way to recover from this.  Han\\, Leia and Luke should have all died and then end of Episode VI and the galaxy would have been a much better place today.    Things will not get better in Episode IX.  Jar Jar Abrams said in a recent interview that the fans who didn't like TLJ (male and female) are simply \\\"threatened by women\\\".  How nice\\, he disagrees with the assessment of many fans so he creates a basket and throws us all in.  Rather than learn from the fans that the storyline is broken\\, he's doubling down and saying the fans are the problem!!!\\n\\nThe only solace for the fans is that Disney paid $4 billion for the Star Wars rights and they don't make new movies for free.  They have a lot of money at stake and they're not going to make it back spinning out crap like TFA and TLJ.\\n\\nThere used to be an unspoken covenant between moviegoers and film makers... they want to make a good movie and we want to see a good movie.  Moviegoers can no longer afford to make such assumptions.  I will not be going to see Episode IX or Solo or any other Star Wars film.  Like graffiti sprayed on a beautiful piece of art\\, it only serves to make me angry.","true":true}