{"101487":169551,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*SPOILERS* The thing I did not like about The Force Awakens was the over-the-top slapstick comedy. Too many gags to try to force laughs. Everything else about it I loved. In The Last Jedi\\, they take the slapstick comedy to a whole new level. It feels like they try to become like Chris Pratt and Guardians of the Galaxy (which was a fantastic film)\\, but instead the merger just felt more like Spaceballs with Mel Brooks. There are some great dramatic moments\\, but they will not let a dramatic moment LAND! They must insert a gag or humor that did not fit in with the tenseness that should come from the scene.  \\n\\nAnd if you admired JJ Abram's commitment to less CGI and more real costumes\/effects\\, that all went out the window\\, it seems. Lots of CGI\\, especially with the pointless casino scene. \\n\\nI felt that about 90% of the movie was pointless filler. Anything other than the storyline of Luke\\, Rey\\, and Kylo was absolute garbage. And even then\\, many of their scenes felt unfulfilling. Again\\, NOT EVERY CHARACTER HAS TO BE FUNNY. I felt like some of the story decisions were made for the sake of being surprising. Oh\\, you think we killed Leia because Carrie (RIP) died? Well\\, we did. PSYCHE! We didn't. And now Luke is dead. Look at us being so bold. \\n\\nAnd hey\\, there were some great\\, genuine moments where the timing was just right for a laugh\\, and the execution was perfect. But it needed to be reduced by 80%\\, and no\\, BB-8 did not need to control an AT-ST walker. Might as well have him fight Kyo with a lightsaber. \\n\\nI'm ok with the new story not tying back to the old story. I think that is probably a wise move. But\\, this movie just did not feel like Star Wars to me.","true":true}