{"101487":175075,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi has great scenes and horrible scenes. The opening scene is great\\, a couple of okay fight scenes\\, and I love the humor. I have been a life long fan of the Star Wars franchise but in my honest opinion; the bad outweigh the good in this movie. Disney has shown in this movie that they're going in a completely different direction that I don't agree with but it is what it is. You can either get onboard or get lost. And I have chosen to get lost unfortunately. In my opinion\\, the only way to enjoy these new Star Wars movies is to NOT have any expectations of these new Star Wars movies living up to the originals because they will not. You will be disappointed every time. George Lucas sat the bar so high that it seems nearly impossible for these new & young directors to reach.These are my thoughts below:\\n\\n1. For this movie to be almost 3hrs long I feel like there is entirely too much talking and not enough action.\\n2. Luke Skywalker was not Luke Skywalker. His character in this movie was everything he isn't.\\n3. Luke Skywalker should of trained Rey how to fight with a lightsaber but didn't. \\n4.There were not enough lightsaber battles in this movie. The lightsaber battle with Snook's guards was OKAY but nothing spectacular.\\n5. I felt as if this movie should of dug deeper into showing us who Rey's parents are.\\n6. Snook died too easily to be as powerful an all knowing as he is. You can't have a powerful villian such as Snook get killed the way he did in this movie.\\n7. There should of been an epic lightsaber battle between Snook & Rey\\,  Kylo Ren\\, or Luke Sykwalker.\\n8. There should of been an epic battle between Luke Skywalker and Kylo Ren.\\n9. The way Luke Skywalker died was horrible. You can't kill off the character that made the Star Wars franchise that fast. Espically after making his 1st reappearance after 20 t0 30 years.#EPIC FAIL\\n10. You mean to tell me that the Great Luke Skywalker died from using a Force Projection technique for less than 10 minutes? If he didn't die from that than that is surely what it looks like.\\n11. There is not enough detail and background on Snook in this movie.\\n12. Why does Yoda literally look like a puppet on a string in this movie?","true":true}