{"101487":138291,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"In sum. Excrement! It is as if Disney delights in dropping heaping wet turds on my childhood. So pronounced was my hatred for this movie that were it not for my three kids\\, I would have left 30 minutes in and demanded a refund. My specific reasons follow:\\nPowerful John Williams score and Star Wars text crawl: Yes please.\\nConference call between wanna be Han Solo and wannabe Grand Moff Tarkin where wannabe Han Solo pretends he doesn't hear wannabe Grand Moff yapping. No (if it were Harrison Ford-yes).\\nSpace battle between resistance fighters and star destroyers. Please sir may I have some more.\\nBombers dropping bowling balls on imperial ships and battle ending after 30 seconds. No.\\nBombers having no shields or any other offensive capabilities. No.\\nAdmiral Akbar dies without ceremony. No.\\nPrincess Leai slapping Han Solo wannabe in the face. Yes.\\nKylo Ren. No.\\nKylo Ren being talked down to by Snape or Snoke or Snook or whatever the hell that thing is supposed to be. No.\\nKylo Ren in supped up fighter. No.\\nPrincess Leia blasted into space. Yes.\\nPrincess Leia flying nun through space back to ship. No.\\nLaura Dern with Pink hair. Sure.\\nLuke Skywalker tossing light saber over a cliff. Yes.\\nLuke Skywalker being a jerk. No.\\nChewie breaking the door down. Yes.\\nChewie getting no love. No.\\nChewie being in the movie for less than 1 minute. No.\\nR2 getting love from Luke. Yes.\\nChewie eating Porgs. Yes.\\nChewie feeling guilty for eating Porgs and Porgs nesting on ship. No.\\nR2 playing the original Leia message. Sure.\\nLuke Skywalker milking a mutated Manatee and drinking the milk. F$#k no!\\nLuke Sykwalker spearfishing a mutated swordfish. No.\\nJedi Temple janitorial staff. No.\\nFinn waking up from coma in leaking wet suit. Nice timing but no.\\nPublic Works Director of ship taking a liking to Finn. Sure.\\nFinn gets stunned by Public Works Director. No.\\nMaz Khatanna on jetpack via hologram. Whatever [this was the point in the movie I wanted to just get up and walk out in disgust].\\nFinn and Public Works Director go to Casino Royale. No.\\nArms dealer tries to use BB8 as a slot machine. No.\\nMutated camel races. No.\\nMade to feel sorry for mutated racing camels. No.\\nThrown into jail. Sure.\\nDrunk and stuttering Benecio Del Toro. No.\\nCode breaking Benecio Del Toro. No.\\nEscape from jail on mutated camels thanks to street urchins. No.\\nPolice chase through cliffs of Malibu. No.\\nCode breaker saves the day initially. No.\\nLuke continues to act like an ass. No.\\nLuke talks to Yoda. Please sir may I have some more.\\nYoda jokes and burns the Wisdom Tree down. Yes.\\nVoldermort\/Harry Potter mental connection and conversations throughout movie. F*@k no.\\nBreak into Star Destroyer and take uniforms with BB8 pretending to be another robot. Sure.\\nImperial dry-cleaners. No.\\nHeroes busted. Sure.\\nDestroyers guns cant hit Calamari cruiser. WTF? Really? Come on...really?\\nThere being like 10 resistance crewmembers left. No.\\nSnoke tortures Ray. Sure.\\nKylo Ren kills Snoke. Ok...we had no idea what the hell Snoke was so why not?\\nKylo and Ren battle imperial guards. Yes please.\\nPink haired Admiral goes to light speed through destroyer. Yes please.\\nRebels go to base with crystal foxes. Ok...\\nRebels jump into trenches and prepare for ground assault. Better when it was in Empire Strikes Back but ok.\\nRebels in trenches get killed after 1 shot. F@#k no.\\nNew AT-ATs. Yes please.\\nBB8 commandeers mini AT-AT on board destroyer. No.\\nFinn fights the tall woman from Game of Thrones. Yes.\\nTall woman from Game of Thrones gets killed after 10 second fight. No.\\nJunk heap speeders go after mega cannon. No.\\nLuke shows up and hands Leia Han Solo's dice cuff links. Umm...ok\\, but how is it that he can touch her but Luke can't touch Kylo?\\nLuke gets shot at by Kylo and makes Kylo mad. Sure.\\nLuke brushes dust off coat taunting Kylo. Yes.\\nKylo fights Luke. Yes.\\nRebels escape out back door and 12 rebels left go into Falcon. No.\\nChewie piloting Falcon. Yes.\\nTribble Wannabees hanging out with Chewie. No.\\nRey shooting at Tie Fighters. Ok.\\nLuke revealed to be present thanks to Astral Projection. F@$k no.\\nLuke sees sunset. Sure.\\nLuke doing yoga pose. No.\\nLuke fades out. Sure.\\nSpark that lights the flame nonsense. No.\\nOf course\\, the kids loved it but what do they know?\\nA heaping giant smelly wet piece of @#!t is what Disney has delivered. Shame. Shame. Shame.","true":true}