{"101487":185949,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-07","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was a beautiful disaster.  I saw it twice in the theater in the first couple of weeks.  I didn't want to see it a second time because it pissed me off\\, but I caved to go with family during the holidays and I figured it may give me a chance to see if I still was upset with it.  Didn't change anything.  The cinematography and visuals were gorgeous.  The story stunk to high heaven.  What a waste of a brilliant storyline.  Thanks for ruining my childhood memories of a great series.  Luke Skywalker reduced to a bitter old man.  Poor Carrie Fisher passed away and they should have cut the Supergirl space scene out and let her die there.  They could have re-edited the story to work around her death.  There were some interesting ideas about the Force that I appreciate.  Powerful darkness needs to be checked and raises up a powerful light.  The hubris of the Jedi? Sure.  Where the hell did Snoke come from?  Who cares\\, he's gone now.  \\nThere could be a fascinating love story with Rey and Kilo.  I could feel chemistry there.  But they'll ruin that too.  The amazingly slow space bombers were a joke.  Poe's emasculation was a joke.  Admiral SJW with the secret plan was painful.  The side quest to chastise the greed of society at the Casino planet was a joke.  This whole \\\"running for our lives\\\" slowly chasing across the stars was lame.  Captains dying by going down with the ship?  Why not auto pilot and evacuate with the others.  There's more plot holes than I care to write.  Hundreds of pissed of reviews on YouTube cover it all.  Bottom line is this... Star Wars isn't a sure fire hit anymore.  It's getting ruined.","true":true}