{"101487":164959,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Riam Johnson what have you done?  I tend to rate a movie based on how much I contemplate the movie after initial viewing\\, how much it swirls around in my craw and consumes my thoughts.  If that was my only rating I would give this a 10\/10 because I kept replaying parts in my mind.  Only the thoughts were causing my distress and more than a little gas.\\n\\nI get the message that Riam Johnson was making (I think) about \\\"let the past die\\\".  This isn't my father's Star Wars (or in my case MY Star Wars).  This is now about the new cast- Finn\\, Rey\\, Poe\\, Kylo.  BB8 even (move over R2).  I wouldn't be surprised if we had a new protocol droid showing up in Episode IX.  Threepio meet Fourpio!  He speaks 11 million languages and is WAY sassier!   \\n\\nI think in Disney's mind the stories of Luke Skywalker\\, Han Solo\\, Princess Leia and Darth Vader are done.  Finished.  Those stories have been told and the book is closed.  This is where the great divide begins.  In my mind\\, and I'm probably not alone in this\\, I wanted this to be Act II of these great characters.  The more I think about it the more I realize this was lightning in a bottle with this original cast.  How many movies can you recollect that had such great characters with such amazing chemistry?  They all worked so well off each other\\, they weren't shallow and one-dimensional.  You could theorize how they would respond to situations because you knew their motivations and it made sense.  This is one of the reasons The Last Jedi felt so wrong: it went against everything we knew about Luke Skywalker.  My Luke Skywalker wouldn't pull out his lightsaber to strike down his pupil.  My Luke Skywalker wouldn't abandon the very thing that gave him purpose and direction and caused so much good.  My Luke Skywalker's father DIED for his belief in the good in all of us\\, Sith Lord or not.  Did Riam Johnson watch the same movies that I did?  \\n\\nMore to come","true":true}