{"101487":176976,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie struggled with dialog akin to csi dramas and force fed corny humor that absolutely took away from a great mix of new ideals and direction to the star wars saga. It was breath taking on the eyes but my honest takeaway was one of distraction. Immersive moments eclipsed by over dramatization and almost amateur plot segways. Not to mention silly distractions like falling bombs in space\\, and battering ram cannons. It struggled on bouncing between captivating and down right stupid. Outside of all of the actual issues I think the movie had\\, the pointless personal annoyance I felt was the lack of development leading to the quick and underwhelming death of snope. No complaints that he was killed only the lack of explanation to his great evil. I know full well this could be explained in the next movie and that is a complaint that has no merit. It's not my story to tell\\, yet the scene did leave me as a fan disappointed. I just hope they find someone who can write a little deeper and less ridiculous dialogue going forward. Star Wars does not need added drama. The story is of everything or nothing far into the future of space. Fingers crossed they dial back the outlandish humor and dial in the dialogue because the story is truly new fresh and intriguing.\\n\\nLastly on one final note\\, Star wars movies in the past have left me at the edge of my seat\\, emotionally invested\\, near to tears. This movie had me cringing for the next big stupid thing someone was going to say. It's dialog ruined it.","true":true}