{"101487":136810,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm not sure what to think about The Last Jedi. I saw it twice within the two days of opening and I left both viewings feeling excited and somewhat confused. After the first viewing\\, I loved some portions of the movie\\, for instance\\, the throne room fight scene\\, the light-speed destruction of Snoke's ship\\, Yoda's scene with Luke\\, and Luke's face-off with Ben Solo. All of those scenes were incredibly well shot and choreographed\\, and delivered on the action you expect from Star Wars.  But I left with a feeling of confusion that undermined the scenes I thought made the movie very good. The Canto Bight scene for one was just poorly executed along with the whole side plot of Finn and Rose. I was not a fan. The second viewing however\\, I enjoyed a lot more because I focused more on the scenes I loved and less on the ones that caused my confusion. It was a much more enjoyable experience. I saw it one more time but didn't really change my perspective. I've had a longer period of time to marinate on the movie and come to my final verdict. I ultimately have decided I like the movie\\, but it could have been so much more. The transition from JJ Abrams to Rian Johnson did not go smoothly and that's what caused the flaws in this movie. Johnson didn't like certain things that were created by Abrams in TFA(The Force Awakens) and thus attempted to fix these \\\"mistakes\\\" and failed in doing so. Snoke's death\\, for one\\, is an example of this. It is clear that Johnson didn't like Snoke because he killed him off relatively early into the film and wasted his potential. The whole romance of Rose and Finn lacked character and was Johnson's way to get rid of the Rey and Finn relationship. That last kiss felt empty and had no real meaning. However I will say that the relationship between Ben and Rey that has been created as a result of this movie is something to look forward to in Episode 9 and how that plays out. Adam Driver and Daisy Ridley's scene in the throne room is arguably one of the best scenes in the whole movie and saga\\, although I wish Snoke's death and the scene were later in the movie. But\\, the biggest grip I have in this movie is the underuse of Mark Hamill. Luke Skywalker\\, the man we have all been waiting for\\, is misused in a lot of ways. His first scene where he nonchalantly throws his lightsaber off a cliff encapsulated perfectly how you feel about the character. In your hands and then thrown away. Oh well\\, at least JJ Abrams is directing the last one so maybe he can salvage the pieces to this story.","true":true}