{"101487":157933,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not really a star.  Maybe a 1\/8th star.  And that's a gift.\\n\\nThis movie in a word is -- awful.  \\n\\nLet me list my grievances against Disney.\\n\\n1.  The mere fact that Disney has decided to release a star wars movie or story every 12 months has destroyed the magic.  Period.  Star Wars is now just another sci fy franchise.  Nothing special.  But hey\\, who cares.  It's all about the money\\, and Disney is going to milk this baby.\\n\\n2. The opening battle scene.\\n  a. Poe's stupid slapstick banter with Hux is on par with Jar Jar Binks.\\n  b. The lumbering WW2 bombers were horrible.  Are you kidding me? Bombs away with Gravity type bombs?  Sigh.  Who's idea was that?\\n\\n3. General Leia getting blown up and sucked out of the cruiser\\, then using the \\\"force\\\"\\, I guess\\, to will herself back to life and propel herself back into the destroyed bay.  Then\\, they open - the - door\\, that leads into the vacuum of space\\, and she falls to the deck. OMG. This was poorly conceived and executed.  \\n\\n4. The slow speed chase of the first order fleet and the few remaining rebel ships.  Why didn't the first order just order their star destroyers to jump into hyperspace and appear AHEAD of the rebel ships????????  This who chase was a violation of the RULES. It made it seem cheap\\, like the writers gave the whole chase about 10 minutes of brainstorming and then said. \\\"F- it\\, let's just say they can't catch them\\, what's for lunch?\\\" \\n\\n5. Rose.  I know they wanted this character to work\\, but she was awful  Jar Jar binks awful.  She goes against everything Star Wars is about.  And she's dumb.  So let me get this straight... Fin is about to sacrifice himself in order to save everyone else ( because if the first order's big gun blows a hole in the blast door the rebels are finished)\\, but is thwarted by Rose at the last second because she wants to save just him??? What?  So she saves Fin for a few seconds only to have the first order blow everyone away?  Good thing Luke just so happens to show up and save the day for everyone. I mean\\, Rose stopping Fin would be like Han knocking Luke out of the death star trench just before Vader shoots him\\, so Han could \\\"save what he loves.  Yeah\\, it doesn't make sense\\, or feel good.\\n\\n6. Fin's comment that it is OK to \\\"tear up the town\\\".  So Star Wars is now preaching that mass mobs that go around looting\\, burning and destroying towns is OK?  Great. \\n\\n7. Snoke.  His demise is a classic example of having too many cooks.  So\\, I guess JJ Abrams came up with the idea of Snoke\\, but old Rian said\\, \\\" I hate the guy.\\\" so much so\\, that Rian chops him in half.  So\\, having all these Fan Boys writing Star Wars fan fiction makes the story uneven\\, choppy and frankly\\, disappointing -- since I found myself yearning for the George Lucas Prequels.  \\n\\n8. Poe.  Get. Rid. Of. Him.     His character is bad.  His jokes are even worse and I am almost ready to put him on the level of little anakin Skywalker in terms of ridiculousness.  \\n\\nI could go on and on and on and on\\, but I will end with this.  Disney is RUSHING the movies so it is almost impossible to get a good\\, cohesive story.  Everything must be done on a schedule.  We are getting processed\\, fast food\\, rather than a well though out feast.  \\n\\nPlease Disney\\, take your time with the next movie.  It's our only hope...","true":true}