{"101487":169392,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"**SPOILERS AHEAD**\\nThis movie was terrible. I've never written a review on this site and I'm sure many other people will have the same complaints that I do but I feel the need to post this anyway. How is this movie a 91% with these genius critics? Were they paid off by the all powerful mouse?\\n\\nThis movie mainly tries to force feed SJW\/political\/feminist BS down your throat instead of actually telling a coherent Star Wars story. Rey is never developed as a character and her parents were apparently nobody after all the hype that was built over her origin. Just an abrupt dismissal of her being linked to someone cool. But still she can beat powerful Jedi with no training and without breaking a sweat. Kylo is somewhat fleshed out as a character but these sequels have still made him look incredibly weak compared to Darth Vader (Can you imagine Vader being made to look like a b***h by the emperor and then getting beaten by someone with no force training??). It took Luke 3 movies\\, years of training and all the willpower he had to beat Vader\\, plus his sister being threatened.\\n\\nFinn and Rose are the main SJW characters with an absurdly stupid side plot that did nothing and probably took like 40 minutes of screen time ( at least it felt that long). I like Poe's character but they tried to make him look dumb in this movie when really he was acting rationally in the face of seeming suicidal stupidity of the purple haired (yes\\, seriously) female captain. \\n\\nSnoke was killed off in a really dumb way with once again no reveal of his backstory. Leia Poppins flies in outer space instead of dying with dignity. Luke's character is butchered\\, with him even saying so himself in interviews. Yoda shows up to validate burning ancient Jedi texts because\\, you know\\, they've got Rey now. Duh. There was also way too much forced humor that was completely unnecessary for a Star Wars movie. \\n\\nThe list goes on and on but I'll stop there. Save your money. Don't see this in theaters and don't buy the blu ray. Stop feeding these Disney whores that like vampires will extract every ounce of blood from the corpse of a proven money maker. I for one am DONE with this franchise and will not be giving them any more of my hard earned money.","true":true}