{"101487":131012,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't know where to start with this film! I went there with an open mind. The force awakens wasn't a masterpiece by any stretch but it had some interesting ideas. \\n    Unfortunately my mind was quickly made up on this movie\\, the minute Princess Leia was seen floating around in space then pulls herself back in using the force! \\n    Unfortunately that wasn't where the bad points stop either. Luke Skywalker's character has been completely ruined. \\n     The whole mistery surrounding Snoke\\, who he was\\, where he cane from and where's he going was also completely destroyed. He had the potential to be something quite interesting and instead they kill him off in the most nonsensical way.\\n   The whole mission the the casino to get the code breaker was completely pointless and could pretty much have been cut from the movie. \\n   The creatures in the movie like the beak-less owls and the Chrystal dogs just looked stupid and were so overexposed it's unreal.\\n   The poor attempts at comedy were incredibly ill judged. I'm not saying comedy doesn't belong in Star Wars\\, cause it does. If you don't have comedy\\, you end up with revenge of the sith. These attempts at comedy however just weren't funny! \\n\\nAll in all I'm a firm believer that Star Wars should've started and finished with the original trilogy. With the exception of Rogue One\\, I haven't enjoyed any of the other instalments like I did the originals.","true":true}