{"101487":183343,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This last installment of the franchise is a beautiful spectacle as far as crappy\/pretentious movies go. It was really pretty to look at but nothing more. As far as storytelling goes this movie is utter garbage.\\n\\nThere are so many things wrong with this movie:\\n1. Building hype about Rey's history and who Rey's parents were then sucker punching the audience by reavealing it is nothing important.\\n\\n2. Building up the Villain Supreme Leader Snoke (THE BIGGEST VILLAIN of this new trilogy) then killing him in the most pathetic anti-climactic way without answering who he was\\, where did he came from.\\n\\n3. Making unnecessary side stories - Finn and Rose's side quest was pointless and added nothing to the progression of the main plot.\\n\\n4. Dumbing down the character of Luke Skywalker the original hero of the franchise and making him go out in the lamest way possible.\\n\\nI could list more but my main problem with the movie is how disrespectful it was to the long time fans of the franchise. What you did to Han Solo and now to Luke (and even admiral Ackbar who just returned to die in such a pitiful way) was a great shame. Add to that the contemptious undertones of the movie for the previous trilogies with lines like \\\"Let the past die\\, Kill it if you have to\\\" and how you handled Luke's role in this story (hyping the audience with that last scene from episode 7 and turning it into a slapstick moment then killing the guy off in an underwhelming unheroic way) is a big fucking middle finger that old fans really found offensive.\\n\\nI wont watch the next movie\\, there is no \\\"next one\\\" The Last Jedi killed whatever love I might have had for the future installments of this franchise.\\n\\nGood Job Kathleen Kenedy and Company.","true":true}