{"101487":147288,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I went into this movie thinking it was going to be mediocre at worst. Man was I wrong. It was abysmal. Most of the points in the negative reviews on here I agree with. The beginning idiotic humor with Luke tossing the light saber over his shoulder and the prank phone call with General Hux set the tone for the rest of this movie. And the tone is that we are going to be in for an unsettling train ride that is more than likely going to wreck at some point\\, possibly fly off a substantially sized cliff\\, and even fall into an inescapable void of a black hole. \\n\\nAll in all\\, the Luke scenes are out of character for Luke. Hamill should've just left the project after realizing that the script betrays his character. Also the politicizing and propaganda in this movie is endless. The scene with Yoda in which he burns down the hut with the Jedi texts is preposterous. Many scenes in this are just weird and out of place period including the Luke milking the creature scene as well as the Luke tickling Rey scene. So bizarre!\\n\\nSo none of the intriguing questions that were raised in Episode 7 were answered in an engaging way. The way the viewer learns about Rey's parents being nobodies as well as Snoke's character not given any dimension are at the top of the list. Also the light saber duels are sub par. There really isn't one good fight in this movie. The Luke scene in which he astral projects himself is a big let down. You think he is going to have a big epic light saber battle but ends up being essentially a Toreador circumventing a bull charge.\\n\\nI wish I could go into everything that is wrong with this movie. I could write an entire series of books about how bad it is. Anyway Episode 8 is an insult to Star Wars fans and should be banished from the Jedi temple!","true":true}