{"101487":187132,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was the worst Star Wars film ever made. It didn't feel like Star Wars it felt like Disney trying to make some quick cash. George Lucas would have never made this movie. In the end we are back to where we started with the Force Awakens. Nothing changes it's all just a bunch of nonsense. There is no story development at all and no spoilers but really? whats up with Snoke? We don't know anything about him? There was no deep emotion that Star Wars films are legendary for and it's basically just a recycle of the original trilogy. No creativity at all. Get rid of the whole resistance thing it's not original and put the focus on Rey and the future of the Jedi\/Sith. This movie was just running in place there was no point to it Bring George Lucas back because this movie was a disgrace. Also stop focusing on unimportant characters\\, we don't care about Rose she doesn't have anything to do with the story. Why was there any focus on characters like hers? The focus was off throughout the movie and I found myself saying WTF the whole time. And on top of it all things just didn't make any sense. You'll know what I mean after watching the movie. I don't understand how you could make a two hour movie without developing the story in any significant way. This isn't a B list series this is Star Wars\\, get it right or just don't try at all. I am beyond disappointed and to be honest appalled. Maybe this Star Wars is just for a new generation\\, maybe I should just move on and stick to the original six movies. Unless they bring George Lucas back. I leave the rest to the viewers.","true":true}