{"101487":183879,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie franchise has become overly politicized and the directors and writers who are championing this are too lazy for the regular Star Wars fan\\, who grew up with SW\\, to over look the leap in logic and themes to like this movie. \\n\\nThings I liked - It took a different approach in the way that the main tension of the movie was centered on one space battle. Yet\\, this was also one of its greatest weaknesses. \\n\\nThings that were terrible:\\n- We get no real explanation of the origin of snoke or real satisfying resolution to what his character was before he died in the crappiest and most convenient way possible. \\n- The matriarchy shut down the patriarchy. Really? If that general just let a CAPTAIN now what her plan was\\, maybe a lot of things would of been different. Instead she looked incompetent and so did he. I thought the rebels were supposed to be different than the empire\/FO and this type of dynamic wasn't a thing. Well thats SJW politics for you. This is coming from some one that champions equality.\\n- Luke was just such a loser. He was a loser for Rey\\, he was loser for being that hermit\\, he was a loser to want to burn down the remnants of the Jedi religion and his death was one of a loser. They killed Luke as a role model in all ways possible.\\n- Mary Sue is still Mary Sue.\\n- The side story with Finn and the diversity hire was just so Disney and not Star Wars. It was cool that they found the hacker. I LIKED how they figured out how rich people funded the entire war but the other themes of that side story sucked. \\n- Ren is still a cry baby\\n- FO head captain guy is a cry baby\\n- No world building for a SPACE OPERA\\n\\nOveral: This movie sucked a hard one. Interjected too much modern day toxic politics for me to actually try to begin to enjoy it. None of it made sense enough for it to be realistic enough to believe that there was an actual conflict happening either. Yes the other old SWs had the same problem\\, referring to the latter\\, but not to this degree. Watch it\\, and decide for yourself. I hate that 2017 supposed hate is being combated with hate and than being put in apolitical movies.","true":true}