{"101487":126593,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Great visuals and sound but that's it. I'm a long term Star Wars fan and this movie is nothing more than an insult. The plot itself does not make any sense. I'm not explaining that further because there are a ton of YT videos that do it for me.\\n\\nThank you for destroying our beloved characters. This is a new trilogy with new characters\\, I get that\\, but why can't you just let the old ones rest with a bit of dignity left? Luke trying to murder his nephew in his sleep??? Are you kidding me? Chewie is nothing more than a cab driver. But Leia (probably because she is female but that is just a guess) turns into a powerful force user able to survive a blast with no training whatsoever. What the fuck? You gave Adm. Ackbar how much screen time before killing him? I guess as a male character from the OT you are having a bad time with K. Kennedy in charge at Lucasfilm.\\n\\nThe SJW Vice Admiral character acts like one of those teachers that nobody likes. Why the hell wouldn't you just tell Poe your plan? This makes literally no sense. Poe's reaction to this is completely human and understandable to me. I CAN RELATE TO THAT because even I thought that this woman was a spy or had just given up. But no\\, no\\, ... She had a solid plan all along and just did not tell Poe and in the end they are LAUGHING about him and how stupid he was. WHAT THE HELL? Why not\\, this provides just another oppurtunity to show how women can do everything better and are overall much smarter. Let's get this straight: I don't have the slightest problem with cunning intelligent female characters. Take Sansa from GOT. It just has to make sense\\, but in this movie it's forced and therefore doesn't work. \\n\\nI laughed really hard about what they did to Phasma. What the fuck? AGIAN? From watching the trailers\\, interviews and whatsoever you could get the impression that Phasma is an important character\\, but she literally has a ridiculously small amount of screen time. Why even bother to cast (and pay) Gwendoline Christie for the role? I like her and she did a good job portraying Brienne. Why not use her character for anything? This supposedly though Captain Phasma acts stupid in BOTH movies and (big suprise) gets trashed in BOTH (one time literally).\\n\\nI could go on about this for hours but I'm ending it here. Sorry guys\\, but the new Star Wars canon is dead for me. Perhaps I will buy some of the old (now \\\"Legends\\\") novells I didn't get to read before. It is just sad.","true":true}