{"101487":134536,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left the theater on the night I saw Star Wars The Last Jedi thinking that it wasn't a bad movie. It wasn't great. But it wasn't awful. At the same time I left feeling bothered. A kind of itch in the back of my sensibility. Something I couldn't put my finger on. I thought about it all night and into the next day. So I decided I would write out the plot on paper to get out everything i still had in my memory bank. As I wrote I began to see more and more clearly the reasons why I felt the way I did. \\n\\nI felt this way after the first 10 minutes of Aliens 3. I loved Alien and Aliens. Ripley had taken us on a compelling and exciting journey and  we left feeling satisfied. I loved the characters that were left at the end of part 2. And then at the beginning of part 3\\, the writers kill off every beloved character and impregnate Ripley with an alien  so she could die in the way she feared most. This is what The Last Jedi felt like. \\n\\nI wont get into the caricatures they made of every character or the plot holes or the story inconsistencies. But they all exist. and I understand. I think i know why. I think we are at a unique point in history. We need more movies where all the women are heroes and martyrs and powerful. And we need more movies where men are shown to be men. reckless and angry and wishy washy and cowardly and power hungry and animal abusers and bullies. I believe there are ways to convey all of this. I think they tried but failed. \\n\\nI will say that it was alot of fun to see visually. It was gorgeously shot. There were a few very creative ways they expanded the mythology and universe that i really appreciated. The action sequences were riveting. The lightsaber fights were amazing. So I will give it half a star for that. But I wish it was a different movie. I would say go see it and if you leave thinking it wasn't bad but it wasn't great\\, leave it there and don't overthink it.","true":true}