{"101487":133003,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I give a 1 Star solely for the effort of the actors here. I wanted very much to like the new characters and gave the Force Awakens a pass for re-hashing ANH pending the depth that this follow up would add to the characters.\\nWhat a waste of time that was.\\nLuke throwing the light Saber over his shoulder was Johnson throwing away every single thread of intrigue which was set up in the previous movie and demonstrating his lack of respect to the source material.\\nI was willing to suspend my disbelief on the whole marReysue phenomenon in the hope that we would get at least a small\\, passing explanation as to how\\, why\\, what could possibly allow Daisy Ridley's character to have unexplained outstanding proficiency in your choice of:- The Force; Light Saber combat; Star ship pilot; swimming (new - despite being basically raised on a desert planet). \\nHow can they expect us to grow attached to a character who has no imperfections\\, struggle  or meaningful character  growth? and I actually think the actor has done a good job given the lack of material to work with. This however does not make the character any less boring.\\nAt the oposite side of the spectrum is the character Finn - who is basically portrayed as a bumbling coward with no real purpose other than ?comedic relief in this movie. Again I was really hoping for something more for this character as the actor\\, I believe\\, has really got talent and charisma (I really liked him in TFA)...\\nSigh.\\nMark Hamil. I am so sorry for what they put you through in this movie.\\nHe was excellent despite the disrespectful writing of his chracter and limited screen time.\\nI have a huge list of problems with this movie and I'm not even a big Star Wars fan - or maybe this movie made me realise that I WAS \\, but that has been shattered by this poorly written\\, disrespectful - to all the actors who gave their all as well as the long time fans - mess.\\nThis movie also dripped with political bias. If ever anyone wanted evidence that political ideologies ruin entertainment - this should be presented as exhibit A. Though I actually feel that this movie was so badly written and executed that it wouldn't have even changed all that much if the agenda was removed entirely.\\nShame.\\nI don't have the heart to type out everything I felt was wrong with this Movie.\\nIt looked good at times\\, though (that's the other 1\/2 star)","true":true}