{"101487":169380,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS AHEAD:\\n\\nI think that the clear message of \\\"destroy the old\\\" hurt a lot of fans because they felt like the story they loved was being discarded.  But it's not that.  It's just growing up.  We got a smuggler without the heart of gold who sold out the heroes\\, we have the resistance slowly burning away while the first order is suddenly upended\\, we have a hero who costs many lives not once but twice learning the weight of his actions\\, and a man who doesn't think of himself as a hero struggling against every instinct to run away.  This story had true archetype breaking figures\\, while playing to the rules and lore of this vast universe\\, we were given something new and fresh. \\nAlso\\, can we just talk about how Beautiful Luke's entire story was....I love that he failed Kylo\\, and it wasn't that he turned that haunted him...it was that he almost did something unforgivable and the weight of his \\\"heroism\\\" was haunting him. But man... if his last stand wasn't the only best ending for that little farm boy...watching a sun set in to the clouds.  And now!  We get Force ghost Luke!   \\nThe war is about to get much more interesting in the stars.  Because with the growing disregard of the old religions\\, we're also seeing a better blend of light and dark.  So I look forward to rebels cutting unsavory deals in the outer rim and the civil war between Hux and Kylo...it's going to be so interesting.","true":true}