{"101487":182663,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is one of the riskiest and unique story lines of the #StarWars saga. It did not take a safe approach in making the #movie surface focused. The story delves deeper into themes and creates new forms of mythos with #the-force. #rianjohnson implements multiple unpredictable plot lines and multiple twists that could either be acceptable or uneasy. On the surface level there are plot holes in the movie but they could also be patched up depending on your perspective with certain scene situations. The subjectivity of the script expands the theology of the force\\, and it also shows that the #darkside and #thelight is not cut and dry which leaves certain arguments open to be debated. There are three storylines divided in this movie. Each one had different pacing\\, tone and emotion. The first act set-ups the #drama with the characters mixed in with humor and small action sequences. The second act went very slow and there are some areas where the writers went political and animal activist-like. Although slow\\, the second act takes it's time developing the characters and tying in the story to an exciting third act. The third act was the best part of this movie and this is where Rian Johnson's talent is heightened. The movement of the action scenes tied in with the emotional connection with the #characters is one of the most exciting action sequences in #starwarshistory .This movie goes up and down the emotional and theological meter of Star Wars. Some of the scenes pulls you back to your childhood from the original saga when original characters interact with each other\\, but they also show the present relationships developing in the movie and there are set ups in the story lines that indicates of things to come. There are moments where certain scenes did not fit well with the #starwarsuniverse \\, some of them felt awkward\\, but they were new and somewhat refreshing. In time it could become accepted as certain story lines of the saga keeps piling up with #disney backing it up in their infinite piles of cash. ","true":true}