{"101487":132385,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If this were not a Star Wars film\\, I bet everyone would agree on how awful the storytelling is. I don't really care if Luke dies or not\\, if Leia floats or not\\, just show the story in a very good way. Don't surprise me with Jedis Ex Machina. Rian Johnson probably thought he would be some enfant terrible of the Star Wars series and redefine moviemaking with this installment\\, but no. You need decently good storytelling skills to break out of the box. The same foundations you have for traditional storytelling are the same foundations you will rely on to break the mold. The basic rules don't change. I appreciate the ideas that Johnson wanted to introduce with this movie\\, but tell it wonderfully. Otherwise\\, he can just write an essay about the gray areas between good and evil\\, and junking the past and stuff like that. Those questions should linger in me after I have seen the movie. The movie should live and breathe those questions throughout the movie. I think this was just an exercise in junking tradition and those issues just happened to be convenient tools to do change for change's sake. This looked as if it were told by a kid playing with his action figures and decides he could tell whatever ridiculous story as he pleases. \\\"Oh\\, sweetheart\\, Princess Leia can fly?\\\"  \\\"Yes\\, mommy\\, she can fly. And Luke can fight anyone from wherever he is.\\\" \\\"Like playing on the internet on his phone?\\\" \\\"Yes\\, except you can recharge a phone. Luke just runs out of juice.\\\" \\\"Oh\\, I'm sure the Jedis have something up their sleeves to resurrect Luke.\\\"?","true":true}