{"101487":117233,"Last Jedi":"Last Jedi","2017-12-15":"2017-11-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Don’t mess with the formula of the most important and epic franchise in movie history. Star Wars: The Last Jedi made a conscious decision to do just that. Where we are now is Episode 8\\, which was clearly conceived for the passerby; the non-fan. Prior to this\\, The Force Awakens had the audience in the palm of their hands on that pivotal scene of Rey handing Luke the lightsaber. New writer\/director Rian Johnson decides what this saga needs is jokes and for revered characters to do childish things\\, such as slapping a lightsaber out of Rey’s hand. Who wrote this new Luke because the Luke Skywalker that we know would never do that. He would never stoop to that level; the level that Rian Johnson is on for treating The Force like this. In fact\\, all of the comedy had very un-comic timing. This is not Spaceballs. Why the director forgot that movie was a spoof of Star Wars\\, I don’t know. The only thing the “comedy” achieves is removing the audience from the seriousness of the Star Wars saga. Johnson’s attempt to bring light into the dark fails miserably. Every scene is rushed through and quickly moves onto the next\\, which doesn’t allow us any time at all to feel emotions for characters and situations. I love Luke and Leia. They are the soul of Star Wars. How Luke’s character was written in Episode 8 is unforgivable. Skywalker is a hero and a legend. I suggest you treat him as such. The Last Jedi\\, they call it. Focus on the Jedi it does not. Where is the epic Jedi training we were waiting for after the buildup of The Force Awakens? 2 1\/2 hours later\\, with no conclusions we have lost the dignity of Star Wars. ","true":true}