{"101487":121451,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First time reviewer\\, ever\\, not a bot. SW fan since Empire Strikes Back in 1980.  Last Jedi had a lot of cool special effects scenes.  And some really good acting which is worth 2 positive stars.  But totally missed on plots and subplots which prevents me from giving it anymore stars.  The direction of the plots were fine.  But the storyboard was way off.  George Lucas was pretty poor with dialogue and directing actors to be believable.  But Lucas painted great storyboards with plots and subplots which made me want more. The Last Jedi storyboard was amazingly awful in contrast.  The caravan of ships chasing each other was boring.   My 11 year old fell asleep during the middle of the movie.  The whole Finn trip to planet Monte Carlo is totally pointless except possibly an \\\"Easter Egg\\\" for Episode 9 that poor people will rise up to be the new rebels.  That whole concept didn't sell well for me. Totally unnecessary and lowered the Star Wars mystique even worse than the Anakin courting Padme scenes.  What really bugs me is the lack of continuity from all other Star Wars movie and huge holes in story.  All the setups in Force Awakens are discarded.  I don't recognize the original trilogy characters say for a few lines.  Sorta felt like watching the last 2 seasons of Lost the TV series.  Great setups in previous seasons just thrown away.  Tone of movie and characteristics of characters was way off.  That makes me not care with any other setups the Last Jedi is trying for in Episode 9. Force Awakens blew me a way for the movie's ability to connect to previous movies and still be fresh.  Same for Rogue One.  Plus the great acting in Rogue One and Force Awakens.  The Last Jedi felt like it ruined all other Star Wars movie for me.  i won't be watching any other Rian Johnson Star Wars movies.  He's all about cheap laughs and trying to throw twist at you regardless of holes in the story.  He should direct and write some Avenger movies and not Star Wars movies. I don't really care what happens in Episode 9.  I do hope Episode 9 redeems the Star Wars franchise.  Much like the last Hobbit movie\\, I won't bother to watch Episode 9 unless fans that see the same issues with Last Jedi I do give it a thumbs up and worth my time.","true":true}