{"101487":154168,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"More diversity and female leads - great!  Moving in a new direction with a new cast - good idea!\\n\\nHowever\\, this is still an awful movie for most of the reasons already stated.  After watching the movie\\, I discussed it with a couple family members\\, one an older male fan and the other a teenage female new to Star Wars.  Both found much of the move absurd\\, like a bombing attack plan less sophisticated than the tactics used in WWII with dumb (guided by GRAVITY) bombs.  My niece found a space movie based on a space ship running out of fuel comical; I agree.  The list goes on. \\n\\nI then went to lunch with a friend\\, a casual fan like me\\, who pointed out that the movie lost him with Luke tossing the lightsaber. The movie didn't lose me so quickly\\, but I remember joking that Rey could have made a bigger difference by joining the First Order as opposed to magically returning to the handful of uninteresting people on the Millennium Falcon - a group it seems the rest of the universe doesn't care about either.\\n\\nWho is Holdo and why such a terrible role?  Having worked with incredible female warriors and leaders\\, it was a cringe-worthy role that no female or male actress\/actor could pull off in a likable or believable way.  Why portray her as hero for sacrificing herself but then chastise Finn for attempting to do the same? Why (throughout the movie) waste such potential in a leading African-American role? Why would Poe be leading anything after the way he was portrayed?   \\n\\nI could go on\\, but why rehash what is found in the candid reviews here.  I found much of the movie looked and sounded nice\\, but the story was terrible. I won't be paying to see any more of these movies.  Also\\, looks like I'm not the only one who after years of reading RT decided to signed up to rate this particular movie.\\n\\nI wish I could laim this quote since it really captures this movie. \\\"Never before have so many done so little with so much!\\\"","true":true}