{"101487":186966,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was so bad. To say it had plot holes would only be possible if it had a plot to begin with. What was the point of most of this. It was two and a half hours of hot mess. Literally. \\n\\nThere was the whole Holdo vs Poe thing.. What was the point? Why was Snoke even in the film? What point did he serve? Was twas the point of waking Finn up? Then the whole collector cameo?\\n\\nI was seriously disappointed. On a scale of 1 to phantom menace\\, this movie is a trash panda. It's not bad\\, it is way worse.\\n\\nThere were pointless battle scenes embedded into thin dialog. To see Luke demoted to comic relief as the whiny teen we knew him to be in a New Hope was disappointing. Fans have waited 40 years to see Luke in action and all we got was someone just as emo if not worse than Kylo. \\n\\nThe whole interactions between characters seemed drab and over acted. Laura Dern was the biggest disappointment of the night. She portrays this new version of Mon Mothma but with the speech and demeanor of a person who is in a studio recording for the next Chipmink movie. \\n\\nOne long pause that is anti-climactic would be fine but this movie was wrought with pauses as though someone at Disney took a pair of Scissors and began to splice together bits and pieces of the movie. I seriously think they took those scissors and jabbed a few critics with them as well... at least those who didn't guy bought out. How this movie gets a 93% is beyond me.\\n\\nI left the theater feeling figuratively depressed and tearful. Quite literally. It was like a part of my child hood was gone. The last nail in the coffin. I think it is time for the franchise to die.","true":true}