{"101487":97052,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"3\/5 Stars - Worth watching\\nSpoiler Free Review\\n\\nI apprach this from the perspective as really enjoying the original films & hating the latter state of Star Wars.  The prequels were an abyssmal casulty of both terrible script writing and early CG among many other dire faults.  The Force Awakens was a fantastic example in how to soft reboot a series & breathed life & hope for the story overall under the careful but caring watch of Disney (who despite some dissent still cares creatively which for a mega corporation is some form of miracle).\\n\\nThe Last Jedi is a 2 hour classic trapped within in a bloated 3 hour failure.  I'm not entirely sure what happened here.  Perhaps creating a Star Wars film following the successful soft reboot of the originals was doomed to some mediocrety but I don't understand why Disney won't allow it's directors more artistic control over the entire trilogy like they have with James Gunn & Guardians of the Galaxy.  Following the reassigning of JJ Abrames  for the final film of this triology\\, I can't help but feel sad he was unable to do The Last Jedi\\, which will now be remembered as the lesser of the trilogy undoubtedly.\\n\\nThe complaint at the length of the film\\, which is not an inherient flaw\\, is highlighted by the fact that the film has so many unnecessary subplots that feel shoved in.  It's not a stretch to say that these scenes were crammed in for the purpose of merchandise. Everyone by now is familiar with Porgs - the small cute penguin-pug like creatures and for better or worse they are in a lot of this film.  They however are not anything more than approprioate window dressing for the most part and some comedic levity. There are far worse examples in this film of scenes \/ characters \/ sections crammed in for the purposes of selling toys.\\n\\nSwing and a miss for me.","true":true}