{"101487":198638,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars movie ever.  Where is the heart and soul?  What they did to Luke Skywalker is unforgivable.  He is arguably the most powerful Jedi ever and they portrayed him as a total loser.  WTF?  His character is unrecognizable.  For those who have forgotten or flat out don't know he is the son of Darth Vader\\, trained by Obi-Wan and Yoda.  He was not left on Tatooine by a couple of space junkies who needed booze money.  Oh wait that is our \\\"new hero\\\" who can do no wrong.  Rey's character is ridiculous.  How they have portrayed her is a disservice to everyone.  Mary Sue doesn't even begin to cover it.  \\nI have so many questions.  Why did they set up so much in the Force Awakens just to abandon everything they set up?  For example\\, Kylo Ren force chokes a First Order officer all the way across a room when he tells him Finn and the droid escaped Jakku with a girl.  He obviously knows who the girl is otherwise he wouldn't be upset?  How does he know her?  Did he put her there?  Did he lie to Rey about her parents?  Who knows?  Apparently it doesn't matter anyway.  God this movie was sloppy.  \\n\\nThere is so much more but it would take hours to cover it.  They killed Luke too early.  This should have happened 2 or 3 movies from now and his death should be so badass he takes a couple of star systems with him.  They had 40 years of material to work with and we were given this farce.  I am so confused.  \\n\\nThis movie broke my heart but it will not break my spirit or love of the REAL Star Wars story.  My happy childhood is still intact.  I will just pretend  this hollow sloppy new sequel trilogy never existed.","true":true}