{"101487":158464,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not what I expected. Predictability isn't always a good thing anyway. This review has spoliers. \\n\\nOkay so first the cons:\\n\\nIt was expected by many that Luke would train Rey to become a great Jedi. Didn't happen. I would not expect to see Luke try to kill his own nephew. Even though he says Ben Solo had already turned. The way Snoke died was cool\\, but shouldn't there had been more. Snoke was supposed to be very powerful. Which leads to my opinion that the movie should have had one epic light saber fight. I thought Leia flying in space was kind of odd. I'm not saying the force couldn't cause this\\, but I would have wrote some other way for her to survive if it wad my movie. The casino was pretty cool\\, but the whole mission seemed like a waste. Sure somethings happened. Finn gets all the ladies or what? A few times we are shown that disobeying orders can be costly. Why such an emphasis  on this. What's with the light speed suicide attack thing? Are sheilds nit able to stop that and why didn't the good guys try this before. Why not put a droid on the vessel rather than letting a lifeform die. The whole chasing ordeal with light speed tracking and well really the whole part of the chasing and waiting doesn't add up to me. Seems like their are holes or the movie doesn't explain well. Lukes force hologram or whatever it was....well it just seems like he could have died some other way. Rey coming from nothing wss kind of a bummer. It would have been cool if she was a bad ass bad guy's grand kid or something. Admiral Ackbar needed more of a role. Okay. \\n\\nSo here are the pros. Very beautiful movie visually. Good soundtrack as always. Good acting for the most part. Actually\\, I thought Mark Hamil was great. Lots of surprises\\, it just wasn't very predictable in my opinion. Lots of new possible story lines. I have no idea what is going to happen next and that excites me. Action scens were pretty good for the most part. Some funny parts\\, maybe could have done without or done different.. Still laughed a few times.  Cool creatures. The porqs were a hit for sure. I have to say people shouldn't whine so much that it isn't going where they want it. It's a great movie\\, that leaves me thirsty for more.","true":true}