{"101487":175884,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi was terrible. Not just because it was a bad \\\"Star Wars\\\" movie. It was just a bad movie period. I will not pay to see another Star Wars movie after this.\\n\\nSpoilers. Ranked 8 of 9 Star Wars movies in my rankings. Hell people on Rotten Tomatoes gave Justice League a higher rating.\\n\\nIt wasn't just bad\\, it was stupid . Here are a lot of the problems (Many borrowed from Ben Shapiro)\\n\\n1. The Force Awakens Apparently Never Happened. At the end of the last movie\\, you'll recall\\, the Rebel Alliance blew up the Starkiller Base\\,\\ndevastating the First Order's capacity to make war. Or not.\\n\\n2. There Is No Gravity In Space. The opening sequence features bombers dropping explosives on a First Order dreadnought.\\n\\n3. Snoke Is A Throwaway. In the last film\\, JJ Abrams made a big deal out of this Snoke guy. Now\\, I'm not a fellow who spends a lot of time googling\\nwhether Snoke is actually Darth Plagueis or whether he's Mace Windu. But if you're going to build up a big baddie who has the power to seduce\\nKylo Ren to the Dark Side\\, completely override Rey's force abilities\\, and threaten Luke\\, you've got to tell us who the heck he is.\\n\\n4. Kylo Ren Isn't Intimidating.\\n\\n5. Rey's Backstory Sucks.\\n\\n6. Luke's Weird Farmer Life Is Weird. Did we really need a whole day of Luke going around milking an alien seacow and drinking it?\\n\\n7. Luke Is A Bad Teacher. Luke says that he's going to provide Rey three lessons. The lessons consist of him (1) telling her what the Force is (okay\\,\\nwe already knew that); (2) having her touch a rock and see the Dark Side (she's drawn in by it but not seduced). There is no third lesson\\n\\n8. Celebrity Cameos Make No Sense. Laura Dern with purple hair? Benicio Del Toro stuttering? What are these people doing here?\\n\\n9. Poe Dameron's Story Arc Is Foolish. Poe is supposed to be newfangled Han Solo. Fail. First off\\, there is no new Han Solo. Second\\, Poe is a\\ndolt. And Admiral Laura Dern\\, working with Leia\\, has a plan they could easily just tell Poe and solve half the conflict of the plot. Why keep it secret\\nfrom Poe? We never find out. Instead\\, Poe runs around like a moron\\, making stupid plans with Finn that have no actual effect on the plotline.\\n\\n10. Finn's Storyline Is Useless. Finn should have died at the end of TFA. He should have died at the end of The Last Jedi. Instead\\, he goes on a\\nrandom jaunt to Monte Carlo with aliens\\, and then rides a bunch of camel\/horse\/kangeroos to freedom while street urchins cheer. It's godawful. Then\\,\\nfinally\\, when he's about to do something useful\\, Rose stops him from doing it. Why is he here again\\, except to have awkward hugs with Rey?\\n\\n11. Rose Is Useless. Rose is added to the plot to give Finn someone to travel with and develop awkward romance with. But her presence is simply\\nnot useful. She doesn't do anything particularly special. She does give Finn a lecture about income inequality\\, though. So I guess that's something.\\n\\n12. The \\\"slow speed\\\" (in Star Trek terms sub-light) chase? seriously. \\\"Fuel\\\" has never been mentioned in 9 Star Wars movies (or the extended\\nuniverse or even the RPG). If Finn and Rose can jump away and back again the first order could have entered hyper space and jumped in front of\\nthe rebel ships. Hell apparently they could have went to another star system (and maybe gambled and drank for awhile) and come back in front of\\nthem or right next to them like Finn and stupid Rose.\\n\\n13. Captain Phasma Is A Nothing. She's apparently a white woman who wears a cool suit\\, and then Finn - a dude who five seconds ago was a\\njanitor - beats her. Welp.\\n\\n14. Luke Shouldn't Have Been A Hologram. Turning Luke into Obi-Wan Kenobe for purposes of the reset makes some sense. But his death made\\nnone. Why is it cool for Luke to survive a barrage from AT-ATs if he's not even there? Why is it cool for Luke to best Kylo Ren in a light saber battle if\\n(1) Rey has already done so\\, and (2) Luke isn't even there? They easily could have brought Luke there\\, and had him do exactly the same thing\\, but\\nsacrifice himself - or perhaps just fade away in front of Kylo Ren.\\n\\n15. The Powers Of The Force Aren't Magic. We learn that through the Force\\, you can now hologram yourself places\\, and that you can also survive\\nbeing thrown into space (Leia). Wut?\\n\\n16. Light Speed Can't Be Used As A Weapon. You can't destroy ships by flying at them at light speed. If you could\\, the entire first scene would have\\nbeen unnecessary (forget the bombers\\, just shoot an X-wing through that dreadnought)\\, and the Rebel Alliance could have taken down every Death\\nStar ever in the same way.\\n\\n17. Why Would Luke Try To Kill Kylo? He tried to save Vader after Vader destroyed a planet and cut off his hand. He sensed good in him. He\\nsenses evil in Kylo and for a moment wants to kill him? That seems like a mild stretch at best.\\n\\n18. There Are No Interesting Characters Left Except For Kylo Ren. So\\, now everybody's dead. Han's dead. Luke is dead. Leia was never that\\ninteresting\\, but Carrie Fisher died\\, so Leia can't stick around for long. That means we're left with the new characters - which is the point\\, since Star\\nWars can't survive on nostalgia forever. But Rey isn't particularly interesting - they just gave her a crappy backstory.","true":true}