{"101487":175605,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"“THE LAST JEDI”. NO SPOILERS. For some reason this is one of those movies that critics raved about but audiences have been (pun intended) Lukewarm on. First\\, I want to thank all the butthurt audience members who saw this and made me lower my expectations. I walked in not expecting much and was blown away. I absolutely loved it. I don’t know if people dislike the new characters or what. Personally\\, I love the new characters and there are a handful more new ones in this one that I love too. I’m not married to Luke and Leia and Han and Chewie like others are. I think the new actors can act circles around the old ones. They have a dynamic fire all their own\\, particularly Boyega and Driver and Ridley. Mark Hamill definitely gives his best performance of the entire series as Luke though\\, i will give him that. I hate to sound all PC but I also love the fact that there is a great bit of diversity in these movies too and new character Rose was one of my favorites. The effects are top notch and they seem more real than the ones in the prequel trilogy. I don’t picture the actors standing in front of a green screen. I also like the new creatures introduced like the porgs\\, the crystal foxes and whatever those long eared things are that race. Furthermore this movie is long\\, but to me it didn’t feel long. I was not bored for a second. It sets up the concluding chapter nicely with a raging ominous threat but also a good deal of hope. Seeing the dedication to Carrie Fisher at the end was nice too.","true":true}