{"101487":169600,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(SPOLIER FREE REVIEW) The Last Jedi...I am lost for words with how perfect this film was. Today I went to see it for the second time and just wow\\, this is truly my favourite Star Wars movie. Everything about it was magnificent!! But yes the movie had a few flaws here and there and this isn't a spoiler but I found the casino scene was actually great\\, it helped develop Roses character really well. Anyways from start to finish it is packed with action\\, amazing comedy\\, beautiful acting\\, and some of the best cinematography I have ever scene. Now let's talk about the characters starting off with of course Daisy\/Rey. Daisy was so much better than TFA in this movie and she showed her emotions so flawlessly and almost every line she delivered was so good and I really love the way that the movie built Rey. Adam driver...wow all I gotta say he stole the show but not as well as Mark Hamill\/Luke because Mark didn't just steal the show\\, he was the show! Mark was by far the best part about this movie with everything he did and I loved every part of Mark\/Luke in TLJ. John Boyega\/Finn and Kelly Marie Tran\/Rose we're so excellent in the movie but let's talk more about Kelly. Kelly really came through with this big role as Rose and she nailed it with powerful emotion portrayal and amazing line delivery. Oscar was just amazing with so many great\\, powerful moments that left me speechless. \\\"Hey aren't you forgetting the porgs?\\\" No I am not\\, I was saving the best for last (just a joke). All jokes aside though the porgs were actually really great in the movie\\, they weren't annoying like the ewoks and they had some of the funniest scenes in the movie and I just love em\\, they were put in at just the right moments. To conclude this. I really just loved this movie so much it was perfect to me and I know the audience is in conflict of if it's good or not right now but honestly for me like I've said it was perfect. Rian Johnson did an excellent job and I can't wait for his trilogy. I give Star Wars: The Last Jedi a 9.9\/10. One last thing for those of you who hated the movie because your fan theory weren't answered I just have to say we never needed any answers. We didn't need all of those fan theory's to be answered. Making a movie isn't about giving people exactly what they want\\, it's about giving people something unexpected but good and that's exactly what Rian gave to us.","true":true}