{"101487":193387,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Was a very disappointing movie for many reasons\\n\\n1) Poorly written script from a director with little no understanding of the previous star wars characters. EX.\\n\\nA) Luke\\, who redeemed Darth Vader(evil genocidal sith lord)  in the first trilogy\\, suddenly tries to kill his only nephew because his nephew showed dark side tendencies. Luke ended up turning darth vader back to the light side in the first trilogy. Luke shouldnt have been so scared of the dark side tendencies in his nephew when hes already dealt with this same problem in darth vader and was successful in turning vader back into the light side. He saw the hope of turning a full fledged sith back to the light side but just gives up on his nephew wasnt even a sith yet.\\n\\nB) Luke is a Jedi Master in the star wars universe. It is very out of character for a any jedi to resort to premeditated murder to solve a conflict. But in TLJ \\, Luke walks into his nephews room in the middle of the night while his nephew is sleeping to murder his nephew. The movie explains that it was a fleeting moment\\, but luke still had to sneak into his nephews room and also ignite his light saber. Doesnt look like much of a fleeting moment\\, looks more like planned out murder.\\n\\nC) Rey suddenly wants to team up with Kylo Ren after Kylo ren kills han solo in front of her and puts her best friend in a coma. She tells Kylo Ren hes a monster throughout the movie and then just poof suddenly she  wants to go team up with him with little to no explanation and weak reasoning.\\n\\n2) Director had no understanding of the already established rules of the star wars universe. In fantasy the rules of the universe are a part of the world building and is very important to the story. imagine if you are watching the next  marvels iron man movie and all of a sudden tony stark doesnt use an iron suit of armor anymore and he just shoots laser beams out of his eyes and flies around like superman all on his own. This would make for a shit iron man movie wouldnt it? If you are going to drastically change the rules of a set universe \\, you need to at least explain why and TLJ just fails on all levels.\\n\\nA) Rey beats kylo ren in a light saber duel. Kylo ren has been trained in the force for his whole life and Rey beats him the first time she picks up a light saber with no explanation on how shes so strong. In the star wars universe\\, to be able to use the force and light saber you need to train for a long time. Luke had to train with obi wan and Yoda before he was able to use the force.\\n \\nB) light speed jump should not be effective as a weapon. This becomes a giant plot whole because since this is possible why was it never used before? they could have blown up the deathstar with an x-wing if it was this easy. \\n\\nc) For Jedi violance\/killing is a last resort. Murder is out of the question. Luke as a jedi should not be sneaking into rooms trying to assasinate his nephew without trying everything else possible first.\\n\\nD) Force ghosts are just there for guidance and should not be able to call lightning from the sky. In TLJ Yoda's force ghost calls lighting from the sky\\, this does not follow the prev rules of star wars and is a major plot whole. If yoda can do this why not have all the force ghost come back and kill kylo ren and snoke.\\n\\nE) Leia who has never lifted a pebble with the force\\, can now super man through space. Even if they tried to explain it in the movie that she recieved training in the movie which she never did \\, this is just ridiculous. No jedi\\, not even luke is strong enough to fly around in space like superman. I think the director forgot what movie he was filming.  \\n\\n3) Iconic characters with random weak death scenes. we had closure for all of these characters in the first trilogy. They got their happy ending. Nad to find out that they never attained happiness after all they went through in the first trilogy is just sad. \\n\\nA) general akbar randomly dies from getting blown into space \\n\\nB) Luke dies randomly in an unclear way by force suicide.\\n\\nC) snoke is randomly killed \\, when no one knows his backstory in the most anti-climactic way possible. He is portrayed as almost invincible and then killed in the easiest cheapest way possible.\\n\\nD) Han gets murdered by his own son in TFA. \\n\\n\\nPlease dont support anymore disney star wars movies. Don't go watch them in the theaters because you are just throwing money at disney and they are going to keep giving you low quality films. We should as a united star wars community rebel and embargo all disney star wars movies. Lets make sure the next star wars movies don't make any money. Join the rebellion\\, lets rebel against disney for trying to destroy the soul of star wars. Just cause Disney says these movies are canon \\, doesnt make them canon. We the fans decide what stories we support and accept. That being said Try Timothy Zahns \\\"thrawn trilogy\\\" as the real sequels to star wars and forget this nightmare TLA and TLJ ever existed.","true":true}