{"101487":130204,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I consider this THE WORST of all the star wars films.\\nWhat the film focuses on more than anything else is racial diversity\\, feminism\\, blatant political messaging\\, which would be ok if the story was good enough to back it up. Spoiler alert - ITS NOT.\\nFirst of all the pacing is awful. The movie starts with action\\, then you are left bored for another 30-45 minutes but after that its like batmas vs superman all over again. non-stop action! action! action! intense music! intense music! intense music! its actually tiring to watch this movie. there are no breaks\\, we barely get any interaction between different characters and each others plotlines our characters do not progress or develop. Which brings me to my next point\\nThe character development is terrible\\, there is no integrity towards character personalities and there abilities. Luke isn't the Luke of old\\, Rey isn't the Mary sue of old\\, Leia is the most powerful force user of all and I hate kylo ren.\\, Ren's actor makes Hayden Christensen look like a god. Then there's the token Asian woman who follows the token black man around. What are her redeeming features? she isn't likeable\\, but she isn't unlikeable\\, she isn't smart\\, strong\\, fiery\\, charismatic or pretty she's just  bland. What does she do - she's on the meaningless token character side quest and gives background information. Just cut this character out. cut the whole token character side quest out and make Finn relevant again.\\nMissed opportunities\\nThere are things people find entertaining in movies regardless of whether or not they have become cliché. the last Jedi is abundant in respect to missing all the great opportunities for scenes which could have been great and offered a lot more pace for the movie.\\nMeaningless deaths- not saying who or how many but there are definite3ly meaningless deaths in this one.\\nKamikaze at light speed is officially the best cost effective weapon in the star wars universe.\\nBut the worst crime is that this doesn't feel like a star wars movie at all.","true":true}