{"101487":175396,"Last Jedi":"Last Jedi","2017-12-15":"2019-11-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is incredibly well directed by Rian Johnson. The way he handled the evolution of Luke and Leia was impeccable. The best performances Hamil and Fisher have ever given as their characters. Kylo Ren takes center stage even more so here in Episode 8 than he did in 7 and even better this time. Rey is amazing as always. Although I found her character slightly less compelling in this 2nd entry and felt Kylo took her place as the #1 in this film. I loved Luke training Rey. Amazing  storytelling. The editing was solid. The cinematography is the best it's been since The Empire Strikes Back\\, in my humble opinion.  John Williams score I liked slightly more than The Force Awakens. The twists and turns that this film takes us on\\, I found it to be incredibly refreshingly new. Star Wars needed something different and unexpected  like this to inject itself with new life. The Force Awakens\\, while a very good film and was well made\\, had been treading the line and seemingly crossed it with Starkiller base; too much striking familiar territory and I felt most the risks in The Last Jedi were very compelling and completely paid off with doing the antithesis\\, which appeased and worked effectively. A couple misses with the Canto Bite sequences. I enjoyed the planet and casino and the message they were sending\\, I just felt the character of Finn took one step back to move two steps forward. I like Rose a hell of a lot. Only thing that truly was dissatisfactory was Deltoro's character. I thought Rian could have done a better job writing him there\\, but hey taking risks means not all of them will always pan out like you wrote them and saw it in your head\\, but  minor ultimately in my eyes. The 'Throne Room sequence\\, now at this point is one of the greatest shot scenes ever put to a Star Wars film. The lightspeed moment is one of the greatest moments in any Star Wars film ever. Overall\\, thoroughly satisfying and the 3rd best made star wars film behind Empire and A New Hope.","true":true}