{"101487":188490,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was the worst star wars movie I have ever seen. I have been a huge star wars fan for years. I loved the originals and as a kid\\, was downright obsessed. I hated the prequels for the most part\\, apart from Darth Maul. And the Force Awakens was great in terms of characters\\, but the plot was identical to A New Hope. Rogue One was forgettable\\, except for Vader's scene. But this was by far the worst film I've seen. It was so bad\\, I am not going to see the next one in theatres. Here are 5 of the big reasons for clarity:\\n1) WTF was up with the \\\"snail race\\\" in space? Couldn't Hux just get in front of the ship and cut them off? or go faster and get close enough to blast through shields? We had a 1.5 hour snail race. Ridiculous\\n2) Rey and Ben having a intergalactic skype call? Come on. And on that note\\, Poe communicating with Fin when they are in light speed? Wow... radio must work great.\\n3) What was the point of Luke and the Island? Literally\\, nothing happened. Nothing was revealed. It would have been just as effective for him to refuse to be absent for the whole movie and then feel Leia's in trouble\\, and hologram himself to help her escape.\\n4) Rey had ZERO training but ripped through imperial guards like nothing and mastered the force for let out the rebels and allow them to escape?\\n5) Snoke was clearly a powerful force user\\, but couldn't sense Kylo betraying him? Come on... They should have had to work together to kill him and it should have been damn near impossible.\\n\\nAll in all... save your money if you are reading this. This is worse than Attack of the Clones except it is a lot longer and more meaningless.","true":true}