{"101487":169400,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers Alert!!\\n\\n\\n\\nFirst off let me say that this movie wasn't made for me. It was made to appeal to a new generation. From my limited sample\\, my teenage children that didn't like the original trilogy\\, it has succeeded. Disney hasn't become the behemoth that it is by being stupid. They are a corporation and their purpose is to make money. It would have been stupid to make a movie for us old Grognards. They want to make money lots and lots of money. To do this they need to make new customers. They are counting on the old customers hanging around and we will. Rogue One\\, Han Solo and Kenobi are for us\\, so Grognards unite and don't feel that you are being left out in the cold. \\n\\nThe movie seemed jarring from the opening scene. I realize it was supposed to. I thought I had walked into a Spaceballs remake at first. I asked my wife if this was a short that was showing before the movie started. \\n\\nExamining character in depth isn't Star Wars\\, or wasn't Star Wars at least. Star Wars is about action. Star Wars is about noble warriors saving the day. Star Wars is about hubris and tragedy. If I want to see character building and tearing down\\, I will go see one of the academy award nominations for the year. \\n\\nSo Rey\\, the main character of the new trilogy\\, is a nobody with no heritage? Ok\\, so that is pretty much my life. Why do I want to see a movie about that? My life is pretty boring and tedious. It would be one thing if they built her up as a noble warrior out to save the galaxy. What has she done? Did she kill Snoke? Did she turn Kylo to the light? She did follow the lure of the dark side so she could look in the endless mirror. She did steal Luke's books. If you are going to build up the nobody from nowhere that saves the galaxy\\, you need to let her be a hero. They managed to do that in the first movie of the original trilogy. She did manage to save the day by moving some rocks. Not quite the same as blowing up a planet destroying space station.\\n\\nIf you are going to destroy my childhood heroes\\, please do it with some style and not with elementary school humor. When Luke tossed his saber over his shoulder I got up to walk out of the theater but my wife grabbed my hand. When he wharfed down the green milk and the creature sat back and enjoyed it\\, there was something very sexual about it and it literally made me throw up a little. Luckily I had a Stormtrooper popcorn box to throw up in. Luke Skywalker the Jedi gigolo\\, really Johnson? I hate you!\\n\\nObviously the idea of this movie was to break down all the tropes of the previous Star Wars movies. There is a problem with that\\, the tropes worked and it created millions of fans. These tropes were part of the human mythology and they have been around for a couple years. \\n\\nBefore this movie Star Wars was a modern mythology. Now it's a character examination.\\n\\nUnfortunately I have already bought tickets to see it with my father in iMax. Maybe after a second showing I will come away with a better feeling towards the movie. I have my doubts.\\n\\nThe gave this hack Johnson his own trilogy? ","true":true}