{"101487":103916,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"An ordinary addition to the franchise that feels like a passing of the torch from the original trilogy.  Star Wars is now primarily for a younger generation but we \\\"old timers\\\" can still tag along for the ride if we choose to.  At the conclusion of the film you have visited a couple more planets\\, witnessed a few more battles\\, introduced to a couple new character and say goodbye to a lot...surprisingly a lot of characters (both old and new)\\, and the film ends on a reset.  The sith is dead but the dark side has a new dark lord\\, the jedi ways have been burnt away but the light side has its young champion and may yield another generation of followers\\, and the rebellion is now under the control of a brash\\, young x-wing fighter pilot. \\n\\nIt is obvious this film did not intend to be bogged down by all the questions that were raised needlessly by the previous episode in the series and decides to either give simple answers that will likely disappoint those Youtube theorists or simply brushes those questions aside. I for one took a twisted pleasure in the way the director Rian Johnson just threw all of that to the side and focused on his own story about the regeneration of the battle between good and evil. Unfortunately\\, Johnson didn't have anything new or exciting to offer. Quite frankly\\, it's rather bland for Star Wars.\\n\\nMy personal concern is that the Disney Star Wars is being used to discourage boys from embracing traditional male concepts of heroism and valor.  Since Kathleen Kenedy has been at the helm there has been no strong male lead characters to come out of these movies and the classic male heroes of the past have fallen from grace (Han is a failed father\\, Luke is a failed teacher). Its as if the original goal of these films to provide examples of heroism has been turned on its head. Everything is jaded...even in the Star Wars universe.  But I suppose there is still hope.","true":true}