{"101487":114574,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Dazed and confused\\,\\n*Spoilers*\\nWhere do I begin...first off how did Disney pick this director?\\nWhat other movies has he done for him to get the honor to make a star wars film?\\n\\nWhere was Luke Skywalker? You remember The Jedi that turned him self in to Vader and the emperor and took them both on.(recycled in this movie) I get you want to kill the majority of them off\\, that's fine; just the way you guys did it was.. well just lazy!\\n\\nWhat was the point of snoke?\\n\\n Humor was horrible and awkward \\n*Spoiler* Disney will make Chewy a vegetarian.. that scene made no sense\\, hey I'm cooking some meat over an open fire and all of a sudden I get a heart and won't eat it \\nhow did Chewy get that meat prepared?maybe there was a super market they did not show us\\, a big mystery.. like snoke!\\n\\nFor Disney wookies don't rip arms out of your sockets..they give big hugs and fart out rainbows.\\n\\nYou know what would have really been a Breath of fresh air... Create a new star wars trilogy from scratch\\, you have this huge universe where the imagination is limitless\\, but instead you crap all over the characters we fell in love with.\\nLet's remake some classic Disney movies and crap all over those characters. \\nDisney and that lady Lucas made president will be the Death of Star Wars.\\n\\nFor me\\, The last Jedi and Rouge one was the worst Just by those 2 movies you can see the direction they are taking\\, boring and stale.. If I was Disney I Would bring in Peter Jackson or James Gunn\\, pay them the money!","true":true}