{"101487":142075,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Its a confused mess.  Follows in the \\\"grand\\\" tradition of The Force Awakens by cherry picking ideas from the original Star Wars Trilogy but this time injects its own narcissistic approach.  I guess Lucas started it when he put a skeleton of a sand-worm on the desert planet as a insiders FU\\,  we werent watching Dune\\, and JJ did it to Lucas by putting the skeletal wreck of a star destroyer to say the same to Lucas.  Blowing up JJ's resistance base at the beginning\\, FU number 3...Now for the third time\\, Star Wars becomes more about the directors own \\\"vision\\\" of that galaxy far far away rather than staying true to any consistent ideas...  I felt that I had already seen this movie\\, the rag tag fleet being tracked by the cylons in the more recent Battlestar Galactica was handled much more intelligently.  snow speeders vs. sandspeeders\\,  Casino planet vs. Cloud City (which was a casino destination in the books)\\, 2nd act of a trilogy where everything is kinda left in ashes and hope is fading... isnt that Empire?  Mark Hamill is clearly not happy with what happened with Luke for good reason.  Poe's character comes across as a naive wannabee instead of an accomplished leader of a guerilla resistance.... Admiral Ackbar is replaced by Laura Dern\\, why?  Princess Leia is replaced by Laura Dern\\, why?  Since when did \\\"fuel\\\" become a plot point in Star Wars?  JJ's mystery boxes apparently aren't even mystery boxes if the box is never opened...Just sooooo many bad decisions for basically a boring and nonsensical ragtag fleet running way last stand.  Luke at the end is totally channelling Chuck Norris in Ultimate Epic Battle Simulator... \\nThe other Star Wars movies werent perfect but Force Awakens and now this mess... its like they have all the action figures but they never understood what it was all about....","true":true}