{"101487":187847,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was an interesting Star Wars movie. The story follow a certain logic and push it to it's limit. The characters are flawed in that story almost all of them\\, and I would say it's the theme of the story. Most of the movie is on a timer\\, which make every scenes counts in terms of pace. But you go to Rey and Luke from time to time\\, which slow down the timer. It's like watching two movies with two different paces\\, that get to assemble in the end. That's an unusual style and some might not like it\\, but it works well in my opinion. The FX are all amazing from space to on planet. Some of the distant scenes between Rey and Ben\\, later Luke are done with simplicity and are very efficient that way. Even the creatures feels more organics to their surroundings. I found interesting that some powers can be used in both ways. There might be debates that Luke in the end use a power from the Dark Side. But like he implied they are not all exclusive to one side of the force or one person. In the end\\, I wasn't very satisfied with Rey parentage or lack of good explanation regarding her powers. Although Yoda says she already know everything...at this point any explication would come too late to be satisfying. I wasn't badder by any critters\\, I didn't mind them. They provided good humor at key times\\, in a very serious film. But there was a lot to digest in this movie\\, maybe too much...The role of Del Toro was a little bit out of place but yet logical in the circumstances. His role was intriguing and very well acted on his part. I would love to see more...That was a fun movie to watch\\, and I guess I will understand it better on second watch. I give it a 85%.","true":true}