{"101487":170370,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars the last Jedi was a good Disney movie\\, even a good MARVEL movie but not a good STAR WARS movie. It shits on continuity. The new trilogy doesn't live in a vacuum\\, it has a wealth of history and a solid past included with it the well established characters. It was hard to believe that the characters from the original trilogy would act that way. It felt like it was dishonoring their history\\, their character and their victory. This movie also robs us from a much wanted resolution from all the mysteries and questions they set up for us in FORCE AWAKENS. It took everyone and all the fans to question who Snoke was to be met with a movie that doesnt even come close into answering or giving a care to answer that question. The beauty of Star Wars is the lore\\, the story and the depth of its world-building and we just didn't get that here. Also\\, the characters in previous Trilogies like Anaking and Luke \\, regardless if they were considered strong in the force HAD to have gone into some form of training and here we just see Rey beats a well trained enemy in Kylo Ren easily without training. This movie really just shits on established rules in the Star Wars universe. Not to mention how every scene was a wisecrack. There were too many forced jokes that it robs the audience from feeling the seriousness of the situation. Also forcing to include a new character just to be played by an asian as a move for Disney to reach more demographic is appaling. The character wasnt really integral to the story so is her forced love story and also the whole \\\"side-quest\\\" story that just took us out of the action of the main story. I can go on and on about my dissappointment but like snoke's death\\, i'll just leave this all cut in half and left unnanswered.\\n\\nStar Wars the last  Jedi \\, great visuals\\, great score\\, and a great MARVEL Guardianss of the Galaxy type of movie but a bad movie for Star Wars.","true":true}