{"101487":105496,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As bad as the movie is with the many valid reasons people have expressed for not liking it\\, when the dust settles I think this movie will be seen as an impostor: Being advertised under the Star Wars brand but without the heart and soul of the original movies. What's even worse is the fact that Star Wars has now become a politicised propaganda weapon to influence the minds of the young. \\n\\nThe OT became so popular because at its core was a simple story of the archetypal struggle between good and evil told through the intergenerational relationships of the Skywalker family. It's no accident that George Lucas was able to craft such a powerful story. He was an excellent student of Joseph Campbell and anyone who's read Campbell's 'The Hero With a Thousand Faces' will have gained a deeper appreciation of not just the OT\\, but story-telling in general. Hollywood has either become incapable\\, or more likely\\, unwilling to produce stories that emotionally resonate with audiences as they don't want to inspire\\, only to mindlessly entertain. This is at the core of the continuing decline of Hollywood. The same desolation has occurred within the music industry over the past few decades.\\n\\nAs a vegan I care deeply about animal welfare\\, as I'm sure the vast majority of carnists do as well. However\\, the scene with Chewie and the roast porg totally undermined the characterisation of Wookies. As Han Solo told the droids in A New Hope\\, Chewie had been known to pull people's arms out of their sockets for no other reason than mild irritation. Did this scare you as a kid in the 80s? Or course not\\, it made the Wookies seem more formidable as allies in the fight against the seemingly unstoppable evil Empire. Disney's infantilisation of children does them a disservice in the long run. \\n\\nIn many ways this is a movie of its time\\, wheres the OT is timeless. The great hope is that Generation Z will see the effect that cultural marxist poison has had on the Millennial generation and become immune to the propaganda. There is hope that this is happening already. \\n\\nI'll finish with a note about the character assassination of Luke and will echo what another reviewer stated\\, 'The obvious deliberate deconstruction of one of the most positive male archetypal characters of the last 50 years within popular culture is a cultural marxist's wet dream.' Stories about idealised heroes following their own Hero's Journey are as old as culture itself. Myths help us to understand our own natures as we struggle along our own journeys. Disney going their own way with new characters within the SW Universe is fine but not if it means the destruction of what came before. Nothing can justify what they did with this beloved character.","true":true}