{"101487":169396,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers ahead. You have been warned. \\n\\nTL;DR - Terrible script\\, glaring plot holes\\, a few amazing moments overshadowed by a pile of shit that rivals the pile you see in Jurassic Park 1. Hopefully JJ Abrams is able to salvage something from this monstrosity you released\\, Rian. \\n\\nAwful movie. I've seen all the others previous\\, including The Force Awakens and Rogue One. Enjoyed them both. This one? That scene where Luke Skywalker tosses his own lightsaber behind his back after Rei hands it to him? Pretend he's Rian Johnson and put JJ Abrams in Rei's place. Now visualize the lightsaber as the script. That's what this movie felt like. Plot holes galore\\, exceptionally poor CGI (looking at you Yoda)\\, forced and displaced humor\\, an unnecessary and out of place swooning moment between Finn and Rose\\, and Snoke...the most useless bad guy in all of Star Wars. Save your money and your time. Two and a half hours and this is all you could come up with\\, Rian? Really? Your movie Looper was amazing. What the hell happened? Why would Holdo keep her plan hidden from Po? That was also unnecessary. How did the Jedi texts make it onto the Falcon? And now\\, with so many defending her character\\, it turns out Rei really is just another Mary Sue with absolutely no significant backstory\\, alluding to \\\"anyone and everyone is special\\\" mentality. If that turns out to be the case\\, then the word special has now lost its meaning.","true":true}