{"101487":134531,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left the theater in a strange mood\\, confused\\, not really knowing if I wanted to see the next installment.  I may\\, only because JJ will direct it... but I hope he gets NEW script writers...\\nWhat was Snoke's purpose? How did he get those scars? Why was driving him to destroy the republic?  Why did he have so many followers? How did he turn Kylo?  Apparently the writers didn't care about that storyline... so they didn't even give him a good death scene... no Luke vs Snoke moment...\\nLuke's legacy is... the writers didn't care about Luke\\, they butchered Luke and depicted him as a coward child murderer.  Did they read episode4\\,5&6? No wonder Mark Hamill expressed his disagreement.  I agree w\/him. \\nRey? Her story is less interesting than ever before.  I could care less if she dies as Snoke did because she is boring as a main character.  Jedi training?  Who needs it! Anyone can use the force w\\o training.  Rey is doing things that other Jedi's struggled w\/for years.  Luke could barely lift rocks while training w Yoda\\, but Rey picks up a bunch of heavy rocks like nothing... it's ridiculous.\\nThe best character of the last Jedi is... Kylo REN.  I want that guy to kill the resistance and see what happens next.  He is the most complex character in the 9 Star Wars films thus far.  Mark Hamill was amazing as well\\, even with the horrible storyline that was forced on him.  I don't know why they made him disappear at the end... I think that was dumb but then again there are many other dumb scenes...\\nThere are many half thought out scenes in this movie that I am gonna pretend I never watched it.  I hope JJ can fix this... gosh... what a mess.\\nEsta es la peor película de Star Wars que haya visto.  Porque?  Porque Luke no es un asesino de niños\\, porque Luke nunca haría las cosas que nos quieren hacer creer.  Los escritores no leyeron el episodio 4\\,5\\,6. \\nY Snoke? Todo el misterio de Snoke fue a la basura\\, y Fin? Y el code breaker? Y la nave de la galaxia lejana que no tiene piloto automático y requiere q alguien se quede para disque pilotearla y Leia ... en el espacio flotando y peor aún la tripulación abriendo puertas de naves en el espacio como si estuvieran en el planeta tierra... está película es para el olvido... casi una hora y media de escenas que no tienen relevancia.  Rey se mete al agujero según del lado obscuro de la fuerza y para qué? Para nada... no pasó nada... y Snoke que según era un master de la maldad pasó sin pena ni gloria. Y Fin se olvidó de Rey y según se enganchó con un personaje irrelevante... y Yoda? Apareció para q la gente se olvide de las otras escenas... y Obi One? No le habló a Luke para nada... \\nhay buenas escenas? Si las hay.  La batalla en el planeta de la sal\\, el casino estuvo interesante pero como q no computé como fue Fin hasta allá mientras los rebeldes trataba de escapar... en Fin ir a la velocidad de la luz ... bueno... \\nOJALÁ JJ pueda arreglar esto","true":true}