{"101487":195450,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What a terrible movie. I saw it a couple weeks ago and the bad taste still lingers. I cannot believe it sits at 50%. Just take a bit of time to go thru the audience reviews. It would appear that it should sit around the 25 to 30% mark. I guess Kathleen Kennedy and Rian Johnson hate capitalism and the Star Wars fans because they sure took a dump on us. JJ rehashed a New Hope in TFA but in doing so\\, created some interesting characters and questions. Rian just says to us\\, \\\"who cares about creating a story\/ plot that makes sense. Who cares about continuity and let's kill the original trilogy mythos while we are at. And most importantly\\, let's not give the fans Luke; let's destroy him and everything George Lucas created.\\\" I guess for me and my kids\\, my friends\\, and my extended family\\, Star Wars died after TFA. I only know one person who told me the movie was good. Of course the folks on Rotten Tomatoes who like the movie will call us trolls or Russian bots for having an opinion but that is ok\\, everyone gets an opinion. Before I see what JJ cooks up in Episode 9\\, I will make sure I read the audience reviews and not what the \\\"critics\\\" say. Finally\\, as far as the new Rian \\\"SJW\\\" Johnson trilogy is concerned\\, there is no way in hell I will pay to see it at a theater\\, redbox or bluray. I will leave that film to the new generation of Star Wars fans. They might be amazing movies and I hope they are but I would feel like a traitor to the Skywalker's if I support Rian's ideology.","true":true}