{"101487":179393,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The train wreck awakes. *Spoilers* If you don't want spoilers skip to the conclusion at the bottom.\\n\\nThe dialog is so forced that\\, at times\\, it is physically painful. \\nThe story is unbelievable.\\nThe characters are forgettable.\\nThe heavy handed political agenda is thinly veiled.\\nThe musical score\\, which is usually excellent\\, fell flat in some places and felt wrong in others.\\n\\nApparently\\, someone decided to prove the Infinite Monkey Theorem with this movie's story and it failed horribly. They did however succeed in destroying everything that fans used to love about the Star Wars franchise. Not since Jar Jar Binks have we had a character as pathetic as Finn.\\n\\nImmediately after a completely an unbelievable battle and escape from the first order\\, we are treated to Luke acting like a petulant child and Emo Ren throwing a literal tantrum over he daddy figure's understandable disappointment in his loss at the hands of a girl that had never held a lightsaber before. Fully half of this movie is people behaving like overgrown children\\, ignoring logic and reason and staring in sullen silence. \\n\\nLeia saving herself from her impromptu space walk by using the force is ridiculous and absurd. It was at this point that I knew for certain that Star Wars was dead.  This was soon confirmed by the announcement of the deaths of all of the iconic leaders of the rebellion from previous films. Much like Game of Thrones\\, this movie will kill every character you have ever loved. \\n\\nThe person that takes Leia's place while she recovers from what would have killed a xenomorph? General Gender Studies. With purple hair and all. Our introduction to this character is by way of a thoroughly boring \\\"inspirational\\\" speech and acting like middle school bully to the best pilot in the rebel fleet. Her aloof and pompous attitude sours the audience on the character within the first 30 seconds.\\n\\nFinn continues to bumble around like Jar Jar on a battle field until he's caught by the cleaning lady who\\, for some reason\\, the writers (see Infinite Monkey Theorem) are trying to force us to accept as more than just filler. \\n\\nThe cleaning lady and Jar Jar figure out how the space nazis are tracking the rebels through hyper space and come up with a plan the stop them because of course they do but instead of taking this info to General Gender Studies\\, they take it to the emasculated pilot who is in semi-disgrace. Makes perfect sense.  Pilot man decides that the acting leader of the rebellion doesn't need to know about the plan because she won't be needed to give the order to burn up the rest of their fuel later and remember that we are ignoring logic and reason. \\n\\nYou may have noticed that I haven't mentioned Rey at all. That's because her character is very forgettable and barely has any role in the \\\"story\\\" until nearly halfway through the movie. Out of nowhere and with no real explanation\\, Rey turns out to be insanely strong with the force. Don't ask why\\, they wont tell you. Emo Ren asks Rey an excellent question \\\"why is the force connecting us?\\\" to which Rey responds by hurling insults and rubbing her beating him to Luke in his face like a triumphant 4 year old.  \\n\\nNow back to the grand adventures of Rose: Rebel Cleaning Lady because that's the only way they can try to drag the plot in some what of a forward direction. For some reason\\, the cleaning lady is in charge of the mission to find a code breaker that can get the rebels onto the capital ship so they can turn off the hyper space tracker and the rebel fleet can escape from the space nazis. Bond villains come up with plans less ridiculous than this. Firstly\\, the rebels are running out of fuel. The movie makes sure to drill this point home several times but we are meant to believe that  the cleaning lady and Jar Jar are going to have time to hyper space out to a planet (without anyone noticing)\\, find 1 random hacker at a craps table\\, and get back before the rebels run out of gas. Give me a break. Secondly\\, we are supposed to just except that General Gender Studies has no plan of any kind and is just going to keep limping along until they run out of gas and get blow out of the sky. Despite the purple hair\\, I find it impossible to believe that she would just sit and do nothing. This of course means that when the cleaning lady and Jar Jar get back either the fleet will have tried to take on the space nazis and lost or they will have tried to jump to another sector\\, run out of fuel and been blown out of the sky. Upon reaching the planet\\, we are treated to a lecture on the evils of capitalism and the cleaning lady says something about wanting to punch a whole city. \\nThrough flash backs we get a little bit of Emo Ren's back story and why Luke has cut himself off from the energy that binds everything in the universe together. As if that's even possible. Just when we think we might figure out what the hell is going on\\, they cut back to the rebel fleet doing absolutely nothing and  losing a ship because of it. \\n\\nBack to the cleaning lady and Jar Jar\\, who get arrested for a parking violation and they just happen to be thrown into the same cell as the hacker they were looking for. They escape because reasons and proceed to steel alien horses which they use to destroy the vile hive of capitalism and villainy. \\n\\nMeanwhile\\, back on planet Irish island\\, Luke pokes Leia in her coma for no discernable reason and Rey calls Emo Ren on skype to talk about their parents. I fell asleep during that part so I can really comment. When I woke up Rey found herself in a carnival fun house that was trying to talk to her but never said anything clearly so we're all left wondering why we paid money to see this. Emo Ren and Rey have an unexplained skype call where they shake hands before Luke walks in like a dad catching his daughter cyber sexing with her boyfriend. Rey then kicks the crap out of the most powerful Jedi ever and storms off. Enter Yoda\\, laughing lord of lightening. Yoda somehow burns down the ancient Jedi library and tells us all that Rey already knows everything in the books he just burned because reasons and proceeds to Rafiki Luke.  Everyone cringes and we move on as quickly as possible. \\n\\nThe story jumps back and forth so often that it's difficult to follow but at least they are starting to converge back into some semblance of a plot. Don't get your hopes up\\, the story doesn't get any better.  Pilot man launches a mutiny (rightfully so) against the do-nothing General Gender Studies\\, the hacker\\, cleaning lady and Jar Jar steal  uniforms to sneak around on the capital ship and General Gender Studies and Leia defeat the mutiny handily and then the hacker sells out the rebellion even though he had no time to strike a deal with the space Nazis. We soon find out that Darth Smeagol is the ceo of skype and has been connecting Emo Ren and Rey to set up a convoluted plan to kill Luke that would once again put any Bond villain to shame. It of course worked flawlessly. \\nAt this point I feel it necessary to mention that Colonel Gingersnap slaps like a girl. After treating pilot man like a child and trying to slip away in the transports Leia and General Gender Studies find out that their plan is complete crap when the space Nazis start blowing up the undefended transports one at a time. Darth Smeagol monologs for what seems like hours and then\\, in a complete rip off of Return of the Jedi\\, Emo Ren is swayed by the pleading of Rey while she's being tortured and kills Darth Smeagol. Hey! It worked for Return of the Jedi so let's just do it again. Emo Ren and Rey\\, BFFs forevs\\, beat the crap out of the worst in a long line of horrible \\\"elite guards\\\" and Rey gets her heart broken because Emo Ren wants to start his own club and wants her to be the first member but she still wants to be a Jedi.  Rey somehow survives General Gender Studies flying the command ship through the entire space nazi fleet at hyper speed. Don't ask how\\, they won't tell you. Somehow\\, just about everyone on the space nazi's ships died except the characters we're supposed to care about. Disbelief is too weak a word. \\n\\nFrom here it just gets silly. The ball droid steals chicken walker and shoots up the rest of the storm troopers except Jar Jar's old commander who Jar Jar beats with a stun baton and they all escape like this crap is believable in any way. \\n\\nThe rebels hole up in Hoth 2.0: This time with salt! Hey! It worked in empire strikes back. This time they're flying rusted out garbage cans and for some reason that the writers didn't feel like explaining\\, the cleaning lady is piloting one of the garbage cans. Don't ask questions\\, you won't get any answers. Chewy and the fur-penguins show up just in time to turn the battle that the rebels should have lost within 30 seconds and\\, like lemmings\\, the space nazi fighters all chase after them because reasons. As usual\\, rebel pilots start getting killed off like red shirts on an away mission until only the main characters remain. Finn tries to heroically sacrifice himself to destroy the land cannon that the space Nazis just happened to bring along but is stopped by the cleaning lady who wrecks his speeder and then sexually assaults him before passing out.  The cannon goes off and the rebel fortress is cracked open like an egg.\\nLuke shows up via astral projection\\, hands Leia a set of dice that means precisely nothing to the audience and walks out the front door as if he's going to lightsaber the Nazis to death and Emo Ren decides to do the first sensible thing since his character was introduce by firing every gun on the planet directly at Luke. This of course doesn't work because the director hates us all. Jar Jar drags the cleaning lady past all the space Nazis and through the front door that is red hot and we're meant to just except that no one saw them or tried to stop them. The rebels find a way out of the strong hold even though the made sure to tell us that there was no way out and escape on the falcon after Rey figures out how to lift rocks. Luke monologs for a while waiting for Emo Ren to figure out that he was never there and then dies of boredom and disappears. He probably went to go find the Disney CEO and ask why they hate Star Wars fans so much. \\n\\nConclusion:\\nSo let's sum up. 99.99% of the rebels are dead. All the characters that you know and love are dead. There is no galactic senate. Darth Smeagol is dead. Rey has had about 15 minutes of Jedi training but somehow she'll be the one that brings balance to the force even though everyone else that has tried to fulfil the prophecy has screwed it up. The rebellion is down to one ship\\, the falcon\\, and they don't even have a hidden base to run to. Colonel Gingersnap is now Emo Ren's personal punch line and we are meant to believe that the silver storm trooper is dead but she'll be back later on to add manufactured conflict to some future abomination that bears the Star Wars name. \\n\\nDo not waste your money seeing this in the theatre. Don't buy the overpriced Bluray. Wait until it comes out on Netflix and skim through it. This is 2 and a half hours that you will never get back. You have been warned.","true":true}