{"101487":110851,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Boy oh boy\\, turning to my partner as the credits rolled with apprehension hoping his expression mirrored mine of confusion\/disappointment. \\n\\nCredit to the impressive chemistry between kylo ren and Rey. Their storyline\\, the underlying question of good versus bad and a hunger for power but also companionship\\, was the best aspect of this very disjointed episode. \\n\\nWay way too much cringe worthy humour that fell flat without the level of wit and craftsmanship we've come to the expect of the star wars saga. Look being honest I'm all for a cute animal sidekick to give me a little guy to love on in otherwise tense moments. But the little owl\/otter\/guineapigs were weird\\, and unfortunately a glaringly obvious push at merchandise for Christmas sales...\\nAlso Pokemon'esk ice foxes? Bb8's odd ability to disappear and then reappear commandeering an impressive piece of machinery and conveniently destroying all obstacles when all hope was lost?\\n\\nI picture the conversations leading to this movies plot arch. Imagine a start and a finish\\, but everything in between felt inconsequential to me.\\n\\nThe fact that (spoiler) Finn can fly his way towards the centre of a giant cannon to sacrifice himself for the resistance\\, and I felt nothing is a apt symbol of what little emotion and connection I had to the previously engaging and enjoyable characters of this trilogy. Also rose? I'm into all the strong female characters now present in the star wars franchise but? Did we need a love interest for Finn? A conveniently placed accomplice to give our leading man a story to balance reys exciting arc? It didn't work.\\n\\nA lot didn't work. And yet I'll be back for the next one. \\n\\nIt felt lazy\\, very lazy but very long?","true":true}