{"101487":186462,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was dreadfully awful.  There were so many holes\\, bad jokes\\, let downs and disappointments.  I understand its Science Fiction and certain concessions need to be made but the movie asks the viewer to throw all common sense\\, prior knowledge\\, and legitimate questions to the side.  What were those bombers?  Don't bombs need gravity to fall\\, wouldn't they just float into space? Why was Leia floating frozen through space only to be able to use the force to superman herself back to the ship?  Finn and Rose's plan was foiled because of a parking violation?!!  They must take parking on the beach really seriously on that crummy casino planet.  Snoke\\, who controlled the minds of Ren and Rey who weren't even on the same planet\\, got caught off guard by a light saber sitting right next to him?  Who was Snoke anyway?  I thought Rey was going to explore the Darkside down that hole\\, but instead it was a Coney Island funhouse mirror.  I could go on and on but it is the overall poor and lazy plot lines that go nowhere that kill the movie.  Oh and the criminally poor treatment of Luke Skywalker.  They pretty much spit on the ultimate hero for an entire generation of kids.  I understand the movies need to  forward but come on!!  He's some vaguely jaded guy that comes back around to die in order for the rest to run away.  Luke (and Hamill) deserved better.\\n\\nI'm not some super fan and I don't have any insights or opinions as to the casting or possible political implications of the movie (which I have read are explanations to the poor viewer ratings).  I'm just someone who grew up with the movies and was expecting a good solid movie after XII.  To say this movie was a disappointment is an understatement.  It was garbage on all levels.","true":true}