{"101487":164909,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Review is in German \/ Deutsch:\\nIch bin ein Star Wars Fan der ersten Stunde und habe in den 80er Jahren die erste Triologie geschaut und geliebt. Das was nun mit Star Wars: The Last Jedi passiert ist\\, haben denke ich\\, die meisten befürchtet als Disney das Ruder übernommen hat. The Force Awakens war \\\"noch in Ordnung\\\" und hat relativ gut ins Star Wars Universum gepasst\\, aber mit \\\"The Last Jedi\\\" hat Disney das SW-Prinzip komplett über den Haufen geworfen und versucht nun eine Art Kinderfreundliche Geldmaschinerie aus diesem Franchise zu machen. Zudem ist man sich bei Disney scheinbar über den Ton und Zukunft von Star Wars absolut uneinig\\, da viele Aspekte in SW8 direkt dem widerspricht was man in SW7 zu sehen bekam. Anfangs dachte ich wirklich ich sitze im falschen Film und bin zufällig in eine unbekannte Aufführung von Spaceballs 2 geraten. Diese Art stupider kindischer Scherze gehören nicht in einen Star Wars Film\\, vor allem wenn sie eine ernst gemeinte Szene einfach in Luft auflösen und das direkt zum Start des Films. Was sollte das mit dem KasinoPlaneten? Völlig unnötige unwichtige schlecht inszenierte Nebengeschichte die nicht in diesen Film passt. Luke ist mittlerweile ein perverser Monstertittenmilchsauger geworden der zudem scheinbar sein komplettes Jedi-wissen über Bord geworfen hat und Kylo Ren erschaffen hat weil er ihn eines Nachts umbringen wollte? Es aber dann doch nicht tat? und deswegen haben wir jetzt einen neuen Bösewicht? Der gesamte Film hat mir kein Stück gefallen und ich werden keinen weiteren Star Wars mehr sehen bzw. kein Geld mehr dafür ausgeben. Mal davon abgesehen\\, dass die eingestreuten politischen Messages wie \\\"Rettet die Tiere\\\" oder \\\"FRAUENPOWER 4theWIN\\\" und \\\"VORSICHT VOR DER BÖSEN WAFFENLOBBY\\\" in Star Wars einfach nichts verloren haben. Dieser Film ist ganz einfach nicht GUT. Er hat eine unlogische irrationale Story\\, schlecht geschriebene Charaktäre wie zb. Ray die scheinbar die Superfrau des Jahrtausends ist und ALLES ohne Training kann oder Fin\\, der einfach nur noch eine Witzfigur ist oder Rose die die ganze Zeit nur Scheisse baut wie zb. Fin davon abzuhalten einen heroischen Tod zu sterben um seine Kameraden zu retten. Ende vom Lied war dass SIE sich opfert damit ER sich nicht opfern kann und das Imperium letztendlich die Basis stürmt. Welcher Depp hat sich denn diesen Mist ausgedacht? Wieso ist Luke nur ein Hologram wenn er doch sowieso sterben will\\, wieso ist er nicht persönlich aufgetaucht? Wer schreibt denn so einen Dreck? Ich frage mich ausserdem ernsthaft\\, nicht OB sondern in welcher HÖHE die meisten \\\"Kritiker\\\" hier auf Rotten Tomatoes von Disney entlohnt wurden um über diesen ganzen Schwachsinn hinweg zu sehen und diesen Film 4 oder 5 von 5 Sternen zu geben? WIEVIEL? 1000 Dollar für Youtuber? 10.000 Dollar für angesehene Kritiker? Was ist hier los? Wie kann es sein\\, dass Kritiker einen Film mit mieser Story\\, ohne Charakterentwicklung\\, irrationalen und unlogischen Handlungselementen\\, so eine hohe Score geben? Die Zuschauerwertung mit UNTER 50% entspricht da schon eher der Wahrheit. WAS IST HIER LOS?","true":false}