{"101487":152616,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Luke\\, the most beloved character of the franchise:\\nDoes nothing.\\nRefuses to do anything and help others.\\nMakes a plan for people find him when the time is right (TFA) \/ When they find him he refuses go help but also says that he went away just to die. What the hell?\\nAlmost kills his own nephew because of the \\\"growing darkness\\\" in him.\\nIs such a pussy that never even leaves the island planet to confront Kylo.\\nDies inexplicably because he sweated too much?\\n\\nLeia:\\nRocket powered SuperLeia engages!\\nShe should have been the one who sacrificed for the resistance.\\n\\nRey:\\nShe's inexplicably badass with the lightsabre and the use of the force with zero to none training.\\nShe's no one and her lineage is just stupid to believe. So anybody can be a jedi\/sith?\\nThe mirror scene is just stupid. Cool looking but doesn't explain anything.\\n\\nKylo Ren:\\nBest character performance. I don't really like him but Adam Rider did better than in TFA\\nHis backstory is short and also predictable. No surprices.\\nWhen you think that he's close to becoming a good guy\\, he goes back to the darkness as predictable.\\n\\nSnoke:\\nWho the hell is him? Not explained\\nIs super powerful and can connect two force users to have a Skype call\\, but dies in the most stupid way... why didn't he see the lightsabre moving?!\\n\\nFinn\/Rose:\\nTotally unnecessary plot.\\nRose is in love for no reason. Just because Finn is a hero?\\nFinn is not in love with her and it shows.\\nFinn could have been remembered as a true hero who sacrificed himself\\, but no.\\nThey both go in an adventure that ultimately has zero meaning to the movie.\\n\\nBenisio del Toro:\\nI don't remember the character's name.\\nDoes nothing and ends up being a scammer.\\nTotally wasted character\\n\\nCaptain Phasma:\\nTotally wasted character\\nReflects lasers with her armor. Why not give that to all stormtroopers?\\nSays 4 lines at most in all her existence.\\nGets killed stupidly by a non-trained ex storm trooper.\\nHas every chance to get rid of Finn and does nothing.\\n\\nChewie:\\nDoes nothing. Damn he didn't even eat that penguin thingy\\nHis inclusion in the movie is irrelevant. Hess there because he's Chewie.\\n\\nR2D2\/C3PO:\\nDid nothing. Wasted\\n\\nBB8:\\nThis one has lots of things to get out of every single hard situation.\\nCan handle an AT-ST. wtf?\\n\\nA lot of the movie time goes about the escape of a resistance ship that's running out of fuel but has enough to power its energy shield. So what happened to that first order's dreadnought shields? It didn't have? What the...?\\n\\nThis is the first time that i come out of the movies after watching a Star Wars movie and not feeling a thing.\\nThis movie was pure trash\\, but what i believe is that Disney is trying to kill all Star Wars's old lore and establish something new. A movie full of out place and lame jokes\\, puppet creatures that sell well and lots of special effects\\, cgi and childish dialogs and plots...\\n\\nNow i can say that the prequels were not that bad. I prefer them over this piece of shhh!\\n\\nStar Wars is now dead. Heil Disney.","true":true}