{"101487":183921,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-09","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie had a lot going for it\\, such as the space battles\\, but ultimately ruined by 21st century Earth political zeitgeist projected upon a long time ago in a galaxy far far away. I have no problem with strong female characters and female heroes but this film just shoved the most annoying form of feminism down our throats. Laura Derns character was the most offputting character in any star wars move I have ever seen. Her stubborness and unreasonable manner of expecting to be obeyed without any explanation after emasculating Poe was embarassing. She wasn't shown as much of a leader. Also\\, where did the line \\\"God speed rebel ships\\\" come from? The Force is the only religion in the Star Wars universe and never had there been mention  of a god. \\nThe whole story arc of Luke Skywalker since ROTJ and his role in this film is actually soul destroying. What happened to the always optomistic hero we loved from our childhoods. He defeated the Emperor by bringing his father back from the dark side\\, the rebel alliance won. They've overdone the demise of the alliance\/republic and the apathy of Luke. What was there to be happy about with the end of the return of the Jedi? I could go on and on about this film. The scene of Leia flying through space\\, the absolutely shit character rose\\, the waste of time that is captain phasma\\, the stupid scene with poe calling hux\\, the most powerful military might in the galaxy being held up by a blast door\\, Luke breastfeeding from a walrus\\, in fact the whole Luke Skywalker ach to bullshit! \\nThe force awakens was a blatant but shit rip off of a new hope. The last jedi has turned the Skywalker saga into such a shambles that it has had the last of my interest and the last of my money. Rogue One was absolutely brilliant. It gave me hope for the star wars franchise again but the last jedi has finished me. Kathleen Kennedy has absolutely fucked star wars. Shame!","true":true}