{"101487":194624,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well\\, that was just the worst. I think I've got a new most disliked star wars movie off all time. I think the first 10 minutes I enjoyed. The 2 hours or so in the after that I thought was an absolute trainwreck of epic proportion. Just awful awful acting and completely and utterly predictable plot (twists). Not to mention idiotic story line and unbelievable plot holes. Believe all the bad reviews you've read. It's really that bad. They destoyed Luke Skywalker. They destroyed the universe and worst of all made a joke out of the force. I'm also huuugely disappointed with Mark Hamill and Carrie Fisher. Hamill's acting was in my opinion as robotic as his hand\\, the worst I've ever seen and Carrie Fisher (RIP) just got that whole Ozzie Ozbourne off her head from all the years drugs\\, slurred speech and bad acting. I would not have believed anyone if they told me how bad those two would be.\\nFinn\\, awful\\nRey\\, awful (maybe JJ should of made her cry again so she'd remember to act)\\nRose\\, punch in the face awful\\nKylo\\, pathetic.\\n\\nSnoke I actually thought was the best character\\, and he was CG! But what a 5 minute waste of villain. And like we should think a Sith lord that can read the minds in the room can't tell a lightsabre about to poke him in the side? You know it's a bad movie when Poe was just the glimmer that shone in that entire movie. The rest just acted like they were in a bad B movie?\\n\\nI hate to say it but rotten tomatoes is right in my opinion\\, just one of the worst in the saga. Specifically signed up here to join voices in the worst injustice ever done to the Star Wars universe.","true":true}