{"101487":172911,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"the action\\, special effects\\, and cinematography were mostly excellent. adam driver and daisy ridley saved this movie from being a complete disaster. story and characters were poorly written and the film is a very disappointing sequel to episodes vi and vii. luke skywalker has a bad dream and decides to murder his nephew in cold blood. then luke abandons his best friend and sister for years. leia organa becomes space mary poppins. nobody seems to care than han solo was just killed by his own son. great characters like finn\\, poe dameron\\, general hux\\, and captain phasma are forgotten to make way for annoying new characters rose\\, holdo\\, and dj. the resistance loses 90% of its forces because holdo forgot to send a memo to poe dameron about the plan to escape from the first order. rose and finn travel to las vegas to protest animal abuse and get arrested for a parking violation. three heroic deaths are given to irrelevant characters when they could have carried so much more impact and emotion if the audience actually cared about the people dying on the screen. unfunny and poorly timed disney\/marvel style humor is used frequently with little success. rian johnson tried so hard to subvert the audience's expectations that he forgot to write a good story and characters. and in the process neglected the possibilities built into episode vii by lawrence kasdan and jj abrams. ultimately episode viii is near the bottom of the barrel of star wars movies. the only film worse than episode viii is episode ii. ","true":true}