{"101487":107759,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Awful. \\n\\nThere were many holes in this movie that were just terrible\\, yet it was met with some good scenes to try balance it out.\\n\\nFirst\\, the elephant in the room should be addressed. It would have been a better send off to have Leia die on the bridge. That scene of her surviving the vacuum of space was ridiculously silly.\\n\\nWhat the hell was the 'sith hole' with the mirror under the island that meant absolutely nothing? \\nIt was completely pointless. \\n\\nPoe told some very bad jokes at the start of the movie that really didn't sit right with me at all which had already put me in a bad place. Why would he have to hold? It makes no sense again.\\n\\nFinn and Rose's story was also very pointless. They caused more harm than good meaning having to endure that sodding casino planet didn't amount to anything. The premise of a rich planet is interesting\\, but was very poorly executed.\\n\\nThe woman put in charge of the resistance in Leia's absence didn't fit the role. She looked more like a member of the cast for the hunger games. Her line of Godspeed rebels also went down horribly.\\n\\nYoda looked very 'off' as well. Being dead doesn't appear to have been good to him at all.\\n\\nThe story for the first hour is also stagnant. It goes nowhere. Just complaining and complaining with the one golden moment of leia's hologram to Obi-wan slotted between.\\n\\nPorg was just needless merch-candy for Disney to make new toys. Other than that\\, no significance to this species exists.\\n\\nWhy does the film think we only want to see new nameless planets? I'd love to go back to Tatooine\\, Kashyyk\\, Geonosis\\, Coruscant\\, Yavin 4\\, etc. There could be a chance to really mix it all in with the prequels quite well. Instead of finding another rebellion base\\, wouldn't a droid\/clone base be so much more interesting? They would see artifacts from a war before their time and maybe could use the older outdated vehicles which we saw in the prequel films.\\n\\nWell\\, I could go on but it's unlikely this will be \\nread much anyway. I'm just so disappointed by this film. It was advertised as a gritty and dark but was a film that relied heavily on jokes and undeveloped story arcs. This could have been so much more than that.","true":true}