{"101487":169546,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*SPOILERS* The long awaited \\\"Star Wars: The Last Jedi\\\" is finally here and along with many others I was quite excited to see it. However\\, the build up to this movie was far more exciting than watching the actual film. This movie failed to establish characters other than Rey\\, Ben Solo\\, and Luke and introduces new planets and characters that feel as if they really don't need to be there. After watching the first sequence with the resistance bombers I have to say I was quite excited. This scene was a fantastic display of classic Star Wars action and overall a very enjoyable scene. However\\, kicking this great scene off was an awkward\\, unfunny forced exchange between the resistance head: Poe Dameron\\, and First Order General: Hux. This is meant for comedic purposes but really should be nowhere near a Star Wars film. Personally I thought It felt more suited for the fellow disney bought company marvel. Star Wars movies have humor in them even newer ones such as \\\"Rogue One\\\" and \\\"The Force Awakens\\\". I see this humor issue throughout the film and maybe some with find it funny but I personally did not see the humor nor the place for that brand of comedy. To get back to the character issues with this movie- I thought Finn one of the main characters in TFA if not the main character really had no purpose of being there other than one side adventure he's on. Finn was a key player and has a somewhat mysterious end in TFA and this movie turned his serious injury he inflicted into slapstick comedy\\, having him stumble in like a moron. Finn meets a worker on the ship (Rose) who I'm going to say now has no point in this whole movie and they form a bond and at the end of the film have an out-of-nowhere romance story that can clearly be seen through as an attempt at a classic Luke-Han-Leia love triangle. Again\\, this seems forced. Her overall character seems very forced in this movie along with another out-of-nowhere character \\\"Holdo\\\". Now I do not have a problem with introducing new characters but you have to introduce them in a better way. I don't have a huge issue with Holdo but she still just seems like she doesn't have to be there. Luke and Leia aside from chewy are now the final two OG trilogy characters left and I think they made the worst choices with them. Carrie Fisher's character is dead in real life and I think to give her and end in this movie seemed right and they make you think that's what they're doing. In a brilliant sequence of Kylo flying his star fighter targeting the bridge that Leia is on you can see confliction in his eyes and Leia's fear\/worry. Kylo decides not to fire but his fellow pilots bomb the bridge.Leia is sucked out into space and I was perfectly fine with the events that occurred and Kylo looks so distraught. However\\, she somehow does not die from space but floats her way back to the ship... I honestly think who ever chose to do this scene was tripping on acid. How they could make such a stupid choice is beyond me. It was easily the worst part of the movie and I honest to God almost left. It was after this moment I knew what kind of movie this was gonna be. On to Luke. I thought Luke was very unlikable in this film\\, and no it's not because he attempts to kill a young Ben Solo I had no problem with that. I don't know how to describe it but he just seem like it didn't do justice to the Luke we all know and love and trust me I'm not a crazy original trilogy fanboy. At the very end of the film Luke allegedly reunites with the rebels and faces Kylo. Luke however is revealed to be a force projection which is fine but it kills him ! Killing off Luke Skywalker when he really has only been in one of the new movies is such a bad choice. I understand Han's death but now Leia is all they have left and I doubt they will CG her in the whole movie. Just and illogical choice and a blunder on their part. Luke should have lived not Leia it would make so much more sense while also going along with the Kylo Ren arc. A issue I see with this movie is you can tell the very different visions of Star Wars from JJ Abrams and Rian Johnson. I prefer JJ Abram's TFA because it just didn't seem like such a fake Star Wars movie. Another thing\\, the casino planet is completely pointless. I was weird to me I understand they were getting the hacker but Benicio Del Toro while being a great actor never amounts to anything. He is in a few scenes and instead of being a new Han Solo or Lando esc he betrays them and is never mentioned again. Now Rose and Finn are going to be executed by the most unneeded character Phasma and Holdo sends the rebel flagship through the First order ship. Finn and Rose are laying unharmed while there are a bunch of dead troops around them ? Then Phasma and her goons appear from a doorway when they WERE IN THE SAME DAMN ROOM !!! If they were unharmed like Finn and Rose why would they not kill them ? Finn picks up one of the dorky little police batons and they fight. Phasma should kick is Ass. She is a highly skilled Stormtrooper captain who has most likely been trained since the age of seven and she loses and dies to Garbage man and Escape Pod Security guard. Wow that scene was such a mess. I have come to the conclusion that Finn has to be force sensitive because he avoids perishing too much for how sucky he is as a fighter. Then the last thing I'll go into detail about was killing supreme leader Snoke. Fine ? I guess. They did it in a cool way and a great fight scene followed but I now know all the praetorian guards were there only to sell toys. Kylo cuts Snoke in half using the force to ignite the skywalker saber. I thought it was cool to be honest until I thought about it. Going into the movie everyone wanted to know who Snoke was and I think they are just kind of screwing themselves by killing him now. Kylo just doesn't seem like a strong main villain to me. Finally\\, there is the snow\/mineral planet action scene that was just pretty dumb and then Luke does the whole force projection thing and blah blah the rebels escape. Overall I thought this movie was a disney cash grab and not a great Star Wars movie and certainly not the best like some are saying. It was rather boring and just not from me. Who knows maybe you'll like it. Critics are getting soft on disney films *cough* Marvel *cough* Star Wars.","true":true}