{"101487":191142,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Update: Changed my rating to one full star becuase I'm reading things like reviews containing half stars aren't counted.\\n\\nOriginal Review:\\nYes\\, I'm one of those that created a Rotten Tomato account just so I can post this review.  Disney and the main stream media will automatically discount it as not authentic.  I don't care I needed to do this for therapy more than anything.  I discount almost all the positive reviews here because if you look at them they are almost always just a few sentences long and never identify any specific details or scenes from the movie that make their point.  Just about all the negative reviews specifically identify where and how the movie went wrong.  I tend to believe those are real.\\n\\nI grew up with the original trilogy.  I remember my mom packing us kids in the station wagon and driving us around to different theaters in different cities to enjoy the movie multiple times.  I remember her driving us to the big city of Seattle and standing in a line that went around the block to watch it in a state of the art theater.  She even took us to a drive in showing of the movie.  We saw it about six or seven times.\\n  \\nWhen I grew up I never really got into the prequels. To this day I haven't watched any of them from beginning to end.  When they announced Disney would be renewing the Star Wars franchise I bought the original trilogy on DVD and got my kids really interested in them.  I told them what a watershed moment these movies were for their dad growing up. We were all excited for the new movies.\\n\\nWe all liked the Force Awakens.  Even though it was an episode 4 re-tread I thought they filmed it well and it really had the look and feel and emotional connection of a Star Wars movie.  Rogue One in my opinion is the best Star Wars Movie of them all.  It just had that look and feel and grittyness and the emotional ending was fantastic. \\n \\nWhat a huge dissappointment The Last Jedi was.  I still have no idea what they were hoping to accomplish whith this film.  I was so distracted by things that threw me off in the early going that I couldn't focus on the rest of the movie\\, so I went again to give it another chance.  Both experiences were similar.  I felt ok leaving the theater but it didn't last long. Just the negativity of how they handled things ends up washing over me and I feel like they totally butchered it.\\n\\nI'm ok with the opening scene\\, corny humor and all\\, and even the space bombs.  Visually I thought it looked great.  I had no idea the corny humor would infect just about every scene the rest of the way.\\n\\nMy big issues are with three scenes in particuar that practically ruined the whole movie to the point it didn't matter what else happened.  Before I get into those the movie also suffers from pacing and is way to long.  By the time they even get to the big Rey\\, Kylo\\, Snoke\\, scene I was squirming in my seat ready for them to start wrapping this up.  The Casino plot line was totally unecessary and should have been cut to help with the flow and pacing.  I also feel like they \\\"jumped the shark\\\" with the force this movie and ruined the whole concept of it. \\n\\n The force was always this magical spiritual energy thing for me that you had to work hard to learn to tap into and learn how to control it.  They made it into a big parody and a farce.  You can now use the force to survive in outerspace with no protective suit\\, to force video chat long conversations with whomever you want\\, to astro project yourself anywhere in the universe\\, to affect the physical world even though you are dead\\, to even pick up your broom when it's time for you to sweep.  One review put it perfect.  This is the millenials version of the force.  You get all the benefits of the force and you don't have to work for it first.\\n\\nThe three scenes that kill this movie for me.  The Leia in space scene.  Knowing Carie Fisher has died my daughter and I were wondering how they would handle Leia in this movie.  When she got blown into space my daughter and I looked at eachother saying ahhh that's how she dies.  Although Kylo seemed to have zero problem killing his Dad (Han) I was wondering why they would make him now not be able to pull the trigger on his mom.  \\n\\nWhen they showed her floating in space zooming in I thought what a great moment.  They're going to let the emotions build as Leia floats off into space.  Letting us\\, the audience\\, internally say an emotional farewell to a great character in this great film franchise.  But\\, then they zoom in and linger on her face.  And I think\\, That's weird they're holding that shot a little too long.  Then it starts hitting me why they are doing that. My insides explode\\,  \\\"NOOOOOOO\\\"\\, \\\"NOOOOOO\\\" they're not going to do that?\\\".  Internally I'm shouting to myself \\\"don't open your eyes\\, please don't open your eyes\\\".  Then they switch to lingering on her hand and I know exactly what they are going to do.  From that point on I'm screaming internally \\\"WHYYYYY\\\"  WHHYYYY\\\".  Why the hell would you do that.  That had to be one of the cheasiest unbelievable scenes in Star Wars history.  Even with the concept of the force that scene is so unbelievably stuipid and bad.  I litterally could not get past that scene\\, how bad it was.\\n\\nThe next scene that ruins the movie (and pretty much ruins re-watching episode 7 anymore) was Luke's reaction to Rey handing him his light saber.  We have this huge crescendo at the end of episode 7 that culminates an emotional peak for the audience and leaves them applauding what they just saw.  The anticipation of Luke and his character for the next movie summed up in this great dramatic closing. But then it's like they were purposely trying to make a parody movie out of episode 8 instead.  It's like they said\\, instead of making this dramatic how can we make this funny.  I don't know\\, let's go consult with Saturday Night Live maybe they can give us some good suggestions.\\n\\nI literally thought I was watching an SNL spoof skit.  He tosses it over his shoulder and slinks off to hide in his hut? Without saying a word?  Rey is probably the first human he's seen on his island in a long time.  No \\\"who are you?\\\"\\, \\\"how did you get my light saber\\\"\\, \\\"How did you find the map?\\\".  Nothing\\, not even one word.  Just a toss over the shoulder. How can you watch the end of episode seven in the same way anymore?  How can you care at all about the whole map story line?  The sacrafice to get the map\\, etc?  What a farce.\\n\\nThe other scene that just left me with disgust was the physical fight between Rey and Luke.  A physical fight really?  Between the new hero of Star Wars and the old hero that are on the same side? Not only that\\, she sucker punches him from behind because he won't answer her?  He gets the better of her during the skirmish and she summons his light saber and acts like she's going to strike him down dead with it.  WTF?  The way they handled that whole movie they may as well as had her do it.  \\n\\nThose are the big things that ruin this movie for me.  I like The Force Awakens and Rogue One enough to give them the benefit this in an anomoly movie.  But if Han dissappoints I probably am done with Disney's interpretation of Star Wars.  And I wont' be going to any more Rian Johnson Star Wars movies.","true":true}