{"101487":178798,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There were so many wasted opportuniites for greatness even within this disaster of a plot line. \\n\\nMinor spoilers:\\n\\nThe Plot\\nThe plot takes us almost nowhere and sacrifices main characters for little to no reason. It seem Rian Johnson wanted to Game-of-thrones-ify the star wars universe by violating expectations above all else.  This misses the point.  Star wars was built on the formula of myth making (see A Hero with A Thousand Faces).  People haven't gotten tired of the heroes journey for thousands of years.  Now Rian Johnson wants us to \\\"let the past die. Kill it if you have to\\\". If you are going to forge an entirely new path you had better have a good story to tell.  So far it seems he has nothing but pointless quests to send characters on. If you have to rely on a follow up movie to rescue yours\\, you've made a bad movie.\\n\\nThe wasted opportunities\\nLeia's character is revealed to be stronger than anyone knew\\, but sits on the sidelines the whole time. With Carrie Fisher's passing we will never see it on screen.\\n\\nLuke is completely out of character almost the whole time. It's like introducing Superman into a movie except now he is fat and depressed and only wants to talk about bowling. Luke has been building towards greatness since the beginning of star wars and we never get to see it on screen.  \\n\\nRey is the protagonist\\, right? In this movie Rey is a sideline character that barely contributes to the story. This is probably not ideal. Her whole arc is striving for identity and mentorship and we waste the whole moving giving her none of it. She spends the entire 1st movie trying to find Luke.  Once she finds him it turns out to be pointless. How does a character progress without learning anything form anyone or discovering anything about herself?","true":true}