{"101487":195819,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What originally had so much promise ended up a disaster in so many ways. I walked out of the theater on Thursday (preview) night in absolute anger at how the script treated Luke Skywalker (among other things) and I haven’t walked out of a Star Wars showing feeling that way since Episode 1. The fan base seems absolutely split down the middle in terms of like vs dislike. It is easy to see why: Episode 8 is a true disappointment. The longest Star Wars Saga film to date\\, nothing really happens during the 2.5 hour runtime that greatly advances the narrative. I feel as though you could go from Episode 7 right to Episode 9 and not miss much or need much of a recap to get you up to speed. Our heroes are split up across the galaxy\\, accomplishing different tasks...yet many viewers sat and asked themselves what the purpose of those scenes were\\, myself included. Pacing DRAGGED at times. Some questions from Episode 7 were answered (even to a pleasantly surprising degree)\\, yet others were were either ignored or answered with more questions. Lots of character development ensued\\, but many of the characters were damaged in the process. The third act was tense and fun in the classic Star Wars sense and set up what appeared to be an epic conclusion to the film...only to utterly and completely self-implode into the greatest disappointment imaginable in the last 5 minutes. One particularly egregious scene involving Leia (you’ll know it when you see it) audibly made audience members GROAN. Is The Last Jedi 100% bad? No\\, or I would have rated it even lower than I did. It is a visually stunning film\\, with 99% of the visual effects appearing seamless and the return of practical effects a welcome addition (much like in The Force Awakens). There were a few unexpected shockers and nods to the Original Trilogy\\, and some very enjoyable action sequences. Unfortunately\\, they weren’t enough to save the film. I didn’t expect this film to topple The Empire Strikes Back as “OMG\\, THE GREATEST STAR WARS EVER!!!\\,” but I expected Rian Johnson’s script to be more adoring of and respectful to the Star Wars Saga than it was. I appreciate his efforts to go in a new direction (unlike The Force Awakens\\, which was simply an enjoyable\\, though tired rehash of A New Hope)\\, but I am disappointed that he failed in his attempts to achieve this in a manner that proved so dissatisfying to so many. He couldn’t have done Luke more wrong if he’d tried to. J.J. Abrams definitely has his work cut out for him in Episode 9\\, but I’m not sure he can save the trilogy from the damage Rian sadly caused in Episode 8.","true":true}