{"101487":139906,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I spent my childhood admiring the Jedi order and Luke Skywalker. He was relentless in redeeming his father who was pure evil. Now when faced with his nephew who is conflicted (not even close to pure evil) what does Luke do? He straight up just tries to take the easy millennial way out and kill him. Luke was so concerned about Snoke (everyone was) yet Luke does nothing to try and stop Snoke. In fact\\, no one ever even explains who Snoke is. Everyone in Force Awakens and Last Jedi know\\, fear and talk about him. But it's one big secret who he is. Moodie spoiled millennial Kylo Ren takes Snokes position as Supreme Leader (just like that). Rey wastes most of her screen time with depressive Luke Skywalker whom in the opening scene tosses his lightsaber over a cliff. I literally waited two years to see the interaction between Luke and Rey and that is what he does. He mocks the Jedi and the Force. In fact\\, Luke is portrayed so badly that when he dies\\, no one cares. Luke SKYWALKER dies and no one cared. He seemed so miserable that I was happy for him that he was out of his misery. The side show of Finn was a complete waste as well. The three acts of the movie are all the SAME. Beginning (resistance barely escaping First Order) Middle (resistance slowly trying to escape First Order in space) and the end (resistance barely escaping First Order via mountain rocks). Ugh. This movie even had Yoda destroy the original Jedi temple and the ancient veda texts. Luke does not care about anyone or anything. I waited for two years to find answers about Snoke\\, Luke\\, Rey and even Chewy and we were left with nothing. VERY underwhelming movie!","true":true}