{"101487":166308,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Saw the movie twice already. Once on IMAX and once on a Standard 3D cinema. I absolutely LOVED it! I seriously don't understand what's up with all the hateful reviews. Never thought I'd say this\\, but I certainly hope Kylo\/Ben and Rey figure out a way to bring balance to the Force together. Balance is not about the Galaxy being ruled by the Sith exclusively nor the Jedi alone. Balance means exactly that. Balance! According to Snoke they are equally matched on opposite ends of the Force. There's no denying the Force-Skype sessions between the two lonely and misunderstood misfits Kylo\/Ben and Rey have brought them together in ways no other Jedi\/Sith have ever connected before. They achieve a level of emotional intimacy at a very deep level. If there's one word I could use to describe their connection now is this: sensual. Supposedly\\, it was Snoke who arranged the Force-Skype sessions\\, yet by the end of the movie\\, after Skoke was already dead\\, Rey and Kylo\/Ben managed to connect via Force-Skype yet again. Their paths are intertwined in ways neither of them yet realize. I know this is not meant to be a romantic type of movie\\, but it would make sense to have the two opposites meet in the middle somehow.  If that means a love story and\/or coupling\\, then so be it! This approach didn't work for Padme and Anakin\\, but hopefully it will work for Rey and Kylo\/Ben. Since the latter are both Force sensitive in equal measures this has a chance to work. It would be a win-win for the entire franchise. Nobody is ever 100% good or 100% bad. Bring balance!  Bringing balance to the Force: Rey and Kylo\/Ben","true":true}