{"101487":193236,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"WARNING: POTENTIAL SPOILERS I do not honestly know where to start. If this movie was not a Star Wars movie it actually would have been entertaining. But it is a Star Wars movie. And to say the least\\, it was an utter failure and travesty. It is truly a mole on the face of this franchise. For starters\\, the character development for 3 major characters was none existent. And without giving spoilers\\, Disney seemingly decided to abandon 2 of them by killing them with no reference or mention to their backstory at all. The fate of Snoke literally infuriates me. They handled his character like he was an extra in a war movie who gets killed\\, yet no one takes notice. He had the potential to be an extraordinary character...and honestly he was 90% of the reason I was intrigued by this trilogy. Aside from that\\, the subplots were absolutely absurd in this movie. It was so confusing and pointless that about halfway through I was beginning to wonder when the film was going to end. All in all\\, this film was a complete and total disaster. Disney has no idea where they are taking this franchise...unless it is into the ground. I wanted a Star Wars movie\\, not a Marvel\/Guardians of the Galaxy one where all they do is cheesy jokes. Star Wars is not supposed to be a comedy. Sure some humor is great\\, but this went way too far. Even Phantom Menace had a central storyline and decent character development. Everyone owes George Lucas and Episode 1 an apology now. Disney\\, if you’re reading these reviews\\, for the LOVE OF EVERYTHING\\, get someone who knows what they’re doing when it comes to Star Wars. Start taking some advice from George Lucas (who actually made this incredible series) and get Gareth Edwards to do more movies...because one more movie like this and you’re going to lose more than half of your fan base.","true":true}