{"101487":155603,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My thoughts on TLJ:\\n\\nRose and Finn's subplot to find a safe cracker added absolutely nothing to the plot and the characters end up exactly where everyone else on the Mon Calamari ship did\\, Crait. It's like Rian Johnson forgot about Finn in his first draft and had to stick him in somewhere. The plot itself was the most boring chase scene ever stretched for 2 hours. The First Order could have easily destroyed the rebel ships with Tie Fighters\\, they even show this when the Ties blow up the Mon Calamari's ship's bridge with no effort at all. However\\, Hux calls the Ties and Kylo Ren back because The First Order's capital ships wouldn't be able to cover the Ties? WHAT? The whole freaking point of tie fighters are that they're dispensable. That's why they don't have shields or a hyperdrive. They could have done something really cool to show that Leia was force sensitive\\, but they had her fly through the vacuum of space like freaking Superman. That was the most ridiculous thing I've ever seen. If Vice Admiral Holdo told Poe her plan\\, then the entire and completely pointless sublot with Finn and Rose wouldn't have happened\\, and DJ wouldn't have told The First Order about the rebel ships fleeing from the Mon Calamari Cruiser. I get not telling Poe if he didn't need to know\\, BUT HE WOULD'VE HAD TO ABANDONED THE SHIP TOO. Why the fuck keep it a secret when everyone on the ship should've been preparing to abandon it? Then after not following any of her commands and leading a freaking mutiny against her\\, she says she likes him. What? Why? People don't usually like other people that constantly try to screw them over. It makes her character seem fake as hell. The climax of the movie should've been about Rey\\, *not* Luke. The climax of Rey's character seems to be the fact that she could move some rocks. Given everything else she's done with the force up to that point\\, moving some rocks is not impressive at all. The climax of ESB was Luke's struggle with the dark side\\, and while I'm glad they didn't copy ESB\\, they didn't really do anything meaningful with Rey's character at the end. TFA introduces Snoke and makes him this larger than life mysterious character and in this movie there's absolutely no payoff from that. How the hell did Snoke create The First Order? How did he learn the ways of the force? The Last Jedi was a convoluted mess and it felt like it was written by committee. Where 20-30 people sat in a room and said \\\"wouldn't it be cool if-\\\".","true":true}