{"101487":159146,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok so I don't think I need to mention that there will be spoilers in my comment. This movie has some of the best visuals that I had ever seen. However there were so many points in the movie which ruined it. Snoke's death. Well he barely displayed much of his power yet what he did display already showed the difference in strength between him and Rey. Yet some how they thought that it was a good idea to kill him off. Rey she is a Mary Sue to the degree where she is the next Jar Jar Binks. She is a joke she did not earn any of her power and some how manages to defeat Luke Skywalker. Princess Leia Organa well let's she she got shot into space survives with almost unscathed compared to the only other few starwars characters who survived the vacuums of space. Darth Vader survived without his helmet through sheer use of the dark side. Star Killer needed his body rebuilt after\\, and finally an Alien Jedi who doesn't even breathe air. Leia not fitting into any of these categories pulled a deus machina and literally directed herself back towards the ship. Kylo has so many mood swings it feels like he is going through a monthly cycle. Finn and Rose are almost useless in this entire movie. Finn drives vehicle into a laser that cuts through 10 feet of metal unscathed. Since Star Wars rebels is cannon due to Disney owning star wars. Well since the Princess happened to have Thrawn turn her army and killed them off until there was just a single squad and pulls a strike on the Rebel base from space. You would think that she would put shields in place to protect the bunker from a situation like this. You would think that Finn should have gotten a shield generator and would have been better off doing something useful then trying to commit suicide. Another issue is why does purple haired Ms.SJW decide that somehow it is a great idea to get nearly get everyone killed and not listen to Poe and finally killing off Luke Skywalker through a heart attack. Yeah I knew that enventually that Luke would die. But after he threw away all of his values and happened to trigger the events that led to this situation and how he happened to die from a heart attack. Yeah no this is the single worst movie that I have ever watched. In fact I actually enjoyed watching  The Dark Tower\\, or even Aragon more then I had enjoyed watching this mess of a movie.","true":true}