{"101487":174667,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The good:\\nClassic Star Wars space opera.  Action was good.  Humor that I think I've heard a lot of people complain about was not entirely out of place.  Some definitely was\\, but it wasn't horrible.\\nThe bad.  I'm not even going to bring up the plot holes.  I don't have all day.  These are my complaints about this movie\\, and also how this trilogy is culminating:\\nThey killed off the best part of the movie way too soon: Snoke.  Why?  He was a true villain.  Kylo Ren looks like he's always about to cry.  It's hard to even take him seriously.  Snoke was kicking ass though.  He was the villain we needed.  I really wish they'd have kept him around.  The way he was killed also.. that was crap.  They Boba Fetted him.  Take a powerful\\, intimidating\\, iconic character and kill him in some stupid lazy fashion.\\nForced romance.  What is the thing with Rose and Finn?  I wasn't feeling that at all.  I guess they are trying to give Finn some additional relevance?  \\nIt's apparent that we won't get any decent light saber action out of this trilogy.  They are more props than anything else.  The one time a light saber almost entered battle it was more like two people fighting over the last donut.  \\nHoly crap why keep Leia alive?  They seriously needed to kill her off in this movie.  It was nice to see Carrie Fisher's daughter in the movie though.  That was cool.\\nSomeone needed to die here.  Poe.  Finn.  Leia.  Rose.  Someone.  But all that died were red shirts.  Nobodies.    We needed to feel tragedy.  Luke died but in the crappy \\\"Yoda fall asleep and give up on living\\\" variety of dying.  WHY.  Why not send Luke down to get killed by Kylo somehow\\, if he is just going to die anyway?  Why go through ALL THAT TROUBLE to astrally project yourself\\, and then collapse dead anyway.\\nSo what's left.  Defeat Kylo Ren.  This guy loses every time he gets in a fist fight\\, essentially.  He is loser\\, all the way around.  He keeps getting beat by Rey who has essentially had no training.  He is a joke.  And now he's our main antagonist?  Seriously?  And we've left all of the other main characters alive?  So we killed Snoke\\, and left the joke alive to fight all of the other main characters + now Rose.  What the hell.\\nStop with the unconvincing fake-outs.  Finn about to crash into the cannon.  Rose hurt.  Leia floating in space.  Nobody EVER DIES.  Just let someone die.  Just once.  Or even get badly injured.  Let Rey lose a hand like Luke and Annakin.  Give us something to go with\\, here.  Something to let us feel like the bad guys actually have a shot at winning.  That there's actually a struggle worth watching here.\\nPlease no more long chases through space.  This felt like the Star Wars equivalent of the OJ slow speed chase in the white SUV.\\nPoe \\\"If they move\\, stun them\\\".  NO.  SHOOT THEM.  Gahhhh we have to use stun guns on everyone now\\, huh?  Come on.\\nCasino.  Apparently nobody writing this has ever been to Vegas.  Casinos aren't full of rich people gambling.  And is the only way to get rich actually selling weapons?  What was that whole thing about??  They could have almost done without the entire casino act... but then I guess they would have to have skipped out on one of the biggest plot holes in the film\\, which I said I wasn't going to get into.\\nThe biggest tragedy was in the writing.  It just seems lazy.  You can really feel Disney's influence now\\, and not in a good way.","true":true}