{"101487":169586,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILER WARNING!!!! My biggest complaint with The Last Jedi was with Luke thinking about killing Ben Solo\\, even if it was just a fleeting thought. Wasn’t the entire point of the original trilogy that Luke saw the spark of good in Vader and was able to guide him back to the light? In the Last Jedi Luke caught a brief glimpse of darkness in Ben and thought about killing him\\, his own nephew\\, to the point of firing up his light saber? That didn’t feel right to me. It seems that a Jedi should be slower to act on emotion than that. Snoke was a huge red herring. Why build so much hype around this incredibly powerful and mysterious character and then Darth Maul him? Now we’re left with Kylo Ren as the main villain. Doesn’t he seem too unstable to be a formidable adversary? I liked the Yoda cameo. Ahch-To was very interesting\\, aside from the space penguins and fish nuns (did we really need to see Luke milking the alien?)\\, I was hoping for more about the force tree though. Some of the humor seemed forced (pun?). Hands down the best scene in the movie\\, maybe the entire franchise\\, was when Vice Admiral Holdo rammed the First Order ship just as she jumped to light speed. SO COOL! The Dreadnaught was awesome as well. I’m so on the fence about this movie. So many pros and cons. Overall I think I’m disappointed. I’ve looked forward to this movie for so long\\, but the idea that Luke created Kylo Ren in the way that he did feels so flawed I don’t think I can get behind it. I’m probably too much of a purist though. I didn’t even like the prequel trilogy that much. Midichlorians were one explanation we did not need. Boba Fett deserved a better back story\\, or none at all. Sometimes mystery is a good thing. Maybe I’ll just go back to the EU\\, or Legends\\, or whatever they’re calling it these days. Disney\\, please give us an official unaltered original trilogy!","true":true}