{"101487":129414,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a person who saw \\\"A New Hope\\\" a 100 times when I was a kid.  I loved the whole franchise...even the prequels and TFA.  While they all have some faults; I am a huge fan\\, and willing to overlook those faults.\\n\\nThe same cannot be said about \\\"The Last Jedi\\\".  This movie is a complete abomination to true Star Wars fans.  I could go over the same problems\\, that everyone else has already gone over\\, but I will just briefly address the SJW created problems.  DId you notice that ALL leaders on \\\"The Resistance\\\" are women and minorities?  Did you notice how how every leader in the \\\"New Order\\\" where all white british men?  What marketing genius!!! (Sarcasm)  Lets alienate all the white men who make up 90% of the fan base since the beginning! #ERRRR  At Christmas I tried to find a Kylo Ren for my friends son.  ALL I could find where Rey dolls.  EVERYWHERE.  REY DOLLS.  A week before Christmas nothing but an endless sea of...Rey dolls.  This should have told Disney everything they need to know on the complete and utter markething error that they allowed Katherine Kennedy to completely ruin!  As a businessman I cannot respect that one bit.  As a fan I am completely disgusted and devastated.  \\n\\nWhile there are some fun parts of this movie that are good and fun; I truly wish that Disney would just apologize and completely redo the movie.  I think the fans would completely forgive and forget.  At this point I may see \\\"Solo\\\" just because \\\"Rogue One\\\" was good.  I might see see episode 9 becasue \\\"Return of the Jedi\\\" taught me that even the worst of the worst can be redeemed...","true":true}