{"101487":165434,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson was much more successful in his aim of subverting audience expectations than his aim of delivering a compelling story. However\\, he didn't even fully stick the landing here as the basic story beats are not far removed from standard fan speculations that dogged message boards in the run up to this unsatisfying eighth in the franchise.\\n\\nWhile the plot points are mainly expected\\, the route in which they are reached is often stilted\\, meandering and frustrating for the audience. The cast gamely try to do their best\\, with Daisy Ridley especially seeming locked in a battle between her obvious innate charisma and the most thinly scripted protagonist you'll likely see in a cinema this year.\\n\\nJohnson also seems to go out of his way to deny popular characters fitting and fulfilling arcs while giving the film's most heroic moment to a character we've never met before who we don't care about. Add to this a main plot that amounts to a slow motion spaceship chase and a subplot at a space Monte Carlo that ranks amongst the poorest diversions in any Star Wars adventure and you have an undercooked and overlong slog that squanders all the careful story work of the Force Awakens. \\n\\nWhat is also clear is Disney's desire to clear out old IP in favour of their own content that's focus tested for four quadrant domination. While the film will undoubtably slay at the box office\\, it isn't a movie that audiences will be keen to revisit in 2057. In fact\\, thanks to it's blandly neat wrap up and culling of beloved characters\\, I will be surprised if episode 9 matches the haul of The Last Jedi when it comes around in two years.","true":true}