{"101487":180940,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-13","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film is a bad bad Star Wars movie it looks nice\\, some good performances and cinematography is great but the story is god awful\\, just terrible fan fiction. They had a plethora of great Ideas they could have taken from an expansive Legends\/EU universe to use yet they came up with this.  \\n\\nI feel sorry for Hamill - no wonder he felt uncomfortable with Luke in this movie and it kind of shows in his performance. They basically made him run out of batteries and take a dump over the OT outcomes and what Luke and the Rebellion achieved - you won't understand that unless you watch the movie. \\n\\nTake the nostalgia goggles off for the showing and there are some very glaring holes carried over from TFA which make even less sense in this movie.  Rey is a Mary Sue no ifs no buts and unless something changes i.e. she ends up being a Skywalker that label is there to stay.  Yeah.... I think I'll give the next one a miss and any further movies from Disney related to Star Wars. They should rebrand and name the next movie \\\"Store Wars  - The Farce Continues\\\" - it's just about money and merchandising now more then ever.\\n\\nThey have taken\/ are leading the franchise in a very precarious direction and I don't think it's going to go as well as they think it will. Yes the movies\/merch will make money but everything that made Star Wars what it is\/was\\, is now lost - a few bad movies in and the whole franchise could go to shit.","true":true}