{"101487":136646,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'mma start off and give a real review as to why this movie is actually getting bad reviews and why I'm giving it such a bad review. This isn't a \\\"shame on you disney rant\\, this is a legitimate review that will give insight on just how bad this movie really is.\\n\\nFirst off the way this movie is shot and told is down right atrocious. The pacing is slow and keeps you bored. The more you pay attention the less it makes sense and leaves you wondering why the scenes you're watching are happening. The plot makes no sense and the director really doesn't even try to patch that problem up with the camera or transitions.\\n\\nSecond\\, the atmosphere of this movie is supposed to be serious but everytime it tries it throws shoe horned slapstick comedy at you. Realistically it's like the creators of Spaceballs were asked to direct a real star wars movie and blend it together. Any scene that's is supposed to have value is just turned into a laugh fest.\\n\\nOk so now the grit of the problems WHICH CONTAINS HEAVY SPOILERS\\n\\nAlot of the huge problem of this film is that it's the 8th movie and it basically acts as if every movie before hand didn't exist at all. It destroys it's own lore and makes up it's own for the sake of just bullshit. \\n\\n>The whole bombers are just a ploy to make a toy\\, we already have Y-wings and the bombers made no sense logically.\\n>The whole movie is a Chase of capitol sized star ships and its out numbered 1 to 10 yet it somehow isn't cornered or flanked or caught up to.\\n>The entire Finn and Rose plot line is pointless and costed more lives of the resistance all because the reason that they even did what they did was because the replacement general refused to tell the crew the plan.\\n>Luke's character is completely not him. Luke isn't hopeless and downright coward. There's a whole back story he tried to kill kylo in his sleep but that's never something he would do.\\n>Leia uses the force but in a way that makes 0 sense. She gets shot into space and survives the vacuum of space and flies using the force back to the ship. That's not how the force works or how anything works really.\\n>Literally no character development. Kylo gets stronger off screen and rey learns nothing but gets stronger. Didn't add anything to them but kept them dragging the plot on.\\n>Rey's parents are nobodies that sold her. Ok I can deal. But why does she naturally have powers like that. They're not refined so how does that even work.\\n>Snoke. Everything about this person is useless. There's no explanation how he became so powerful\\, how he manipulated kylo to the dark side or anything and then they just kill him. All he does is act like you're Sunday morning cartoon villain. No substance.\\n>Luke force projects himself across the Galaxy which is unheard of because I didn't realize you can just pretend to be somewhere. Tricks kylo Ren in a scene that relies on laugh gags when it's supposed to be serious.\\n>At the end of the film they ram the rebel spaceship into the ships of the first order at lightspeed and it destroys the entire fleet. First off established lore states that's not how light speed works and let's say it does\\, why wasn't the plan from the beginning?\\n>Phasma dies again with no screen time. At this point her character is only used to sell toys as she does absolutely nothing.\\n>Luke dies alone because he used to much energy using the force projection. Pretty much anti climatic.\\n>YODA shows up and uses a lightning bolt to burn a Jedi temple down. Makes 0 sense how he could interfere with the physical world.\\n>At the end the plot is screwed. The last movie is basically kylo and a strong first order (which were never told how the first order became so strong) vs 20 rebels (which were never told how they became so weak) and Rey (who were never told how she became strong). Just a generic bad vs evil plot at this point.\\n\\nIt seems that they threw everything from the 1-6 episodes away then took all the stuff from 7 and decided to cancel certain new things just because they didn't feel like using it.\\n\\nThere are several things episode 7 introduced they gave up on.\\n>Snoke\\n>Knights of Ren\\n>Maz\\n>The entire Galaxy itself. This trilogy really makes it seem like the Galaxy that was so expanded on in the other films non existent. Where is everyone?\\n\\nI don't dislike this movie because it's \\\"not the same star wars!\\\" I don't like it because it's not even star wars! I don't want a rehash of a plot I want a new plot using star wars as the basis but they removed the star wars basis and just winged it for the worse. Also to all the people saying people are hating this movie because of diversity and women you're in denial. There are no problems with that issue. The problem lies with this film and it's plot and destruction to what the franchise is and how movies are told and presented. \\n\\nIt's disappointing and if you must see it go ahead but watch with caution.","true":true}