{"101487":133587,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have a lot of issues with the plot\\, but what's bothering me the most is the asinine battle at the beginning of the movie and the ensuing... chase.\\n\\nSPOILER ALERT... I forgive a lot of Star Wars physics\\, but this is just total nonsense. A new type of super ship is introduced\\, a dreadnought\\, far bigger than a star destroyer. A fleet killer!!! Thankfully\\, a single X-Wing can dismantle all of its defenses. Also\\, one small load of bombs\\, which for some reason are \\\"dropped\\\" in space\\, completely destroys it. Cool...\\n\\nBut then we get to the real meat of the plot... the chase. You see\\, the resistance ships must use their remaining fuel to stay just out of range of the First Order ships. But for some reason\\, despite being faster\\, they never actually get away. They stay perpetually \\\"just\\\" out of range. Neat...\\n\\nWe also discover that a ship jumping to light speed can basically wreck a whole fleet. Why do they even have laser cannons?\\n\\nOof... everything just feels so forced. Phasma is totally shoehorned in.They go overboard with the cute creatures. Way too many silly moments. Snoke's character is wasted. Rey is poorly developed. I still don't know what was going on with Luke. Overall it just feels like a plot spread too thin.\\n\\nThe only saving grace is a fight scene with Snoke's guard. We get to see some vibroweapons. I'm gonna watch this again to see if maybe I'm being too hard on it but right now 1.9 of my stars are for the vibroweapons.","true":true}