{"101487":129541,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am not a Star Wars fan.  Sure I've seen all the films and can enjoy the saga-like approach to an endearing story\\, but this is about as bottom of the barrel as space operas go.  The film rambles from the opening\\, and to be honest the infamous scrolling text did little to inform everyone what is going on\\, but I digress.  We are introduced to the Rebels once again who battle the shiny\\, but Nazi-like Empire. At this stage in the game I did wonder what exactly what was the conflict anymore.  Empire versus Rebels?  Why? For what?  In any case we get a steady dose of Princess\/General Leia Organa\/Solo as she conveys a certain tiredness that I couldn't help feel sorry for.  Added to the woes is Laura Dern as a bitchy lieutenant that brings nothing to the table but aggravation for Poe Dameron played by the fiesta Oscar Issac.  His performance was the most genuine in this film and I wanted to see more of his character do greater things.  Across the galaxy\\, the film catches up with the spunky orphan Rey as she incessantly pesters a very haggard Luke Skywalker played by the thankless Mark Hamill.  You get the feeling that Rey's part is to bug Skywalker to a point of him finally agreeing to train her and thus be captivated by an updated series of Jedi training sequences.  Sadly\\, the film never goes there in this department.  Long gazes at sunsets and spooky dream sequences flood the screen.  Will she be able to fight once again against the deadly Kylo Ren?  That remains to be seen as there are zero lightsaber duels in the film.  But Kylo Ren is another major problem with this film.  With all due respect\\, Adam Driver looks just like Joey Ramone.  In fact if there is ever a Ramones biopic film\\, he has to be cast as Joey\\, period.  But here\\, Driver plays to a ying-yang of his character.  One scene he's good\\, then bad\\, then back to good\\, sorta bad\\, then great again\\, but now bad;  it's an endless sequence of guessing that does not advance the story here once.  The ending is a mishmash of a bizarre sequence of events.  A Rebel stronghold duel with the advancing Empire robots against the threat of maybe fifteen actual people.  I shook my head several times as I couldn't make out who was doing what in the final Big Battle.  To be honest\\, in the final scene I am not entirely sure what became of Luke Skywalker.  Dead?  Alive? Melted into the ground by ambiguity?  It really does a disservice to diehard fans who have kept this afloat all these years.  I will tell those who are fans that because it's from a beloved franchise\\, you don't have to rubber-stamp every film as genius for fear of going against the online-fan-critic grain.  I love the Indiana Jones trilogy\\, but abhor Crystal Skull.  There.  I said it.","true":true}