{"101487":106269,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"At first I was a little upset about how Luke was being painted as a coward who is hiding away from everyone and everything but As I continued to watch the movie I understood and empathized how he carries with him this tremendous guilt about what happened with kylo-ren and all the Jedi. He places an enormous amount of blame on himself and is disappointed in how he “The Legendary Luke Skywalker” led to the destruction of the Jedi. With help with an old Jedi mentor Luke realizes that being a Jedi is also about understanding that failures are part of the process no matter if you’re a legend in the Universe. How characters deal with their own legends is a running theme throughout the movie\\, while Luke hides from his\\, Kyko and Rey are battling with the creation of their own. Kylo is living in the shadow of his parents\\, his grandfather and is trying hard to live up to the Vader legacy...Rey is more than eager to find her place in all of this but is dealing with the created legend of her parents who abandoned her as a child\\, this causes her to seek anyone she respects to fill in the role of father or mother to her. The only three big problems I had with the movie were the fact that the movie never really talked about Snoke’s backstory I mean he seems like a powerful Sith who has reached Master status but who is he and how’d he get to where he’s at? The other thing that bothered me were kylo-Ren’s members of his order. Where are they? What happened to them? Oh and the biggest thing that bugged me was the fact that Rey didn’t go through any damn Jedi training besides 101 from Luke! I was bummed out about that. All in all it’s a great film and one I highly recommend. ","true":true}