{"101487":176306,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The most passionate fans among us are treating this like how Empire was treated following the smooth\\, tightly structured self-contained A New Hope. Both positively for those who love it and negatively for those who don\u0092t. It's very divisive. The Empire Strikes Back was\\, too\\, originally for some of the same reasons. \\n\\nIt hyperspace jumps the saga to a brand new central conflict\\, which is no less complex\\, compelling or controversial than the conflict of a sadistic genocidal maniac trying to convince his freedom fighter son to become a murderer alongside him. Make no mistake about it. The relationship building between the young\\, idealistic Rey and the manipulative Ben Solo is every bit as ancient in myth and fairy tale though and that's why it will work universally everywhere just as the parental conflict did. This new conflict though is a big part of what is dividing people. Star Wars was a fairly masculine entity until recently. Oh\\, sure there are tons of female fans but they have been outnumbered by males for decades. That's changing with this saga and a lot of men seem to be interpreting this as a threat to what they hold dear. They shouldn't. It's more respectful for Star Wars to leave the perfect father\/son story of the original trilogy alone rather than try to carbon copy it with cousins or whatever else many fanboys out there wanted to happen. \\n\\nThe central conflict change around another aspect of Space Opera would already anger some but Rian Johnson's decisions for Luke Skywalker is the single biggest controversy of them all. It shouldn't be. Johnson studied Carl Jung and created the perfect psychological exploration of an aging hero who's had a lot of pain and suffering in his life and relatives of military veterans who've struggled with issues of guilt and purpose after duty will find a lot to unpack. \\n\\nMark Hamill delivers the performance of his life as the middle-aged Luke. Fans forget that this was a character who'd previously chosen to jump off a ledge and into a ventilation shaft in a move that felt more like a suicide attempt than an act of heroism in the Empire Strikes Back. Johnson is well aware of each of Luke's weaknesses psychologically and crafted a beautifully touching tale of grief\\, of accepting that each of us is capable of a moment where the Dark side called out to us and we listened and later regretted. This is a story of accepting your faults and stopping to deflect and project your own regrets and mistakes onto others or other groups. It's about taking responsibility and ending excuses and accepting that the mistake was part of who you are. Not your favorite part. But part of you. Yoda helps Luke to realize this and to accept that although he\\, personally\\, felt he had caught himself from crossing a line it was completely rational for Ben Solo to feel that the line had been crossed and that his Uncle had permantely given up on him. Johnson channels Kurosawa's Ran by revealing the scene from multiple perspectives. Somehow I think Lucas himself would have liked that artistic choice. \\n\\nRian Johnson similarly tests each of our heroes in this and again misty in psychological ways. Finn's loyalty to the cause is tested by a man who believes it's stupid to commit to any movement and by a woman who is making the kinds of sacrifices for him that he'd make for Rey. Poe Dameron's training and belief in the importance of chain of command is tested after his bravado and arrogance leads to devastating consequences. Kylo Ren's belief in the Dark Side is seemingly tested the more he spends time with Rey and it's clear that she has become his biggest weakness as he continues to grow as a villain. \\n\\nThe world-building and creature designs reach new highs in the Last Jedi with a mixture of practical effects and CG that will have you feeling like it's the 1980s all over again. The tone throughout also forgoes the Christopher Nolan grimdark era of self-seriousness that the 00s ushered in and takes us back to a playfulness of 1980s filmmaking that you forget you miss until Back to the Future\\, or Return of the Jedi\\, or Big Trouble in Little China comes on and you realize how much more fun and daring filmmakers used to be with tone. \\n\\nStar Wars wouldn't be Star Wars without combat though and the Last Jedi delivers several sequences that are among the best in the entire saga. The Praetorian guards battle. The mine sequence. The Miyazaki-inspired Falthiers running free. Luke's return to the battlefield. And honestly... sooo much more. \\n\\nThe Last Jedi is a 10 out of 10 for me alongside A New Hope and The Empire Strikes Back. These are the 3 best films in the saga for fans of the magic and zaniness of Star Wars. Grimdark fans will prefer Rogue One's realism and nostalgia for the terrific ending of Return of the Jedi will help others see past its flaws but for me this is the third best film of the saga and one of the best action adventures released past 2000. Emotional\\, thought-provoking\\, personal\\, funny and magic... I hope you still have enough childlike wonder to let it into your heart and keep your cynancism or preconceived notions of what Star Wars needs to be out of your mind. If you can do so you just might realize that this is what Star Wars needed to evolve.","true":true}