{"101487":145992,"Last Jedi":"Last Jedi","2017-12-15":"2016-01-23","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never seen such a huge fan backlash. Don't believe for a second this is as bad as the prequels. There are bold decisions here and people are really upset the movie doesn't care about their stupid fan theories. It's internet armchair warriors at their worst. This is a gorgeous\\, nuanced movie\\, that keeps you guessing and demands more than just a casual viewing if you wanna go deep. The hyperbole surrounding the decisions made with characters is just that: hyperbole. I'm starting to think people never understood those characters to begin with\\, and essentially wanted them to never grow as people. Also: anyone saying the prequels are better is just salty. Like Crait. The dialogue alone in this film is Shakespeare in comparison. (I'd imagine those people haven't seen the prequels recently or they just genuinely like terrible movies). There are a few plots that def are there to give folks something to do\\, but I like the characters enough to not mind it. This is probably the most emotional Star Wars film ever\\, even moreso than Empire or Jedi. And it's hands down the most gorgeous. It's so much to process initially so def go see it a second time. I loved it that much more on second viewing and most of these 'reviews' are knee jerk reactions to a really subversive film. And the franchise is better for it. There are some minor subplots we don't get an answer for...I don't really see how suddenly getting an explainer for them makes it a better film. It doesn't. On top of that\\, this film treats it's characters like real people\\, actual characters and not just a Wikipedia entry where you can read everything about them and then suddenly that knowledge has made them a better character. Some folks want that\\, and the movies vision cares not for it. It's fresh. It's new. And it's so expertly crafted and visually engaging....I can't believe it's a Star Wars film. Johnson gets performances out of these actors that you don't typically associate with a big franchise. This is a great film. The audience score here is a woeful representation of the final film. Go see it. You won't regret it. ","true":true}