{"101487":177694,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The only redeemable feature of this garbage movie is its pretty visuals. I went into the movie with an olive branch to the trilogy\\, with a condition. I wanted an original plot I didn't get one. It's the same movie That Empire Strikes back was\\, with the battle of Hoth moved into the end of the movie and the show off between the bad guys was ripped from The Return Of The Jedi. Even the confrontation with the bad guys was same with The Villain turning on The Evil Dark Lord Wizard. The plot structure is the same. The Good Guys separate with the Main Protagonist going to training while his\/her Friends fight The Empire. Oh I'm sorry. I meant The First Order. When The Friends are in trouble\\, The Hero comes to save them. The movie plays out a little differently BUT The Plot Structure stays the same! \\n\\nThe entirety of the movie centered around the plot of a boring and dragged out naval combat in space. The enemies were portrayed as incompetent idiots and thus\\, unintimidating. The Main Character is an aimless Mary Sue that just wins at everything because she grew up as a stick wielding scrap collector on some isolated Tatooine rip-off? Really? She never got trained and Yoda says she already knows everything? What the hell is she? Did she just absorb the knowledge like some omniscient hive-mind? That pissed me off. Rey gets a crash course on the philosophy of the force and just gets it and goes back to kicking bad guys? The whole movie is filed with SJW garbage and themes about evil rich guys and animal rights. The ending with the little kids using the force just screams about themes of equality. It's all just a huge load of nonsense. Make no mistake\\, the newest Star Wars trilogy is just a defacto reboot trilogy with SJW crap all over it. Don't support Disney Star Wars with your money and just pirate it if you have to see it. Disney has no respect for Star Wars brand.","true":true}