{"101487":188318,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was simply not Star Wars\\, but the typical radical-left\\, political opinion piece.\\n\\nWe can start with the absolute ridiculousness of the mary poppins flight through space scene after being fully exposed to space for a couple of minutes.  I'm no expert\\, but I believe your blood boils at around two minutes of exposure.  Then go on to bombs dropping in space and finally end at the arcing turbolaser blasts.  Just disregard seven prior movies and go with that.\\n\\nApparently Luke and Anakin wasted a ton of time training to become powerful Jedi.  Rey just pulls it out of thin air and becomes more powerful than Luke and Kylo\\, despite their life-long training.  \\n\\nThe entire Finn\/Rose plot was a waste of time\\, serving only to put the pro PETA\\, anti-war (in Star WARS)\\, and anti-capitalist brainwashing of the left.\\n\\nIt destroyed any story arc from TFA and any previous movies.  Every reason to come back and watch episode eight was a complete waste and this movie leaves no reason to come see nine.  \\n\\nThey made the First Order a joke... literally.  Kylo is an emo preteen while Hux is a source of entertainment.  Phasma was a complete waste and easily killed by the janitor.  There is just no threat from the FO anymore.  You KNOW Rey will just come melt faces\\, so what's the point?\\n\\nBB8 can take out squads of soldiers alone and pilot an AT-ST.  Poe was just a joke through the entire film.  He actually would have been better served not being in the movie at all. \\n\\nLuke was not the Luke that was developed over a trilogy\\, countless books and comics\\, and tens of games developed as cannon by LA.  Why didn't he go to the salt planet?  He died anyway.... it was so useless.\\n\\nAs useless as the juvenile attempt at humor.  Star Wars traditionally had some silliness in the movies\\, but not a fart joke every three minutes.  \\n\\nYou just cannot take this movie seriously and can't enjoy it.  It alone has destroyed my faith in Disney to stay true to the franchise.  I enjoyed TFA and loved Rogue One\\, but after this\\, I see they are sacrificing everything that made Star Wars what it was to push radical politics and make a quick cash-grab.\\n\\nAvoid this movie and disregard Disney's decree to wipe most of the Star Wars cannon if you even liked the franchise a little.  You have eight good movies and a ton of books\\, comics\\, and games that are both cannon directly from Lucasarts and EU.  Avoid this movie if you are even a casual fan of any type of entertainment and don't feel like wasting your money.","true":true}