{"101487":145910,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've heard some people say that Star Wars The Last Jedi is not about anything. I don't know what movie these people were watching\\, but what I saw was an emotionally substantial\\, evocative\\, intensely meaningful movie. \\n\tThe overarching message of The Last Jedi is the notion that the needs of the many outweigh the WANTS of the few. Luke imparts this message to Rey when he reveals that the Force does not belong to the Jedi\\, but to everyone. Rey tries to convey this message to Kylo Ren as she strives to win him back to the light side. Leia and Holdo teach this lesson to Poe when they attempt to show him that rushing in and being the hero is far less important than protecting the light. And Rose beautifully expresses this sentiment to Finn after she saves his life and urges him to understand that the war against the First Order will be won by saving what they love\\, not killing what they hate. \\n\tThe story is about the importance of collectivism\\, of embracing and protecting community and rejecting self-centered pride. It's interesting to note that the characters that express these major themes the most are female characters who are attempting to inspire and open the eyes of male characters. It is true that women tend to be more communal and it makes sense that the female characters would be the ones to spread this message of rejecting selfish dreams of glory and accepting the strength and power that comes from togetherness and unity. Such a great and unexpected theme to find in a movie series that is historically about some guy who is the chosen ONE who must save the galaxy.\\n\tIn one excellent scene\\, Leia admonishes Poe for recklessly attacking the First Order dreadnought\\, an attack that costs many lives. Poe tries to defend himself\\, saying the people they lost were heroes. Leia responds with \\\"Dead heroes. No leaders\\\". Leia gets it. She has seen her share of hotshot heroes and she knows that it is better to raise up leaders who will bring the people together than to glorify heroes who will ultimately fade away.\\n\tThis is why Rey is so important. She seems more interested in leading than gaining power or renown for herself. The revelation that Rey's parents were nobody of significance was so essential. It takes us back to the message of A New Hope\\, to the idea that even a nobody from nowhere can be special. Rey doesn't have to descend from some space-royalty bloodline to matter. Who cares who her parents are or who anybody's parents are. What is important is using one's power to lead with compassion. This is why Rey will be the greatest Jedi; she doesn't have to be a hero or a Princess\\, she can be a leader who shares the Force rather than keeping it for herself.\\n\tThe Last Jedi is brilliant and it is certainly not about nothing. There are so many powerful messages in this story\\, timely messages. It is about the folly of vanity and hubris. It is about the importance of humility and forgiveness. It is about the idea that anybody can be a leader. It is about the danger of running away from feelings. It is about the destructiveness of greed. It is about the universal significance and power of hope. It is about the strength of women. It even takes a jab or two at organized religion and its tendency to anoint itself the arbiter of all good things. At its heart\\, it is about putting the needs of the whole galaxy ahead of the needs of the vain and the greedy and the conceited few.\\n\tWho will save the galaxy? Who will bring balance to it all? Probably not a lone man with a sword or gun out for glory. Instead\\, it will probably be a group of people who believe in balance\\, in equality\\, in protecting the greater good.","true":true}