{"101487":169267,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILER ALERT!\\nThis is so difficult for me because I am such a huge Star Wars fan. My entire life I have gotten so into the Mythos. I have read the Joseph Campbell books that George Lucas heavily borrowed from for the ideology of the force. Return of the Jedi is my favorite movie of all time. this is difficult for me\\, there was too much that I liked about this movie to say that I hated it\\, and there was too much that I hated about this movie to say that I liked it. But I have to be honest I think and say\\, I did not like this movie.\\n there were some wonderful things that I liked about it\\, some risks that I'm glad they took that paid off\\, the space battle at the beginning\\, some of the things done with the plot in the space fight in the light speed crash and the fight between the praetorian guards and Rey and kylo because it Harkens back to the original 1972 plot of a Sith and the Jedi teaming up to fight guards to fight their way out of the base. There are many things that I liked. Some of the humor I loved\\, like Luke tickling raised hand with a blade of grass and she says I feel something and he says that's the force. I love the scene with Yoda. Yoda is my favorite character in all of Star Wars and they did him beautifully and perfectly again. I loved Yoda calling down lightning and destroying the tree. There was a lot I liked.\\n but the many things that I did like was not enough to save this movie. This movie made me angry. I hated Luke. I don't know why they didn't listen to Mark Hamill\\, when he told Brian Johnson that he did not like the direction that they were going with his character\\, man they should have listened to him. I absolutely hated Luke and Luke is my second favorite character next to Yoda. And they destroyed him\\, they made him a loser\\, sulking crooked old has-been that just went to an island to die. That is not the optimistic hero\\, fun\\, loyal to his friends Luke that I know and loved. I cannot stress this enough that I hated the direction that they took Luke.\\nThey somehow  made it so that the struggle from the original trilogy was all for naught. As if Return of the Jedi have never happened or nobody who made the movie ever watched it.\\n I did not like Admiral Holdo until Leia  got out of her sick bed and intervened and siding with  Admiral holdo\\,  shot Poe  to subdue him from doing something rash and being insubordinate. I liked her later When Admiral holdo crashed her ship into Snokes ship at light speed. I didn't like the whole \\\"animal cruelty and rich people are bad\\\" side plot of Finn and Rose. I loved the scene of kylo and Rey fighting the praetorian guards because it was very much like George Lucas's original plan of a Jedi and a Sith teaming up to fight their way out of the base. Although I didn't like Ray fighting because I don't know how she knows how to do it. Never picked up a lightsaber before yet she can kill several praetorian guards by herself come on. I did not like the scene with Maz Kanata\\, what's up with a jetpack? She reminded me of the grandma on Hoodwinked when Little Red Riding Hood calls her and she's fighting bad guys and she's like \\\"I got to go my programs on bonsai!\\\"\\nScenes that were really interesting are often cut short by scenes that were far less interesting and it really chopped up the tone of the movie. Like Luke talking to Ray about the force switching to a scene of Admiral Holdo giving an uninspiring speech\\, or switching to Finn and Rose to ride space horses.\\n at first I thought I will just give this movie another chance\\, but the more I think about it in the more I mull it over in my head the more frustrated and angry I get that it is destroyed the character arcs of everyone that I like and destroyed the mithos and the story of Star Wars. \\n I should not have to wait for the second half of a movie to like it. I should not have to hate the first half of the movie before I start enjoying it. I don't hate the first half of Empire Strikes Back or Return of the Jedi. It was just not well made.Quite frankly I think I'm just going to sell my Force awakens DVD and Star Wars is going to end with the Return of the Jedi for me. I will not be seeing episode 9\\, I have no need to\\, no incentive to see it. There is nothing tying me to this Saga anymore. I didn't like it and I think I'm done.","true":true}