{"101487":189112,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To be fair\\, I was actually enjoying the movie at the movie tmake new characters relevant to the story. The entire Rose - Finn side story is just a washeatre. My first impression of the movie is aligned with the critics\\, it's a beautifully directed movie with plenty of fun and surprises. However\\, when I got home and actually think about the plot and how it's gonna unfold in the future\\, I feel this movie has done some irreversible damage to the series. \\n\\nHere are what I think they did it so wrong\\n\\n1. Killing of snoke is a surprise\\, but that leaves kylo ren the only antagonist in the series. He's neither strong  nor intimidating. I don't have any interests in seeing how rebel would defeat first order in the upcoming episode\\, as I can already see they will somehow blow up first order's newest battle station and kylo ren will lost a duel again with Rey. If he's still alive at the end of TLJ\\, I'll still be interested to find out how Rey can defeat Snoke without Luke's presense. I know the director want to have a wft moment in the movie that matches the empire strikes back's 'I am your father' line. But killing of snoke just makes the subsequent story uninteresting in contrrast of empire's shocking revealation.\\n\\n2. Wasted opportunity on Luke. If anything they should have learned from Rogue One's success\\, they should know that fan will forgive everything if you just treat the fans a showcase of power of their favorite characters\\, even if it's just for a brief minute. The luke's display of power at the last scene is both lackluster and pathetic. Makes you wonder\\, is that all Luke can bring after years of training and meditation?! \\n\\n3. Useless new characters. I mean I get it that Disney wants racial and gender diversity in their movies. I am cool with that as I am an asian myself. But te of screen time that doesn't serve any purpose in the big picture. Both Rose and Laura Dern's character are not likable in any way. And the Lando wanna be DJ character is just not redeemable. \\n\\n4. Phasma and Knights of Ren are ultimately not relevant. I don't even care their back story now\\, one more reason to skip episode 9.\\n\\n\\nFinal thoughts\\, the entire purpose of ep8 is to further expand what has been established in ep7\\, and sets up your audience's expectation for ep9. In that regards\\, this movie failed on this cause miserably.","true":true}