{"101487":153324,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Maybe in a month I'll be like \\\"eh fk this\\\" but right now having just come from the theater I can say I enjoyed this as much as I could for what it was. What is it? Overtly formulaic marketed Disney toy vehicle with a handful of good actors being underused. But that's fine\\, it is what it is. \\n\\nI enjoyed all of the women in power in this one\\, even if they all felt kinda under used. Poe is such a flyfckboi bitch and Leia is definitely tappin that and I'm here for it. I enjoyed Laura Dern's bad ass terrorist exit too. And Rose was a solid addition to the cast\\, enjoyed her zapping the shit outta Fin. \\n\\nHated the porgs. Loved the crystal critters and those giant race dogs. Kylo Ren still a mopey bitch who IF he could just have a conversation and clear up some shit probably coulda saved a buncha lives but no ok just gonna throw a fit? Alrighty. Fin didn't do much except slay my main girl Phasma which was a bummer. Poe\\, besides being a dumb bitch\\, was hot as hell and so I appreciated his screen time. Benicio del Toro was also a great addition and hopefully made it out alive. \\n\\nPour one out for Admiral Akbar\\, VERY upsetting. Ok I think that's all I have to say about this Star War. Maybe one stab at interpretation: a movie about killing your idols (literally and figuratively) in order to grow\\, how abuse of authority is inherent and perpetual as things grow larger\\, Poe is a mutionus fool but I'd still hit it. Did I mention Poe is a hott--","true":true}