{"101487":193229,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Warning - minor spoilers. What makes TLJ so disappointing is that there were so many opportunities for character growth after TFA. To watch Poe become a whiny second\\, Finn continue to bumble and Rey be Rey\\, is simply unfortunate. Kylo Ren\\, continues down his awkward path of self doubt and internal conflict and his path is easily predictable. Further\\, if someone could explain to me why Luke “The Last Jedi”\\, is so intent on ending the Jedi\\, yet dresses like a Jedi I would be greatly appreciative. These characters - these actors - deserve better. Carrie Fisher deserves better. It it sad and unfortunate that Carrie died. Her fans do and will continue to miss her immensely. So why in a movie where there are multiple opportunities for her to be written out of the story gracefully does Johnson force himself (now JJ) to make something up in IX? There was so much time between principal filming and this movies release to do her justice. Why not allow the bridge scene to be her farewell\\, or let her slip away in the med bay? Why not let her take the lead ship control from Holdo? Why not let her walk into the sunset with Luke? Now\\, instead\\, there needs to be an explanation that no SW fan is going to buy. People may argue that TFA was merely a remake of ANH (there are without questions similarities)\\, but that’s what an opera does. It repeats themes. It may not have been wholly original but it made sense. It expanded the SW universe and it’s canon. Where JJ went back to the live sets and grit of the original films and made them as much a character in the movie as any actor\\, Johnson seems to have found his inspiration in the CGI of the prequels. This leaves so many environments uninspiring and lifeless. The characters don’t act well inside them\\, and they are more distracting than imaginative. There are unquestionably some great special effect shots in this film\\, but with a movie this choppy and flawed\\, who has time to care?","true":true}