{"101487":191621,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Very disappointed in this movie. I am not sure how it has a 93 critic rating. Disney must have paid them off.\\n\\nI won't talk about any spoilers but Disney needs to get rid of Rian as director. He made so many bad decisions. There are huge plot holes. Characters go on pointless missions. 50% of scenes added absolutely nothing to the movie. NO light saber battles. I mean seriously? This is Star Wars.\\n\\nThe whole premise of the movie is ridiculous. Starship chasing starship. Fighters can't go far from main ship when lone fighters travel just fine in many previous films? Rian\/Disney\/whoever made these design decisions is an idiot.\\n\\nThe whole movie basically felt as if they had an idea and then tried to add in fillers\/bloat and half assed explanations to progress the story. Was it really that important to make Rey and company the new face of the series that they had to basically sacrifice a ton of potential in older and more iconic characters? I understand a new generation of children is being targeted but these kids will also watch the older films. Should have tried to add to the Star Wars universe\\, not replace it.\\n\\nSorry for the rant and vagueness. Not trying to spoil movie since many who are reading here are still set on watching it. \\n\\nLike many others i left the theatre with very little desire to see the third installment. Hopefully the backlash from this movie will wake Disney up because otherwise Star Wars is in for a slow slow decline. I anticipate they can still milk the franchise even with these disappointing movies for a while longer since Star Wars has such a strong following. Sad.","true":true}