{"101487":155096,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"My 10 cent worth is it could possibly be worse Star Wars movie ever!\\nThe PLOT\\nLeia and her Mary Poppins\/Superman scene WTF\\nThe Comedy fell flat at every opportunity.\\nThe Bombers dropping bombs in space with zero gravity.\\nThe PLOT\\nSnoke's death\\nSnoke's lack of story\\nThe PLOT\\nWhere is the knights of Ren?\\nEverything with Luke in it.\\nLuke milking a sea lion thing then grinning at Rey like some creepy freak WTF\\nLuke throwing the saber over his shoulder.\\nThe PLOT\\nLuke going to kill Ben Solo because he sensed dark side in him?? \\nLuke being the dude who wanted to save Darth freakin Vader but fook it kill his nephew! \\nNo wonder Mark Hamill was pissed.\\nRey is the jesus christ of the jedi world.\\nShe has instant super doper powers with zero training.\\nRey's parents are nobodies even though in TFA it was made out they were someone important.\\nThe PLOT\\nThe awful side story of Rose and Finn that was worthless.\\nThey end up in a jail cell conveniently with a hacker who's waiting to break out WTF\\nRose falls in love with Finn in a few hours??\\nSnoke's throne room has nothing in it apart from a giant magnifying glass WTF\\nThe mutha fookin PLOT!\\nAnd last but not least the ending Luke's death OMG that was horrible writing.\\n\\nIt all could have been forgiven if at the very end Luke came out with his green saber and kicked all the Walkers ass's but nooooooo he wasn't really there GTFO here Rian you dick!","true":true}