{"101487":133658,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have been a Star Wars fan my whole life. An entire wall of my room is devoted to displaying my vintage Star Wars action figures. I've read so many of the books\\, I've seen the films over and over\\, I've played most all of the LucasArts video games. I really and truly love Star Wars... but I hated this film.\\n\\nHalfway through the movie i was thinking \\\"if i came to this alone id just get up and leave.\\\" I was so fucking bored and done with it. Nothing makes sense. It's filled with plot holes and inconsistencies but worst of all it has no respect for Star Wars. It treats everything as if it's a stupid joke in a pixar film. It has the same attitude towards serious and tense moments as Boss Baby. It defecates on everything you love about Star Wars (spoiler: Admiral Ackbar dies OFF SCREEN and is barely acknowledged.)\\n\\nThere were so many \\\"WTF\\\" moments that halfway through the film I gave up. I stopped trying to follow it. I wasn't watching a movie. I was just watching moving pictures and hearing loud noises at that point. I had no reason to care about any of the new characters and the old characters were just hollow images of their former selves. Luke isn't Luke. Mark Hamill even said in an interview when asked about how this portrayal of Luke differs from what he thought it'd be\\, he said \\\"Who is this guy?\\\".\\n\\nThe way they treat important characters and events is a joke. There isn't a tense moment in the film. Whoever wrote this script should be taken out and shot for murdering the franchise and Disney should be crucified for allowing this to happen\\, but we all know that'll never happen because Disney is the untouchable corporate god of media.\\n\\nPlease don't see this movie at the theatres. Do not pay money for this. Do not buy the toys. Go see Blade Runner instead if it's still playing in your area. This movie is not worth paying money for. Wait for it to be in a bargain bin somewhere on dvd. \\n\\nThis movie has really made me consider whether or not I'll go see any new Disney Star Wars films in the future. At this point it seems unlikely.","true":true}