{"101487":164516,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Really just disappointed. I have been waiting for two years to see this\\, spent countless hours reciting all the different possible storylines and this is what i get?The three main story's are the chase\\, Kylo\/Rey\/Luke and then the Finn\/rose shit show. The overall plot revolves around the the resistance running out of gas...are you kidding me. I didn't even know they had gas in Star Wars\\, you'd think they would have thought of some other sort out way to have energy for space shit considering they have lightsabers\\, guns that destroy planets...etc. Then in a way to combat the gas shortage\\, Finn and some random lady have to go space Montecarlo and find some guy\\, but they find a different guy who's bad. This all doesn't even matter because they end up blowing up the First Orders ship with hyper speed which was really cool tbh. So that complete storyline was redundant. Then Rey and Kylo like become buddy's but Kylo is tricking her and they team up and kill Snoke! But then Kylo immediately turns back evil. What was the point of Snoke? He was barely in the first one and he gets killed halfway through this. No character arc he just is some fake emperor who dies and no one really cares. Another redundant story line. So the resistance get away and then Luke dies which actually is kinda cool\\, and the whole Yoda scene is great but why would Yoda burn books? In the end it became clear to me that the whole point of this movie was to set up\\, not the next film\\, but the next series. With everyone dead from the original trilogy except Leia (she's next) i felt this weird shallowness leaving the theatre. All these characters have died or been killed and I just don't really feel connected to the new ones. Finn was great in the force awakens but his second act was very meh. No one gives a fuck about Rose she's just a cheesy annoying character that's just there. Poe is cool i guess but my biggest let down was Rey. Why do i have to like her? I just don't really care for her\\, she's just some random girl with the force. Luke doesn't even like her. Kylo Ren is actually my favorite character\\, he's whiney but actually has depth and a part of me wanted him to go good and Rey to go bad. Overall it's just a really disappointing experience. The script sucks also\\, too many serious moments are ruined by attempts at comic relief which land at a 20% rate. (Biggest one being a remark rose makes to Finn as they're leaning the first order) It's sad to say but this kinda has ruined Star Wars for me\\, this whole film destroyed so many of the reasons why i love Star Wars and replaced them with new characters and stories just to bridge the next trilogy. Go and see it because it's Star Wars Maybe your opinion will be different than mine but The Last Jedi is the worst Star Wars since Attack of the Clones. 3\/9 (on the Star Wars movie rankings)","true":true}