{"101487":121466,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First Viewing Thoughts (SPOILERS)\\nIn with the new out with the old. TLJ took risks that made us as star wars fans realize that we've been looking at the wrong things for depth\\, and thinking the wrong things mattered. I for one\\, understand the frustration by some for lack of a Star Wars feel\\, however I believe you're missing the point if you feel this way and here's why.... First of all\\, the opening scene of Rey and Luke was amazing. It\\, and the scene of Snoke's death tore apart the premise of TFA with swiftness making you realize that heroes of both sides can go down at any moment. It was Rey and Kylo\\, who played off each other the entire time who brought Luke back to relevance and kept the First Order from shattering under Snoke's demise. Now before I go into depth on everything I loved about the movie\\, here's some things that annoyed me: 1. DJ's betrayal felt so pointless and just annoying. 2. Introducing Poe and Rey was cute but felt like a forced cover up for now making Finn and Rose the new love interest. 3. Why on earth did Kylo Ren show Hux any mercy and let him live after Snoke died. (They shouldn't have mocked Snoke's irrelevance by showing a frame of him dead with his tongue out either) Maybe to lead his troops\\, but the way they favor Kylo because of the force and Hux calling him Supreme Leader reluctantly (awesome btw) makes me think that was unnecessary. Now I begin on this. The first fight scene opened the movie with a bang by being incredibly funny with Poe mocking Hux\\, and showed how devoted the resistance\/(now rebels again?) is to the cause as Rose's sister took one for the team and pulled it off with her dying breath. Amazing. The dynamic of Rey and Luke was phenomenal. Luke took the Yoda role\\, but you could tell the impatient wanting to do what's right but in his way Luke of the originals was very much alive. Kylo and Rey connecting through the force set up an interesting unspoken conflict between Rey and Luke until it all came out before Rey left explaining she could bring Kylo back and before Luke had his conversation with Yoda. Yoda is still that dude and the wisest being ever btw\\, however\\, I wish they would've spent any time explaining Luke and Yoda's feelings towards the Jedi order being corrupt and over (which they backtracked over in the end in Luke's words to Kylo hinting that Rey will lead the new generation of light side users). The theme of the movie was obviously symmetry and nothing displayed it better than Kylo and Rey. Throughout the whole movie they mirrored each other exactly. At the beginning they were both questioning themselves and who they were. Kylo after Snoke degraded him and Rey searching for answers from Luke who was originally closing her off. Then\\, the closer Rey got to the dark the closer Kylo got to the light. The brief moment of Kylo's betrayal of Snoke and Rey and Kylo slashing up the imperial guards (I think) was the moment they were complete evens in terms of the dark and the light. However that quickly changed with Kylo revealing to Rey his intentions and Rey not giving in to her dark side and resisting Kylo one final time. There\\, things snapped back and Rey became engulfed in the light and Kylo back to his beginning of the movie dark state. Leaving us at the end of the movie with each of them being as dark or as light as they've ever been (Kylo after Luke shits on him and Rey after reuniting with Finn and Leia). THIS relationship is what made the movie amazing. In my opinion I see why people would say Snoke is underused but in reality he was almost irrelevant to the storyline other than turning Kylo to the dark before the trilogy even began. Some random things I loved: 1. Rose\\, Finn\\, Leia and Poe got their own storylines. This was a long film\\, but I loved the depth it went into on the force sensitives and the resistance fighters having their own separate stories. 2. Although random and a little weird\\, Leia using the force was AMAZING to me. 3. Luke's disappearance and becoming of a force ghost to me was not wasted and we will see him become more powerful of a force ghost than ever before because he transcends physicality more at peace and with more strength than anyone we've ever seen. So we'll explore that new chapter in episode 9. 4. LOVED LOVED LOVED both Luke and Kylo being ashamed of what actually happened at the Jedi academy and lying (hinted that knights of Ren may also include other force sensitive students ALSO WHERE TF THEY AT HOPE THEY EXIST IN EPISODE 9) but then Luke coming out and sharing the entire combined backstory to Rey. 5. Rey's backstory is exactly what I've been asking for for the past 2 years and I loved her being no one and a vessel of the force. Although she could still be related to Obi Wan. This movie was simply amazing to me and shattered all my expectations. After first viewing\\, it is a solid 10\/10 with no doubts and the greatest movie of all time. Easily the most I've enjoyed any viewing of any movie at the theater ever. Where will they even go with episode 9? Who is that kid and will he be Rian's new hero? What will they do with Leia without Carrie? Who knows\\, but I can't wait for these next couple years to go by already. Final note\\, Adam Driver\\, Daisy Ridley and Mark Hamill STOLE THE SHOW with their performances. Everyone else was amazing too\\, but these were all time performances. \\nside note:\\nyoda's destruction of the books was awesome because it showed that they're irrelevant. however\\, I wish we got more insight to what was inside of them\\nVERY VERY VERY funny movie","true":true}