{"101487":130325,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I created a RT account just so I could rate The Last Jedi.\\nSimply put\\, it is boring. It is poorly written. The plot choices make no sense. There is no real character development. The pace is slow and plodding. Rian Johnson seems to have written the screenplay and directed the movie with the intention of bringing flippancy and cynicism to Star Wars and giving the middle finger to all true Star Wars fan. He wanted to defeat our expectations\\, and succeeded in the worst possible way. The details (spoilers):\\n\\n- The primary plot of the movie is a slow chase between a First Order fleet and remnants of The Resistance. This is not a bad idea\\, but it is ridiculously executed. Tactically speaking\\, there were numerous options available to the First Order to corner The Resistance. I guess none of them fit with Johnson's script.\\n\\n- Luke Skywalker greets Rey by throwing the infamous lightsaber over his shoulder. He symbolically and effectively flushes all the setup established in The Force Awakens and the other films down the toilet. Luke Skywalker turns out to be a beaten-down sardonic useless old man. Way to go. Rey gets no training. There's a pointless scene with Rey in a cave. Yoda shows up and spouts some pop philosophical nonsense.\\n\\n- Kylo Ren kills Snoke and takes over the First Order. Cool\\, but... give us a little more backstory for Snoke. Why do we hate him? How did he seduce Ben Solo to the dark side? Kylo and Rey fight Snoke's guards. Cool\\, but... can we see some force powers in the battle? Kylo did some cool stuff in The Force Awakens.\\n\\n- Canto Bight is an Earth casino with aliens in it. Super. I support animal rights\\, but the morality play is too awkwardly inserted. More subtlety and subtext\\, please. BB-8 has super powers. Wonderful.\\n\\n- Laura Dern plays Admiral Holdo\\, who apparently took some time off from selling homemade jewelry at the farmer's market to talk down to Poe Dameron\\, keep pointless secrets\\, be Leia's secret feminist lesbian lover\\, and crash a cruiser at lightspeed.\\n\\n- At the film's end\\, The Resistance throws out some skimmers and some troops in a trench to die for a few minutes in front of the First Order walkers. It makes no tactical sense and results in no First Order vehicle or personnel casualties. I guess they wouldn't have all fit in the Millenium Falcon for the final escape. Brilliant. Why can't the First Order hyperspace track the Falcon at the end? Oh\\, and there's a forced romance between Finn and Rose Tico. I like Rose\\, but it wasn't done right.\\n\\n- Luke Skywalker shows up and plays Jedi Houdini. Then he dies on a rock\\, because he's tired. This was much a surprise to Mark Hamill\\, I'm sure. Been waiting since ROTJ for that?\\n\\nRian Johnson is an arrogant SoCal dirtbag and hates Star Wars. It is the only rational explanation. Kathleen Kennedy is his evil accomplice.","true":true}