{"101487":140524,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I think all the hundreds of reasons why this movie was so mind bogglingly terrible have been explained in prior posts. I just wanted to more describe the experience of watching this monumental pile of wet bantha poodoo at my local theater. The audience was completely silent except for some nervous chuckles. I saw it late at night and there were a lot of millenials there who for the most part probably didn't understand the power and magic the OT had if you were a child growing up with it. I vividly remember seeing Ep. 4 at the age of ten and the crowd cheering and laughing loudly... it was an integral part of the experience\\, just goosebumps over and over. Fast forward to 2017 and I wanted to and should have walked out of this trash compacted garbage heap during the casino planet disaster... but have been waiting since 1983 to see my childhood hero Luke Skywalker come back and kick some butt. (SPOILER) Then he turned out to be a hologram... and then he just died for no explained reason. It tore the soul out of my body and urinated on it.\\n\\nAlso Luke never told Leia or the like 20 people left in the Resistance what his plan was - to stall the enemy. Really good thing they figured it out and left through a tunnel to be miraculously picked up by Rey in the Falcon. A side note Anyone wonder how the First Order didn't notice it sitting there plain as day on the surface of Crait? I mean it was only like what a mile or two away from the base. Wouldn't the skies be black with tie fighters??? Anyway as I left the cinema all the millenials filed out silently staring at their smart phones... it was probably the most depressing moment of my movie going life. Never going to give another dime to Disney for what they did to me. Unforgivable... the end.","true":true}