{"101487":186728,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was just rubbish. I have no idea where to start. Does Rian Johnson hate Star Wars and the lore that George Lucas (and company) created? Or is he just trying to create a name for himself as the guy who turned the saga into a steaming pile of bantha fodder. The movie is boring and full of bad dialogue\\, awful forced humor\\, and bad character development (if it even existed at all). I was not a fan of the Finn and Rose side plot and that kiss...painful to watch. I am not sure why Holdo was introduced when Admiral Ackbar could have served the same purpose and had a fitting farewell (as he is a fan favorite). I don't really understand why the director would turn Luke into... well\\, I am not sure who he was but his personality was awful. This is not Luke Skywalker. I think Mark Hamill is right\\, this is Jake Skywalker. Also\\, I really didn't like the flying princess. I enjoyed TFA and it brought back the nostalgia of the OT for me. My kids loved BB-8 and Rey so we were so excited to see Luke train Rey and learn who she was\\, catch up with Snoke and the Knights of Ren\\, and see Hux and Kylo grow in strength and power. Sadly the Snoke character development and backstory was abandoned\\, the Knights of Ren were completely ignored\\, Hux is a (prank call) joke and Kylo can force facetime now. I am not going to turn my back on this franchise and my family and I will still be going to Disneyland quite often\\, but this paper thin movie was really a drag. I think the biggest twist of all is that my kids aren't interested in seeing it again and have asked me to take them to see Thor: Ragnarok (AGAIN). Never thought I would see the day when Rian Johnson's Star Wars movie would make my kids lose interest in the franchise.","true":true}