{"101487":176912,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie represents everything about Star Wars fans must hate. The resistance fails in all movie there wars no plan achivement by Leia or the \\\"heroes\\\".  All the resistance fleet tried to escape and finally they did it in the MILLENIUM FALCON\\, the loses were massive\\, they failure were massive. The Finn's plans failed\\, almost wxecuted. The mutiny of Poe failed. The bombing to dreaghnot ship results carhastrophic. How the resistance could un the future be strong? No one response the Leía's calling and Now Luke is no longer. The future of the Resistance is none. \\nIn Star Wars the New heroe are Rey \\\"no body\\\"\\, Finn \\\"no body\\\" why? Because I think for Disney is not important developing the New heroes and villains. The original Star Wars every main character has enough background to satisfy the fans\\, even the names in somehow reveals who they are: Han SOLO\\, Luke Skywalker (the last name more powerfull of the Galaxy thats Now means nothing). The son of Schmi the slave (more humble origin than Rey) was born from the will of the force\\, agree or not\\, our favourite  heroe\/villain has a full explained story. This story took 6 episodes. Now Snoke a super powerful evil dies without any explanation about what o who was. \\nLeia resurects into the space\\, is for far far the most stupid scene in the movie industry\\, an  insult For the fans. \\nThe Yoda looks so bad that was a disappointment. \\nThe poor characters (not for an acting issues)\\, the stupids scenes (Poe vs Hux jokes is other example)\\, the no sense with Luke's reaction\\, no sense in the resistance fleet persuit (takes all movie)\\, every heroes plans failed\\, all of these are the perfect ingredients to create the worst Star Wars movie. So bad that I refuse to call it \\\"Star Wars\\\".","true":true}