{"101487":169523,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS!!!!\\nWhy Stars Wars the Last Jedi sucked:\\n1.\tIt did not feel like Star Wars.\\n2.\tThe movie was too long with too much filler.  \\n3.\tToo much CGI.  It felt more like the prequels.  IE. Finn and Rose's chase through the streets\\, BB-8 with the walker\\, etc.\\n4.\tFinn and Rose's storyline was pointless and unnecessary.\\n5.\tToo much humor.  For a movie intended to be dark\\, it was trying for kids laughs too much.\\n6.\tPorgs were only in the movie to sell toys.  It was overused.  A few times it was funny but by the end it was stupid.  \\n7.\tWhy exactly caused Ren to extinguish the light inside him?  His talks with Rey?\\n8.\tThe Rey's parents thing seemed like a cheap out.  \\n9.\tIf Ren was struggling with the light why did Luke think he was forgone at the temple?   But Rey can sense it?\\n10.\tLuke crying the entire movie.\\n11.\tLuke's Matrix move.  I wanted to see Luke do some badass shit.   The matrix move was just horrible.  \\n12.\tWhy exactly couldn't the First Order catch up with the Resistance fleet?  Couldn't they have just sent a star Destroyer in front of it from a different location in hyperspace?\\n13.\tHow exactly did Snoke corrupt Kylo Ren when he was at the Jedi temple?\\n14.\tThe action was mediocre at best.\\n15.\tWhy did the Admiral wait to see a bunch of her allies die before saving them when she knew she was going to die anyways?\\n16.\tBenecio Del Toro\/Laura Dern... why?  I hated their characters.  We don't need big names in the movies.\\n17.\tThe entire resistance is what 8 people?  How are they going to recover when they have no allies or money or supplies?  Luke's stand will inspire everyone\\, everywhere?  \\n18.\tDid Yoda look weird to you?  I loved he was there\\, but the visual was just way off\\, like worse than the prequels off.  \\n19.\tBB-8 shooting coins and tying up prisoners.\\n20.\tTotal underuse of R2-D2 and Chewbacca for that matter.   \\n21.\tFinn should have died.  It would have been a meaningful death.  \\n22.\tWho the hell is Snoke?  He basically was nothing more than an ancillary character.  I will say his death was badass.\\n23.\tWhy was Luke astral projecting and not in person if he was going to die anyways?\\n24.\tIs Rey just going to train herself?  \\n25.\tLeia's floating in space.  It would have been a good end to the character.","true":true}