{"101487":129930,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I can say a lot of it was well made. I loved the set up of the connection between Rey and Kylo and the fight in Snoke’s chamber was awesome. The planet at the end was cool. Luke was ruined\\, Finn went from a character I really liked to an annoying character to me because he was so tied to rose who is the absolute worst character in Star Wars (everything she does literally leads to failure and she is treated as a moral superior character who is always right)\\, the entire plot line of rose’s arc is dumb. They are able to fly off the ship undetected\\, wait why don’t they just fly people off one at a time in that exact same way? They happen to go to a planet and their plot is foiled by “a parking ticket”? They happen to run into a DIFFERENT guy who just also happens to be skilled enough to accomplish this task in prison? And that guy happens to be able to escape prison at any time he just coincidentally waited for them to be there? She has that god awful line where Finn says at least it’s all been worth it cause they freed the horse things and she goes “no\\,” reaches up and undoes the saddle of the last animal and says “now it was worth it”. The hacker they get betrays them and gets a ton of resistance member killed (failure in a movie is awesome but not placing any blame on rose was awful). Then she is suddenly one of the top members of the resistance and a pilot and crashes into Finn nearly killing them both in order to say her line about winning by protecting what we love not destroying what we hate and then surprise kissing Finn. Absolutely terrible character. Poe has a really cool arc of being a hot head and needing to learn that there is a time to wait and be patient and it’s executed awesomely by having him send off a mission that leads to deaths and failure.... but the reason he fails is cause the people in charge won’t tell him there plan for absolutely no reason is awful and then in the situation where the resistance is about to be wiped out he decides THAT is the moment not to put it all on the line? TERRIBLE! Killing off Snoke with no explanation of who he was and also saying Rey was a nobody was kinda cool and good to not follow the same sorts of reveals that are in empire BUT what JJ does in 9 is much better. Then there is the issue of this being the middle of a trilogy that is supposed to set up an episode 9 finale... it discards all of 7s ideas\\, but sure I could go with that\\, but it also leaves the most bare of set ups you can imagine so episode 9 has to spend half the movie setting up the finale in order to execute the finale. If not for Solo\\, and maybe episode 2 this would be the absolute worst movie in the Star Wars universe even though it is better made than all the prequels because it’s storyline is a mess. I love Rian Johnson\\, and looper was absolutely awesome.... this was bad.","true":true}