{"101487":170058,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars The Last Jedi (2017) Film Review I was glad that they utilized the classic characters better. I was glad that this film used established themes more. I was glad this film did a better job at the world building and creature development compared to The Force Awakens I was pleased by the opening of this film. It is one of the better Star Wars openings. This film is not as dark as Rogue One or Empire Strikes Back. I like the film score by John Williams but it is not my favorite of the Star Wars films. I was not pleased by the ending of Luke at the end. I was glad we saw Yoda once again. I could not stand how long this film had the Rebels evacuating. I felt like it took way too long. I also had trouble believing this story at so many times with these cheesy sequences. I was glad that we saw Leia's Force powers in this film and we got to see Luke with his Light Saber once again. I just wish that we saw Luke do more with a Light Saber. I think that the Space battles were cool but I wish that we saw more practical stuff and less CGI. One issue I had with this film was that they made the Rebels and Resistance seem small. I think that this trilogy has been the weakest of them all. I was glad that Kylo Renn finally took care of Snoke which is more than Vader did. One issue I have with this film is how small they made the Rebellion or Resistance become at the end of this film by destroying so much of it by the end of the film. I had a real issue with this film where they saved just at the nick of time way too frequently and there was not enough emotional investment in this film or the creatures. I have a problem with all the new characters. I just don't care about the main characters. There are all these humans but not enough alien main characters. I had a problem where the battles took so long or there was so much time it took to do something that I had trouble believing in the reality or believabilty of this film that it would take as long as it did to accomplish what they did. Also I had a problem where this film tends to have the stakes so high and yet always leaves enough for characters or enough to be saved so often that to me it lost my sense of reality and my belief that it could happen as often as it did in this film. Those aspects disappointed me the most about The Last Jedi. There were stacks in this film but not emotionally invested stacks in this film. ","true":true}