{"101487":164896,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Return of the Jedi was released in 1983. I was 2 years old. I watched Star Wars from basically the second I was born every Christmas. That's 35 years of fucking dedication to the single-most incredible film series and saga in the history of film.\\n\\nWhen the prequels were announced\\, every sci-fan in the world (regardless of who held sides in the Star Trek vs. Star Wars debate) instantly got erections that could topple mountains. Meet Joe Black is one of the highest grossing films of all times despite the fact that very few people saw it. This is due to the fact that it was the first film to show the trailer for Episode I. Most people walked out after they saw the trailer. It sparked world-wide anticipation for this beloved trilogy. We were handed cinematic abortions. Creations worthy of Hell itself on loop. The prequels are universally met with scorn to the point that fans deny their existence. Episode I was dished out in 1999.\\n\\nWe were then delivered the necrotic excrement that was the 'remastered' original trilogy. Any true fan to the series immediately burned any copy they had of that cancer on magnetic tape. It was an insult to the living memory of what was expertly delivered to us on the big screen.\\nThen the worst thing imaginable happened.......Disney bought the rights and we despaired for the future of the series. We'd waited 16 years for the next instalment and every troll who was savy with editing software immediately mocked such an enterprise.\\n\\nFate handed us an expected twist. Episode VII was a fucking masterpiece. It was nuanced\\, the story and characters were rich and well thought out. The story arc was complicated and amazing and held true to what we had seen in the original trilogy. I remember seeing it and I don't ever remember blinking. It filled me and other fans with hope and salivating anticipation for the next instalment\\n\\nThen Disney threw us a curve ball. ANOTHER prequel movie; this time set between Episodes III and IV. Yet again\\, another masterpiece. This time based on fan fiction. It was incredible. It was not traditional Star Wars and as Matt and I have already outlined in previous posts\\, it shook the foundations of what we expected the saga to be. It appeared that Disney was truly the successor to something I have loved my entire life.\\nThen today at 5.40 p.m. I stood in line shaking and\\, with a smile from ear to ear\\, I went into the cinema armed with a foot-long hot dog and Tango lemon ice blast. I didn't want to believe what Steve had said.\\nWe'd had two years of fan fiction and YouTube hypotheses. Each intricately exploring plot lines\\, canon and non-canon possibilities to explain what we had seen in Episode VII. We'd had millions of people wondering who Snoke was\\, who Rey was\\, why Luke had gone to the first Jedi Temple. They\/we had even gone so far to assume that Disney would try somehow to incorporate the prequels.\\n\\nDarth Plagueis and Windu were a betting man's staple.\\n\\nThen the opening sequence rolls.....\\n\\nThe opening is shit like someone wrote it 5 minutes before I saw the film.\\nRemember all that hatred that had been built up over the prequels? Yeah\\, this is worse. For the first 30 minutes\\, I kept wondering when they would actually hit the 'act' button rather than showing us the outtakes and rehearsals. Did Disney just say \\\"Fuck it\\, we hit it out of the park on the first one. Make this one as quick as possible\\\"?\\n\\nHey\\, why not just throw a bunch of CGI in there? Worked for the prequels\\, right? NO!\\n\\nMark Hamill spends 3 hours looking like he doesn't want to fucking be there. A fact that is reinforced by anyone who had read his articles or seen his opinion on the new films.\\n\\nLet's extend that. Every character in this fucking abortion is two-dimensional and had absolutely zero character development. After about an hour\\, it got interesting. It seemed to go back to the thing we expected. Snoke was interesting. He was enigmatic. We expected something fucking amazing in terms of story discovery and enhancement. We were fucking robbed. There is limitless fan-fiction out there that Disney could have drawn on\\, but they pussied out like the corporate-driven\\, copyright-fearing CUNTS that they are. After the spectacular Rogue One\\, you'd think that maybe......just fucking MAYBE that they'd realise where they were going RIGHT!\\n\\nEvery time the film got interesting in terms of character arc\\, it was essentially cock-blocked by nothing. NOTHING! A story just ended.\\n\\n*SPOILERS*\\n\\nAvenues were not explored and the film became entirely predictable. As for Luke \\, why the fuck was it necessary for that final scene? Why not in person? He had the x-wing in the bay. Him dying the way he knew he would but from afar served no purpose. It would have been better and more impressive and emotive if had gone the same way Obi Wan had. Also Yoda fucked me off. I loved the fact that they didn't go totally CGI and used a puppet for Yoda. But Jesus Christ\\, they got it so wrong.\\n\\nNothing cohesive happened in regards to script and plot development. All we have now is a bunch of dead people and we know nothing new. All we have are predictable plot lines and an anger that can burn Titanium until it consumes George Lucas.\\n\\nIn short\\, the prequels were better.","true":true}