{"101487":115892,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disappointing... again.  The primary issue is sacrificing character depth to nostalgia... we start to learn more about Ren but it is not developed.  Instead they keep rehashing old story ideas - like the Falcon flying through a maze and the Empire crashing into spaces they can't go.  Yawn.  Destroy the big ship (the entire creative process must have been 'Abrahm's says we can't use another Death Star... What do we do?' ... Yawn.  Let's let Ren go to the 'dark place' and do something mystical and hard to interpret.  Yawn.  Let's have Yoda show up and correct Luke.\\n\\nVisually\\, the movie is stunning - truly as good as any Star Wars movie and in that respect makes the movie worth seeing.  Who ever had the idea for the red sand - great job!  And FINALLY\\, the x-wing is not constrained to aerobatic type moves in space!\\n\\nPoor Adam Driver got a chance to act a little\\, but (again) the shallowness of the character is just unbelievable.  Why does he want to be supreme leader?  Why does he hate so much?\\n\\nThe politically correctness of the movie just made me want to gag.  Women in every roll of power\\, men in weak or dying positions throughout.  Almost every officer on the bridge of the cruiser was a woman.\\n\\nOk... and who believes that a technician who guarded the escape pods suddenly can and would be chosen to fly a land speeder (forgive me - I don't know what it is called) at the end of the movie.  Seriously.  Out of everyone in that base\\, and all of the pilots\/co-pilots who flew there\\, they couldn't find an active qualified pilot?\\n\\nAnd...  the empire can't catch a cruiser. Uh\\, the empire had ships which could travel faster than light.  At a minimum\\, hyper -in and then back in with half the fleet - in front of them.\\n\\nAnd... did they really just figure out that they could fly a ship at hyper speed through another ship... seriously?  Seems like (just my last point) someone might have made a few weapons (like an X-wing) to do just that.\\n\\nRogue One was a wonderful addition to the Star Wars universe... The Last Jedi\\, unfortunately\\, was a disappointment that added little.","true":true}