{"101487":133213,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I grew up with the original trilogy.  This movie did go places I wasn't expecting with Luke.  We tend not to look at characters we love and admire as people that are fallible.  Part of me is saddened to see this hero I have admired be so disillusioned.  Overall his journey does make sense.  Luke had is whole life destroyed because of Vader.  He never met his mom. Finds out who his dad was. Has to fight him.  Yes\\, he saw him redeemed but I'll bet it took years to mentally process the evil deeds of Vader.  Its no wonder he was so terrified of what Ben could become.  I think he took on too much too soon.   \\n\\nDid Kylo ever had a chance?  Snoke corrupted and manipulated him from such a young age.  He probably felt betrayed knowing his uncle and mentor for a moment\\, thought about killing him.  With the knowledge that Vader is grandfather\\, Snoke temptation\\, you have a recipe for disaster.\\n\\nYes the movie does have some faults.  I wish we had answers about Snoke's orgins... \\n\\nBut there is no denying that this was storytelling at its finest.  As fans we are protective of the things we love.   We have to realize and understand that there are going to be stories and character arcs we don't agree with.  Ideas and plots we come up with in our heads can sometimes seem absolute.  We still have to remember these characters are prone to mistakes and not the superheros we expect them to be.\\n\\nGive The Last Jedi a chance...","true":true}