{"101487":193239,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*****Warning\\, spoiler alert! For TLJ\\n\\nSo this moron naked Rian Johnson directed the last moronic\\, dissected\\, ruminated\\, so called movie...\\n\\nThe Last Jedi IS the biggest let down EVER in the cinematic multiverse!  Yes I said multiverse\\, I have to cover every angle because this is what #rianjohnson did do to ruin this post epoch failure of a movie!  \\n\\nAll I want is 5 minutes alone with this person to set him straight....\\n\\nThe failures of this movie are so many so I will limit myself.\\n\\n1.) Leia not dying in the movie but she has passed away in real life.  The force somehow brings her back to life as she flies through space from her ship that has blown up!  \\n\\n2.) Snoke is suppose to be this universe badass but does at the hand of a bipolar moron named Kylo... ?? \\n\\n3.) Did I mention how bipolar Kylo is?  He doesn't know if he is coming or going!  Murders his father previously\\, (warning strong sarcasm coming) now he can't kill his mother\\, he fights with Rey\\, now they fight off Snoke and his imperial guards...by a small twitch\\, Kylo is able to kill Snoke with the power of his fingers twitching a light saber and cuts Snoke in half! ?? \\n\\n4.) Luke...my lawd!  Luke evolved from a farm boy to a hero starting from the original in 1977 and through 1980(The Empire Strikes Back) and 1983(Return of the Jedi).  He was the staple for every young man who desired to be good.  A innocent young man with dreams of helping a good cause.  \\nWhat #disney did to Luke in this last movie is an abomination!  They took agood\\, turned it into some schizophrenic lunatic.  \\n\\nWhy anyone would think this movie was good has part of their frontal cortex missing!  If I want to watch defected I can watch a DC movie where they try yet always come up short!  \\n\\nThe anger is strong with this one...","true":true}