{"101487":135085,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'll start by saying that i loved The force awakens and Rogue one but from the very first frames this film just felt wrong.The humour is far too over the top and totally out of place in some scenes to the point of being embarrassing although some of it was funny.BB8 has been reduced to an annoying cartoon character and a lot of the time i felt like i was watching the awful prequels especially the whole Canto bight section with its over the top CG and cornyness.Benicio del Toro's stuttering character was so contrived it was ridiculous.In the Force awakens Abrams was able to make that film fun but not go over the top with it like it is here.\\nThe exposition was confusing too as many times i didn't know why some characters were doing what they were doing and it all seemed too busy.\\nDuring the end section on Crait i felt like i was watching Attack of the clones as none of it looked very real\\,especially the crystal foxes and the very CG looking bit where the falcon flies into the planet.It all looked so fake compared to the gritty realism of Jakku and Jedha from the last two films.\\nThe two stars i'm giving this are for Luke and Rey who i thought were the best part of the film and all their scenes on the island i really enjoyed especially the trippy bits with Rey and their acting was very good.But i find it hard to believe that Luke had become what he had and i really wanted to know the story of how the lightsaber had got from Bespin to Maz's castle but it was never mentioned and i guess it never will now as the bloody thing got snapped in half! Major plot hole there.\\nAnd thanks Rian for killing off Luke at the end.So in episode 9 there'll be no Han\\,no Luke and no Lea.Maybe if we're lucky Luke might come back as a ghost!\\nDisappointing.","true":true}