{"101487":162447,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Pointless movie that does not need to be seen. \\n\\nEvery character you remember from star wars 4 5 6 dies but somehow leia lives. They let harrison ford shoot his characters death scene last movie  but not carrie fishers.  Spmehow she has mutiple scenes where leia would die and it would have been excellent storytelling but they refused. \\n\\nThe las Vegas side plot is not needed. Have one rebal code cracker mercenary on the ship and so much time could be saved to keep the plot coherent. Then the character Rose Tico played by Kelly Marie Tran would shine.  Keep the fight in space\\, drop the fuel plot point and ditch the ground battle entirely. This movie does not need to be this bad. \\n\\nAlso drop lightspeed as a superwwapon it defeats the point of all super weapons when a droid can self destruct and kill any target. Such a wrinkle does not need to exist in star wars.\\n\\nNo explanations on what snoke is. You could cut him from two movies and lose nothing. We dont even know what race he is in this movie.  \\n\\nThe big reveal is reys parrents are no one. This was set up for years and it goes nowhere\\, it doesnt need to be in this movie nor the last movie.  Let Rey have a last name and be done with it. \\n\\nForget about star wars lore and things this is a poorly paced and sadly directed movie that insults the audience and wastes the talent of the hundreds of excellent people that made this movie. \\n\\nLuke is made the opposite of what he has always been. \\nLuke pre-the last jedi... is the heart of the  orginal star wars movies\\, the biggest optimist and cares about his family so much he would never kill them when he could SAVE them. \\n\\nIn this movie luke tries to murder a child\\, wants the jedi to die\\, severs his connection to the force and just grows it back with no connecting story element or explanation in rhe movie\\,  his x wing is clearly rusting away at the bottom of the sea (on film) and demands to burn books.","true":true}