{"101487":132280,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If Rian was handed custodial responsibility of Indiana Jones\\, we would find years later that Indy is working as a disgruntled lounge singer who has contempt for the artifacts of civilization as a means of passing the story on to a new breed of archaeologist. The Last Jedi is a laser sword to the nether regions of 40 years of Star Wars fans keeping our icons vibrant and culturally relevant. Was it all just to be different? Like a new manager re-organizing the department regardless of function to make themselves preeminent? Like that sports referee who integrates him or herself into the game? It seems so.\\n\\nThe Last Jedi performs radical contortions in order to make a desperate story line \\\"work?\\\" It uses the iconic characters as table scraps to placate the lifelong fans. I mean\\, if you really want a codebreaker with experience hacking Imperial hardware\\, hello R2-D2! Worst of all was the reconfiguration of Luke Skywalker into a character with no connection to the real Luke. Awful\\, disjointed\\, and desperate.\\n\\nLook\\, there were more plot holes in this movie than in any other. Suddenly fuel consumption is a concern? One of many holes. Did they not have a production meeting? A disrespectful disaster.\\n\\nThe destruction of Luke Skywalker is the worst. Mark Hamill deserved so much better as did the base that has enabled this franchise to span generations. Luke survived the loss of mentors and family members yet never gave up on Darth Vader but he loses Kylo and gives up so easily? He goes from a courageous\\, tenacious force for good and someone who would give anything for his friends to someone who suddenly could care less for them? It makes zero sense. It does not fit. Nothing fits. Nothing makes sense.\\n\\nIf the only qualification for being labeled bold is to disregard reason then the bar has been lowered to a point of no return.\\n\\nNonsensical disrespectful disaster. Sorry\\, Luke. You got sold out. So did we.","true":true}