{"101487":143649,"Last Jedi":"Last Jedi","2017-12-15":"2018-09-23","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's time to let old things die..\\n\\nWell I certainly hope not. \\nThe last Jedi is actually the first star wars movie I actually enjoyed watching. Which was a very pleasant surprise.\\nAs with the beginning I was like.. Here we go again.\\nThe same music\\, same big yellow letters as a introduction..(which was porely translated fort the netherlands by the way).  \\nIt made me cringe.. like... really? This again!\\nAnd then the movie starded.\\nImmediatly you felt like you are back in this fantasy world only with a lot of new charackters. At least for me.\\nI was impressed by the way they give you the same ambiance but in a more modern setting. \\nNice!\\n\\nI do however was a little bit in a lost because of the new charackters because it had been a long time since I ever watch star wars. \\nBut it was resolved quickly.\\nAs with all the movies the story isn't to complicated\\, butt very enjoyable\\, and easy to follow with a beautifull mythical underlining. \\nAnd when whe got to ahch-to.\\nWauw\\, just wauw.\\nThe island is so beautiful and it's funny to see how Luke has made it it's own which whe can see when Rey follows him around.\\nAnd humour is all around.\\nThe\\, not so subtle\\, irritation of the locals on ahch-to towards Rey.\\nThe way Luke throws away the lightsaber as soon as he gets it\\, the bound between the porg and chewbacca. It's great. Star Wars always had this kind of humour in it's films.\\n\\nSo much hidden gems.\\nThe way the lightsaber of Kylo looks more like a sword compared to Rey's sable. \\nThe visuals in general are perfect and compelling and there is a lot of attention to details like no red footprints when Luke walks towards Kylo.\\nAnd the vulptex.. AMAZING.. so beautifull.\\n\\nThere is so much to love about the movie and it really reignited my interest in the franchise.\\nThe actors are wonderfull in their roles\\, Although I would have loved to see more of Rey and Luke training. For me that was the best part. \\nAnd personally I think people are going to miss the big lightsaber fights.\\nBut I haven't enjoyed a star wars movie like this one in a long long time.\\n\\nGo watch it right now!","true":true}