{"101487":141738,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It is with great sadness that I write this review.  I too created this account simply to put my 2 cents in here.  I felt it necessary\\, since the critics have either been bought off or must have been drugged while viewing this movie to have given it such good reviews.\\n\\nCAUTION: SPOILERS\\nBeing a lifelong fan\\, I was beyond excited for this movie. I loved The Force Awakens and felt that all of the pieces were there for an excellent follow up.  I couldn't wait to find out who Snoke was\\, who were the Knights of Ren\\, how did they get to Kylo and who are Rey's parents.  None of those are answered (some not even addressed) to my satisfaction.  It was like the director of this movie hadn't even watched TFA.  \\n\\nI was excited to see what Luke had been up to all these decades.  When we last saw him\\, he had defeated the Emperor\/darkside and life in the galaxy was good.  Then Luke runs away to become a hermit that milks alien walruses.  Why?  Because he feared Ben\/Ren MIGHT turn to the darkside so he attempted to kill him.  What????  Not my Luke.\\n\\nRey finds him as we know from TFA\\, but he is cranky and old and trains her for about a day.  Yoda shows up and appears to be slightly deranged (he burns all of the old Jedi texts to symbolize ridding of the old...we get it Disney).  Some of the best scenes of the movie are when Rey and Ren communicate telepathically and it seems like they are both torn and conflicted about who they are and where they want to go.\\n\\nI really liked Poe and Finn in The Force Awakens.  I thought they had good buddy chemistry and I was looking forward to seeing their stories further develop.  This did not happen.  Poe is nothing more than a hotheaded \\\"flyboy\\\" who needs to be tamed by Leia and her vice admiral Holdo (played by Laura Dern).  They scheme and develop a plan that they cannot spend 30 seconds on telling Poe.  Instead\\, they appear like the wise adults and he is portrayed as the reckless child.  Feminist agenda?  Yep.  I like Laura Dern as an actress\\, but she was miscast here.\\n\\nFinn\\, poor Finn.  He appears nothing more than a prop to showcase a new character\\, a mechanic named Rose.  Why this character had so much screen time devoted to her is beyond me.  The character\\, and the plot she and Finn were written into\\, were terrible.  This was the weakest part of the movie for me and it ate up a lot of it too.  Nothing against the actress who played her\\, but I really didn't didn't like Rose at all.  I found her tedious and didn't like the obvious leftist agenda written into her character's dialogue.\\n\\nThe ending had strong and weak points.  Visually\\, it was stunning and had elements of classic Star Wars scenes.  But\\, it fell apart when Rose pulled her little stunt to prevent Finn from sacrificing himself.  I didin't want Finn to die\\, but she selfishly prevented him\\, delivers the cheesiest line out of any movie and probably doomed the Resistance.  Then\\, Luke appears and I thought we were in for a showdown with him and Ren.  Nope.  Why?  He isn't really there....he just projected himself\\, served as a distraction and then died from the exhaustion.  Yep.\\n\\nSome of the casting and acting were on par with the prequels.  The humor was forced and gimmicky.  And\\, oh yeah\\, Leia flys like Mary Poppins after her ship was blown up.  The SJW and political leanings were obvious and heavy-handed.\\n\\nAll in all\\, this was a really terrible movie.  I understand that Disney wants to move it in a different direction\\, but they should at least attempt to stay true to the SW lore and canon.  Otherwise\\, why bother?  \\n\\nI cannot imagine that I will care where this story picks up in 2 years time.  If episode 9 is just picking up where this mess left off\\, I cannot envision that I will be seated in a theater watching an extension of this wreck of a movie.","true":true}