{"101487":113970,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Contains spoilers\\n\\nReally thought about turning this movie of after 40 minutes.  The prank phone call joke with hux is the worse acted\/most unfunny thing that i have seen in all the star wars movies to date. \\n\\nthe milking of the cow\\, nonsense creatures\\, leia able to survuve in space.  chewie bit part where he becomes a veggie. absolute rubbish.  SNOKE had awful cgi.  (why didnt they just use actor with makeup?  waste of a character.    \\n\\nonto the story now\\, full of plot holes\\, I was interested in finding out more about ray\\, kylo\\, snoke\\, finn after fa.  i dont care about any of them now apart from finn. kylo ren is worse bad guy ever he is more like an angsty teenager than a supreme leader\/sith.  the whole spaceship will run out of fuel is an insult to any sci-fi fan and is idiotic.  Movies so far are only interested in killing off the old characters and replaceing with bland uninteresting replacements (even the droids). \\n\\nnot surprised though as that is hollywood now\\, trying to please everyone instead of having a vision and making different movies that appeal to different demographics.  only interested in profit\/pc and forcing political agendas on the audience  only ends up in a disjointed mess of a movie.\\n\\nrogue one was a great movie\\, pity about the continuation of the main story\\, so many possibilities in the star wars universe and this is all they could come up with!  disney will not be getting any more of my money for star wars ever again!","true":true}