{"101487":139618,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw this a couple of days ago and let it simmer a little before posting a review.  The more I think about it\\, the more of a disappointment this movie is.\\n\\nThe main premise of a space race between a fleet of Empire (er\\, 1st order) ships and a few resistance ships that are just slightly faster is ridiculous.  In the time that it takes to \\\"catch\\\" them\\, why didn't the 1st order just call in a couple of faster ships to come and fight?  Why not jump ahead?  Why does it take so long?  Makes no sense.  The sub-plot with Fin and the unlikeable Rose lead to NOTHING!  That entire part of the movie could be left out with no effect on the movie.  The Luke story is a complete mess.  Here's a guy who presumably has separated himself from the force\\, but is living in a Jedi temple. what?  He is lectured by Yoda to pass on what he has learned AFTER he ran an academy.  He recognizes the power in Rey and the danger to the universe in that power\\, and with that\\, decides to abandon her?  He's completely selfish and not at all the charactor he was at the end of the Return of the Jedi.  Makes no sense.  Reys  personal experience with the dark side on the island is confusing and has really no point.  Rey is a pretty impressive fighter considering she has had no training and no help from Luke.  Why is Snoke so powerful but so easily killed in such a stupid way?  Who was that guy anyway?  We have no idea.  Finally\\, all these new force powers\\, like flying through space\\, projection\\, direct communication\\, are just lame.  I'm so disappointed in what could have been a really cool continuation.","true":true}