{"101487":139651,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw this movie at the fan event early showing at my local theater. I'll start off now SPOILERS AHEAD! I'll start with the bad...\\n\\nTo begin with this movie is a Star Wars movie... that being said there are things that should be done as a star wars film. And too much comedy isn't fitting. We don't want to much comedy.... hell even Luke has his comedic relief moments. WHY?! \\nNext up Is Rey... ok so she is clearly the 2nd lead in the first movie she is the most important person she and Kylo.  Well she remains quite important in this movie until you find out that she is a nobody... SPOILER FOR REYS PARENTS: They were legitimately NOBODY... just scoundrels who sold her for boos. Nice job Mr.Johnson I now don't give a damn about her not because she is a nobody... but because she falls off as a character towards the end. She has her moments when she helps the resistance but she doesn't even fly the Falcon anymore. The best part of her is her trying to save Kylo.\\nNext is Snoke.... oh my god.... when you finally meet him he's so cool! A really nice bad guy! Your like YEAH the supreme leader with so much wonder who is he?!?!!?\\nSPOILER ALERT: he dies.... he's killed by Kylo to save Rey.... in the second film. Wow... Wow. Yeah now Kylo is the leader of the first order! Yay! Oh and now we don't even have to care who snoke is anymore...\\n\\n\\nNext is Luke Skywalker... my hero everyone's favorite jedi... SPOILER ALERT: Luke dies in this movie. Yep he does in the second movie he dies.... Basically cause he uses a really strong force move from too far away.... it's really cool what he does and I liked it alot. But then he dies. Why?!! To become a damn ghost.... why not just keep him alive nobody likes that he dies.... for me it broke my heart. \\n\\nOk the good! \\nITS BEAUTIFUL! There is so much beauty the amazingly done space battles to the bad ass show downs with the lightsabers! It's just a fun action filled adventure. There are some cameos we get yo see Yoda yay! The scene where snoke passes is just amazing\\, a cool little team fight with kylo and rey!!! It was a good movie for sure go see it. It just had some bad times as well!","true":true}