{"101487":165696,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rubbish! Many characters could have had there scenes cut and it wouldn't have made any difference to the films story other than shortening it. Amongst the films many flaws is the Rey charter\\, who seems to need no training to realise her full force using potential. Rey is also not the only charter to spontaneously develop force using ability\\, one other charter does too at the most opportune moment when her life needs to be saved. Kylo Ren can not only be beaten buy Ren\\, but apparently Snokes guards can beat him in battle too. He was given a very public dressing down by Snoke who told him to grow up and stop prancing about with that ridiculous helmet on. Snoke also confirmed to him that General Hux was an idiot\\, and his actions in this film only confirm this. Why does Snoke put up with them\\, is he a poor leader who can't have talented people beneath him? Well never know as the charter is not examined and is killed off before any mystery surrounding him can be unravelled. If only the galaxy knew what a bunch of idiots the first order are they would no longer fear them and surely they'd be over thrown. The humour is also a issue too. This films makes many attempts at humour\\, which left the packed cinema I watched this in\\, in cold silence. \\nCan I say anything good about this film! Yes it can be exacting somewhat. Characters find them selves in situations that you wonder how they will get them selves out of\\, and the manor they are extracted from these situations isn't predictable. On this positive note I'd like to thank Disney\\, I knew these films were never going to be as good as the originals and that is to be expected. But due to the quality of the original trilogy (A new hope\\, Empire strikes back and Return of the Jedi)  I felt to compelled to watch the new adaptions. Thank you Disney you have cured me of the need to spend money on this franchise I will not spend any money on the watching the third instalment.","true":true}