{"101487":194937,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What a colossal letdown! So many problems with this film.....Let's rank the Top 10:\\n10. So apparently the prophecy that Darth Vader would bring balance to the Force (by destroying the Sith) last for like 20 minutes?\\n9. Why couldn't Poe just be told about the plan from the get go??What purpose does it serve keeping him in the dark?\\n8. Why do we need Admiral Holdo (Lauren Dern)? It would have made much more sense to have Admiral Ackbar play that same part and give him a much more deserving end. \\n7. Han Solo died for nothing?! One would think that after destroying Starkiller Base in the last film the First Order would have been dealt a major blow...nope\\, they're just as strong as powerful as ever\\, and the resistance is nearly destroyed anyways. \\n6. It's everyone's favorite punching bag: General Hux!\\n5. Why exactly is Captain Phasma in these films? Are we really supposed to care about her and her non-relationship with Finn? Speaking of which...\\n4. Perhaps the biggest let down of the film is Finn not sacrificing himself to save the day. He serves little to no purpose in the franchise. \\n3. They destroyed Luke's character. He went from a great Jedi master to an emasculated\\, whiny\\, defeatist. He wasn't willing to quit on his father who he barely knew.....but his nephew who he knew since birth he's ready to just cast off for good with no fight? And then when he finally gets back into it and fights back....he dies?!?! Seriously?! Mark Hammill said it himself after reading the script \\\"I hate everything you've done to this character.\\\"\\n2. Snoke- They build him up\\, tear him down and give us no inkling of who he was and how he came to power....and why doesn't Luke go after him sooner.\\n1. Imagine I show you a really fancy box and tell you \\\"Wait til you see what's inside!\\\"\\, but you have to wait two years to open it...and when you finally do\\, what's there??? Nothing! That's pretty much sums up what they did with Rey's parents.","true":true}