{"101487":113984,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Continuity. This the major issue with this film. If this film was anything other than a “Star Wars” film it wouldn’t be that bad of a film (at least as good as a “Transfomers” movie). But the problem is that the film is supposed to be the eighth in a series. It completely disregards the lore\\, history and legacy of the seven films that came before it. Most notably the one right before it! It’s as if Rian Johnson had never seen a Star Wars movie\\, and that JJ Abrams had only given him the names of the characters\\, and that it was set in space. It is not “ fan service” to ask for a film that has some kind of basis\\, in the universe that the previous films have established. This film isn’t taking Star Wars in a new direction but is rather a blatant\\, disrespectful abandonment of its predecessors. The film reveals its intent when Kylo Ren says\\, “Let the past die\\, kill if you have to”. This is why we hate this film.... killing the past isn’t how you move forward. We are all the sum total of our experiences\\, our past is what makes us who we are\\, for better or worse. It’s how we learn and what makes us stronger. Forgetting your past\\, dooms you to repeat your mistakes. If Disney doesn’t start embracing the films that came before it\\, they will never progress. They will never expand the Star Wars universe. A universe ripe with possibility and adventure... And that’s what we all really want. ","true":true}