{"101487":188101,"Last Jedi":"Last Jedi","2017-12-15":"2018-12-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was hands down one of the most beautifully stunning movies in the Star Wars universe.  Each shot had its lighting and coloring meticulously choreographed to convey themes and dazzle the eyes.\\n\\nUnfortunately\\, this wasn't an avant gaurd independent film designed to use imagery as the primary means of story telling.  Johnson clearly had a series of stunning images in his mind and then threw up some flimsy character breaking reasoning to shoehorn the movie into the scene.  As a result fans have been left to do Johnson's work for him and are ardently defending the movie by writing the script for him.  \\n\\nIt was also predictable that this movie caused so much division.  The third wave producers have gone out of their way to broadcast in interviews and every chance they get that they will be focusing on SJW issues\\, but rather than presenting the issues and examining through various organic scenarios they just slam their beliefs one after another in your face.  The impression you leave with is that they clearly hate the fan base and believe them to be all a bunch of misogynistic\\, sexist\\, racist\\, capitalistic bigots that need some women to take over because men sure are dumb but we love them anyways.  It's the sort of presentation that puts you off even if you agree with their stance!\\n\\nThe pacing was off\\, the interactions were off\\, the tone was all over the place.  If you took away the star wars name and instant love it generates this movie would be as loved as \\\"Sky Captain and the World of Tomorrow\\\"","true":true}