{"101487":117464,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Dropped from 1.5 to 1 star since it's rumored that halfs aren't scored.  \\n\\nThe good: music and visuals were impressive and there were a few scenes that were pretty awesome and memorable.  Basically what you come to expect in any SW film including the prequels.  \\n\\nThe bad: I did not enjoy the plot and the direction they chose to take the story after TFW\\, which was a flawed movie itself\\, but also one that setup TLJ to be something spectacular.  It never really pays off.  There was no real character development; no obstacles to the protagonist's journey (she is infallible); other characters were used in almost slapstick fashion and found their way in and out of situations through combinations of dumb luck and contrived scenarios.  There is an unnecessary 30-minute side story that is a complete waste of time.  It adds nothing useful to the plot and actually detracts from the main events of the story.  \\n\\nThe ugly: For some reason the director and writers have decided that SW should be some kind of comedy\\, or that it at least requires several scenes of comic relief.  This isn't chuckling over some of C3PO's nuances\\, but as one user put it \\\"like the Jerky Boys were called in to perform a skit\\\".  The First Order is so inept that it is impossible to believe that anyone would fear them.  Their general is a bumbling fool and their dark lord of the Sith is an emo who lost to untrained Rey the first time she used a lightsaber.  Who would be afraid of these guys and why?  I saw every other SW movie in theaters multiple times\\, but there was no way I was going back to see this piece of garbage.  It might pull in some casual fans\\, but it is not a SW film in the spirit of the series.","true":true}