{"101487":141560,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It is extremely rare that I leave the theater diassapointed\\, but that is exactly how I felt at the end of this one. The trailer built up the suspence and set a dark\\, serious tone. Then it completely failed to deliver on anything promised in the teaser. The mood of the show was rudely interrupted by terrible humor. Even when the humor made me chuckle\\, it completely detracted from\\, instead of adding to\\, the story. The liberties taken with space-time relationship was also incredibly distracting (as it was in the force awakens as well). Explain to me how Rose could have caught up to (while having to cover more distance) Fin to derail his heroic attempt at self sacrifice. Did Fin decided to go slower than the max speed on those crafts they were driving? He said\\, I better slow down so maybe the laser goes off before I can crash into the battering ram deal. Where the heck did Phasma go...she was right there when they were going to execute Fin and Rose\\, but then somehow appears after the explosion with a bunch of storm troopers walking in...and EVERY SINGLE storm trooper around Fin and Rose die except the two of them when they have armor and Fin\/Rose don't? There are many other examples. The only movie in recent memory with such terrible space time relationship was the third hobbit movie. \\n\\nAnyway\\, I've ranted enough. There is a lot I didn't like\\, but the worst was the humor and the destruction of the serious film I expected to see. Expectations breed disappointment\\, and my expectations were high.","true":true}