{"101487":138610,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"I only know one truth\\, it is time for the Jedi to end\\\"\\, Luke teased in the first trailer. If we're being honest I have to agree with him. It's time to \\\"let the past die\\\".\\n\\nThe second installment in the Sequel trilogy (and third by the Walt Disney Corporation) left my jaw on the floor... in a negative way. With a strong foundation being set with 2015's \\\"The Force Awakens\\\"\\, the next installment had incredible potential to cement a new era of Star Wars into the popular culture. Perhaps my through-the-roof expectations let me down\\, but in my opinion this film is up to par with 2002's \\\"Attack of the Clones\\\".\\n\\nThough quite obviously none of the events of Star Wars could ever happen\\, there was a certain grit and charm to the Original Trilogy that made the story feel real. Grounded by technical limitations\\, the story was believable. This believability was missing during the prequel trilogy\\, with over-the-top fights\\, maneuvers\\, and glaringly bad CGI.\\n\\nWe're back to the prequel days where our heroes do things against incredible odds and the Force is treated like a super power that can do anything your heart desires. Amazingly\\, the CGI has somehow gotten worse in the last 2 years. The back-to-practical-effects days it seems is over.\\n\\nThe most blasphemous sin in this movie is the incorporation of Marvel humor. There are gag scenes in this film that are WORSE than Jar Jar stepping in feces. The most serious moments of this film are ruined by sorry little one-liners that have NEVER been a part of Star Wars. They try giving every character that Han Solo humor\\, which really doesn't work considering Han never made toilet jokes. It's easy to lose sight that Star Wars is meant for kids\\, but this is a total sellout by the Walt Disney Corporation.\\n\\nThe best thing about \\\"The Force Awakens\\\" was the emphasis on characters\\, which I hoped to see more of. How the story is structured\\, very little time is spent on our main characters. Little growth is shown and it's sad. Things change\\, but motivations are unclear. Performances at times are wooden.\\n\\nTo discuss the positive\\, \\\"The Last Jedi\\\" tells a pretty fresh story. It was bold and took risks that \\\"The Force Awakens\\\" did not. That in itself deserves credit. There are some pretty unexpected twists and turns which I appreciate but personally feel unsure of. So much happens it is really unsure what is left to tell in Episode IX.\\n\\nThe Original Trilogy will always be superior to any subsequent releases under the Star Wars branding. I'm just not sure how in an era where the Prequel films are so badly maligned that this could happen. We owe George Lucas a tremendous apology. It begs the question of where the House of Mouse will take is now.\\n\\nIn May\\, the troubled Han Solo movie will be released. When the lead actor states that his character feels more like Ace Ventura than Han Solo\\, you know we're in trouble. In 2019 J.J. Abrams will return to close out the trilogy he started. I wish him the best. After that\\, Rian Johnson (director of this monstrosity) will return to create an all new standalone trilogy. To quote C3PO\\, \\\"we're doomed\\\".","true":true}