{"101487":159048,"Last Jedi":"Last Jedi","2017-12-15":"2017-06-14","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok\\, I just want to say that first of all the amount of 1\/2 and 1 star reviews on here is ridiculous. This is not a 1 star movie by any stretch of the imagination. Maybe for some star wars fans that didn't get exactly what they wanted and who probably need to see it at least one more time to catch the things that they say are plot holes that are not plot holes. Is this a perfect movie? No. Did I have some issues with this movie? Yes. But it doesn't mean I still won't give a 5 star rating. Why? Because when a movie can make me just feel for all of the characters like I do for all of them in this movie it deserves a five stars. Add on to that the amazing fight sequences and the score. Star Wars will never be what the original trilogy was. And I think people need to except that. But I think this new trilogy is doing what it needs to do. The first movie drew people in with these amazing new characters. These characters from this movie and the original trilogy also go on a great journey in this movie that for the most part for me was satisfying. And made me want to see how it is all going to end. Also if I see one more person call rey a mary sue I am going to lose it. I would agree if in the scene where (SPOILER) she meets with smoke she was able to resist him and not be controlled by him\\, that would have done of for me but she didn't and when her and kylo (also spoiler) were fighting over lukes lightsaber\\, she didn't grab it from him like she did in TFA they were evenly matched. So please go and see this movie for yourself. And don't listen to the star wars fans who will always complain about these movies since they will never be like the original star wars\\, even though TFA was and they complained about that\\, and then this tried to do something different and they complained about that. As much as I love this franchise it's fans will never be totally satisfied.","true":true}