{"101487":174986,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi denigrates and desecrates everything and everyone that made the classic trilogy great. \\nLuke Skywalker freely set foot in a lion's den with two of the most powerful Sith so that he could bring his father back to the light against the greatest of odds. But now we are expected to accept that this archetypal optimist\/idealist has turned into a cowardly hermit who has effectively deserted his sister and best friend in a war they are clearly losing. Worse Luke is severely diminished from being a staunch ally of the Jedi to someone who considers killing his own nephew. \\nThe Last Jedi is also replete with plot holes which make me wonder how critics could have ever allowed this piece of drivel to amass a 90% score. Here are just a few of the most egregious inconsistencies:\\nThe First Order has the technology to create a multi planet killer and yet can do no better than to \\\"turtle chase\\\" a small resistance cruiser until it runs out of fuel.\\nWhat was the point of Holdo's not divulging her plan for the resistance to Poe? Had she done otherwise\\, the tedious\\, pointless\\, fruitless sojourn to Canto Bight could have been avoided altogether.    \\nFinally\\, there are moments that simply left me cringing:\\nLeia does a Mary Poppins.\\nSnoke who is built to be the quintessential face of overpowering evil is suddenly snuffed out with no back story or reason for us to care.\\nCaptain Phasma\\, a character with so much potential is also killed off uselessly.\\nI cannot help but draw comparisons between Darth Vader and Kylo Ren. The former evoked fear through intimidating gravitas increasingly fortified through three movies. Kylo Ren who leads this contemporary rendition of the Empire is not intimidating at all and instead comes of as a fickle\\, clumsy\\,whiny adolescent devoid of any credibility for the audience to believe he now rules The First Order.\\nYou know TLJ is bad when you watch the much maligned prequels later on and actually find relief. I did.","true":true}