{"101487":185588,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie retro actively ruins the force awakens. The over all plot was awful\\, and it did nothing to pay off anything from the first movie. There were a few really cool moments but over all the experience left a lot to be desired. Additional comments with spoilers. The plot is so dumb. The whole “story” hinges on like 40 first order ships chasing 3 rebel ships that are..... wait for it..... running out of gas. O yeah the rebel ship can out run the first order ship in space because they are lighter??? The rules of the this universe make no since from one film to another. One rebel x wings can destroy a capital ship but the one rebel capital ship can with stand an entire 18 hour barrage for the first order fleet and take zero damage. Apparently the first order forgot they have tie fighter\\, that blew a hole in that same ship at the start of the the movie.... The whole Leia thing.... why? How? The build up between Rey and Kylo pissed me off so much.... that was the absolute worse tease of something that could have been awesome... they spent the whole first act connecting these two and building up a huge connection with serval very touching moments to finally blow it in act 2 by literally doing nothing with it. Kylo is the bad guy and Rey is the good guy because “script”. They built up for this amazing team up for the entire 1 movie and 1 act of this one and delivered on nothing. Luke’s whole purpose in this movies was to piss off fans.... either be moody and emotional or not but his character felt bi polar with one minutes he not training Jedi to next minutes I’ll train Rey as a goofy mentor figure that tickles her with a leaf. Finn..... what is his point. He had this amazing opportunity to save the rebellion\\, redeem his character and leave us with all the “feels”. But do they pay that off...... of course not. The force has no rules or lore.... it is limitless\\, does anything\\, Apparently you can master it by spending the afternoon thumbing through a user manual. The tone of the movie was awful\\, serious moments were met with “one liners”\\, some character were major departures from their previous development and lore. ","true":true}