{"101487":159057,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok... I'm going to take a look at this film. I'll score each point for how strong I think it is out of 3.\\n\\nPositives:\\n- Phenomenal acting. +2\\n- Exciting and never kept me bored. +3\\n- The twists are something I'd never thought would be in a Star Wars Film. +3\\n- Dear god the film gave me chills... +3\\n- I genuinely felt scared. I was incredibly scared of what the First Order did to the Resistance. +3\\n- Dear GOD that opening action scenes is one of the best in Star Wars. +3\\n- What they experimented with the film was interesting. I loved what they did with most new characters. +2\\n- Yoda\\, Yoda\\, Yoda... Spectacular\\, you are. +2\\n- Kylo Ren's backstory from both sides was interesting AND fascinating. +2\\n- The interactions between Rey and Kylo were really\\, really brilliant. +2\\n- Supreme Leader Snoke dying was unexpected... Really came out of nowhere. I loved it though. +2\\n- Light speed into Snoke's ship... AMAZING! +3\\n- Kylo Ren and Rey against the guards was phenomenal. +3\\n- I got a free poster once I finished watching it\\, yay! +1\\n- People ACTUALLY FELT in risk in this film! I could FEEL lives being lost and it was horrifying! +2\\n- Because of how much peril there was in the film the final moment of hope felt so\\, so deserved! +2\\n- The Porgs weren't annoying! Yay! +1\\n- The film made me cry\\, and that's not easy. A lot of films this year made me cry to be honest... +3\\n- The cinematography was beautiful. This film has many spectacular shots that I absolutely loved. +2\\n- The score may have been mostly reused\\, but I don't really mind that since it's just phenomenal anyway. +2\\n- By the end\\, Kylo Ren actually feels menacing. He feels like the Vader we all wanted him to become. +3\\n- The Luke and Kylo Ren fight was exciting\\, thrilling and so\\, so extremely satisfying. +3\\n- Luke is at rest. It leaves a nice taste for his entire character. Thank God. +2\\nTotal positive points: 54\\n\\nNegatives:\\n- Most of the humour did feel forced. If they kept the humour for BB-8 and Poe it would've felt natural\\, but most of it is just unnecessary. -3\\n- I liked the concept\\, but I can't really buy Leia doing some of what she does with the force in the film. -2\\n- I don't know why but the CGI felt hit or miss with the film. Some of it is easy to notice which really ruined the fantasy aspect. -2\\n- The casino planet part really ended up being pointless... -3\\n- Phasma died... Guess I'll never get the character redemption I always wanted. -1\\n- I just felt so incredibly sad by the end... -1\\nTotal negatives: 12\\n\\nSo we I'll use this thing to calculate my grade:\\n\\n((Positive Points) divided by (Positive Points + Negative Points)) time's by 10.\\n\\nSo that's (54 \/ 66) * 10.\\n\\nThat makes my score 8.2\/10.\\n\\nI think it's deserved. I loved this film\\, and the positives highly outweigh the negatives. I'll be bombarded with hate anyway because it's my opinion.\\n\\nAs Sharron Carter once said... \\\"Compromise where you can. Where you can't\\, don't. Even if everyone is telling you that something wrong is something right. Even if the whole world is telling you to move\\, it is your duty to plant yourself like a tree\\, look them in the eye\\, and say\\, 'No\\, you move.'\\\"","true":true}