{"101487":121260,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First: I'm not a bot\\, I'm not a 40 year old and I'm not one of these anti-SJW rant people.\\n\\nWhat I liked:\\nRey and Kylo: Not bad\\, I liked better Rey in the previous one and I'm not really worried about how OP she is. For me it's fine\\, I mean\\, why not? Anakin was also OP.  Kylo was just great\\, loved Adam Driver's performance.\\n\\nBattles and action were pretty good\\, specially when Kylo is involved.\\n\\nThe effects were pretty good.\\n\\nWhat I didn't liked:\\n- No cliffhanger at the end of the movie. It felt so dull...\\n- Finn started great in this movie... after that they found another love interest for him and sent both to a stupid mission full of cringey CGI characters\\, pointless plots and Benicio del Toro acting like he's doing a cameo instead of a character. So dissappointing.\\n- Why you kill Laura Dern after 20 minutes? She would've been a gret replacement for Leia as one of the leaders... sad. You're great Laura\\, too bad you won't be in Star Wars anymore.\\n- Spaceballs humour felt out of place. Sorry... \\n- Why you keep humiliating Hux like this? He's a boring buffoon now.\\n- Why is Luke's island so crowded with random creatures? It was reallly necessary? It feels a little bit too random.\\n- Phasma hyped everyone before ep VIIwas out. After the movie we felt she was coming back even more badass... She got killed again or whatever. And it feels like she's not even in the First Order\\n- Poe is OK\\n- SuperLeia Poppins. Weird. Didn't like it.\\n\\nSorry about my english and thank you for reading me. And again I'M NOT A BOT\\, I'M A 32YO MAN.","true":true}