{"101487":137029,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm still shaking my head at this one. I didn't have great expectations for this one\\, but was going into this thinking it had to be better than the piece of crap that was A Force Awakens. Nope. This was much\\, much worse. Right away this felt like a parody of itself with the corny jokes & setups. I know the OT and prequels had its fair share of humor but it went to a groan worthy level here. I still don't really care for any of the new characters\\, I can tolerate Rey but the rest are horrible. Action scenes were crap and feel so repetitive with the same tired plots that it's beyond dull. I think the only thing I can give a high mark on is the appearance of an OT character but it's in a short scene. The Disneyfication of Star Wars makes me want to puke with the addition of those Porgs. I know they're not in a lot of scenes but it just reeked of \\\"Look at us\\, we're so fucking cute aren't we? AREN'T WE?!\\\" Disney laughing all the way to the bank with the sickening amount of ads and merchandise off this cash cow. Was really close to giving this a half star because I basically hated this movie and half stars are reserved for the worst of the worst. This barely escapes that dreaded rating. I could care less for any future Star Wars installments\\, I've had enough of this franchise. Put a fork in it already. For me they should have ended with the prequel trilogy\\, or at least not done these for another decade or so and involving a totally different set of characters\\, with better writers\\, a different plot and most importantly without the kiddy shit. I'm done. Done.","true":true}