{"101487":132979,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Iger gave the Star Wars keys to Rian Johnson\\, and\\, Rian\\, in one fell swoop\\, drove and totaled the franchise down into a cliff of Beggars Canyon.\\n\\nRian's film making was shoddy to be brutally honest. Aside from the plot holes\\, the scenes do not mesh from one to the next. When I saw the kid in the last scene\\, playing fantasy Jedi\\, I wanted to puke. It made no sense.\\n\\nMaybe Rian heard the criticism of the Force Awakens\\, that it a derivative of a New Hope. Hoping to avoid that criticism in the Last Jedi\\, he threw in some plot twists. Never mind the Last Jedi is a shameless copy of the Empire Strikes Back. Rian's plot twists are not really creative or interesting. He decided to change Luke's and Yoda's characters. That's a mistake you learn to avoid in Film Making 101. For example\\, what if Daniel Craig in the last 007 movie played Bond like Vincent Vega? What if Ian McKellan played Gandalf like Carol Channing in the last Hobbit movie? You'd be weirded out I'm sure. James Bond never changed characters in a bazillion 007 movies. Gandalf was the same in six LOTR movies.  The point is inventing ridiculous plot twists is pretty easy to do and not very clever.\\n\\nYou've heard that Jeffrey Katzenberg put the kibosh on Aladdin midway through production. He had the writers and directors redo Aladdin. That's right. An animation mulligan.\\n\\nIger should have seen the Bantha doodoo coming halfway through production of the Last Jedi. As of this writing Jumanji is kicking the Last Jedi's ass in the box office. Iger should have pulled a Katzenberg and fired Rian Johnson. Iger: \\\"Rian\\, you want to go home and rethink your life. Dismissed.\\\"\\n\\nBob Iger\\, fix the Star Wars franchise. You have three huge investments in Galaxy's Edge (WDW and Disneyland) and a Star Wars hotel. Nobody will be interested in these attractions given the bad taste of the Last Jedi.","true":true}