{"101487":134554,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left this movie frustrated and disappointed.\\n\\nI'm frustrated because the First Order is a joke that deserves to be endlessly ridiculed. Every villain on the dark side is completely inept. Kylo Ren hasn't done anything noteworthy since he stopped a bullet in mid-air 5 minutes into \\\"The Force Awakens\\\" and Snoke\\, who was fairly intimidating as the \\\"Supreme Leader\\\"\\, was too oblivious to notice the light saber sitting next to him begin to move and was cut in half by the aforementioned Kylo Ren. \\n\\nNot only do the individual villains look completely incompetent\\, but the entire fleet of destroyers hovering in space are useless as well. The plot of this movie centers around a chase scene that should have lasted a couple seconds. The rebel ship is a sitting duck that has run out of fuel\\, but the First Order seemingly can't do anything to it. Fortunately\\, there is a sub-plot with Finn and a new character named Rose that results in nothing more than tom foolery and more plot holes. Neither did anything helpful except further reveal that the First Order villains are completely useless when they easily kill off Captain Phasma. They have made the entire First Order out to be completely incapable of defeating anyone. \\n\\nI'm disappointed because the writers had two years to come up with a great storyline that ties up a few loose ends from The Force Awakens\\, but instead took everything that movie set up and crapped on it. They made the Star Wars franchise as a whole look terribly inconsistent. There is no rhyme or reason to anything. Droids are now as capable as humans (I'd have a better shot at beating Kylo head-to-head than BB-8). Ghosts from the past\\, like Yoda\\, can now destroy things in reality. Princess Leia can be shot out into space and then fly back to the ship like Mary Poppins. And finally\\, we're left wondering why Luke Skywalker has a blue light saber at the end. It's sad that this one film has been able to change my perception of the entire franchise. \\n\\nI couldn't wait for this movie to end.","true":true}