{"101487":193251,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"**WARNING - SPOILERS** I'm trying not to be super critical here but given how much money this IP makes\\, I think it's fair to hold it to a higher standard...so here you go. The Good: - the opening x wing fight sequence was probably the best opening of all the movies. In particular the 180 he did.. Nice - Rey and Kilo do excellent jobs acting in this movie - good to see Kerry Fisher one more time - the fight scene in snokes red room - the battle sequence on the red salt planet at the end was well done and beautifully shot. - kilo screaming up due every gun they got - snoke as usual - Porgs\\, I liked the screaming with Chewbacca scene. Finally had an actual laugh - when they turned the ship and went light speed into the bad ships The Bad: - if the resistance ships are faster than the bad guys\\, then why the hell did they stay the same distance the entire time? Physics tell us they would get further and further away\\, makes no sense - why is the hell wouldn't the stand in resistance stand in leader while Leah is out (sorry I'm terrible with names) not tell po what they were doing? It makes zero sense and causes him to doing a completely worthless mission and take over the ship - at the casino\\, with their entire resistance running quickly out of fuel and every minute counts\\, fin and new girl have time to chat about how awesome or not awesome the casino is. Um\\, hurry the hell up... That entire set piece needs to be removed - the humor throughout missed or ruined what would've been a good tense moment - killing snoke without telling us anything about the best bad guy in the movie (cough) Darth maul all over again - the way they killed snoke. This unbelievably powerful Jedi all of a sudden can't hear the light saber turning RIGHT NEXT TO HIM - space bombers that for some reason were built to go two miles an hour... In space - everyone is happy at the end after literally everyone has died except for 10-15 people - Kerry Fisher gracefully dying which would've been a beautiful way to go out but no\\, she someone is super woman all of a sudden - kill phasma after literally a total of 5 minutes in two films (cough) boba fet - leaving us wth literally nothing to look forward to in the next film. Guess what\\, it's Rey vs kilo\\, Rey will win\\, the end. Good luck JJ. I felt the plot had holes everywhere and star wars felt lost without a death star weapon to fall back on. What's crazy is the critics are loving this movie and I would actually thought they'd tear this plot up. Did I mention the terrible casino side quest? It's waaayyyyy too long and literally had me second guessing myself leaving. I literally think I'm over this brand\/series. Marvel gets all of this so right\\, I don't understand. They will still get billions from this so nothing will change. ","true":true}