{"101487":142578,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's been 4 months since The Last Jedi was released in theaters. I should be over it by now. Yet every couple of weeks I return to Rotten Tomatoes to check the audience score in hopes that it has dropped another point. I also read through the newly posted reviews. I decided that I am in mourning over the fact that Star Wars is truly dead. A wonderful franchise that has mostly delighted me for 4 decades died an embarrassing and ignoble death. \\n\\nThe Force Awakens wasn't great\\, but it held some promise. I felt less acerbic toward its obvious recycling of original trilogy characters and plots than most genuine fans did. I realized that while most people claim to love the Star Wars franchise the vast majority of people cannot recall the basic plot of any of the original movies as they probably viewed them once\\, and that viewing most likely took place decades ago. I felt that the repetitive nature of The Force Awakens was a way to assist the vast majority of moviegoers in their recollection of what Star Wars was meant to be with a modern dynamic.\\nIn short I extended Episode VII some credit. I assumed all debts would be paid for with interest when the missing pieces fell into place on the release of The Last Jedi.\\n\\nMy trust in the new direction of Star Wars was tentative until Rogue One was released. I remember my elation so well after seeing it. They really got it. THIS was truly Star Wars. The future was very bright for Star Wars fans.\\n\\nThe critics claimed to love The Last Jedi. I was so excited to go and see it. \\nAnd what a terrible disappointment. I felt like Joe Pesci's character in Goodfellas when he thinks that he's finally going to be a made man\\, and then is assassinated instead. \\n\\nI really never thought that I would feel the way that I do\\, but I want Star Wars to fail. I have decided that Episodes 1-6 plus Rogue One exist. The other movies do not and will not. We're in a kind of group therapy\\, my fellow true fans. Don't let these new terrible movies destroy Star Wars for you. There is great value in the real movies. They mean a lot to us for good reason. Stupid\\, talentless hacks should not dictate that you can no longer enjoy them. That would truly be a crime. May the Force be with you\\, always.","true":true}