{"101487":156517,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Nope. You're not allowed to do this. The Thrawn Trilogy has just been cemented in the minds of all real fans as the true story for episodes 7-9. No one wants your garbage disney. Oh\\, other than all of this little kids buying toys who can't yet truly appreciate a good story. The aesthetic beauty of this film does not make up for how poorly written it was. I feel bad for all of the actors who originally were excited to be a part of this epic story and universe. They don't deserve this. Mark Hamil\\, Carrie Fisher\\, Harrison Ford\\, the list goes on\\, they don't deserve to have the love the fans have for their characters snuffed out by your horrendous writing ability. \\\"let the past die!\\\" you say? Sure\\, we're on board with that. Give the past some dignity when you do it. I feel for the great actors and actresses who are forever tied to this dumpster fire. Although\\, Liam Neeson\\, Natalie Portman\\, and Ewan McGregor did just fine. I'm sure this cast will do ok as well. Leave us alone Disney. Do not step on what we love for the sake of your wallet. Do it right and we'll want to pay you\\, not hate you.  I guess i should include an actual review in here somewhere.. It was too long. Too many subplots from the first film were completely dropped. Most characters didn't have a fulfilling arc or send off. A large portion of the film was rendered completely useless and pointless in the end. The entirety of the major conflict of this film\\, that lasts through out\\, could easily be solved with obvious fixes. As well as the fact that the premise for the conflict isn't something that even makes sense within the universe.    How it could have been better? Read a Timothy Zahn book and hire a lore-master. Done. You get your money making epic and we want to keep coming back. Simple stuff guys. You've done it before\\, don't know why you decided to wet the bed on this one.","true":true}