{"101487":182323,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is not a half bad movie and that's the whole of the problem. First it's too long this film is fat a lot of things were very unnecessary. My first dislike of this movie is the curse of the all inclusive disney social crap. I can't help but notice White Males suddenly have become the Empire. this movie goes Way out of the way to Make the Men in this movie who don't fall into a minority Evil or a loose cannon. always seen the Empire more like Nazis or communist this fill corrects that notion by making All White males evil that needs to be stopped. second issue any older cast members whom are alive are now dead. the only \\\"1st generation humans\\\" left alive are princess leah which is weird because she is dead. Another problem I have with the film you can remove luke skywalker from the movie entriely and it has no impact to the movie minus the 5 or so minutes at the end and the Holograph luke could have been created through technology like a ghost from Christmas past. and yes some of the Humor is very out of place or at the very lest there is just too much of it. to sum things up the critics love it because hey Disney is powerful and could you imanige if you were a reporter for Hollywood and your did not get the exclusive interviews because you were honest about their cash cow. they have to be nice\\, after all we all know people will fork out their hard earned cash to see it just becasue it is Star Wars. for fans its not bad it mostly follows the same formula that makes the franchise great Light saber fights\\, space battles\\, but it is not magical just kinda there. at least they give you pleanty of time to go to the bathroom. but never tell you anything about Smoke. honestly you could just wait for it on blu ray and rent it for pennys to the dollar by renting it or spend 10 dollars more and buy it outright for your collection. the force is weak with this one.","true":true}