{"101487":168779,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So much promise. JJ Abrams had set the tone and direction for this new trilogy. Questions were asked. Who are Rey's parents? Who is Snoke? Why is Luke in hiding? The audience was drawn in and eagerly awaited the next instalment.\\n\\nMost previous posts have already clearly stated the mutltitude of issues with this particular chapter. But the fans have been badly let down. Rian has stated that there was no pressure from Disney and that he wanted to make Star Wars \\\"real\\\". Well that is such a hypocritical statement. Star Wars is first and foremost a fairytale of good vs evil. But if you are continuing a 40 year history of a particular tale then there are certain rules that must be followed. All of those rules were broken.\\n\\nRian says he is a fan but I struggle with this idea when he has so blatantly disregarded the framework on which Star Wars was built.\\n\\nWould the film be better if Leia had not miraculously come back to life and flown back to her command ship? If Luke hadn't been such a loser and shown complete contempt for his father's lightsabre? If Hux hadn't been made to look like a complete parody? If Luke hadn't milked the space cow?   If the humour hadn't been so misplaced? If the director didn't have to come out and explain the ending to everyone because they simply didn't get it?\\n\\nNo it wouldn't because it was such a poor plot with poor characters and the whole thing seemed like a complete waste of time. \\n\\nAs others have stated\\, what is there now to hold on to or anticipate for the next chapter? The 3 original characters are gone and of the 3 new heroes\\, 2 seem to be superfluous.\\n\\nFor a movie that was supposed to celebrate 40 years of arguably the world's greatest fantasy story this was an unmitigated disaster.\\n\\n2 stars awarded for the score and the cinematography although too much CGI. A lesson that should have been learned from the prequels.\\n\\nI don't have a clue or much interest in where the saga goes from here.","true":true}