{"101487":130659,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-07","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I didn't watch this movie for eight months. It's the first Star Wars movie I didn't see it in the theatre because audience criticism was so negative. Now watching it (for free on Netflix)\\, I realize this criticism was undeserved. Not the best Star Wars\\, but much more in line with the lore than Phantom Menace and the other prequels. \\n\\nI grew up believing I could be Luke Skywalker.  The representation of the Force in this movie did not betray the expectations that I had grown up with. It was in line with the spiritual aspect of Star Wars\\, while expanding on it. (Don't get me started about midichlorians. THAT was an abomination). Luke's departure is similar to how Kenobi and Yoda both died. I don't get how people don't see that. \\n\\nThe political undertones weren't any different than all the other Star Wars movies were at the time. I didn't sense a huge political agenda threaded through this movie. (Remember how Anakin tells the smoker to rethink his life? What about the cantina on Mos Eisley --- you will never find a more wretched hive of scum and villainy than in a bar back in 1977). So I wasn't offended. It wasn't necessary\\, and if I was the editor I would have cut it out. I thought the Chewbacca scene was cute --- but I didn't think he was going to go all Vegan on us.\\n\\nPeople that love this movie are wrong\\, but so are people that hate it. It is a solid 3 and a half stars. Some of the plot points are a little thin. Slow-speed star destroyer chase? Why not just outflank and surround them? Do they need to go to Canto Bight? Probably not. I might have written that differently\\, but it doesn't ruin the whole movie. And who gets thrown in jail for a parking violation? Why don't they just tow the vehicle off the beach? Rose isn't as annoying as Jar Jar Binks. Not even close. The movie is not slathered in one-liners\\, either. It actually is pretty on-par with other Star Wars movies. Leia flying around --- not exactly as the reviewers have stated it. I saw it as the Force acting to protect her. She IS Anakin's daughter. This is the only time she's used the Force in five movies. Everyone gets bent out of shape.\\n\\nAnd Snokes death? Well\\, maybe he should have taken Luke's class on the balance between the light and the dark. Might have seen that coming a little better. Don't put a bunch of Jedi in a room with light sabers. Someone's going to get cut in half.\\n\\nI'm disappointed that I didn't see this in the theatre. It's not the 91% that the critics wrote\\, but neither is it 46% audience score. A solid 75\\, meaning they would have to change 25% of this movie to make it perfect.","true":true}