{"101487":130285,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"?I counted down the days since TFA for #LastJedi. I was looking forward to a new story told in a new way by an awesome director but I have never been more angry or disappointed leaving a cinema.?\\n\\n?2\/9 It was so bad\\, I actually started to think that there was a \\\"joke cut\\\" of the movie and that I was unlucky to be watching it but I? ?would get refunded and get to see the real version - which is of course\\, ridiculous?!\\n\\n?3\/9 There was minimal good bits\\, it all looked amazing? ?- apart from Kylo's nipples. The best thing I can say about it - and this was noticeably? ?brilliant - was? ?the broad female and ethnicity? ?representation.?\\n\\n?4\/9 Personally\\, I reject lovers of the #LastJedi saying that haters of the film dislike it because it's doing Star Wars in a new way and that fanboys can't handle it but I can only? ?speak? ?for? ?myself of course?.\\n\\n?5\/9 My biggest problem with? ?#LastJedi was it felt that Rian Johnson hated TFA. All the threads that had been established? ?he quickly and brutally destroyed. Obvs\\, you can't please everyone\\, but it felt like contempt rather than resolution.?\\n\\n?6\/9 #LastJedi feels like more of a beginning than a middle piece to a trilogy. TFA is meaningless now and I don't see how JJ comes back to finish ep9 with what's left. As an aside - I'm also unlikely to pay to see Han Solo next year - a movie I was already wary of.?\\n\\n?7\/9 Surely the blame then lies with those overseeing the whole? I don't see how we can? ?go from JJ's TFA to RJ's TLJ in the same trilogy. If the ultimate? ?aim was to move? ?the franchise on fresh? ?then they should? ?never have made TFA? ?and JJ shouldn't be back for ep9. ?\\n\\n\\n?And just to restate moving on fresh was my hope from the beginning.? ?Yes\\, I loved TFA cos it felt like Star Wars - yes it was flawed in its remake of Hope but it was soooooo much better than the prequels? ?and maybe? ?it was the Star Wars? ?movie we needed at that time.?\\n\\n?I will go and see to LastJedi again - just to be sure. But I'm not holding out hope. I was fresh\\, excited but not overly so and open minded about the film before going? ?so I'd be surprised? ?if I? ?180. I genuinely? ?believed I was going to see the best #StarWars film - unfortunately that was not remotely the case?.","true":true}