{"101487":146678,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was introduced to Star Wars on VHS in the '90s\\, and enjoyed the Prequels as well as the 2008 Clone Wars show. So it's safe to say I kind of grew up being a fan of Star Wars.\\nEver since Disney bought Lucasfilm I had a bad feeling about it. I didn't like Force Awakens' hollow retread of A New Hope\\, or Rogue One's boring and dreary tone. The Last Jedi was the third strike for me. Since when did Star Wars become a ripe place to bring up animal cruelty\\, shaming meat eaters\\, or all this other SJW garbage? Disney doesn't care about how special and unique Star Wars was or is. All they care about is pushing social agendas and having a \\\"quantity over quality\\\" mentality with the brand.\\nLast Jedi does nothing but destroy classic characters and key aspects of the Force; (\\\"Everyone is force-sensitive! Everyone's special!\\\")  all the while expecting you to just accept it. Rey is still an unexplained master in the force\\, and Kylo Ren is still a whiny\\, entitled brat who we're supposed to see as the villain. Classic characters like Luke and Leia are rewritten to the point of in-name-only compared who they are in the OT; while others like Chewie\\, Threepio\\, and Artoo are merely window decoration with nothing to do. \\nThe locations like Canto Bight were much too worldly and unimaginative. The puppetry for Yoda\\, those awful Porgs and background aliens was Sesame Street quality. Leader Snoke\\, the discount Emperor Palpatine who was built up in TFA with all this mystery\\, was killed off in a hilarious fashion in the middle act with no real buildup. Also since when did people in Star Wars say stuff like \\\"Godspeed\\\" or \\\"big-ass\\\"?\\nAnother thing theses new movies lack is that certain \\\"feel\\\" the previous 6 had; that feeling of adventure and optimism; a sci-fi fairy tale with an all-ages appeal.  Last Jedi and Rogue One feel far too dark and violent in tone; is that what Star Wars is about now? I don't remember explicitly-shown high death counts in a franchise where \\\"good will triumph evil\\\" is the central theme.\\nDisney has ruined the Star Wars brand. As far as I'm concerned: Star Wars began at The Phantom Menace and ended at Return of the Jedi. Star Wars was a saga created by George Lucas that wanted to take a new spin on sci-fi with biblical\\, mythological\\, and fantasy elements. Without George Lucas all you're left with are loud big-budgeted fan films with the Star Wars logo pasted onto them.","true":true}