{"101487":176056,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The main sticking points I had with this movie:\\n1. Why Didn't the First Order Fleet Destroy the Resistance Ships Immediately? The First Order Fleet clearly outnumbered the Resistance and they had a number of Dreadnoughts\/Destroyers at their disposal (also the fact that one X-Wing took down a whole dreadnought was ridiculous and was done only to showcase Poe).\\, so why couldn't they have caught up to the Resistance much quicker? Other than that\\, the action was cool and the tension was high but overall it was the longest chase scene I have ever watched in the cinema.\\n2. When Darth Sidious said \\\"To cheat death is the power only one has achieved\\, but if we work together\\, I know we can discover the secret.\\\" I never realised that Leia would be the one to discover the secret by miraculously flying THROUGH THE VACUUM OF SPACE and back to the Raddus like Superman using the Force- this was the most ridiculous moment of the movie. \\n3. Poe vs Holdo. This whole segment of the movie was a complete waste and didn't amount to anything significant. Why didn't Holdo Just Let Poe in on her plan from the beginning? I understand Leia and Holdo where maybe trying to teach Poe restraint but this was literally the Resistance on it's last legs and it didn't seem like the right time for moral lessons.\\n4. Phasma. What a joke. less than five minutes of screentime and Disney marketed her again as being central to the story (Phasma vs Finn\\, Book release\\, Last Jedi DLC in battlefront 2). GC is such an amazing actress however she was definitely short changed as were the fans.\\n5. Snoke. This was the most frustrating death purely from the fact that I feel like I wasted days reading the Aftermath Trilogy for them to suggest that he was this massive dark side presence and with RJ saying he was more powerful than Vader and Sidious yet he couldn't detect Kylo turning the lightsaber towards him?? And the fact that he's dead now means there is not much point for any further character development and he was another wasted character.\\n6. Rey's Parentage. While I can accept that she came from nothing significant\\, mirroring Anakin's lineage\\, why oh why did they build up on this theory since Force Awakens? In the end it meant nothing and for me it was just another example of lazy writing.\\n7. Finn and Rose. While their character interactions are excellent their whole plot in this story was completely insignificant (apart from Finn killing Phasma). They never recruited the Codebreaker they were meant too and they never shut down the tracker device. Also the whole sequence on Canto Bight was drawn out and felt like a promotion for highlighting rich society and animal cruelty (which are important) but how did this lend to the main plot?\\n8. Luke. Well where do I start? For the first hour and a half I thought his character direction and portrayal was great but then I began to realise why Mark Hamill initially said in interviews that he didn't like the script; he didn't give Rey any real training\\, we never got to see him physically wield a lightsaber and during his fight with Kylo he's now the worlds best limbo player??\\, also he was able to hologram himself? Across millions of miles of space?? and create hologram dice? This is where the nature of the Force is now just a Mcguffin which can fill in crappy plot holes. Luke's death was so stupid and ridiculous considering that in 40 years of canon and lore\\, Luke has always been promoted as one of the most powerful Jedi etc and his story continued well into old age. But after a hologram fight he just gets tired and gives up? What a joke. \\n9. Killing off 5 main characters from the old and new trilogy. This just demonstrates how the writers have disregarded fans likability for certain characters - Ackbar\\, Holdo\\, Phasma\\, Snoke\\, Luke. All deserved more time on screen. And none of these deaths had any emotional impact compared to any other SW movie or certainly Han's death in FA.\\n10. Yoda appearing to Luke. While I loved Yoda's cameo\\, why didn't they introduce a CGI Obi Wan (they done a great job of Tarkin in Rogue One) as well since he was Luke's first mentor and arguably the one he was most attached too. \\n11. the Hyperspace suicide... because of it the whole universe doesn't make sense... they could have used the same tactic against the Death Star.\\nOverall I would rate it 5\/10 and by far the worst Star Wars movie. It had so much potential to be great (Luke fearing Kylo which could have led him to the Dark SIde and then lead him to fighting Rey and Kylo\/ or Rey joining Kylo and ruling the Galaxy vs Luke in Ep.9.\/ Snoke being an Ancient Sith and killing one of the main characters or having Luke save Rey and Kylo on the Supremacy). But overall alot of the plot threads amounted to nothing significant.\\n\\nThe movie was shot beautifully and the action sequences were great. The actors portrayal of their characters was also great. As I say\\, my main issue is how the plot serviced these characters. The plot was messy and lacked real direction and I think in order to simplify things for Episode 9; that's why the writers literally destroyed everything. This is the first SW movie that I was genuinely disappointed in\\, and its the first SW movie I have ever complained about (I love the Originals\\, the Prequels and TFA\/RO).","true":true}