{"101487":179049,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The special effects are amazing. The camera work is stunning. The acting is really good. Mark Hamill put in probably the best live action performance of his career. It has some amazing strong female characters. The script is rather good. John Williams' score never fails to impress. However\\, despite all of this\\, it is still a bad movie because the storyline is simply dull and broken. \\n\\nIt isn't enjoyable to watch. The movie for the most part\\, centres around the 'bad guys' chasing the 'good guys' in space. The storyline is full of plot holes and boring needless side-plots which feel like filler to the audience. The character development from the previous instalments have been wasted and ignored for this chapter. The movie has lots of cheap and unfunny jokes which seem out of place. The dark epic tone delivered in the trailers and marketing is not present in the final execution of the movie. There are so many wasted opportunities in this movie\\, which is a shame\\, as it had a lot of potential. It feels like the storyline is being made up as they go along. It is as if the creators behind the movie\\, had no end goal or rough idea where they wanted to go with the storyline.\\n\\nThe pointless sub-plot on the Casino Planet\\, comes across as a mash-up of a James Bond movie and a Harry Potter movie. The movie even lacks an iconic lightsabre duel. To conclude\\, the movie is very boring. I am not excited to see this movie again. I've never felt this before with a Star Wars movie. It is obvious to the audience that Disney have sacrificed storyline for profit and merchandising. Unfortunately\\, I do not have high expectations for the next instalment. It is apparent that you can polish a turd. 3\/10 is a fair score for this movie.","true":true}