{"101487":166309,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Saw the movie twice in the cinema. After seeing it a first time and feeling very underwhelmed\\, I went back to see if there was something I was missing. The \\\"critics\\\" were raving about this brilliant reinvention of Star Wars. Nope. The movie is pseudo-intellectual\\, postmodern garbage. Ryan Johnson has to be the most overrated director in Hollywood. It is like he wanted to show everyone how smart he was by unravelling the longstanding use of Joseph Campbell's hero motif in Star Wars story telling. Yes\\, visually movie excels. But peel past this veneer and you will discover that the plot meanders\\, the scripting sucks\\, the character arcs are regressive\\, and the film is out of kilter with previous Star Wars films\\, including its immediate predecessor the Force Awakens. Even if JJ Abrams left an inconvenient bunch of \\\"mystery boxes\\\" such as who are Rey's parents and why did she have visions when she touched Luke's original blue light-saber\\, just cant pretend they weren't there or dismiss them. Worse of all\\, courtesy of Johnson Luke Skywalker has been reduced from hero to loser. Why? Because according to Johnson everything is contextual. There is no real good or evil. If\\, like Luke Skywalker\\, you hang around long enough you will realise that the hero's journey is pointless and what is old becomes new again. So the inevitable option is to give up. Confusingly however Rey becomes some kind of hero without ever really earning the right. How does she become a jedi master with almost no training. Particularly if she is a \\\"no body\\\"? This is not a renewal of the franchise. Even ignoring its unnecessary inclusion of antifa politics\\, the film's \\\"let the past die\\\" philosophy is is an arrogant and disrespectful junking of tradition and the many fans bought up on Star Wars pop culture. Maybe many of these fans are \\\"man babies\\\" and maybe we should quit calling what are really just laser swords \\\"light sabers\\\". But if your agenda is want to destroy fantasy and pop culture beware the consequences. Many of us simply wont watch Star Wars anymore.","true":true}