{"101487":134541,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-13","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left the theater very quiet at first. Trying to sort through the last 2 and a half hours. This movie was franchise fuckery of the highest order. The same kind of fuckery we saw in the 2016 Ghostbusters. This film spent more time trying to push an ideological message than to answer any questions we were left with from TFA. Who's Snoke? Fuck you. Who are Rey's parents? Psh\\, why do you care? Here have some garbage feminist imagry\\, and a side-quest that grinds the film to a lull where we have the Black guy and Asian girl go to the planet with the \\\"Worst people in the Galaxy\\,\\\" or Evil Old Rich White people who use child labor and abuse animals. Let's kill off all of the male commanders (except Poe\\, we'll just demote him) and now all the Resistant Commanders are female and led by a purple-hair lesbian (real subtle there Johnson). Oh and lets not forget the final stand off between the Resistance Ship and the First Order fleet. The Resistance are commanded by a group of strong willed womens who don't need no man. And the first order? Commanded by evil white dudes. Oh\\, and the setting for the final stand of the film seemed like Johnson laughing at 51% of the Audience hating it on Rotten Tomatoes as it's a planet where everything is salt. A soldier touches the ground and licks his finger and says \\\"Salt?\\\".  Why? Because before this\\, you think they're on some kinda ice world like Hoth. And throughout this film\\, the message is pushed \\\"The old must die.\\\" Well we clearly know what Disney and Johnson plan to do with this trilogy. Kill off every original character\\, and replacing them with characters they can mold into political ideological vomit spewers. My brother asked me if this film was bad enough he should wait to do a red box rental. I said \\\"No\\, don't even give them your money. If you have to see it\\, pirate bay that shit.\\\" This is the worst thing to happen to Star Wars since the Christmas special.","true":true}