{"101487":170414,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars The Last Jedi was the first Star Wars movie I have ever walked away from where I was completely and utterly disappointed. At first\\, I found my self-scratching my head to strange choices director Ryan Johnson made for the movie. These choices included things like Leia flying through space which may have made me cry watching the death of her character turned into something that was laughable. The biggest disappointment for me leaving the theater was that the director seemed to rewrite Star Wars lore not caring about the characters that George Lucas created. As evil as his father was\\, the only time Luke almost came close to killing them was when he threatened to hurt his sister by turning her to the dark side\\, so Luke would never consider killing her son. Later as I began thinking about what I just saw my disappointment grew none of the questions that I had from The Force Awakens were answered and if they were they were answered in a disappointing scene. \\n\\nIt seems not only did Kathleen Kennedy and Ryan Johnson neglect the original trilogy of Star Wars they also neglected their own trilogy by not following up on issues that arose from The Force Awakens. Now when re-watching The Force Awakens I have to make myself believe that R2-D2 turns himself on when Ray arrives and that Finn didn't actually need Poes' help to fly because apparently\\, he knew how to all along. It seems that Laura Dern's character was shoehorned in as a social justice issue of not wanting a man to take over while Leia was hurt\\, and all this happened in an incredibly bland story about the resistance running out of fuel. I felt that the opening scene with Luke Skywalker and his father's lightsaber was a perfect representation of what Kathleen Kennedy and Ryan Johnson did with the beloved universe the George Lucas created.","true":true}