{"101487":146314,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wanted to love this. I really did. I bought tickets to see the first showing at my nearest Alamo Drafthouse here in NY. Stormtroopers met me at the door and gave me trading cards. Darth Vader was inside the lobby to take pictures with. I got Dark Side & Light Side pint glasses. I was excited and ready for an escape. When the Lucasfilm name hit the screen I started the applause and then the movie started. I was along for the ride. Angry Luke was fine with me. Rey wanting to be a Jedi. All good stuff. We meet Snoke and he's actually very interesting and I want to know more. I thought the CGI on him was beautiful. And the movie kept going. I liked Rose. Thought she was a good addition and I liked that her sister's death set everything up. But then we kept going back to the Island with Luke and Rey and he never trained her. There were no lessons imparted on her. He made her sit on a rock\\, she levitated and he freaked out. I was hoping Luke would find what was lost in him by meeting Rey but instead it was just a lousy set piece that did nothing to develop the story. Rey's the most powerful Jedi in the land and she has had no lessons. The Jedi the entire series was built on imparts no wisdom from his journey on her. But still\\, I'm along for the ride. Then Princess Leia is space walking.....WTF? Then Laura Dern watches like 10 of her ships get blasted while she could have done the suicide mission right off the bat....and then Snoke\\, the one character I'm excited to learn about\\, the one I'm enjoying the scenes with the most\\, gets killed.....By the time the end came around I was thoroughly confused and not in a good art house way. I see all these Austin Film Critic guys who are friends with Rian Johnson fighting with people all over the internet today because they didn't love this movie. Well\\, I didn't love this movie. It was poorly plotted. The payoffs were lazy. If you're going to kill Luke\\, then by God make it epic. What he chose to do was the least cinematic epic thing you can think of. I mean\\, let Kylo kill his mother and let Luke try to avenge her in a fit of dark side rage before he is vanquished. Do something epic. This felt like \\\"how do we suck the fun out of storytelling\\\" to me. Just lazy with no vision in the plot. Was it beautiful? Yes. Did I love seeing women pilot ships? Yes. Did I love seeing all races represented? Yes. The problem with this is the plotting. It's poor. It's lazy. It's a mistake. Friends of Rian's who are badgering people online who are not calling this a masterpiece are doing him a disservice. He should hear the criticsm. Nobody clapped in the theater I was in when the credits rolled. They weren't crying with emotion. They all had this slack-jawed\\, \\\"huh?\\\" look on their face. I give it 3 stars because that's what it deserves. And I'm not a bot. I'm a fan and cinema lover.","true":true}