{"101487":158691,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Objectively\\, this film is fantastic. More characters get much needed development. The relationships between characters are deeper. All the cast gives superior performances to The Force Awakens. Adam Driver and Daisy Ridley sell an extremely powerful and surprising bond between their characters. Mark Hamill is at his all-time best as Luke Skywalker and Carrie Fisher really delivers one of her best performances as Princess Leia. John Boyega does a fantastic job as Finn and made me really feel for his character toward the conclusion of the film. Oscar Isaac and Laura Dern have a unique and interesting relationship that will surprise people but both performances were fantastic. The film goes off into unexpected directions\\, avoiding the major criticism of The Force Awakens. The only criticism I have is the movie does have some uneven pacing and suffers from \\\"The Two Towers syndrome\\\" where one of the story lines is less interesting than the others. Objectively speaking\\, I feel this film is superior to The Force Awakens because of its overall character development and performances.\\n\\nSubjectively\\, fans will be extremely divided over this movie. It goes in new directions and gives answers that will give different results to different fans. This being said\\, no one can deny that the story isn't interesting. I was genuinely shocked with some of the decisions that were made. I liked almost every decision\\, including some of the controversial ones made with the \\\"legend\\\" Luke Skywalker\\, but I can see where some fans will disagree. The answers the movie provides for the numerous questions left at the end of The Force Awakens are a mixed bag. I loved some revelations involving Luke and Kylo Ren but felt Rey's answers were not satisfying. To be fair\\, there is room to expand on some of these points\\, particularly Rey\\, in Episode IX but the answer you get here seems unsatisfying\\, especially after the question is played up through the movie. I was also surprised that Kylo Ren and Luke really felt like the film's most important characters with Rey following behind. John Boyega has a moment toward the climax that I thought was going to be a very powerful moment for his character that is suddenly prevented by another character. I really liked the lead up to this moment and began to really feel Finn's character arc come full circle but that emotional moment is taken away from you. The film features several callbacks to the Empire Strikes Back and Return of the Jedi on a visual level which was great to see and not obtrusive to the story. The conclusion of the film really got to me emotionally as the final battle will really pull at Star Wars fan's hearts. I didn't feel the same emotional pull in The Force Awakens even though that film was a great entry into Star Wars. Subjectively\\, the film will divide fans but I personally loved many of the decisions and found it refreshing that the movie really went all out with both old and new characters. I think the surprise that Luke is not the same man he was at the end of the Return of the Jedi and decisions made with supporting characters on the Dark Side will be the real dividers between Star Wars fans.\\n\\nIn summary\\, the film is an incredibly interesting and beautiful movie. Characters go on interesting and surprising arcs. The action is compelling and on a refreshingly smaller scale. The conclusion will leave Star Wars fans emotional. I think this film is a unique and great addition to the Star Wars films. I view it as one of the greater Star Wars films to be produced and I'm interested to see how the film will be viewed in years to come.","true":true}