{"101487":147452,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I will give it 1 1\/2 stars because newer fans will like the movie. It is well filmed\\, and the acting is good.\\n\\nLong times fans will not like the script. They setup so much to look forward to in The Force Awakens\\, and this movie just tosses it all away.\\n\\nspoilers:\\n\\n\\nThe main villain is killed by a lightsaber sitting on a table. With no backstory or reason for what drives him. No epic fight with him.\\n\\nRey gets movie #2 with still virtually NO force training. If you were a fan of the first 3 star wars movies\\, you could relate a lot with Luke as he painfully trained to use the force. Rey\\, now 2 movies in with no training\\, is going to just be able to do whatever the plot needs her to without her having to earn anything.\\n\\nWhat they do with the legacy of Luke Skywalker in this movie is insulting. Luke tries to kill his teenage nephew\\, gets knocked out by his teenage nephew. Refuses to train a Rey who shows up to gives him back his lightsaber\\, Loses to an untrained Rey when she finds out what happend\\, then he makes a hologram of himself for 5 mins and dies. That's what they did with a char people have waited 40 years to see? \\n\\nThe rebel forces are just slowly dying out over a 2 1\/2 hour long movie. Their is no wins for the good guys the whole time. How is this inspiring a new generation of force users or rebels? Luke was ment to be the inspiring legend in the end with a loss? I don't understand..........\\n\\nI left the theater after watching the force awakens 3 years ago excited for the next movie\\, I feel none of that this time around.","true":true}