{"101487":170096,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi does pack a wild science fiction punch being a strong emotional\\, visually exciting\\, and a great second film in the trilogy with the direction by Rian Johnson. Also\\, one of those films it is best knowing less and avoiding spoilers cause there are a couple of twist with the characters directions or reveals. I will try avoid giving away much details besides it was a spectacular film overall. The film kicks off right after the Force Awakens as ended\\, Rey (Daisy Ridley) meets Luke (Mark Hamill) in an island. Where she wants answers on were she fits in all this and needs Luke's help to aid in the resistance. Meanwhile\\, Poe (Oscar Isaac) and Leia (Carrie Fisher) are trying to escape the first order led Kylo (Adam Driver). Then\\, there is Finn (John Boyega) and Rose (Kelly Marie Tran) who are on a casino like planet looking for a decoder by the name of DJ (Benicio Del Toro). The plot was strong and emotionally moving with characters. A little hard to discuss without giving away anything. Besides there is a lot of unexpected directions characters turn around too. You may get good guys struggling with hope\\, bad guys that are also emotionally conflicted\\, and an climatic battle with characters dueling with lightsabers. Some aerial dog fights through space ships. And also a battle on a salty planet. There are also some twists that star wars fans may love or hate. I personally was expecting the direction to go a lot different. But I have no complaints with its new direction. I am excited to see were episode 9 will go. The set designs were cool. There is a lot of action from beginning to end. This film also feels like it's a big long chase with the rebels trying to escape from the first order through their space cruisers. There are some fun looking creatures like the porgs or the crystallized looking dogs. The aerial combats was plenty with the film and the visual effects are exciting and amazing. There was also a cool lightsaber duel which may leave the audience clapping. The script by Rian Johnson did give a good emotional story with a lot of things going on with the characters. Poe and Finn have a lot more to do in the story. And Rose being introduced and giving a more emotional connection with Finn. As they share there perspectives of this galactic war. And how running away from it will never make it go away. Out of all the star wars films. This is one of the better films. I still loved Revenge of the Sith\\, The Force Awakens\\, and Empire Strikes Back. The Last Jedi fits in right after Empire Strikes Back. Overall\\, The Last Jedi is a great Star Wars addition. It packs an emotional story\\, characters are at stake and have a lot going on in the film\\, the action and visual effects are great and plenty. I rate the film 5 out of 5 stars. I definitely recommend seeing the film in the big screen for its impressive exciting action\\, story\\, and the visuals.","true":true}