{"101487":135991,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I love Star Wars. I was so excited to see this movie on opening night. The critics gave it outstanding reviews\\, some even said it was better than Empire. The movie looked and sounded great. If all you are looking for in a movie is a comedy with special effects and space battles\\, you will probably enjoy the film. As the movie progressed I held my hopes for what the critics must have loved. \\n\\nSo much wasted potential. This was the only chance they had with the original composer and actors. They have a huge budget and access to modern special effects. The only problem with this movie is the terrible writing. \\n\\nThis movie is full of plot holes that will ruin your suspension of disbelief. The humor is childlike and self-aware\\, to the point where this movie feels more like a parody of Star Wars. Every hope and expectation you have for the film will be ruined in the most contrarian way possible. The film is full of cheap \\\"gotcha\\\" moments and useless\\, poorly-managed subplots. This film tosses away iconic characters and adds a plethora of underdeveloped sub-characters. There is no real character development for new or existing characters. \\n\\nLuke starts off by throwing his father's lightsaber away like a cheap toy. Luke never leaves the island. Luke never trains Rey. Luke's character arc is retroactively ruined. Luke was the only one to refuse to kill his mass-murdering father Vader\\, but now turned his innocent nephew Ben Solo into Kylo Ren after he tried to kill him. He abandoned everybody after making this mistake. He never planned to leave the island despite creating a map. He milks a sea cow and slurps the milk and lets it drip all over his beard. He dies for absolutely no reason. \\n\\n\\\"I fundamentally disagree for every choice for Luke in the Last Jedi\\\" - Mark Hamill\\n\\n\\\"Remember kids. It's not important if it's of high quality\\, only if it makes money.\\\" - Mark Hamill\\n\\n\\\"Jedis don't give up. . .  I mean even if he had a problem\\, maybe take a year to try and regroup . . . but if he made a mistake he would try and right that wrong.\\\" - Mark Hamill\\n\\nThere are no explanations for the setting of the previous film. No answers are given to any of the questions setup by TFA. Why is the First Order so powerful? Why is the New Republic so weak? Why did Luke leave a map? Why does R2-D2 suddenly wake up? Who is Snoke? Who is Phasma? Why did Han Solo and others seem to recognize Rey? Why can Rey become as powerful as a Jedi master within days? Why did Rey get visions of the past? Who are the Knights of Ren? These questions are never answered in the Last Jedi. Instead you get the joy of watching a Resistance ship be chased for two hours\\, a nonsensical casino planet adventure to temporarily save animals\\, and romantic force-skyping between Kylo and Rey (yes he is shirtless in one call). \\n\\nThis movie wants to destroy everything that was Star Wars and recreate it.  The force is no longer special\\, even a random child uses the force to lift a broom. The characters are all shallow and speak mostly in one-liners\\, it is like watching an imitation marvel blockbuster. Any character development in TFA was thrown out the window. There is no more bromance between Poe and Finn. Finn is comedic relief and does not do anything useful. Poe now only wants to blow things up and does not think anything through. Kylo Ren is still constantly flip-flopping. \\n\\nRey is still a perfect character with absolutely no character development. She can speak to BB-8 and Chewbacca. She can swim despite being on a desert planet her whole life. She can expertly pilot ships and cannons. She can repair and operate vehicles. She can beat the powerful Kylo Ren. She beats Luke onto his butt. She lifts up a mountain with the force. This is all without real training and only days after learning what the force even is. She has suffered nothing. Her parents do not matter. \\n\\nThe main plot of the film involves the last Resistance carrier being slowly chased by a First Order fleet. The fleet never sends out small ships\\, can't do damage with their cannons\\, and never tries to cut off the Resistance ship. The Resistance can outrun the fleet for as long as they have gas in their carrier. Leia gets shot into space\\, survives the explosion\\, and flies back. This\\, of course\\, makes her need to take a nap. New pointless characters were added to the movie\\, most notoriously Rose and Holdo\\, and existing characters were underutilized.  The purple-haired Admiral Holdo takes over while Leia is now napping and refuses to tell anyone about her plan. This causes Poe to worry that she has no plan and start a mutiny. Poe sends Finn and the space-plumber Rose to go to a casino planet and find a hacker to save the day. They immediately get thrown in jail for a parking ticket. They find a hacker in the same cell and he frees them. They go free some goat-horse-cat animals\\, but abandon the slave boys that helped them free the animals. They ride the goat-horse-cat stampede through the wealthy casino goers as the police chase them. With the impending police capture Finn and Rose decide that this whole adventure was worth it because they got to free some animals. The hacker suddenly shows up with BB-8 to save them from the police. The animals likely got recaptured\\, innocent people trampled\\, and the slave boys punished for freeing the animals. \\n\\nFinn\\, Rose\\, and the hacker go to hack the First Order fleet. The hacker overhears Holdo's plan to abandon ship. The hacker uses this to betray them to the First Order. Leia wakes up and stuns Poe for mutinying. Finn and Rose get captured. The Resistance tries to abandon ship\\, but the escape ships get shot down by the First Order as a direct result of Holdo not telling anyone her plan. Holdo stays to pilot the cruiser\\, but after 90% of the Resistance is already dead decides to put it into hyperspace and kamikaze it through the First Order fleet. It would have been nice to see Admiral Ackbar or Leia do this instead. If hyperspace was such a powerful weapon why would they have never used this in the previous 8 movies? This saves the remaining Resistance along with Poe and Rose\\, but needlessly leads to Phasma's death. Snoke also dies for no good reason. They land on a salty desert planet with a secret resistance base\\, and basically rip off the Hoth attack. The Resistance sends a dozen ground-based\\, archaic ships to go and destroy a cannon defended by a full squadron of AT-ATs. For some reason\\, they trust the mutinous space-plumber Rose and space-janitor Finn to be pilots of these few ships.  \\n\\nFinn has a cool scene where he is going to sacrifice himself into the cannon and save the Resistance\\, but Rose comes out of nowhere to crash into him and doom everyone. They land right in front of the AT-ATs that do not shoot at them for some reason. Rose says a cheesy line about saving the ones she loves and gives Finn an extremely awkward kiss\\, then passes out. Finn somehow arrives back at the base in a couple minutes after carrying Rose back for miles without a ship or being shot. Everyone is going to die because Rose doomed them by stopping Finn from saving the bunker from the cannon. Luke now has to astral project himself to the planet in order to buy them time\\, but in doing so exhausts himself to death. Rose basically got Luke killed by forcing him to sacrifice himself to save everyone. Rey shows up to lift a mountain of boulders from the base as an escape route. Only a dozen Resistance troops survive and they all leave together on the Millennium Falcon. \\n\\nAll this smothered with cheesy humor. I highly recommend not seeing this movie or supporting what Disney has turned Star Wars into.","true":true}