{"101487":140269,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It doesn't take much at all for me to enjoy an action movie in space. I'm pretty easy. Space ships\\, sword fights\\, good\\, evil\\, heroism\\, drama - sign me up. It doesn't have to be great- I'm usually down with the cause. I like a lot of bad movies as long as they do a decent job of taking me on a journey for an hour or so. \\n\\nI'm not a Star Wars \\\"fanboy\\\"and am totally cool with a movie taking an old narrative into a new direction with new\/diverse characters. However this movie is nonsensical in so many ways that it is very hard to suspend disbelief and get lost in the movie. \\nThe humor is misplaced\\, the characters' motives are either unclear or inconsistent\\, and the plot holes are as vast as outer space. \\n\\nI'm all about change-but not just for the sake of change itself. There has to be a payoff. Honestly\\, I just couldn't wait for it to be over because I felt so uncomfortable watching it. It's like watching a comic bomb. You are just stuck watching something happen that your brain is rejecting\\, but you stick with it because you hope and pray that there will eventually be something redeemable in return for the money and time you've invested. \\n\\nIt never happened for me. I hope you enjoyed it better than I did. \\n\\nThis is the first review of a movie I have ever submitted. I felt compelled (maybe too strong of a word) to write this because I don't understand how most of the critics are into this. It's very strange. I'm almost always in agreement with the majority of critics. Its just weird. I'm also hanging with my in-laws for the holiday season and don't have much to do on this snowy day. \\n\\nMerry Christmas and Happy New Year everyone!!! May the force be with you - as well as your family and loved ones! Dec 23\\,2017","true":true}