{"101487":149826,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Let the past die. Let legends go. Let everything you love and hate from the previous films be out of your mind. The last jedi is not about the original trilogy cast story. This about a new\\, fresh\\, different story. A story about Rey and her purpose. Not her lineage. A story about Poe's resolve in the resistance. Not about kicking ass because bad guys suck and good guys rule. A story about Finn and some girl named Rose. Not a story about shipping your favorite characters.(kind of.) Kylo Ren was terrific in this movie and a shinning gem to all this. Luke's role is a juicy one you will either love or hate depending on your stance and knowledge of the old star wars if refuse to let go of these ideas that the character is \\\"invincible\\\" because he is your childhood hero. Childhood heroes can be vulnerable and feel weak. That's what makes them human.  There is exploration of the force and used in ways the previous films did not go. Again you may or may not like it because your past knowledge. The trailer greatly emphasized the point of this film. This is not going to go the way you think. This is a new star wars. Not star wars original trilogy. Not star wars prequels. This a new story. A very different \\\"Hope\\\". A very different \\\"Empire\\\". This film does well in its story overall but not with a few setbacks that clearly shows such as they wish to expand more things in the horizon which the film suffers for not keeping in focus. The work of Surpeme Leader Disney and Rian Johnson no doubt to squeeze the franchise to add more questions.","true":true}