{"101487":115784,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disappointed and odd are the two descriptive words that jump out to me.  It was like Rian Johnson had some kind of vendetta against Episode VII.  The the blatant and total disregard for everything established in the Episode VII was disrespectful to say the least.  Two years of tension and waiting for the lightsaber handoff scene resolution just to have him toss it over his shoulder like trash. Like anyone would do that with their father's lightsaber that they thought was lost and hadn't seen in years...even if they had no interest in being a Jedi anymore. I literally thought that was part of an outtake gag reel.  Plus all the non-stop out of place comedy.  Luke goes from grumpy to constant comedian. So many forced punchlines and gags.  Maybe 2 out of 5 gags hit their mark\\, the rest are so out of place and character that they are groan worthy.  But those choices seem Oscar worthy compared to the big \\\"jump the shark\\\" moment of Mary Poppins Leia.  There were audible \\\"WTF's\\\" that could be heard in the theater.  Unfortunately Rian Johnson has now gone and #flewtheLeia with Star Wars. Rian wanted to do Star Wars his way...great...but you don't do it in the MIDDLE of an established trilogy and completely abandon everything the previous directly eastablished.  I can only think that the professional reviewers are being paid or afraid to say something negative against Disney's biggest cash cow\\, because this movie was not good.  The audience knows it and I think Disney knew it too\\, so they force fed so many positive reviews to keep up the hype.  I'm thankful that someone else is doing episode IX. We need someone to restore some balance to the force. Help us JJ Abrams you're our only hope and you have a lot of work to do to try to fix this mess.","true":true}