{"101487":184467,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is a serious disappointment. It's a shame it's going to make a lot of money and encourage the buffoons who made it to make more. It was a waste of my time and money. Gender Politics\\, all the villains are men (mostly white men) and the heroic roles are women. This movie suffers horribly from new age liberal PC identity politics. Frankly\\, it's stupid and offensive. Technically\\, there are more flaws than a 50's sci-fi flick (gravity bombs in space? loud explosions in a vacuum? no decompression when spacecraft are damaged? A girl with no training swinging a light saber around and NOT cutting off her own leg? Bad guy swinging his three-way light saber around and not cutting off his own arm? etc etc). Plot was disjointed and hard to follow and after 2 hours\\, you didn't care any more. Pacing was slow mostly and it just kept going on and on. The Drama was boring and inconsequential. The main characters were a disappointment in role and function. You expected Luke to rise up instead of actually being the disgruntled hermit he appeared to be. The Action scenes seemed to be inserted just to keep audience awake (didn't work). Too many scenes where it appeared all was lost just to have someone you hadn't seen in awhile pop in and save the day. The Disney Factor was highly evident here with cute critters and silly machines. Generally this movie is a confused mess suffering from a lack of identify and clear direction. I get it that the franchise is trying to go in a new direction (for lots of bad reasons) but Disney botched it badly (along with their sycophant critics who \\\"loved\\\" it and gave it high marks. The new direction may as well be the Donner Pass. Many will not want to go in that direction again after seeing this travesty.","true":true}