{"101487":132370,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If this was a stand alone movie and you had no knowledge of what the entire Star Wars universe has provided for story and plots then you would maybe if being generous give this an 8\/10. But if you take into consideration the entire universe of Star Wars this movie has ultimately failed for a number of reasons.\\n\\n***WARNING POTENTIAL SPOILERS AHEAD***\\n\\n1.a) The plot and story for this is just extremely under developed. It feels like a list was provided on things Disney needs in the movie to stick to a Disney image and to sell merchandise to anything that can move. Examples being... give enough screen time to a bunch of characters so that we can sell multiple costumes and items from a large group of characters\\, have some cute droid\\, have some cute animal or two and don't really do anything dark or evil because we want the children to be hooked on the good guy thing. \\n\\n 1.b) Regarding the story they spent far too much time with side characters that ultimately what little character development they did adds nothing to the overall character or story. Instead of providing a way to develop key characters and add to the overall plot they basically just gave you a run down and at the end you are left feeling it was a waste of time. \\n\\n2. They did not develop or use Luke or Snoke to the level that they should have. Both characters are highly underdeveloped and underutilized. The Force Awakens built up Snoke\\, built up meeting Luke again after all those years with questions about how he has developed\\, what he has learned and what is he doing on that island. Not to mention Lukes take on the force with the original jedi temple. They for the most part do absolutely nothing with these great characters and interesting plot points. Snoke is supposed to potentially be this ultimate evil Sith Lord that has somehow survived and came about but is just a complete nothing for a villain. This sith lord was treated like a storm trooper basically\\, generic bad guy that might actually do something but is totally worthless in the end. They don't even give Luck who in the star wars universe is supposed to be one of the most powerful jedi ever a chance to really display what the force can do. \\n\\n3. Finally after reaching the end of the movie all I can say is that it leaves the next movie in a bad spot where I personally do not see any way I will be excited to see. They might as well call the next movie saving private kylo ren\/ Ben Solo because they have set up the next movie with such a generic and boring plot that whoever the writers are have a massive hole they have to dig out of to make the FINAL movie of the Star Wars Skywalker Saga to a grand ending","true":true}