{"101487":121391,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First review I have ever written on here. Btw it says a lot that this movie bothered me so much I decided to write my first review. Long story short this was a very \\\"meh\\\" movie and as a star wars film it was terrible. Plot points from TFA are either thrown out the window or a huge letdown. Physics and logic are thrown aside when it is convenient to the plot. Scenes that carry weight are ruined by jokes literally seconds after. I remember thinking at one point\\, \\\"didn't a bunch of people just die? and now were cracking jokes??\\\". A whole 30 minute segment of the movie is pointless and has no bearing on the plot whatsoever. We get a new character with a sjw agenda shoved down our throats. I didn't go see star wars to watch a PETA commercial. In a nutshell there is one scene that defines this whole movie\\, * Caution Spoilers*. The mini death star cannon is getting ready to fire on the base and let the first order in killing everyone inside. Finn in an effort to destroy it decides to sacrifice himself. Right before he is about to independence day the laser\\, Rose rams his ship from the side stopping him. We then see Rose laying their dying and Finn asks her what was she thinking. And here it is folks\\, she literally says\\,.\\\"Finn we need to remember\\, what makes us different from them is that we don't destroy what we hate\\, but save what we love\\\" Literally seconds later the cannon fires blowing the resistance base open\\, killing tons of people inside and now letting the first order in. Seriously?? Good job rose\\, you saved finn and in doing so caused hundreds of casualties that could have been prevented. Oh yeah don't forget space leia who fly's around at will and blows doors open with her mind.","true":true}