{"101487":146271,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wanted to like the movie so much that it took me a whole day to realize how bad of a starwars movie this was. If you thought the Force Awakens had too many parallels to a new hope\\, don't expect anything new here. This film continued the trend by paralleling Empire Strikes back. The empire trying to wipe out the ragtag rebels\\, Rey goes off to train with a strange hermit master\\, leaves against the masters wishes to confront the dark lord. Rian just doubled down on the issues that eppisode VII had. Eppisode 8 makes all the same mistakes as 7 except it throws out any respect for the original trillogy at the same time. So not only does it ape the plot\\, it insults the entire trillogy as it does it. The decisions that were made regarding lukes character don't fit at all and seem like they were made to put luke down and make the new characters look better. That almost seems like the theme of this trillogy\\, hijack the plot of the old movies and insult them while you do it. The state of the world after this film: The republic has fallen\\, the old heroes are dead\\, a dark sith lord commands a massive army that wants to rule the galaxy with an iron fist\\, and the galaxies only hope is a young jedi from a backwater planet and some ragtag rebels..... Sound familiar? It even makes the strougles of the original trillogy feel like it was all for naught\\, since we are right back where we started. Why do people say this movie makes bold decisions? The film spends so much time trying to kill the legacy of the original trillogy that we still know next to nothing about our new characters. This film is objectively bad.","true":true}