{"101487":182726,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is probably my favorite Star Wars film\\, simply because it makes the boldest moves and I admire it for that. I understand why many\\, particularly some of the die hards are mad. This movie does make some choices that some could interpret as messing with the established universe from before. I really like the direction they went with this film with most of their characters. There are some problems I have and I will get to those in a bit. First\\, I will say what I did like. I liked what they did with Luke here. This movie makes his character much more interesting. He is not mister flawless and I like that. I also really like the development of the relationship of Kylo and Rey. I think it is a fascinating dynamic that is arising here. From here on I will discuss spoilers so\\, SPOILER ALERT. I like how they handled Snoke. Many were lead to believe that he was going to be this trilogies palpatine. However\\, I am glad they killed him off. It makes for a nice red herring in the story. We expect him to be the big bad\\, but really its Kylo\\, who I feel is more interesting as a villain because there is more to him than just being evil. I like also the reveal of Rey's parents being nobody. It gets rid of the idea that you have to be part of some kind of noble blood to have any real value in this universe. Another thing I loved in this movie was the humor. A big problem I have had with other Star Wars movies is they sometimes take themselves too seriously. Now onto things I didn't like. I really did not like Rose. Her character was very annoying and had some of the worst lines in the movie. I wish they would have utilized Finn differently and just got rid of Rose. She was unbearable. I hated that she stopped Finn. That would have been a great way to finish his character arc. Leia Poppins was also rather silly. Overall\\, there is so much really good that it overshadows the negatives that I have so I still think it is probably my favorite star wars film","true":true}