{"101487":174929,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi and Rian Johnson apparently take risks in Episode 8. This isn't really true as he simple does the opposite of what you expect. The Force Awakens was such a layup for this movie that most die-hard fans as well as casual fans are found dumbfounded at the lack of effort in storytelling and purpose. Example 1 of this is the entire side story with Finn and Rose. It is practically irrelevant to the saga other than to allow Finn to confront Phasma for less than 2 minutes and to set up the obvious notion that hope is in the galaxy at the end of the movie. Another huge problem with this movie is focus. There are wayyyyy too many jokes that don't land (for most viewers) and more importantly ruin the direction of nearly every scene in the movie. Leia using the force is so out of expectation in a bad way that it's hard to take it seriously. It could have been done so much better and more emotional taking into account Carrie's death that it is almost insulting. The good parts of this movie are the fight scene with Kylo and Rey against Snoke's guards and Yoda's force ghost. Luke's use of a force entity at the end 1: doesn't have any consequence if he was not even there because he dies in the end anyway and would have stalled for the same amount of time 2: is most likely a set up for the narrative reality for it to be plausible that Snoke can come back because he was doing the same thing when he died 3: keeps going and without direction. A fitting end for a movie that had this same problem throughout. The redeeming quality about this film is that it is so anticipated that fans are just glad to see another Star Wars movie and that is what is driving sales. This will be confirmed when the next anthology film\\, Solo\\, does par or below expectations. \\n\\nJM","true":true}