{"101487":175222,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is a movie where you have a 40 year franchise that cost over 4 billion dollars to obtain and burn it down. J.J. Abrams set up The Force Awakens as the foundation to be continued onto the next two films. An easy task for whoever helmed this project and build upon it. It was supposed to leave viewers anticipating what challenges these new characters will have to face while bringing closure to the original cast. That was not the case with this movie. Rian Johnson (with Kathleen Kennedys influence) took everything Lucas and Abrams built and demolished it to the point where there is no reason for the viewer to see any Star Wars movie in the near future. This movie is going to impact the Han solo movie and Episode 9 and that is a fact.\\n\\nSo to make it clear to those are unable to comprehend what I mean. I will describe two analogies.\\nDo you remember as a kid coming home from school and seeing this dimwit little boy smashing all your stuff? Then you realize that your mother allowed him to do it because she's busy bullshitting with her friend. \\nHow about that female relative that after you worked so hard decorating your house for the holidays decides it upon herself to redecorate it without your consent?\\nThat's Rian Johnson...\\nOn top of all this they went out to deliberately humiliate every male character in this movie. It's like they didn't learn the lesson of what happened with Ghostbusters. I wouldn't be surprised if they took pointers from Paul Feig when writing this movie. Every scene that was built up as a serious moment began or ended with a joke. Characters were introduced and killed without the audience knowing who they are. We have characters going to places and returning with no main goal but to eat up screen time. There are story plots not explained and rewritten for brainless millennial's who are raised to not question or have an opinion.\\n\\nThese are the four easiest questions that were not answered in The Last Jedi.\\n1. Let's begin with who was Lor San Tekka and how did Kylo Ren know him? How did he wind aquire the piece of the map Leia was looking for to find Luke? \\n2. Who was Snoke and how did he become Supreme Leader of the first order?\\n3. Who were the Knights of Ren and what happened to them?\\n4. How did Maz Kanada obtain Lukes lightsaber that was lost in The Empire Strikes Back?\\n\\nSpoilers- Reasons I didn't like the last Jedi and what I would have done different\\n1. General Hux returns as the center of all the first orders jokes. The way they treat this character is so embarrassing to watch that they were better off leaving him dead along with Captain Phasma who also was totally wasted in this movie. \\n2. Poe's arc in this movie made him out to be an asshole. His telephone joke in the beginning of the movie with Hux was nauseating. His disregard for General Leia and Holdo orders was also unlike this character. It's like the message they wanted to send was about men not being able to follow a women in charge. As Poe disregards general Leias order the bombers also do the same exact thing. What kind of general is this woman if everyone decides to ignore her? Did I forget to mention that he gets slapped by Leia for this just so that a few seconds later allow him to do it again. She later pulls out a gun at him and stuns him. What the fuck is going on? Then he contacts Maz Kanada who he never met in the force awakens. All of this shit should be removed.\\n3. The Finn and Rose Arc should be removed. They should have had their characters stay on the ship the whole time with Finn waking up right before they head to Crait.\\n4. Admiral Ackbars death off screne was another disrespect to the character. This was orchestrated to have Leia become Admiral and her Lesbian lover Holdo as General who no one on the ship knew she existed.\\n5. Let's talk about Luke Skywalker and him throwing the lightsaber that belonged to the father he redeemed over his shoulder. This scene infuriated me to the core because the people who thought about this and wrote it are fucking assholes. It wouldn't bother me as much if there was some sort of dialog from Luke asking Rey how she got the lightsaber. Then Rey could have shown him a hologram of Leia explaining why she decided not to go herself and sent Rey instead. We next have Chewy knock down Luke's door and needs help from Rey to translate. Wait\\, What? Luke knows Chewy. Then Luke asks\\, \\\"Where's Han\\\"? Where's Han? That's your best friend you should have known by the force he died just like Leia did. This is another one of those instances where they make the male character into an idiot. Then they have him sucking Alien manatee milk to embarrass this character even more. All aliens should have been removed from this island. If Luke wanted fish he can use the force to get fish. If he wanted water we could have seen him gather it when it rained. We then have Yoda show up and burn down the tree where Luke stored his Jedi books. This time we have Yoda preventing Luke in seeing that he got bested by a girl\\, because at the end she winds up having the books and the last laugh on Luke. Then there's the scene at the end where he talks to Leia letting her know that he means business and is going to kill everyone out there. The reason this being true is because he gives her no plan of escape if he fails. Luke went out to meet the Kylo Ren and first order and crush them all using the force. Then I would have except Luke's death at this point. But he physically had to be there and not a fucking hologram which didn't make sense on why Kylo Ren was stupid enough not to sense it. \\n6. Rey and Kylo Ren have no character growth or Arc in this movie. Whoever wrote these two characters had no idea what to do with them. It's like they forgot they were force users and decided to fight a bunch of experienced guards physically. This fight went for far too long and it served no point. Kylo could have force choked all of them or have them all kill themselves with their own weapons.\\n\\nSo that's as much as I can muster at the moment. They really tried to insult my intelligence with this movie and failed. As for those who liked the movie and needed to see it multiple times because your brain was telling one thing and denial was telling you another need mental help. But I leave you with why this shitty movie deserves the lowest score possible and millions of dollars lost. Star Wars is finally over. A nice finale with nothing left to look forward to.","true":true}