{"101487":147463,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I will never give starwars lower than a 80. Just because it’s the most amazing universe and it’s my childhood in a nutshell even attack of the clones. That being said I’ll rate this a weak 84. I have a couple likes and dislikes I’d like to speak on....(SPOILERS) Alright likes.\\, Yoda and Luke and a couple unique lightsaber moves. That’s really it ...but ether way Luke and yoda were enough for me you no. No matter how bad the movie could have been if Luke and yoda are badass than I’ll immediately think to my childhood and I think that’s the ultimate goal of starwars. Also Luke and Kylo rens flashback was cool. I also thought Poe’s character did a nice job and also leis super Jedi pull move. Dislikes...corny at times main characters like Rey fynn and others were weak in my opinion. The biggest upset of mine is Rian Johnson didn’t get creative. Think about it everyone was coming up with these theory’s and not a single one was actually answered. I don’t believe it but if Rey’s parents are actually just piece of shit junkies. That is fucking lame. I hope the next one they actually say something legit cause no way that’s the truth. Alright Kylo looked like a pussy as usual other than his cool lightsaber move. On a side note there really isn’t gunna be spoilers like the force awakens. (Han solo dies) the only spoilers you could say are yoda is in it and Luke becomes the force so there’s not much. Rian didn’t take much chance in the movie maybe the next one will. ","true":true}