{"101487":121675,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"For better or worse (usually the former)\\, this movie felt like everything Star Wars ought to be. Exhilarating space battles? Check. Regular nostalgic nods to original trilogy? Check. Routinely making the familiar strange and what should be strange intimately familiar? Of course. The film wasn't without its share of issues - inconsistent pacing being the most evident - but it should go down as one of the best and most important chapters in the Star Wars universe.\\n\\nThe movie taps into a much bigger picture than a simple exercise plot resolution some die-hard yearn for\\, dealing with the waning hope of the rebellion and the larger concept of failure on a grand scale. Mark Hamill's performance is excellent\\, and he makes it abundantly clear from his opening dialogue what moviegoers should not expect from his character. The movie makes a habit of flipping expectations\\, making fan theories surrounding popular plot questions null and void (this is a good thing).\\n\\nThe rebellion's side quest featuring Finn and Rose is the film's weakest point\\, but seems to be demonstrating the lesson Rey is learning elsewhere - that failure is an important teacher on the path to progress. Characters like Finn and Poe (and even Luke) do not come in and save the day in a traditional sense in this movie\\, making for an unexpected twist in the traditional hero arc. The dialogue is generally tight throughout\\, and includes a few more of those cutesy\\, modern Key-and-Peele bits of humor first seen in The Force Awakens.\\n\\nThe Last Jedi is a solid entry into the Star Wars canon; a film that excites new and old fans of the series alike while leaving the future of the franchise more wide open to new possibilities than it has ever been.","true":true}