{"101487":169384,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS AHEAD!!!!!\\n\\nLuke deserved better\\n\\nThe Last Jedi illogically destroys existing Star Wars lore\\, and I'm deeply disappointed by the route Rian Johnson went with honestly every single character.  The movie is filled with plot holes\\, unnecessary sub plots\\, and a complete disregard for established characters.  If he wanted to start a new star wars storyline\\, he didn't have to spit on the old storylines to do it.\\n\\nJUST A FEW of my grievances with the movie:\\n-Luke's dead.  The buildup for the question ' Who is Luke Skywalker' is gone\\n-Snoke's dead.  The buildup for his character is gone\\n-Admiral Ackbar is dead!!!  Not even a nod of respect to his character as he's killed in the explosion that nearly killed Leia\\n-No reference to the Knights of Ren.  The buildup for their characters is gone\\n-2 minutes of Luke training Rey.  The buildup seeing them train together is gone\\n-Rey's parents are junkers\/nobodies.  The buildup of her being born from the force is gone\\n-Leia surviving a giant explosion and flying through space\\n-Phasma is cool...for 30 seconds\\n-Forced romance between Finn and Rose.  Rose's character is unnecessary\\n-Benicio Del Toro character is unnecessary and difficult to understand\\n-Forced message of animal cruelty on the casino planet\\, Canto Bight\\n-Luke milking an alien\\n-Porgs\\n\\nI don't know who will be in charge of directing episode 9\\, but they have an absolute mess on their hands coming from the little lore that's left standing at the end of The Last Jedi.","true":true}