{"101487":115755,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Director Rian Johnson mines gold once more with his second bigger budget piece as he arrives following the widespread success of his 2012 sci-fi opus \\\"Looper\\\" and several standout episodes of AMC's \\\"Breaking Bad\\\". Unsurprisingly\\, he sheds new light on a universe that spans comics\\, books and video games and does so with childlike passion and reverence for what came before. So\\, how does he pull off this Herculean task? Throughout Johnson's filmography\\, it soon becomes clear that he is an actor's director and everyone from bit parts to cameos to major star appearances have great showcases for their talents. Carrie Fisher is luminous in her final onscreen appearance and big bad Kylo Ren (Adam Driver) strikes an interesting duality in his performance as a conflicted Sith Lord who struggles with his place in the legacy of his forebears Darth Vader and Darth Sidious. The most striking element of this film was the tricky balancing act of lighthearted humor and more serious tones that accent the proceedings. No Star Wars film would be complete without witty banter among our heroes but when the going gets tough (and it does) we see our heroes rise up to meet their destinies. \\\"The Last Jedi\\\" should go down in history as the best directed SW film of all time. With striking cinematography that's graceful and poetic\\, Johnson has an impeccable understanding of pace and emotional character beats. If 2015's \\\"The Force Awakens\\\" failed to take the universe in any new directions\\, Disney chief Kathleen Kennedy and Johnson took note of JJ Abrams's film and made sure to pave a newer canvas. Here's hoping that returning director-for-hire Abrams will build upon Johnson's movie and give old and new fans alike something to really sink their teeth into.","true":true}