{"101487":182760,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is quite possibly the worst sequel for a beloved franchise I've ever seen. Star wars is dead and Lucas is the only winner in this scenario. The Tomatometer is an absolute lie and is made by critics with inflated wallets due to the fact that they most likely have been paid by the people who made this film to give it a glowing review. Too bad that won't make these vultures money. Absolutely bad writing and direction\\, this is what happens when you change directors in the middle of nowhere for no reason. I don't know if Star Wars can even be salvaged anymore\\, the games are becoming trash\\, the movies are becoming trash\\, the shows are becoming trash. Did anyone expect anything different when Disney of all companies was the one who bought the rights to Star Wars?\\n\\nRIP Star Wars 1977 - 2018This is quite possibly the worst sequel for a beloved franchise I've ever seen. Star wars is dead and Lucas is the only winner in this scenario. The Tomatometer is an absolute lie and is made by critics with inflated wallets due to the fact that they most likely have been paid by the people who made this film to give it a glowing review. Too bad that won't make these vultures money. Absolutely bad writing and direction\\, this is what happens when you change directors in the middle of nowhere for no reason. I don't know if Star Wars can even be salvaged anymore\\, the games are becoming trash\\, the movies are becoming trash\\, the shows are becoming trash. Did anyone expect anything different when Disney of all companies was the one who bought the rights to Star Wars?\\n\\nRIP Star Wars 1977 - 2018","true":true}