{"101487":178230,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There are so many problems with this movie\\, other reviewers have covered many of them. There are a few things that haven't been mentioned - Now before I start I just want to say that I realize Science Fiction movies ask audiences to believe many things that don't really make sense - see flying the Death Star around the galaxy at light speed.  However this movie takes all of this to a whole other level and has major parts of the story that just do not make sense. Examples - On the island when Rey goes down in the Dark Side cave she learns nothing\\, nothing about her parents\\, nothing about facing her fears\\, she doesn't even need to be rescued by Luke and just walks out\\,  it is a total wasted scene. To make matters worse it didn't even feel like a Star Wars movie\\, it feels like a scene from a Harry Potter movie. Speaking of feeling like a different movie\\, all of a sudden right in the middle of the supposedly tense starship chase we end up going to a Casino in a James Bond movie. Then in the battle of Crate\\, what were the rebels doing by driving the mining cars at the Walkers? The cars are not armed so what exactly were they going to do? If it was just a suicide attack and they were going to crash into them then how did they all end up surviving and back in the cave? For a movie to be good the story has to at least make some sense and this mess simply does not.  \\nBottom Line - This is a terrible movie - Far worse than any other Star Wars movie including Phantom Menace. The only reason this movie will make money is because of the legacy of the past movies. In China where there is no large built in Star Wars fan base the movie was pulled from theaters after only a little over a week because of such low sales.....One star is generous -  Oh and I am not a Bot!!! Just a very disappointed guy that has been to every Star Wars opening since 1977.","true":true}