{"101487":147920,"Last Jedi":"Last Jedi","2017-12-15":"2019-12-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Joined Rotten Tomatoes just to give this piece of crap half a star.\\n\\nWhere do I begin? First of all I am not a toxic fan. I think most \\\"toxic fans\\\" actually really wanted to love this movie. I really liked TFA and Rouge One was definitely my favourite Star Wars of the Disneys. I would have liked nothing more than to leave the cinema feeling like I watched a movie as brilliant as TFA or Rouge One. I didn't. On Rotten Tomatoes\\, a 40% audience score reveals one of two things. Either A\\, the fans are nasty and want to throw a tantrum at something that was actually brilliant. Or B\\, the movie was terrible and disappointed the fans. I know what my money is on.\\n\\nDo not let the good critic score fool you! Because the critics. Do not. Understand. Star Wars. They may analyse it's direction\\, visual effects or cinematography (all of which I loved) but there is a Star Wars magic that was non-existent in this film. By Star Wars magic I mean anything that resembled a strong story or likeable characters. I was expecting as film that carried on the legacy of Lucas's films. This film took dump on them. Rian Johnson's writing was amateurish. The story was weak. Also\\, I'm going to have to say it... Jar Jar Binks had a bigger character arc than Rey. I personally loved Poe in TFA but he looked like a winey brat in this movie. Couldn't stand Holdo\\, Rose\\, or even Luke. Not even the people that like this film like the Canto Bight scenes. \\n\\nBut since I am trying to make this review as balanced as possible\\, I will tell you everything I liked about the film. The throne scene was good on first watch (however on second watch it was abysmally choreographed and a disgrace to all Star Wars fight scenes)\\, John Williams' score was fantastic as usual\\, Driver and Ridley acted very well. Umm\\, thats it?\\n\\n Rian Johnson was not the man for the job here. Heck\\, even the prequels are looking attractive now. I really wanted to love this film. I hated it\\, and I'm not alone. But\\, hey\\, why give the fans a good movie when our expectations have been averted?","true":true}