{"101487":167947,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So I've already seen this film two times and I'm about to go see it for a third. After walking out of the theater at 2:30am in the morning on opening night I was breathless and buzzing with energy. I don't think I can fully express myself in a single review\\, but in a nutshell: TLJ was the best Star Wars movie to date. I'm in love. It was so self-aware and intelligent in the way it presented its content\\, and I've never seen a Star Wars movie where characterization has been so nuanced and intimacy is displayed so poignantly. There is such love for the expanded canon\\, along with an understanding of literary archetypes. I'm so thankful to Rian Johnson--to the whole cast and crew--for making The Last Jedi the way that they did.\\n \\nThe movie was more mystical than I thought it would be\\, but in a way that referenced the greater canon. It was so FUNNY. I was not expecting to laugh that hard\\, and half the time I was struggling to contain my giggles. Mark Hamill's portrayal of Luke in this film was fantastic. His arc was so poignant in how it touches on where Luke came from and where characters go and adapt\/evolve over time. The final scene with Leia--especially in light of Carrie's passing--made it all the more touching. I was in tears\\, but in a good way.\\n\\nMost importantly of all\\, I want to say how thrilled I was at both the individual characterization of Rey and Kylo Ren\\, and the dynamic they have towards each other. I love how Rey how was so nuanced in her internal motivations. She retains her agency throughout the entire film while showing compassion for Kylo\\, and makes it very clear that the decisions she makes are HER decisions. She will not be beholden to anyone: not Luke\\, and not to Kylo. No matter how much she cares about either of them (and oh man\\, does she care about Kylo a lot). Adam Driver's depiction of Kylo Ren was amazing. He brought the forefront the internal conflict that the character has suffered. He's not a common villain and I love that.\\n\\nJust a really\\, really great film all around. I can't wait to see it again.","true":true}