{"101487":163497,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"Professional\\\" critics are lying to you.  This movie along with Episode 7\\, are second rate stories with characters that no one cares about.  They have flimsy repetitive plot lines (another BIG GUN!!) that fail to capture the spark that the original (nonCGI versions) had.  Episode 8: The last Jedi starts where the last POS left off\\, in a big mess.  Fans have waited 30+ years to see Luke and what they are given is a half crazed man that has plot \\\"twists\\\" that don't fit his character in the slightest. For a man that saw \\\"goodness\\\" in his villainous father\\, Luke seems quite to-the-sword for Kylo for no good explained reason.  Also the weak main characters have an all out duel with Snoke (who the hell is this guy) with very little training?? Come on! This move is made for morons who appreciate the flash of a bulb and would choose special effects over complexity.  Its sad that a wonderful story has been corrupted to this degree.  SW fans have convinced themselves this episode \\\"isn't too bad\\\" because they are accustomed to this following the Ep 1-3 CGI cartoons.  If you are a true SW fan then you will leave this movie feeling sadness. Sadness that Luke Skywalker was given such a weak character in this movie with such little true impact.  One questions why he would even have participated in this nonsense.  Save your money for something more clever.  If you want a movie where you care for the A\\, B and C level characters then I suggest Harry Potter. I would like to submit a title for the Episode 9: The Last Wookie.  The story has lots of zip\/zapping with paper thin characters all over the known and unknown universe\\, but spoiler Alert: Chewbacca Dies while trying to protect the last 3 idiot rebels that ran into another base with only one entrance\/exit. Sign me - Disappointed by the Dumbness","true":true}