{"101487":165551,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rion Johnson has killed the franchise. I'm a die-hard\\, 30 plus year fan\\, and it pains me to say it because there is light in this movie. However\\, the darkness has claimed it. I will not spoil this movie or the big twist\\, but the entire middle story that the audience is rooting for with Finn and Rose...... Essentially amounts to nothing. It goes nowhere and simply ends.  The 2.5hr run time is ambitious and while it could've succeeded in this\\, but with so much screen time that amounts to nothing it seems egotistical. They bring back an icon for no good reason except to undermine Luke's ability as a Master even more. The villain falls flat and disappoints after two years of build up. And Kylo continues to present himself as a childish man-baby who feels the galaxy is unfair to him. Also for a movie overflowing with death\\, it never misses an opportunity to poke fun at the plight of the characters for cheap laughs\\, and by proxy the audience. Rey is treated as both a heavy responsibility and yet at times as a inconvenience as well. It's a juxtaposition that is genuinely off putting at time. It's also tough for the movie to decide who it is interested in following. Of course the biggest reason why this movie sucks eggs is because of a choice they make with Luke. This movie was written by a man who\\, by all accounts\\, hates Luke Skywalker to his core. Here's a terrible Master who randomly contemplates murdering his students while they sleep. It is finally clear why Mark Hammel hated the script\\, because it was a movie written with the purpose of ruining the character.\\nAfter over 30 years of being a fan\\, Rian Johnson has finally done the impossible...... I officially don't want to watch episode 9.","true":true}