{"101487":197059,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Why not a fanatic\\, I have always been a Star Wars fan and was really looking forward to the Last Jedi. I avoided all spoilers and went to screening just a few days after it was released.\\n\\nUnfortunately\\, despite trying to remain positive throughout the viewing\\, ultimately I was left hugely disappointed. For me the movie was totally superficial. A good looking movie that  lacked any real soul or depth in either the story or the characters. \\n\\nThat was the real problem for me\\, Star Wars or any good movie has always been character driven for me. I feel a connection to the characteristics and become invested in their story. The Last Jedi had the opposite affect on me. Characters that I had been interested in like Rey\\, Finn and Poe and even long time favourites like Luke Skywalker came across as quite plastic and to be honest almost unlikeable. By halfway through the movie their story had little suspense because I no longer cared what happened to the characters.\\n\\nAfter watching the movie I was quite interested in others opinions and was quite surprised by the positive reviews that it received from critics. Especially reviews that praised it for it's originality and for taking chances. I know it tried to shock at different stages but it came across as being cheap and gimmicky rather than anything of real substance. In fact I wished that they had followed through with some of these scenes. They could have made some of these characters more compelling maybe even making Kylo Ren a formidable villain.\\n\\nOverall the movie was just disappointing or as some of my friends put it a 'lemon'. i do realise that half the viewing population loved the movie and to those people more power to you in fact I feel a bit jealous because I wished that I enjoyed it as well but I can't recommend this movie as anything more than a B movie time filler.","true":true}