{"101487":120986,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Final blow to the Generation X heroes we grew up with.  I have noticed a recent move to kill the great movie\/character francizes of the 80s (Predator\\, Aliens\\, Blade Runner\\, Marvel comics\\, Transformers\\, GI Joe and now Star Wars).  \\n    I was onboard and had excited to see where Disney was going to take the Star Wars saga\\, but feel disappointed and sad to see Disney continue to ruin such a great Sci-Fi story.  With the technology and advancement in special effects the movie studios have a wonderful opportunity to create vast and realistic worlds.  But  the whole process is now ruin by storylines\\, plot holes\\, and horrible\/forgettable characters.   Is there anyone out there that can write a decent plot and storyline anymore?  I don't care if the cinematography is beautiful if the story is shit. A good director\/Producer would spot these mistakes and correct them.  Do they not care about the fans?  Why can't movie makers take things to the next level like Christopher Nolan did with the Batman?\\n   The most depressing thing is these Disney Star Wars movies leave my children uninspired and confused to why Star Wars WAS a big deal in the first place.  This really short changes  the next generation of kids movie going experience from what I had as a kid. I remember as a kid going to the next Star Wars movie was more exciting than Christmas morning or my birthday!   Now I have to literally drag my kids to a movie that is all eye candy and characters they forget 10 minutes after the movie.  How bad is that!","true":true}