{"101487":141307,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I thought this movie was awful\\, and a slap in the face to Star Wars fans.\\n\\nI get it: Star Wars needs to \\\"move on\\\". But it can treat those characters that we knew and loved with dignity. This was the problem I had with the prequels. You know the setup of the noble Jedi Knights that we all dreamed about in the first meeting of Obi Wan and Luke in ANH? That romantic view of them? Dashed to pieces by the prequels.\\n\\nBut this was something worse. The courage\\, the strength of the characters\\, the hard work of the characters in the first trilogy is just wiped away by this movie.\\n\\nHan died as a loser\\, cut down by his son (in the last movie). We are given no time to mourn in that movie. We had more of an emotional investment in him being frozen in Carbonite. That's when I knew things were going badly in this new trilogy. \\n\\nIn this movie\\, Luke dies as a disgrace\\, because he tried to kill his nephew. Something he refused to do with his father. \\n\\nLeia basically made very few decisions in this movie and let the purple haired Admiral do all of her work. She sat this one out until the very end. That's a tragedy. I know Carrie Fisher was not in the greatest of health\\, but what little she is given to do is a real shame and mixed opportunity.\\n\\nThe new characters are a mixed bag. Kylo and Rey seem to work the best. Everyone else comes off poorly -- especially Poe. \\n\\nThe humor was just cringey. It completely degraded the serious situations that the characters were in. Were they afraid that this was going to turn into Batman V. Superman because of the \\\"darkness\\\"? Empire didn't worry about slapstick and it was fine. Same with ANH -- the humor arose naturally and wasn't forced.\\n\\nThe new villains lack any gravitas that the old guard had. Where is the menace and gravitas of Vader? Where is the Moff Tarkin? Where is the looming presence of a Palpatine?\\n\\nNowhere.\\n\\nThis will be the first SW movie I do not purchase for my home collection. I even bought all of the prequels (though they gather dust). Di$ney has certainly ruined Star Wars more than Lucas -- who\\, to be fair\\, at least _tried_ to do something with the prequels that was interesting\\, though very badly executed.\\n\\nI have a weird feeling that either this movie was graded \\\"on a curve\\\" by critics because\\, well\\, Star Wars is no cinematic masterpiece -- OR\\, they were trying to stay in good graces with the Empire (Disney) who now owns almost all franchises that people are going to want to read reviews for.\\n\\nThe Mouse has a monopoly on pop entertainment now. The repercussions of what that means will be felt for a long time.\\n\\nSkip this one. And probably the next. Whoever cut the trailer for this movie should really have been in charge of editing it as well. They did a phenomenal job and had me interested in watching. The actual product was way worse than the trailer.","true":true}