{"101487":129679,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am very disappointed in the Last Jedi. I hope Disney is paying attention because the negative reviews are crazy. I never thought I would say this but we need George Lucas back. I am not sure where to begin but this is not a good movie. I have been a huge Star wars fan since I was young and the elements of Star Wars have been taken away. Who was Snoke and how did he die so easily? Then you have Jedi Master Luke Skywalker who was this old hermit pouting about the Force and Jedi. Really? Would Master Yoda have ever done that? I don't think so. Then there is Rey's parents\\, oh they are nobody. Nice. The Resistance plays cat and mouse chase with the First Order and spends an enormous amount of time wasted with that. Laura Dern's character was stupid and acting was terrible. What was the last movie she did anyway\\, Jurrasic Park? Then the casino planet story was stupid and made no sense. Finn and Rose's strange story and relationship was weird too. Leia flying through space\\, laughed at that scene. To finish it off\\, Luke never actually leaves Anch-To but uses the force to cause a diversion for the Resistance. No good lightsaber battles. What happened to Jedi Master Luke Skywalker in an epic duel to the death? Didnt happen. Only to kill off Luke Skywalker at the end. Doesn't get much worse than that. This movie makes the prequels look good. This is officially my least favorite Star Wars movie. Disney better rethink Rian Johnson for their new trilogy. J.J. Abrams has a lot of damage control for Episode 9. I wish him luck.","true":true}