{"101487":168820,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So now that I've seen the movie....... I want to firstly say I AM NOT A ROBOT..... I hated it. It is NOT a SW Movie at all. To think that this Rain Johnson has destroyed Luke and Leia in this way is gutting. I tried hard to like it\\, I even thought going again would change my mind\\, but it did not....... Throwing favourite SW Characters into tiny back roles does NOT make a Star Wars.  This is even lower rated IMO than The Holiday Special. I have grown up with Star Wars all my life and I have even grown to love TPM and AOTC\\, why\\, because they gave more to a story than this feeble effort. To think the Galaxy is now run by an angry ginger man with a chip on his shoulder and an angry teen who is supposed to be Supreme Leader is laughable to say the least. Calling people Haters because they don't like a movie you apparently like doesn't make it so. The movie is good\\, but it is NOT SW. Its actually embarrassing to think this is now part of such a Massive Legacy is disappointing at least. This movie is supposed to be the building to a crescendo in Episode IX.  There are just way too many flaws to over look in the apparent story line. I NEVER thought that after the Brilliance of Rogue One\\, they were on a franchise roll.......This is a slap in the face to the work JJ Abrams did in TFA. They should have found a director who actually knows SOMETHING about SW first..... This movie is so bad\\, I thought it was that James Franco Movie about the worst movie ever made....... I am NOT a Robot\\, I'm just an incredibly disappointed SW fan. I just wish this had never been made. They should have left it at ROTJ if this is what garbage they can come up with...  \\nAnd if ANYTHING has come out of this.....its that CRITICS aren't always right......","true":true}