{"101487":105074,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a huge star wars fan I found the last jedi truly satisfying. The way Rian Johnson shows Kylo Rena transformation from a whiny wanna be vader in episode to a now badass\\, and powerful sith shows us a somewhat similar but also different  representation of anakin sky walkers transformation from episodes 2-3. The movie is action packed and keeps viewers on the ends of their seats for a majority of the film. Although the start is boring after that first third shit really starts to heat up. There are many wtf moments throughout the film and Johnson created some moments star wars fans truly didn't think would happen so soon. I must admit however that there is one part of the film that could've been done better. I think the Finn and Rose storyline was a waste of time and the 20minutes of the film could've been spent with something better\\, Johnson most used this to introduce the new character Rose but I mostly found her annoying. For me the scene on Crait when Finn is going to sacrifice himself to save the resistance was going to be a scene that showed us how far the resistance has come and how much it means to Finn to defeat the First Order\\, however Rose saved him and for me this ruined it. However it did set up Luke giving himself for the resistance and the epic standoff between Kylo and Luke which all fans had been waiting for since episode 7.  Kylo killing Snoke and Luke's death shows us it will be a showdown of Kylo and Rey in the final episode of the trilogy with Kylo looking to destroy the resistance and make the first order the rulers of the galaxy and Rey looking to defend her new family with the hope of turning Kylo back to the light side.","true":true}