{"101487":147230,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I went in ready to be entertained\\, ready to love it. Unfortunately it was truly terrible. I would rather watch the Prequels they at least have some entertainment value. \\nNothing about this movie makes any sense\\, it is poorly written with huge plot holes\\, the characters are completely flat and do not develop at all. \\nThe opening sequence the Resistance (What's wrong with Rebels they have the same logo?) is trying to escape a planet. Po seems to be commanding everyone so there appears yet again no structure in their military nor chain of command. This world is not lived in it comes across as poorly devised. \\nIn doing so they just manage to scrape out before the base is destroyed. The resistance led by Po the pilot who can take on anything no problem by himself (He is like a man with cheat codes) takes on a feared dreadnought or whatever it's called. The bombers (not Y Wings or B Wings) attack it at what can be only described as the speed a small child's electric car moves when its running on empty. The bay doors open and no one gets sucked out? Ok maybe forgivable but the whole wing is destroyed with one shot as they blow up into each other.... Nearly every pilot other than Po is a female unless they're dying in which case it switches to some old guys.... \\nThe bombing sequence is completely cringe worthy why do they need 100s of bombs which look nothing like the ones in the rest of the Star Wars franchise to destroy one ship. How is it the First Order at a power level beyond the first one? They only just appeared and somehow they have turned the situation around? \\nThey run away from the fight Po gets scolded and I'm wondering where we're going. The Order tracks them and then starts the \\\"run\\\"\\nLeia gets super powers and floats in space. Admiral Akbar is killed and has had no mention other than he was killed. Where is the rest of the rebel fleet? The cruiser they're on seems to change shape so that Kylo Ren can fly through it to destroy the flight deck..... Everyone gets killed and I'm wondering where the damn tunnel appeared from. \\nVice Admiral Hordo becomes what seems as a villain causing Po to make his own plans when she won't give him hers nor will she acknowledge that she has one and treats him as an idiot.  \\nQueue Flinn trying to escape and getting captured by Rose a random person in a corridor looking after escape pods because people are trying to escape and her sister couldn't. \\nFrom this point she becomes a main character..... WHO IS SHE? She also seemingly has infinite knowledge of things and can also pilot just about anything as well as ride dog things. \\nPo sends them to get a code breaker to destroy the tracking device on the only ship that has one but why didn't the rest of the fleet just scatter if this was the case. Later on in the movie everything is destroyed when the rest could've gotten help or something but they can't do that because they'd get tracked.... Whatever\\nThey go to a Casino planet to find a code breaker and meet Benicio Del Toro in a prison where they escape from and ignore the obvious code breaker who turns out to be a bad guy with no redemption which is a huge disappointment. \\nRose then spends the rest of the time on the planet promoting veganism and anti-capitalism\\, it was unbelievably misplaced in the Star Wars universe. The Code breaker points out eventually that the weapons makers supplied both sides. Where did these people come from? Why would they buy X-Wings and Tie Fighters from the same people? The distinct differences now make no sense. \\nBack at the fleet the plan fails and they're betrayed by the codebreaker. For some reason they want to evacuate to a nearby planet on \\\"Cloaked\\\" small ships (Anyone else remember 'no ship that small has a cloaking device'). \\nPo realises Hordo had a plan which she told to no one\\, Leia wakes up and shoots po prior to this and everything Po has been doing and the audience has been watching is rendered as pointless. \\nThe planet itself is completely stupid\\, one entrance? Felt like a knockoff of Lord of the Rings the Two Towers\\, anyway at this point I had gotten completely bored and was hoping it would all end. \\nI haven't even mentioned Luke and Rey. That's not my Luke is the comment made by Mark Hamill\\, he wouldn't run away\\, he'd fight against injustice. He never gives up that's his quality\\, this makes no sense. Paraphrasing but essentially Mark Hamill wasn't happy with it. \\nThe movie also makes Han Solo's death pointless why? Because Kylo Ren didn't transition to full evil apparently. It was purely just to kill off the older characters which seems to be the theme of the movies. Out with the old and in with the new. \\nLuke is also one note but the only interesting bit in the whole movie is when Ren goes straight to the dark side without even trying to resist it. I was hoping she was going to turn out to be pure evil at this point as the rest of the movie had been pretty boring but no she seemingly makes no improvement learns nothing and already learnt everything. She eventually goes to the dark place and learns nothings. She is afraid of nothing\\, has all the knowledge of a Jedi\\, has the Millennium Falcon and has no weakness. Everyone has a limit everyone has weaknesses but apparently she doesn't. This is what makes feminist movies pointless\\, they're incredibly poor. They show no femininity and no leadership. They display a woman who has male qualities and expects the audience to believe it. Maybe I'm wrong but generally no one is allowed to express an opinion like this as you're a bunch of expletives. I can't believe this movie. \\nYoda shows up and destroys a tree and books but the books are on the millennium flacon. Luke seems like an idiot and a hermit. Completely one note as well. \\nThe character development is in Po who learns to run away..... great. After running away all movie he runs away some more from an enemy that has no explanation as to why they are still so powerful.\\nRose has some strange romance kiss with Flinn that Rey sees ..... Don't know why this is in the movie? \\nThe amount of bad puns in the whole movie is ridiculous\\, they're continuous\\, it's not Guardians of the Galaxy for crying out loud. It's Star Wars.... I wanted to see Star Wars\\, Rogue One was good that had a female lead (even though she was a bit overly hostile to people I put it down to being bitter). I mean look at the latest Wonder Woman that didn't have stupid feminist nonsense and that had a strong female lead. \\nOh and the fleet could've split up and flown in different directions allowing people to survive and ships to survive but instead they're reduced to 20 people or whatever it is. \\nStop the Puns already. \\nI never want to see this stupid movie again it's almost as bad as the Ending of Mass Effect 3 except after that debacle I'm not nearly as upset as I could've been. It also means the Force Awakens is all the worse for the existence of this movie. Lucas shouldn't have sold out\\, or at least retained some say.","true":true}