{"101487":178224,"Last Jedi":"Last Jedi","2017-12-15":"2019-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There are so many issues with this movie. I could forgive most the plot inconsistencies this movie has if Rian didn't completely destroy Luke's character! Luke Skywalker is a hero archetype and even if he wasn't he is a character with an arc of progression. He would never have even on reflex thought to murder his nephew based on what he has been through with his far more evil father. In order for characters to change this drastically from their established arc they have to go through a tremendous amount of trauma. Luke did not go through horrific trauma nor does it show him having a changed perspectives on life so his actions are completely out of character. I have NEVER seen a worse example of illogical character assination. \\n\\nThis movie ignores previously established rules on how important training and struggle is. It ignores the lore it even ignores all the set up from the Force Awakens. There are numerous objectively bad plot\\, writing\\, and continuity errors. This movie is absolute garbage and should be retconned from canon. Star Wars is a modern western mythology with a hero story. This movie destroys that mythology. Star Wars was seen as something good that all people regardless of politics believed to be an example of good. That has now been subverted to tell a politically motivated message without nuance.\\n\\nThis movie has harmed the fundamental core of modern society and it is the greatest shame. This could legitimately be the precursor to a civil war. When you destroy the fibers of society that hold it together that hold the different types of people together then society devolves into conflict. Star Wars was a cultural fiber that helped to hold Americans of different beliefs together and united them under a common good. You destroyed that. The consequences for doing this will be seen over the next decades.","true":true}