{"101487":121325,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First of all\\, let me say that I am not a bot or whiny \\\"fanboy\\\" and I take offense to those insinuating that people disappointed by this movie fall into one of those categories.  I'm a real girl who has loved these movies since I was 4 and I cannot believe how 2.5 hours just ruined my beloved saga of a galaxy far\\, far away.\\n\\nMy family of 5 viewed this movie with 2 other families with kids.  Between us there were 6 adults and 8 children ranging in age from 5 yrs old to 14 yrs old.  The only one amongst my party who enjoyed this movie was the 5 yr-old and that is because he entertained himself with his Luke and Kylo Ren action figures while he watched.  I think there was more action going on there than on the screen.\\n\\nThe rest of my party rated this movie ok at best and terrible at worst.  The adults did not appreciate the blatant SJW dialogue shoved down our throats.  This at times seemed to be more of a propaganda piece for a radical leftist political party that just takes place in space than an actual movie.  The preaching was all over the place and focused on several topics: men are dumb\\, rich people are evill\\, animal cruelty\\, socioeconomic classes and capitalism is unfair....blah\\, blah.\\n\\nSPOILER ALERT\\nAnyone who was hoping to see who Rey came from and see her train in the arts of the Jedi will be sorely disappointed.  Her parents were nobodies and her training lasts all of about 10 minutes.  Yet\\, she seems to be a master Jedi already.  How?  No clue.\\n\\nSnoke...who is he and how did he rise to be so powerful?  Don't know and it doesn't matter now because he is dead.  Hoping to see a fight between Finn and Phasma?  Don't hold your breath.  This lasts about 30 seconds and she dies almost as lame a death as Boba Fett.  \\n\\nPoe is treated as a prop to showcase female power.  He is strung along by the new admiral Holdo (Laura Dern) instead of being told the plan all along.  I was expecting to see Leia's demise in this episode...makes since since she passed in real life.  Instead we are treated to seeing Leia being blown to bits only to fly through space like a hybrid of Superman and Mary Poppins.  It was at this point that all of the adults I was sitting near looked at each other like \\\"you've got to be kidding me'.  \\n\\nThe humor was wrong for Star Wars.  The prank holding call in the beginning between Poe and Hux was only found to be amusing to the elementary school aged crowd.  It fell flat with everyone I was this movie with as did the rest of the intended humor.  \\n\\nThe Force Awakens leaves us with Rey finding Luke and we were left to believe that the next movie would include her training.  When the title \\\"The Last Jedi\\\" was revealed for this episode\\, I believed even more that Luke was passing his knowledge of the Force and the Jedi on to her.  What do we get instead?  Luke is a hermit old crank who drinks sea cow milk and tried to kill his nephew in his sleep.  Not the Luke I once knew.  Then\\, when you think you will be treated to an epic showdown between uncle and nephew\\, you see Luke astral projecting himself and then dying from the exhaustion.  \\n\\nI was hoping to see more development of Kylo Ren too.  WIth Snoke gone\\, he takes over the First Order\\, but I didn't find him to be a believable villian. I was disappointed with this as that is what makes SW movies so epic...an effectively scary villian.  I didn't see that In Kylo Ren\\, instead he seems like a petulant teen.  Tood bad because I think there is great potential there and this actor is doing the best he can with the material he is given.\\n\\nInstead of seeing Rey and Finn progress\\, we see Finn paired with the most useless character of all SW movies\\, Rose.  Even Jar Jar Binks served more of a purpose than her.  She is a mechanic to goes on a pointless jaunt to a casino planet with Finn where they accomplish nothing.  The only thing she seemed to bring was a checkmark in a diverse cast and a platform to lecture us on SJW issues.  I can tell you this\\, if she is in the next installment\\, I won't even rent it from Redbox.  She is a poorly acted\\, useless character and a lot of screen time was devoted to her instead of progressing the more important characters.\\n\\nAll in all\\, this movie fell very flat with 90% of the people I know who have seen it.  It had all the elements of a very bad movie...pointless scenes\\, poor pacing\\, bad acting\\, corny humor\\, one-dimensional new characters and bad dialogue.  Add that with a preachy leftist agenda and you have The Last Jedi.  Not a Star Wars movie in any way\\, seems more like a parody or Spaceballs 2.","true":true}