{"101487":198304,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars film ever. Do not spend money to see this garbage. It completely destroys Luke Skywalker's character. Rian Johnson likely did not watch any of the previous Star Wars films as he clearly doesn't understand how the force works or what the Jedi represent. Kathleen Kennedy is equally terrible in that she is using the movie to propagate her feminist social justice warrior agenda. \\n\\nI have been a die-hard Star Wars fan my entire life. This movie completely destroys Star Wars as it completely invalidates everything that came before it (including Star Wars the Force Awakens). Here is a quick summary of just a few things wrong with this movie that I can think of off the top of my head (Spoilers):\\n - The resistance just destroyed Star Killer base in the force awakens yet in this movie (which takes place literally within the next hour)\\, the resistance is reduced to a handful of 'Rebel' ships by the over-powering first order. The resistance was formed out of the galactic republic\\, you would think they would have at least as many resources as the first order.\\n - A single resistance x-wing takes out an entire enemy star destroyer \\n - Bombs are dropped in a zero-gravity environment\\n - Poor jokes throughout the movie (nobody laughed)\\n - MaREY Sue.... Rey continues to over-power with zero training\\n - MaREY Sue beating luke skywalker in a light sabre fight\\n - Finn and Rose go on a 45-min sub-plot that adds nothing\\n - The entire plot revolves around the first order chasing resistance ships running out of fuel\\, yet the first order cannot light speed ahead and out flank the resistance ships\\n - The resistance admiral Holdo doesn't tell anyone her plan (what a fantastic leader)\\n - Poe leads a mutiny against the resistance leadership because admiral Holdo didn't tell anyone what her plan was\\n - Merry Poppins Leia literally flying through the vacuum of space. The entire theater cringed while this occurred. As Han Solo would say: \\\"That's not how the force works\\\"\\n - Luke Skywalker milking an alien titty for blue milk\\n - Snoke dying without any explanation as to his back story\\n - Snoke going out like a bitch\\n - Force Skype calling people across the galaxy is now a thing\\n - Using light speed to pilot ships into capital ships and destroy them is now possible. This completely invalidates all previous space battles.\\n - Shirtless Kylo Ren is now an internet meme for its utter stupidity\\n - Knights of Ren are not mentioned in this movie\\n - Rey's parents turn out to be drunk nobody's even though they built up the mystery of her parents in the prior movie\\n - Flying miniature penguins to sell more toys\\n - A prison inmate has a simple means to escape yet conveniently only uses it when the main characters meet the prisoner.\\n - Captain Phasma goes out like a bitch\\n - Everything Luke Skywalker stood for in the previous movies is completely turned upside down. aka\\, someone who wouldn't take the chance to kill Darth Vader would not try to kill a teenager in his sleep.\\n - No lightsabre duels\\n - Yoda's CGI looked terrible and his voice was not right. \\n - C3PO's red arm from force awakens is miraculously changed back to a gold arm in the span of less than 2 hours (who had time to do this while the resistance is being chased)?\\n - Force ghosts interacting with the physical world is now a thing. If this can happen\\, why aren't all the dead Jedi fighting wars?\\n - Political agendas have no place in a Star Wars fantasy film. \\n\\nIn summary\\, this movie was tragic and a massive disappointment.","true":true}