{"101487":139700,"Last Jedi":"Last Jedi","2017-12-15":"2017-04-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw TLJ a week ago ( second viewing) and first off\\, I’m going to see the film a couple more times\\, but here is my first viewing thoughts. I thought The last Jedi was interesting\\, shocking and confusing. First off\\, Mark Hamill was fantastic and the best part of the whole film. I loved every scene he was in. He and Adam Driver stole the whole film. The scenes with Luke Skywalker and Rey were near perfect scenes\\, but there was little of Rey’s training. I thought that was a huge disappointment. Adam Driver was a thousands times better\\, than when he was in TFW. I felt for his character and his arc for the film made you feel your the character. I won’t spoil anything\\, but at the end of the film\\, it was a tiny disappointing with where they went. The visual effects and the set design were some of the best work since the original trilogy. In some scenes it’s even better than the original Trilogy. So during the Rey and Luke scenes. We had a sub plot with Finn and a new character named Rose. which I will not spoil\\, but it is a very important part to the story of the film. It is so weird and misused placed. In one scene you are feeling like this is a Star Wars film. when Luke is training Ray and than it cuts to Fin and Rose and it feels like you’re in this CG clunker of a mess. They go to this Casino planet and you are supposed to feel sad\\, angry and It makes you feel like you’re not in a Star Wars film in some aspects. Don’t give me wrong\\, I really like some of the elements that they added to the film\\,but I did feel angry and sad during the scenes of this sub plot. For how they ruined a perfectly good movie. The sub plot does not make you feel like you’re in a Star Wars films. General Organa played for the last time by Carrie Fisher had a bigger scene time and she own it every step of the way. I loved her character in this film alone. Except for one scene she was and always will be my princess and now my General. The director of the film @riancjohnson did a great job with the source material and personally he brought more elements and a completely different way of thinking about Star Wars and what Star Wars could be. He should be praised for his achievement and I’m looking forward to his own Trilogy in the Star Wars universe.give Star Wars: The Last Jedi an 7\/10 Original Trilogy Star Wars 10\/10 Empire strikes back 10\/10 Return of the Jedi 8\/10 Prequel Trilogy Phantom Menace 5\/10 Attack of the Clones 6\/10 Revenge of the Sith 7\/10 Disney’s Star Wars The Force Awakens 7\/10 Rogue One ?\/10 ( haven’t seen it yet) The Last Jedi 7\/10","true":true}