{"101487":167971,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So... let's talk Star Wars: The Last Jedi. I'm going to write out my initial reaction to the film and where I stand now after watching it for the third time. So if you have not seen it yet then do not read what follows.\\n\\nAs I sat in the theatre awaiting to see the text \\\"A long time ago in a galaxy far far away...\\\" my heart was racing and then BOOM! STAR WARS\\, and I'm not going to lie\\, I felt an emotional reaction to it. It just brings me back to the very first time I saw a star wars film\\, A New Hope\\, when I was just a boy. The emotion also came over me because I am now able to share the same joy and memories with my daughter and my wife. As the first scene unfolds\\, I am already started to feel my exciting diminish. The reason would be the forced comedy between Poe and General Hux. This felt very much like a Tony Stark\/Marvel moment\\, and not a Star Wars moment. The rest of the scene was enjoyable\\, even the BB-8 comedic scenes were ok\\, because droids throughout the films have had a comedic aspect to it. And then comes Rey and Luke fucking Skywalker\\, a true hero to us all. Then he throws the lightsaber off a cliff\\, and i was shocked. Not upset but shocked because no one expected it. Then comes the bridging of the minds between Kylo and Rey\\, which I loved those scenes\\, even if they didn't make sense on how they were happening. The movie progresses with even more forced comedy\\, and my eyes continue to roll. And then comes the most shocking scene followed by the worst scene in the movie. The bridge on the Resistance cruiser gets destroyed and everyone including Leia and Ackbar get sucked into the vacuum of space. And my heart sank to its core. And then Leia is able to magically survive in space and float through it back onto her ship. So she all of the sudden has a much deeper hold onto the force and is able to have such powers like that? When the all mighty Yoda and The Emperor himself are unable to do that? Come on... from there my feeling of the movie begins to tumble out of control. Then we get such a disrespectful cameo in Maz Kanata. We all were wondering on how or if she survived ep. 7\\, and we got no explanation on it. Next is the most pointless side quest involving Finn and Rose. This was completely pointless and made no sense on to why it happening. Onto when Rey is brought in front of Snoke. So much hype for this. I'm sitting there waiting for details on who he is and how he came to be. And we get nothing. He gets cut in half like a weak and pointless character. Thrown out like yesterdays trash. At least this was followed by one of the cooler fight scenes in a Star Wars movie. And while all of this is happening\\, the SLOWEST chase scene in any movie ever is taking place. So God damn boring.... The light speed kamikaze was pretty neat and made everyone including myself go \\\"oh shit...\\\"  fast foward to Crait and Luke showing up... he shows up with a haircut and his broken blue lightsaber that is magically back together? When all the dust settles and Luke is left standing\\, I had assumed he had a new tremendous power with the force\\, because apparently the movie was filled with them.... but then he brushed the dust off his shoulder with yet another Marvel comedic moment... And then we realize that his an astral projection\\, which there is his brand new made up force power! It's quite impressive and also explains his haircut and blue light saner. Wait a minute\\, no it doesn't. Kylo had never seen him with his blue lightsaber... only his green one. Wait a minute\\, where the fuck is his green lightsaber this whole movie beside in the flash backs??? And then Luke dies..... And so does my spirit and potential love for this movie... And it ends with the entire resistance\\, which is like 15 people fleeing on the Millennium Falcon. So now how do you go from here in Episode 9? Leia is on the Falcon but Carrie is sadly no more... So my initial reaction was\\, \\\"what the fuck did I just watch....?\\\" I did not like it\\, and that was very very hard for me to come to terms with\\, and it still is. It took two more viewings of this movie for me to even tolerate it. So I believe my new ranked order for the Star Wars films goes..\\n\\nReturn of the Jedi\\nThe Empire Strikes Back\\nRogue One\\nThe Force Awakens\\nA New Hope\\nRevenge of the Sith\\nA Phantom Menace\\nThe Last Jedi\\nAttack of the Clones","true":true}