{"101487":169299,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILER FREE(ish)\\n\\nI left the cinema flat and bewildered. I pondered that maybe my expectations may have been too high the whole night. The only other film that made me feel like this was Spiderman 3. A whole lot a potential thrown down the toilet whilst also taking a dump on the film or films before it.\\n\\nIt's taken me a few days to concluded that my expectations really weren't too high at all and it appears that many others share my opinion. What really REALLY annoys me is that the basic principles of storytelling in The Last Jedi haven't even been met. There are plot holes everywhere and questions The Force Awakens asked us two years ago have been thrown off a cliff (quite literally). \\n\\nEven the questions they did answer from Episode 7 are so unsatisfying done it leaves you feeling empty inside. If you're a fan\\, you've probably pondered this stuff for the past two years (or 30yrs in original trilogy cast case) and you'll feel cheated. All the possibilities were staring Disney and Johnson in the face and discarded them opting for Porgs and titty milk rubbish. \\n\\nOne fatal flaw which I've heard mentioned elsewhere too is that the two current films in this trilogy are at odds with each other. The first tells you something is important\\, and the second says it's isn't worth screen time with a quick quip. I mean seriously\\, the basic premise of why Luke Skywalker is even on the island is interpreted different in each film. \\n\\nThis lack of clarity between both films is the most alarming aspect for me and it really shows Disney don't have the overall vision for the franchise in place. When a storyteller backtracks\\, tells you this and that and then tells you it doesn't matter too many times you'll lose fans. Look at the Lost\\, Walking Dead and Heroes series as the prime example. These are questions TWO YEARS in the making don't throw them out the door and focus one new characters with building back stories for the ones you currently have!\\n\\nI agree there are plot twists in this film\\, none of which are very good though. Surprisingly stupid ones in fact. Without giving spoilers\\, the twists and turns will not take it anywhere other than disappointment especially at the very end. \\n\\nFinally\\, I must say some scenes in the film are very good but for every one of these there are two laughable ones which go some way to ruin the Star Wars lore. The worst thing I can say about this film is that it's lost my interest in the remainder of this Trilogy.","true":true}