{"101487":184022,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie has a lot going for it.  It's fun in many places and has some amazing moments that are everything you could ever want from a Star Wars film.  This take on the Star Wars formula is not new by any stretch of the imagination but it certainly does enough mixing of the old elements with some new ideas to make a unique experience that has not yet been seen in a Star Wars movie.  Unfortunately for this film\\, its lows are so low that they detract immensely from its greatest moments.\\n\\nSPOILERS:\\nThe Good:\\n          The Last Jedi is daring in many aspects by choosing a non-Death Star plot line (a joke but not really).  The overall plot of the Last Jedi revolves around two main storylines that take place in parallel: The rebel fleet has been cornered and is on the run\\, and Rey is off doing her own thing with Luke and then eventually Kylo Ben Rolo.  These two stories are fun in their own regard and fill you with all the wonder and delight a Star Wars film should.  The plot twists with Snoke and later on Luke's force projection are immensely gratifying and oh so much fun to experience.  Daisy Ridley and Adam Driver hold your attention like no one else and the movie is overall a fun experience.\\n\\nThe Bad:\\n          The movie has some horribly written aspects to it and these single handedly undermine all of the good that the movie has to offer.  I think all of the poorly written aspects to this movie stem from the fact that it has an identity crisis.  This movie doesn't know whether it wants to be a fun sci-fi fantasy space adventure or a dark and gritty take on the Jedi mythology.  I don't think there's anything wrong with it trying to be both but I must say to my dismay that it fails miserably in its attempt.  There are so many moments in the movie where a hugely emotional scene occurs only to be undercut by poorly misplaced bit of humor.  An example of this is the introduction of Rose grieving over her sister's tragic death which is shortly followed up by an almost cringe worthy comical relief scene between her and Fin.  I could also bring up the uncharacteristic behavior of Luke when he first meets Rey and tosses the lightsaber of the edge of a cliff but I rather liked the whole grumpy old man approach to Luke- oh wait didn't he change his mind and decide to help Rey about 5 seconds after R2 showed him the original video of Leia . . . This movie can't escape the constant inconsequentiality of actions.  Nothing anybody ever does seems to have any affect on them as a character beyond forwarding the plot along because 10 seconds later the film decides to repent them of their actions and is afraid of sticking with these freshly developed character traits.  The worst offender of all is the entirely pointless casino plotline with its attempt to make some profound political statements when in reality it makes no sense at all to have 2 people escape in the middle of what should be an epic space battle to have a space adventure subplot that ends up amounting to nothing at the end of the story.  \\n\\nIf you can get past my ranting and the movies flaws I guess it's not that bad of a movie\\, but unfortunately this is Star Wars and a Star Wars movie cannot just be \\\"not that bad of a movie\\\" because if it is people like me who never write reviews are going to come along and spew about why it's a terrible movie.","true":true}