{"101487":116348,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disney has made it clear that their new movies are made for everyone EXCEPT me and everyone like me. (A white male who loved the original movies).  It is a disgrace that the saga of Luke has been destroyed by the liberal media's push for what they call diversity. With that aside\\, the last 2 movies have SUCKED!  They have created a ridicules story line full of ridicules excuses of why they made the decisions they made.  It has been admitted in interviews that they couldn't have Luke predominately featured in the new movies because he would steal the movie from the newcomers that they were so eager to force on us. Well\\, that's what happened! The best parts of the movie were the Luke scenes. You know why? Because the movie was promoted with the original cast in order to get the original fans excited for something we have waited many years for\\, a conclusion.  They have given us no conclusion to the 9 movie saga that was first envisioned by Lucas.  They gave us a mirage! Why?  Because they wanted our money! They don't want to represent \\\"my kind\\\" other than Nazi type roles by British actors but they sure want my money.  They sacrificed a good story in order to fill political and social diversity needs of their own.  I am all for having any color or race of actor in a movie but you can't just change what something has been for over 30 years.  They should have finished the story and then introduced their own vision going forward.  Anyone that would ague that these movies are finishing the story are delusional and not true Star Wars fans!  These characters could have been part of the spin-offs but that would not have brought in as much money.  The comic relief they attempted in this movie is too forced.  The original movies would not have killed thousands then 2 minutes later have the lead characters joking and being ecstatic. If you are an original fan\\, Save your money!  This is not for us!","true":true}