{"101487":117999,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Enjoyable as a stand alone movie\\, but what it added to the Star Wars lore\\, terrible. Completely ruins the character of Luke Skywalker. From a self assured Jedi Knight at the end of Return of the Jedi to a selfish old man who wallows in his own self-pity and leaves the galaxy to suffer from his mistakes. Then there are all the other majority stupid plot points. Why not tell Poe the plan instead of leaving him in the dark. Would’ve saved every bodies lives and not led to any the problems sen in the movie. The whole concept of slow attrition to chase down the rebel fleet made no sense. Really that’s all the ships smoke has in his empire? Also the bombers in the beginning of the movie to destroy the dreadnought made no sense. Why create such ridiculously easy targets and loss them with thousands of bombshell. Just asking for target practice. Then there are the other Force users. How did Leia save herself? It makes zero sense. In the entire history of the Jedi there has never been any indication they can survive in the vacuum of outer space\\, but a completely untrained Force wielder can? Luke can Astrally project? Smoke can connect the mind of his apprentice to a Jedi he’s never met before? Disney should have never retconned the Legends universe. Although some of those books had their own problems\\, overall they did justice to the Star Wars characters and still took things in new directions. So far the Disney adaptation has not. ","true":true}