{"101487":139733,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I see some reviews saying \\\"Loved it\\\" or \\\"Best Star Wars Movie\\\". Well\\, I don't get it. This movie was very good on visuals and choreography but what they did with almost every story arc is terrible.The only decent arc was Ben\/Kylo. Everyone else was disappointing or straight bad. \\n\\nSpoilers\\nEverything that was created as a build up or a question in episode 7 was either dismissed outright or was taken in a whole other direction. Rey's parents\\, dismissed with a cast off line. Who is Snoke and how did he build the First order. Don't matter\\, he is dead now. Cleverly done but still now he's out. Luke Skywalker is back right? Uhh no. He is made to look like a bitter old hermit for the majority of the movie. When he does come around they have an awesome scene with him. Which was also very clever but then for some ungodly reason. They just show him the door. Oh ok\\, your tired\\, you used a lot of energy\\, so your going to die now. What the hell? I get the distinct feeling Disney wants all the characters from the previous films out of this franchise. The Finn\/Rose story wasn't needed at all. It seemed to be a giant round about to get them on the enemy ship. I don't even know what to say about Rey. Wow\\, the force seems to give her any\/every ability at a moments notice. No training\\, no nothing. From a scavenger on a junkyard world she can fight elite guards that are fully trained and win. \\n\\nUltimately I see it like this...if you like Michael Bay type stuff where they create great moments\\, big explosions\\, and ignore good story telling. Go see the Last Jedi. If your someone that can see past the bright and shiny lures in the world. Then you should save your money.","true":true}