{"101487":187098,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"this movie was terrible.(SPOILERS FOLLOW) Not as a star wars film\\, but as a film in general. There are so many plot holes and things that dont make sense. There are characters that no one cares about (rose) and dont need to be there they dont add anything to the story they just distract from it. Luke has had his character assassinated from the original\\, his beliefs and even his personality was abandoned and just didn't fit the portrait of who he  truly is. Snoke was a scary and mysterious and interesting villain but he was wasted\\, he meant nothing and ended up being empty and shallow with no backstory or reason behind his motivations. Kylo ren while driver acting amazingly is a very confusing character and honestly not even scary? he is just a weak villain. rey can do more than any jedi ever could without any training and weak understanding of the force how convenient for the timeline which takes place in a matter of hours. the movie tells us it wants to do away with the old things etc. but then salvages the jedi and even salvages the rebellion so all the old boring stuff will just continue I guess. oh boy should i even mention captain phasma i mean apparently her character wasnt important so again a waste of time and a character and a waste of a good actor. theres so much more lets see oh apparently the force has no rules or structure and you can basically do anything the writers can think of leia using the force to fly to the ship from outer space was absolutely bizarre and ludicrous. when phasma is about to chop off finns head and the other ship rams it at light speed after the crash you see her and her men walking towards finn through the smoke haha how did they all get separated by 50 yards when they were all next to each other seconds before. another good one was when all the skii speeders break off from the cannon and finn flies straight at it to sacrifice himself to blow it up and rose somehow was able to turn around catch his speeder get ahead of it enough to crash into him hahaha how? he was flying straight at full speed?? its so impossible its stupid. Oh man apparently starships can run out of fuel even though thats never happened before and apparently a dreadnaught and even snokes ship can only fire one cannon shot at a time every 2 minutes and you can just outrun them at slow speeds bc they are so big hahahaha so stupid.","true":true}