{"101487":136567,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm going to preface this with saying I was at a 40th bday party for one of my longest friends and had imbibed about a 4th of a 5th of scotch when I typed this last night. I debated sending it since it kind of rambles but I think there was just enough scotch in my system to make it I bit more enjoyable to read. \\n\\nYeah\\, I might need to make a rotten tomato review. The longer I think about it the more I dislike it. There some pretty cool things in the Last Jedi but the things I didn't like far out weigh the good stuff. \\n\\n\\nPogs - No point at all. \\n\\n\\nNo Snoke backstory\\, just the most powerful person in the galaxy then cut in half. To me this was the most annoying part of the movie. That and Timothy Zahn wrote a much better sequel trilogy that Disney bought and then curb checked it right in front of all the true Jedi fans. (Slightly still bitter) I'm also still going with Lucas wanted Darth Jar Jar but I would do just about anything for 4 billion dollars too george. \\n\\n\\nAlso agree with you. No reason to make Luke Skywalker a Pussy but leave it to Disney. My childhood hero is now a depressed washed up has been that milks aliens on a far off planet named after a sneeze (Could have left that sea creature tit milking scene completely out\\, the directors cut probably has him giving her a motorboat and sucking straight off the areoles) and the most bad ass hero of the movie is a pretentious purple haired bitty who 9\/11ed admiral Ackabars ship (who died a way too uneventful death after keeping the rebellion going for 40 years) at hyper speed like United 175 through snokes ship. She just feels too forced into the movie. Why not have Ackbar sacrifice himself? (Oh yeah lobster privilege)\\n\\n\\nBoth my 7 and 9yr olds NOW think Luke Skywalker is a Stupid meanie.  F you Disney!!!\\n\\n\\nAnd the whole Leia getting sucked into the vacuum of space and force-glow pulling herself back onto the ship. WTF was that?????  I've seen event horizon I know what happens to bodies in the vacuum of space. Laura Dern could have discussed it with Sam Neill while they were digging up dinosaurs. \\n\\n\\nThe whole going to the casino to find a code breaker that they saw but didn't talk to and settled for BDT who thought he was shooting the Usual Suspects 2 that turned them in to the first order which didn't really add anything to the story at all and wasted a good 20min that could have been used to tell snokes backstory. Except it did add some horse things that Disney will market to kids and that the rich casino owners are pricks. Even if they run the free world. Ok Disney you don't like trump we get it. And that is all we get of Phasma?  (Maybe she'll be back for the Christmas special)\\n\\n\\nThe whole force mind melting thing like we are watching the wrath of Kahn. Yeah not having it\\, wrong movie.   \\n\\n\\nAnd since this movie is like three days after the force awakens how did the new republic die out so quickly. The capital planet is blown up and in a matter of days the resistance is down to Poe\\, Finn\\, Billie Lourde and like 4 others. \\n\\n\\nAnd finally we could have at least had a flashback of Rey remembering her tweeker parents selling her for a hit to the junk dealer on Jakku (and really\\, if Jakku is that rough of a place and he was that cold of an alien he could have gotten a lot more out of Dasiy Ridley than a few junk trinkets\\, gold bikini anyone)","true":true}