{"101487":158809,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Oh dear. Where to begin with this. Lets start at the beginning. Now Ep7 wasnt great it was a soft remake of Ep4 but JJ Abrams put just enough in that movie to keep the audience interested for Ep8\\n\\nThe return of Luke Skywalker\\nThe mystery of Rey parentage\\nWho is Snoke\\nThe Knights of Ren\\n\\nAll interesting talking points that we wanted to explore and be seen fleshed out over Ep8. What did we get ?\\n\\nEVERYTHING flushed down the toilet.\\n\\nThe heroic Luke Skywalker now a scrooge like figure spending his day milking elephant tits. The truth of Rey parents is she a kenobi descent is she a skywalker is she the new force created being...Nope shes the bargining chip of some random drunks.\\n\\nSnoke ? An anicent malevolent being who has been around for thousands of years in the shadows watching the rise and fall of the republic and empire jedi and sith. Killed off without any futher explanation of who he was or where he came from or what he was planning to do. Zero point to the character whatsoever.\\n\\nKylo Ren. Er...He takes his shirt off and has a lightsabre dance with Rey and hologram Luke.\\n\\nRian Johnson seems to have failed to realise that the episodic chapters should be linked to each other telling a continuing story within the existing SKYWALKER saga. The place to drop bloated new ideas is his new separate trilogy not here. JJ Abrams understood that the skywalker\/jedi\/sith theme was pivotal to the whole story and you cant move forward with providing satisfactory conclusion to the old characters arc.\\n\\nWhat we got with The Last Jedi was a bloated mess that destroys what came before it and replaces it with a a mismash of new ideas none of which work well.\\n\\nNot just a bad Star Wars movie. Its a bad movie period.","true":true}