{"101487":170328,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-13","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars The Last Jedi Review (there are no spoilers here but just in case you're a sensitive person just read the first paragraph for what I thought) - Wow. I'm almost at a lost for words. I have not been this entertained in a movie in such a long time. It was that bloody good. Better than The Force Awakens and maybe a contender for best Star Wars movie ever. Hands down a 10\/10 for me. If you're at all a Star Wars fan you will laugh\\, be surprised\\, be entertained and be moved over the course of this movie. Make sure you watch it before it's spoiled because there be a HELL of a lot of stuff to spoil! \\n\\nI don't even know what else to say so I'll break it into a things I liked and didn't like (no spoilers but if you want to go in blind do not read). \\n\\nThings I liked - \\n\\nThe cinematography and was the story was told felt fresh and different. There were film techniques used in this movie that have not been used in any other Star Wars movie. Some might think this detracts from its authenticity as part of the saga\\, but I think it's done in a way so it feels like a natural evolution rather than a movie that doesn't fit in with the rest.\\n\\nThe story wasn't as predictable as the previous one and dared to mix up the formula a bit. There were quite a few twists and turns but there was one huge bit in the plot where I actually loudly guffawed and was quite shocked at it. \\n\\nThe sound track and sounds effects are on point and it felt like an epic Star Wars movie the entire time. \\n\\nThe acting from almost everyone is top notch. And the characters and their motivations were believable. \\n\\nThey fleshed out Poe's character a lot more which was greatly needed as he such a minor character in TFA.\\n\\nThey condense a lot of movie into the running time. Think it's only just over 2 hours long yet they jump from different location to location without it feeling rushed. Also they include ALOT of different aliens in this one.\\n\\nIt had comedy in it\\, but also had some really good serious moments. There was a speech Luke made to Rey about the events of the past and it was interesting to hear that kind of self reflection. \\n\\nThe light saber scenes were as always on point. The space battles were on point. And the land battles were on point. Pretty much the entire SFX crew needs a big pat on the back. \\n\\nPorgs. This is how cute critters should be. Seriously how can Jar Jar be so F'ing annoying and shoe horned in\\, yet I couldn't get enough of the Porgs in every scene there were in. \\n\\nThings I didn't like -\\n\\nThis one scene involving a certain character floating. You will know exactly what I'm talking about when you see it. It looked off putting. \\n\\nThat's about it. Even my one dislike is only a 20 second scene of the movie. Go see it now. Stop reading my dumb review and see it ASAP.","true":true}