{"101487":198016,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst movie I have watch this year. I can honesty say I have ever been more disappointed which is a real shame as I have been looking forward to it all year. I don't even know where to start\\, the issue with Disney is that they believe in a one size fits all model wherein they find a style that works for a particular movie or franchise and apply it across the board. They fail to recognise that what might work for say the Marvel Verse defiantly doesn't work for Star Wars. They tried to insert humour at every opportunity and all it did as degrade both the movie and the franchise as a whole. Yes by all means add a bit of humour\\, make one character  the comedian\\, but don't try to have every single character be funny\\, it's not a comedy. Then there is Snooke's death\\, the only thing I can say is What. The. Hell. I'm not even going to go into it because I think that disgraceful scene speaks for itself. Next was that completely pointless side mission to find the code breaker\\, I mean really\\, that whole thing was a needless filler whose only reason for existing was as an excuse as to why they didn't immediately jettison the escape pods and plough into the destroyer. Moving on to the horrible writing\\, they completely destroyed Luke\\, pretty much everything he both said and did throughout the movie is in opposition to his nature. First this is his nephew and after everything he went through he understands how important family is so there is no way he is going to creep into his room and kill a child in his sleep. Had he been truly worried he would have confronted him while awake during training. Also he is a jedi master so when Ren wakes up and does his thing Luke should have easily overpowered him. This kind of poor characterisation continues throughout and i'm not going into them all because I just don't have the time. There was also no real story\\, there seemed to be a lot happening at once that really contributed nothing to the overall plot and lets not forget the poorly edited CGI. So overall poor direction\\, writing and in some cases poor acting\\, made this movie is the biggest fail of 2017.","true":true}