{"101487":167912,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So in case you didn't see it coming\\, Disney is ruining the Star Wars franchise with its weak stories\\, new characters\\, and over-marketing. Disney's only strength is in fan pandering\\, not in strong\\, original screenwriting.  Star Wars is becoming unbearably boring.\\n\\nThe screenplays for 7 and 8 feel like they were written by an AI algorithm that analyzed Episodes 4 5  6 and spit out Episodes 7 8 and possibly 9. \\nAlmost everything in this film is stolen from other films. Yes\\, I'm using the word \\\"stolen\\\"\\, because when almost everything in your film is a weak \\\"homage\\\" to another film\\, you're basically plagiarizing. The best visual representation of this are in comparing George Lucas's droid homage of the HAL 9000 with Rian Johnson's homage (theft).  George Lucas put a lens eye on R2-D2 as homage. On Rian Johnson's BB-9E\\, his homage to HAL 9000 is rotating the HAL 9000 90 degrees . . . and boom! We have a head for BB-9e. Another stolen idea:  The ESB story line of long chase sequence as the major plot . . .  it is needlessly long and boring. I think Rian Johnson is constantly quoting from other films in interviews because he has no original ideas of his own. For example\\, the ending of this film is basically a modified version of the ending of \\\"Fistful of Dollars\\\"\\, whose plot itself was taken from Yojimbo.  The entire major plot of this film is basically this: spaceships chase each other\\, and one side finally escapes. This is basically the same plot of every \\\"Star Wars Rebels\\\" episode Disney has been shoving down fans' throats \\, \\\"foie gras\\\" style.\\n\\nDisney has killed most of the characters we care about as weak 'setup' for characters they haven't developed and so we don't care about. Fortunately Carrie Fisher cannot be abused in this manner for Episode 9. In the end\\, the rules of the 7\/8 universe simply make no sense given the previous universe given by George Lucas. \\n\\nSo what is there left to wonder about now?  Basically this \\\"Will Rey become an all-powerful Jedi? Will Rey go to the dark side? Will Kylo go to the light?\\\".  I really don't care about the answers to any of those questions at this point. I'll let Mickey Mouse jerk off in a dark theater next time without me.","true":true}