{"101487":196130,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"When I walked out of the theater I was on the fence about this but the more I think about it the less things made sense and the worse it seems and I don't think I've ever seen a movie with this big of a gap between the critics and fans in this direction. Visually stunning\\, this is not a terrible movie by any means\\, but it doesn't live up to the standard that the original trilogy had and what I had hoped for when Rian Johnson\\, who directed some of the best episodes of Breaking Bad (the greatest show ever)\\, was announced as the writer\/director. It seemed as if they made the movie for everybody but fans of the original trilogy and it had the stink of George Lucas and Disney all over it. From the unnecessary cutesy characters (that make Ewoks look like the Xenomorph from the \\\"Alien\\\" movies) to appeal to the kids to established characters from previous movies being neutered in favor of new characters and pointless story arcs that go nowhere and achieve nothing other than to ram contemporary political issues down our throats to placate the SJWs there are many elements of the movie that just felt forced. The only thing missing was a scene between Vice Admiral Holdo and Rose talking about their Tumblr blogs on taking down the patriarchy and noting the carbon footprint of the Millennium Falcon. Also\\, so much attention was concentrated towards things like this on the micro-level but we got hardly anything telling us what is going on in the galaxy or how things got to be where they are on the macro-level.\\n\\nIf only this vigilance and attention to detail had been placed on obeying the laws of physics we wouldn't have had scenes with bombs dropping sans gravity\\, spaceships sputtering to a stop sans friction and Leia going full on Poochie from the Simpsons in outer space.\\n\\nThe one bit of candor the movie had was showing us what they thought of the audience as Luke went to go milk the weird space manatee thing. It's pretty clear that is what Disney cares about\\, milking the audience for every dollar they can and giving us the same kind of \\\"what are you going to do about it?\\\" look that Luke gave to Rey or like when Deebo was stealing someone's bike or chain in \\\"Friday\\\". The Star Wars franchise needs someone to stand up to this a la Craig from \\\"Friday\\\" or this continued cash-grab will tarnish the series.","true":true}