{"101487":196502,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-29","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"while it isn't a complete remake like the force awakens was\\, it still takes a lot of major story elements from empire strikes back and return of the Jedi. it has the same basic concept as empire. you have the protagonist (Luke\/Rey) being trained to use the force by an ancient Jedi master (Yoda\/Luke) in an isolated area separated from the rest of the group (the rebellion\/the resistance)\\, who are fleeing from the enemy force (the empire\/the first order) throughout the film. you also have a romance subplot (Han and Leia\/Finn and Rose)\\, a character who briefly helps them but then betrays them (Lando\/DJ) and the protagonist learning something terrible about their parentage. as for return of the Jedi\\, you have the protagonist thinking that the antagonist (darth Vader\/Kylo Ren) can be redeemed\\, but their masters tell them that they cannot be turned. they don't listen and get themselves captured and try to talk the antagonist into turning good\\, to which they are conflicted but don't quite give in. they take the protagonist to their masters (the emperor\/Snoke) who taunts them about how their apprentice will not be turned and how their friends will be destroyed. they order their apprentice to kill the protagonist\\, but they turn against them and kills them instead. you also have a scene where the ancient Jedi master dies and becomes one with the force. so the film gets points off for it's unoriginality. but it does have an original theme\\, which is about learning from your mistakes and letting go of the past. this theme is fresh and interesting. Rey is at least given a bit more character than she did in the force awakens\\, as she has to learn to accept the fact that her parents are gone for good. this is a good character moment for her. but this is only one scene and it should have been focused on more\\, and she does still ultimately feel like a Mary-Sue. I have mixed feelings about how Luke was portrayed. on one hand the fact that a character who once refused to give up on the second most evil man in the galaxy\\, and succeeded to redeem him would now resort to killing the son of two of his best friends who hasn't even fully turned yet feels very out of character. but on the other hand\\, his general ark is really good. I really like the idea of a broken Luke learning to face his past. Kylo Ren is actually significantly improved on here. while in the force awakens he often came off as a whiny emo teenager\\, I actually took him fully seriously this time around. he was a conflicted\\, complex and sympathetic antagonist and brought a lot to this film. Snoke was probably always meant to be a one note character. but the fact that they would do this to such an intimidating\\, immensely powerful character is somewhat disappointing. but for the little screen time he got\\, he was as badass as you would hope. Phasma is also wasted\\, just as much as she was in the force awakens. Hux does what he needs to fine but I find him to be a bit to over the top and hammy. Poe is actually given more attention here and he has a decent ark\\, which I enjoyed. Leia doesn't do a whole lot which is fine. but there's this scene where she almost dies out in space\\, but she uses the force to fly to safety. she flies almost like superman. and while I kind of like the idea of her using the force\\, the way it plays out is just really weird and it doesn't work. there is a new character named Holdo\\, who just feels pointless and her plot line doesn't make sense. why didn't she just tell everyone about her plan instead of keeping it secret for no reason? there is a subplot involving Finn and a new Character named Rose going to find a code breaker. this feels pointless and forces in an overly preachy message about saving animals that this film didn't need at all. also their chemistry is extremely forced and Rose's character is not compelling in the slightest. but although pointless\\, the code breaker character named DJ is something of an entertaining presence. the ports are fine. they're not particularly amusing but they're not in the film enough to become irritating. they're tolerable. something that bothered me is that this film drops several things set up in the force awakens\\, such as Rey's vision\\, Kylo Ren's further training and the knights are Ren. also Han Solo's death is brought up once and then forgotten and Rey is promised three lessons and is only given two. there is quite a bit of comedy in this film. on one hand\\, a lot of the jokes did make me laugh. but a lot of them felt forced and out of place\\, and there is to much of it. visually\\, this is probably the best Star Wars movie. the cinematography and locations are gorgeous to look at\\, and the action sequences are quite impressive. the score by John Williams is great as always. overall\\, this film is a huge mixed bag. it's an improvement over it's underwhelming predecessor the force awakens but still ultimately a disappointment.","true":true}