{"101487":199171,"Last Jedi":"Last Jedi","2017-12-15":"2018-08-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow. I really didn't know how to feel about this movie when it ended\\, it was just nothing and that feeling sums up this movie - it's nothing.\\n\\nI was lucky enough to grow up watching the OT and I was young when the Prequels came out and I loved all those movies. I won't pretend that they are perfect films by any stretch - but Lucas had a vision and for the most part delivered a masterful 6 movie story. After watching Revenge of the Sith - Return of the Jedi became so much better! Vader's story arc is one of the best redemption stories in cinematic history ... And now we have this.\\n\\nI loved the FA\\, I thought the new characters that were introduced were great - especially the dynamic between Finn and Poe - which Rian Johnson decided to not explore at all in this film in favour of adding a new and irritating character in Rose. Rey was ok\\, as everyone has said massively OP but if you put her life into context its not unreasonable to believe she can look after herself. Han Solo was used well and his death by Kylo's hand made Kylo a fascinating villain.  All of these plot points were set up and none were explored in this film at all. TLJ didn't fulfill the role as a sequel - surely that was point one on the list of things this film had to do.\\n\\nFrom the word go the movie was wrong - how has the first order gained control? They just had their massive planet sized base destroyed about an hour before this film starts? Would it not have made more sense to start the film months after - at which point that sentence is could make sense. But no ... because Rian wanted a cheap laugh when Luke throws his saber away. Wow.\\n\\nI won't rant as this review would become a book about all the things wrong in this movie. But to name a few - Leia flying through space\\, despite never displaying any real force powers - Light speed being used as weapon?! Fuel in spaceships?! Why the resistance (terrible name and back story didn't make sense - but that's FAs fault) suddenly become the rebels - Luke's character - Snoke's character - Kylo and Rey's underdevelopment - Finn and Rose's useless side plot - Poe being sidelined for the majority of the movie?! I have no issue with new characters and Holdo could have been great\\, but her purpose was to keep Poe out of action - it's just bad writing and character development. Makes me miss Anakin talking about Sand ... \\n\\nThe biggest failure of this film is that it didn't follow up on the FA set up and then it doesn't set anything up for Episode 9. The FA left us with so many questions and people WANTED to see the next movie - but TLJ sets up nothing. Han is dead\\, Luke is dead and the new characters have gone no where. I've loved Star Wars for as long as I can remember and this movie has left me so disappointed. The moments that are good do not outweigh the horror show that is this movie. I won't be watching Episode 9. Such a shame.","true":true}