{"101487":195915,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What the hell Disney\\, what the hell. (Not yelled\\, just calmly said in disbelief) \\nSo I went to see this hoping to see the next chapter of the Skywalker saga\\, to see WHat and who Snoke was\\, to see the NEXT CHAPTER of an epic.\\n  What i got was an social justice warrior speach about\\, woman good man bad\\, the rich enslave the poor\\,  im surprised they (you disney) couldn't find a way to put the gun control agenda into it. \\n  And 2 there was no story.  I could tell you what happend. But THERE was no story. What should have been SEVERAL slamdunks\\, were lost.  \\n Snoke\\, sith no one knew existed. THAT'S it... you want more ok i saw a guy in a gold bath robe with ALl the menace OF a unwilling cat you just gave a bath to.  Force awakens mysterious and threating. Last jedi ???\\nGeneral Hux. Force AWAKENS a force to be RECkoned with. Last jedi\\, CLOWN well i guess jar jar had to make an appearance somewhere.\\nCaptain phasma. Didn't she die in force AWAKENS? Ok sure why not\\, falls down again? \\nRose. Why is she even in this story? What role does she fill? Finns love interest? I thought that was who Poe was.\\nFinn. I actually had no problem with him just his story arc.\\nPOE\\, ok you could have done more with him and the mutiny. Although it was funny when leia shot him. \\nRey. Good at everything.  Mary sue much?  Insert bad fanfiction character here. No flaws. Knows everything. Until she doesn't. BEATS kylo in a lightsaber duel. Beats luke in a duel. KILLS 4 highly trained guards.  Flys the falcon expertly with no previous experience. Heck put her in a xwing and the new order would run for the hills. \\nGeneral Holdo. Could you have made it any MORE\\n obvious that she was BASed off of big red (a feminist ACTIVIST) and  At times it was like her and leia had more the just a friendly intrest in each other. \\n I feal that they really dropped the ball here or rather in the force AWAKENS i think it would have been really touching to see luke leia and han together in a FINAL SCENE. \\nI can give you the whole leia mary poppins scene\\, lukes sister give her some training. Sure.  \\nLuke what happend? He was this bright light in the galaxy he could see the tiny spark in darth vader brought him back to the light. Oh one of my students is haveing dark side THOUGHTS i BETTER kill him.What?! His death ??? \\n\\nOn the WHOLE the movie lacked menace only the m6 \\nwalkers had any. The movie is bad. Go see it if you must. Better yet wait for it on youtube or netflix your not missing anything. There is only one way to fix this mess. But carrie fisher is dead  so a reshoot or reboot of the force AWAKENS and last the JEDI  are out. So a retcon  is needed i just hope THEse movies goes the way of the Christmas special And THAt they are lost to the anals of time.  I can say this that i'm not looking forward to SEE THE next starwars movie(s) Han or the next-generation.","true":true}