{"101487":162129,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Picking up from where The Force Awakens left off\\, The Last Jedi sees characters introduced in TFA develop as Kylo Ren becomes more psychologically complex as he remains unsure with whom his own allegiance lies. Even Darth Vader wasn't as complex as Kylo Ren. With Vader\\, it was a simple case of \\\"hate this guy\\, kids\\\"...until....THAT happened back in Empire. Now can we really root against him? We'll have to wait till Episode IX to find out. Mark Hamill succeeds in his role as Luke Skywalker after the last movie was a treasure hunt for Luke. And he's become quite the snarker. The action sequences and drama are all well-executed which include a fight between Fin and Captain Phasma and an action scene with some red stormtroopers or whatever they're supposed to be. The drama really is good. The ending represents a REY...no? Okay. The ending represents a ray of hope for the rebellion that oughta help to build up anticipation for the hopefully thrilling final chapter in the sequel trilogy. Though they'll probably make a SEQUEL sequel trilogy\\, or threequel trilogy\\, because the next ten years of Star Wars movies are being planned at this point. But yeah\\, Star Wars is awesome and its more humorous and the Porgs are adorable. A slow-building space opera that also marks the conclusion of a few character arcs whom I'm keeping anonymous for spoiler-free sakes although you probably know who one of those people is.","true":true}