{"101487":194192,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Way too much comic relief in a movie that has very dark undertones. Hundreds of people die or are injured in the film and as this happens jokes and little quips are shelled out relentlessly. I’ll never got the life of me understand why they have to dumb down movies like this. It’s called Star Wars\\, stop trying to make these movies comedies. A few really cool scenes\\, but a plethora of absolutely ridiculous moments that completely destroy the enjoyment. For example in the very beginning when Luke is handed the lightsaber\\, in what was the final and climactic scene in The Force Awakens (which we all spent the last couple of years eagerly wanting to know what happens next) he just tosses it over his shoulder as a joke!?! What?!?! A lot of us grew up watching the originals and the Luke vs Vader storyline was amazing! It’s been over 30 real-time years since anyone has really seen Luke and we’re all excited and the very first thing he does after 30+ years is toss a lightsaber behind him as a joke. WTF man.... seriously. Completely ruins the entire importance of Rey getting the lightsaber in the 7th movie. All in all\\, way too much nonsense with the plot and comedy pandering to lighten the tone of a film that is supposed to be dark. This is the first Star Wars film I have truly disliked. There were faults in previous movies sure\\, but I’ve always found ways to enjoy them. Seriously worried for the future of a franchise I’ve loved my entire life.","true":true}