{"101487":185859,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie takes almost 40 years of history\\, lore\\, fan theory\\, and basic concepts of the force and throws it all away.\\n\\nMy main problems with the film:  Killing snoke was the dumbest decision ever. I was not a fan of him in TFA but this new evil character had the potential to be a bridge that connects all the star wars films together. which in many way is what the audience was expecting from this film. His cheap death made people feel that Disney genuinely doesn't care about lore and deeper meaning in all star wars films that bind them together.\\n\\nSecond:  Cheesy Scenes that push the force to Unnecessary limits. Case and point\\, Leia getting sucked into space and using the force looking like Mary Poppins to return to the Raddus was the most rediculous moment in any Star wars movie by far. Who approved that scene in a Star Wars movie should be ejected into space themselves. The force allows  a jedi to do incredible things yes\\, but that on top of luke projecting himself across the galaxy\\, which eventuallly killed him\\, felt unrealistic in terms of the capabilities of the force we have seen previously. (Even Anakin wasn't able to do that and he was the freaken chosen one)\\n\\nThird: Lack of development of characters. Okay I have one person in mind with this one. Phasma. After the TFA people were upset that Phasma had such little screen time and would be getting the time she deserves in the last jedi. Yeah No. Yet again shes on screen for less that 4 minutes and gets killed off in a very cliche battle with fin. \\n\\nFourth : The journal of the Whills and the resolution of Grey was not even mentioned in the film. Not to say it wont be introduced in episode 9 but Star wars is all about development that leads to an ultimate climax. (Hence 3 films. Beginning\\, Middle\\, End) If all this is to be talked about in the final film\\, fans will be wondering why did we even bother watching the first two. \\n\\nFinally: You killed the greatest jedi in the world and made him seem like a whining upset child then You killed him. Not for nothing\\, with the expection of carries death obviously\\, this whole new sequel trilogy really did a disservice to the characters we come to know and love in the Original trilogy. \\n\\nI believe i covered most of the points of why die hard fans including myself were upset with this. I dont know how Disney will recover\\, but after this triogy is done they should just focus on staying within the confines of George Lucas's 1-6 where they are bound to a universe that can't be tampered with","true":true}