{"101487":175602,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"THE LAST JEDI\\nCurrently\\, Rotten Tomatoes scores The Last Jedi at a 93% from critics and 54% from the\\npublic. And that about sums it up.\\nIt looks amazing. Sounds amazing. Mark Hamill is fantastic. Carrie is great. All 93%...\\nAnd then there is the rest of the movie...\\nLet's just dive right in...\\nDo we really need to see the heroes of the Star Wars Universe get arrested for a\\nparking violation?\\nA PARKING VIOLATION???? Seriously? I can see that happen outside of my front\\nwindow every day in Los Angeles. I don't need to see that in a Star Wars movie!\\nThe entire Casino scene felt like bad footage left over from the Phantom Menace that\\nwas jammed into this storyline\\, just because they needed 'action.'\\nThe Justin Theroux cameo was pointless and takes you completely out of the movie\\nwhether you know of him or not.\\nWhile we are on the subject of the Casino scene... Let's break down Finn and Rose's\\nadventure to the casino:\\nIF THEY NEVER LEAVE THE SHIP AND GO TO THE CASINO Laura Dern's plan to\\nsneak away and hide in the salt mountains WOULD HAVE WORKED.\\nNOTHING they do accomplish anything or adds anything to the story. NOTHING.\\nThese characters only need to do NOTHING and the good guys would be better off.\\nThey act like they brought down the high-class gamblers and their city before boarding\\nthe ship piloted by Benicio. (I don't know his name. Not memorable enough to learn. At\\nall.) Anyway - they did not change anything on that planet. They had a herd of space\\ncamels stampede through the casino and break a few things. This sequence is so long\\nand boring I actually thought they repeated footage.\\nINT. Casino - Night\\nSHOT of a crowd in a casino. You HEAR a rumbling. Then -BOOM- the wall bursts apart\\nas Space camels charge through.\\nThis happens 3 times as I recall... maybe only twice\\, but it certainly felt like the same\\nthing over and over...\\nThese space camels run away but aren't really free. They will be caught again quite\\neasily\\, I would think from the flying police cars... The damage to the casino will NOT\\n'Takedown' the evil rich people. NOTHING has changed.\\nFinn and Rose are thrown in jail - FOR A PARKING VIOLATION - and they meet a\\nstuttering (WHY stuttering?) Benicio Del why are you in the movie Toro... He just\\nhappens to be in the cell. There are TONS of other cells yet they are put in a cell with\\nanother criminal rather than by themselves... Okay whatever\\, it's crowded fine... Doesn't\\nmatter...\\nBUT why is Benico in the cell if it is SO EASY for him to escape??? With a piece of tin\\nfoil by the way... He isn't the master codebreaker - he is just a con-artist criminal that\\nbreaks out of a prison cell with a piece of paper. Okay - good enough? I guess...\\nLAZY. JUST LAZY.\\nWhy hasn't he already escaped on his own?\\nHe clearly doesn't need Finn or Rose's help. And he is not a spy tracking them. He is\\njust a guy who is sleeping in the prison cell... ???\\nWhy not have a bounty hunter chasing these two down? Oh... Because that might have\\nactually been exciting...\\nSo Benico ends up double crossing them and tells the Ginger Bad Guy Hux the plan the\\nrebels have to sneak down to the planet... Giant FAIL for Finn.\\nThanks for nothing 'hero'...\\nThen Finn fights Phantasma Plasma or whatever - the chrome-trooper.\\nI thought they threw this character into a trash shoot in the first movie?\\nI thought that planet blew up? I thought this character was already DEAD!!!\\nSurprise - For no reason she returns and guess what??? She dies again!\\nI can't wait to see her return in the next one to have another lame death scene...\\nIt's like Kenny on Southpark who dies every episode...\\nOkay so anything else with Finn? Yes - he was brutally wounded in the last movie.\\nRight? Slashed by Kylo's lightsaber.\\nAnd we are left to believe he is so badly injured that he may even die! OH MY GOD. I\\nhope he is okay!\\nGuess what - he's not only okay - he is completely fine and comically okay. He isn't in\\nany pain or suffering in anyway. He just wakes up at the perfect time and falls around\\nlike he is in a Buster Keaton movie..\\nThanks for taking all the drama out of that moment in the last movie. Yet another reason\\nnot to like Force Awakens...\\nYou would think he may wake up and fallen back into his evil programming to be a\\nstormtrooper. Oh my - maybe Finn is going to be bad? Or maybe he has a wound and\\nphysical problem he must face and overcome in some climatic moment giving his\\ncharacter some type of journey.\\nNope. No journey.\\nHe is the same at the start. And the same at the end.\\nNOTHING HAPPENS TO FINN. NOTHING.\\nAt least Poe had to learn a lesson to stand as a leader and not act out as the fly-boy act\\nfirst think later hero...\\nOkay... So... Let's talk about Poe...\\nThe opening with him was great. The humor was over the top for my taste - it felt like a\\nMarvel movie - like Guardians of the Galaxy instead of the humor of Star Wars - but\\nwhatever - not a huge deal. The shot of the tiny X-wing standing off against the massive\\nFirst Order ship was visually amazing. And it sets us up for a great opening scene.\\nSide note - why was the Ginger General Hux so tired looking at the start of the movie?\\nHe has Racoon eyes like he's suffered a lot between the last movie and this one... Like\\nmaybe he is even sick? I was thinking Ooo this could be interesting if he is suffering\\nfrom something - adds something to his character - nope - they changed his makeup in\\nthe very next scene and he looked healthy and fine\\, so it was just an odd choice for that\\none scene. Great. Good job with continuity...\\nOkay back to Poe - So Poe learns a huge lesson about being the 'Hero' and acting first\\nand thinking second versus acting like a leader. Leia lays into him after so many people\\ndie defeating the giant ship that can only shoot things very far away\\, but not close up...\\nUmmm really? Who makes this crap for the First Order? Oh yeah the idiots at the\\ncasino planet who are so busy abusing space camels they forget to add a decent\\namount of close range weapons on a GIANT FUCKING SPACE SHIP. He had to take\\nout like 6 canons? How is this a FLEAT KILLER???\\nOkay\\, so Poe learns his lesson... Oh wait - no he doesn't.\\nGeneral Leia is blasted out to space - awkwardly floats back to the ship posed as a bad\\nChristmas tree ornament and then falls into a coma. So Laura Dern takes over.\\nRight away Poe asks - WHAT IS THE PLAN???\\nLaura Dern for NO REASON AT ALL - doesn't tell him the plan. So for an hour and half\\nPoe tries to over throw her and sends Finn on a useless mission to 'Left Over Phantom\\nMenace footage Casino Land' and then he has his mutiny.\\nAfter getting shot by Leia he is finally told the plan. The same plan that was in place\\nnearly 16 hours ago or one hour and a half of screen time ago... He loves the plan. And\\nthe plan would have worked but Finn and Rose did nothing so Benico ruined the plan...\\nSO ONCE AGAIN - HAD POE DECIDED TO DO ABSOLUTELY NOTHING everything\\nwould have worked out fine. There is no reason for anything he does in the second act.\\nNo twists. No excitement. BORING. USELESS. TERRIBLE STORYTELLING.\\nOkay\\, - lets talk about the second act. Probably the longest and most exciting Space\\nChase in a movie - ever! Oh wait scratch that. I mean watch as ONE LARGE SHIP\\nCHASES ANOTHER LARGE SHIP at about 5 MPH through space. One is running out\\nof gas for 16 hours and the other can't speed up to get close enough to use their\\ncanons to blow it out of space.\\nOh so this ship ONLY has SHORT range canons...???\\nIsn't this the same First Order\/Empire that has countless Star Destroyers? And\\napparently has other Dread-Nought ships like the one Poe takes down at the start of the\\nmovie? They specifically say its one of many.\\nWHY THE F DON'T THEY HAVE ANOTHER ONE OF THOSE SHIPS fly over and use\\nits LONG RANGE CANONS to blow the rebels away??? Why don't the Eagles come\\nand fly the rebels away to safely with Frodo and Sam...\\nInstead they call in NO ships. NO support. They decide it's best to float in space for 16\\nhours. 16 HOURS!!!!\\nNOTHING IN THE SECOND ACT MATTERS AT ALL. Lazy.\\nOkay. Do we want to talk about the lack of any real villains in these movies or the B.S.\\nthat was NOT Luke at the end of the movie?\\nOkay lets just get it over with...\\nLUKE shows up at the end of the movie. He looks younger. Shorter hair\\, colored beard.\\nHe looks like the 'flashback Luke' in the flashback scenes. Great.\\nRIGHT AWAY WE KNOW THIS IS NOT THE LUKE FROM THE ISLAND. RIGHT AWAY.\\nLike the instant the hood comes down.\\nHe hands space dice to Leia - great scene - great moment with the two of them.\\n(Minus the horrible joke about Leia's hair - this is a joke for the audience - not Luke or\\nLeia. The Characters would NEVER say this. He could give a $&@! about her hair. And\\nit changed all the time. ONLY THE AUDIENCE REMEMBERS THE HAIR BUNS)\\nANYWAY - Luke is handing her a physical object so I start thinking... Okay wait. Maybe\\nhe is there. He physically handed something to someone. So did the turtle nun\\ncreatures on the island cut his hair and color the beard? Or did Luke stop along the way\\nto get a hair cut?\\nWell that's lame that I'm thinking about this instead of being caught up in the movie...\\nThen he steps outside. Where NOTHING INTERACTS with him. We see Kylo leave\\nfootprints in the salt. LUKE DOESN'T LEAVE FOOTPRINTS in the salt. The two of them\\ndo not interact physically.\\nOKAY - thank you for making it perfectly clear - LUKE IS NOT there on the planet. I get\\nit. You have gone out of your way to ruin any surprise here. So there must be an\\namazing end game for Luke to not be there... Nope.\\nThen there is a moment after Kylo realized Luke isn't there. Yeah - No shit - we knew\\nthis forever ago. HOW ARE YOU SO STUPID NOT TO KNOW THIS KYLO? OH\\nbecause you are the weakest villain ever created in science fiction history.\\nHalf of the audience actually seemed surprised by Luke sitting on the island... WHAT?\\nWas I the only one watching the movie?\\nOkay then Luke dies anyway on the island...\\nWHAT? Why not have him on the planet? Why not have him be a BAD ASS and use the\\nforce to take down the walkers. Actually fight his apprentice. And then sacrifice himself\\nfor the good of the many?\\nOh because having him NOT really there and then dying alone is as exciting as a 16\\nHOUR SPACE CHASE AT 5 MPH!!!!!!\\nGood job everybody...\\nDo we have time for Snoke\\, Kylo and Rey? Well the movie certainly didn't because we\\nwere too busy watching other characters do stuff they didn't need to do for an hour and\\na half...\\nI loved that they were trying to bring Rey and Kylo together - bounded by the force. But\\nwhy not use that more? Why not show us them together 'in the force' somehow visually\\nso we see the friendship or even the possible attraction between them. Build the\\ntension. ANYTHING. Nope.\\nRey flies off thinking she can turn Kylo. Why? She hasn't really been trained or learned\\nanything new. She hasn't mastered her powers at all. She doesn't seem conflicted or\\ntempted by the dark or anything. She just casually takes off and heads to the bad guys\\ngiant ship - which is traveling at FIVE MILES PER HOUR!!!!\\nLuke doesn't seemed worried or concerned. Doesn't try to stop her. He doesn't seem to\\ncare... At all. His character has NO INTEREST IN ANYTHING HAPPENING. NONE.\\nRey's journey is like Finn's. NOTHING CHANGES WITH THEM OR HAPPENS.\\nSo lets cut to it. We know nothing about Snoke. NOTHING. The last movie set him up\\nas a mystery. We are waiting for answers. We are also waiting on a major twist or plot\\npoint - something in the vein of 'I am YOUR FATHER' because all of Disney's marketing\\nis saying please don't spoil the movie.\\nAnd here we are. In the Supreme leader's chambers. Waiting for the twist. Waiting to\\nfind out who Rey is. Who Snoke is... And...\\nKylo is able to use the force to turn the lightsaber and cut the \\\"villain' in half...\\nAnd he dies - instantaneously??? WHAT???\\nSo this guy we are meant to fear - who was presented as a bad ass that can kick Kylo's\\nass and control his mind is defeated by the brat that is Kylo?\\nOkay - so I guess we are going to find out KYLO is really a BAD ASS warrior - the\\nleader of the Knights of Ren. He is going to use the force - the dark side - to defeat Rey\\n- and we will now see the real power he has been holding back... It has all be a set up\\nfor the real villain of the series who is incredibly powerful!!!!\\nNOPE...\\nHe teams up with Rey and they take forever to defeat 8 red guards.\\nREGULAR guards who don't have the force.\\nIn fact Kylo is so weak he can't defeat one of them and is nearly killed himself and he\\nneeds the help of Rey. Proving he is a WEAK 'villain' with ZERO threat to anyone.\\nSo Kylo isn't strong with the force? He is still very weak? Then how was he able to\\ndefeat Snoke?\\nOH yeah - NOTHING MATTERS in this movie. Nothing makes sense. And anything that\\nwe needed answers to from the first movie was brushed off and given NO TIME.\\nTHIS movie negates ALL OF THE FORCE AWAKENS.\\nThe moment Luke tosses the lightsaber over his shoulder it is as if Rian Johnson is\\nsaying to EVERYONE - I don't care about the last movie at all. I don't care that you are\\nwaiting to find out where Maz got the lightsaber. Or where Rey or Snoke come from. I\\nam going to do my own thing and you will choke on the beauty of the special effects and\\nJohn Williams score and because it sounds like and looks like Star Wars you will like it\\nno matter what because you just don't care about quality anymore.\\nHe pisses all over the Force Awakens in that one moment. Thanks Rian. Real classy.\\nSo...\\nWho is REY - NOBODY.\\nWow great 'twist'.\\nWho is Snoke? Certainly not the powerful Supreme Leader you were meant to think he\\nwas. In fact he was weak minded and didn't see Kylo use the force to kill him.\\nSo Kylo is more powerful then Snoke. Rey is more powerful then Kylo.\\nWHO IS THE BAD GUY WE ARE SUPPOSED TO HATE AND FEAR IN THIS\\nMOVIE???\\nThere is nothing to spoil after seeing this movie. No twists. No reveals. In fact it is so\\nwrapped up at the end that I see ZERO reason for another movie in the series.\\nWe know Kylo is weaker then Rey. They have proven that over and over again.\\nWe know that there are rebels coming to life across the galaxy - armed with brooms...\\nSo the good guys will have their numbers. And the bad guys don't have any ships left\\nbecause Laura Dern rammed a ship into the other ship...\\nAnd if the BAD GUYS HAD other large war ships they certainly would have called one\\nin to shoot the rebels right?\\nSo at the end of the movie - NO \\\"GOOD\\\" BAD guy left.\\nGood guys are fine.\\nZero reason to see any of these characters again...\\nThanks Disney. Thanks Rian. Thanks JJ. Thanks Kathleen.\\nMerry F'ing Christmas.\\nA few more thoughts...\\nWhy is Poe the one that thinks to contact Maz about finding a code breaker? Poe -\\naccording to anything we know in this world has NEVER MET MAZ. He doesn't know\\nher character at ALL!!!\\nFinn met her once but really wouldn't know to contact her as someone who would know\\na good code breaker. SO WHY IS POE all of the sudden contacting a person he has\\nnever interacted with??? IF he has - WHY IS THIS NOT ESTABLISHED???\\nITS LAZY. PERIOD.\\nAll the fans that are creating their own stories to fill in these GIANT gaps in storytelling\\nare just so desperate to see something that looks like what they love from childhood\\nthey will like ANYTHING that looks and sounds like Star Wars.\\nThis movie is LAZY storytelling.\\nThis is the studio saying - HEY - we want the orange useless character from the last\\nmovie to be seen here too in order to sell toys. So we see Maz for a minute. FOR NO\\nREASON AT ALL. Poe doesn't know her. Finn really doesn't know her. Rose certainly\\ndoesn't know her. Its just jammed into the movie so we see her again. Terrible\\nstorytelling. LAZY.\\nRey's Character Journey.\\nRey starts out as a woman trying to understand her power. A woman seeking her\\nhistory. Where does she come from? Why does she have this power? What is her place\\nin all this?\\nShe leaves as a woman trying to understand her power. She learns nothing new. She\\ndoesn't grow - she isn't drawn to the light or dark. She isn't more aware of anything. She\\nstill doesn't know who her parents are or what her place is in the story. SHE HAS NO\\nJOURNEY AT ALL. She is no better or worse off at the end of the story.\\nZERO has happened to Rey.\\nPoe.\\nHonestly. I don't like this character. The moment he tells C3-PO to 'Shut Up' I no longer\\ncare about him. He isn't charming. Funny. Smart. Or anything. He is useless in this\\nmovie. They want him to be the Han Solo 'type' but Han never treated C3PO like\\ngarbage. He said - Never tell me the odds. He ran away in Empire as he rushed Leia to\\nthe Falcon in Empire - but he still opened the door and pulled C3PO to the Falcon. He\\ngave 3PO a hard time - but never simply yelled like an ass - Shut up. Poe does this in\\nthe cave. It's out of character. It isn't funny. It's just rude. Not at all fun. It's the difference\\nbetween what this movie should be and what it ended up being. No one took the time to\\nmake it fun and joyful. It just 'moments' strung together that DO NOT add up to a good\\nmovie.\\nPoe is not a good or well developed character in this movie. At all.\\nFinn.\\nI've already covered him in this movie. They don't continue his storyline from the last\\nmovie. And he has nothing to do in this movie that helps move the story forward. He is\\nuseless. Nothing happens for this character - he is the same at the start as he is at the\\nend. Boring.\\nRose.\\nThey introduce her as a scared character - someone who works behind pipes and is\\nintimidated by a 'hero' like Finn. However in an instant she is Spunky and determined\\nand strong and she ZAPS Finn and keeps him from leaving the ship. So she actually\\nstarts as a spunky\\, sharp character willing to stand up for what she believes and ends\\nup exactly the same. Why not keep her in awe of Finn. Keep her scared to come out\\nfrom behind the pipes and become a rebel hero like her idol? Then we get to see her\\nGROW and challenge herself to step out of her shell and become a powerful woman\\nwarrior hero.\\nNOPE.\\nSHE doesn't change or evolve at all. There is ZERO on screen chemistry with her and\\nFinn. AND at the end of the movie we are left to believe she may also be dead. Just like\\nFinn in Force Awakens. So I can only assume that means she will be A-OKAY in the\\nnext movie with ZERO after effects... LAZY storytelling.\\nKYLO -\\nAgain - He starts out as a whiney brat who throws tantrums. He ends as a whiney brat\\nwho throws tantrums. He isn't stronger. He isn't smarter. He isn't feared. In fact we think\\nless of him for being so stupid once again that we laugh at him rather then fear him.\\nNOTHING HAPPENS to this character at all in this movie. NOTHING.\\nChewie.\\nI love you Chewie. I wish they gave you something to do. Why does your character look\\nthe same age in this movie as you do in Empire? You looked older in Return of the Jedi.\\nNothing makes sense in these new movies...\\nSnoke.\\nWaste of time. Nothing new learned. Dies a pathetically easy death. It's so easy that\\nanything set up in the previous movie is negated and only makes that entire movie\\nLESS threatening.\\nNO TRUE VILLAIN developed in this movie at all.\\nLaura Dern's character.\\nShe is a strong leader. Smart and capable. She ends the same way. NOTHING\\nINTERESTING HAPPENS WITH THIS CHARACTER. She isn't a spy. She isn't double\\ncrossing anyone. She isn't bad at her job. She is brave and amazing. Which is GREAT if\\nsomething happens in the movie that we care about.\\nNothing changes. Or develops with this character AT ALL.\\nBORING.\\nI guess that's everyone. Honestly I don't see the reason to continue this story.\\nMy BIG issue with the Force Awakens was a lack of a strong villain with purpose. And\\nthis movie tears apart any element of a true 'Bad Guy' with a purpose. And without a\\nGREAT BAD GUY there is nothing for our heroes to do. And this movie proves it. The\\nHeroes had NOTHING to do with any real purpose. No stakes. No drama. No character\\ndevelopment. Just a lot of Special Effects set to a great John William's score.\\nBELIEVE me I want to LOVE THESE MOVIES. But I am not willing to choke down this\\nlaziness and accept it as a quality movie just because it looks and sounds kinda like\\nsomething I remember loving as a kid.\\nWe deserve better Disney. We deserve Better Rian\\, Kathleen\\, and JJ.\\nRebels the cartoon on Disney XD has better characters\\, story and quality. You would\\nthink a GIANT budget feature film could do the same.\\nTruly Disappointed\\,\\nJDH","true":true}