{"101487":186441,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was cringe worthy and just plain old bad. It's clear that either the \\\"professional\\\" critics were either paid off or blackmailed by Disney into giving this dumpster fire a 90% rating LOL!! It's not just a bad Star Wars movie...it's just a bad movie in general. \\n\\n- The plot is filled with gaping holes and completely ignores the questions that were posed by The Force Awakens. -\\n- Outside of incredibly poor acting\\, there is little to no character development and the established characters we do know act contrary to everything that had been established by the previous films...Ultimately ruining the character itself.\\n- The countless cheesy jokes in times of the movie which are supposed to be serious continuously take you out of the story.\\n- The pathetic attempt to stuff every possible social injustice into the movie was enough to make you want to puke.\\n- Ignoring simple things like gravity and the vacuum of space seem evade the director's mind (ie; a bomb drop in space?)\\n- The claim that the Last Jedi is \\\"bold & new\\,\\\" yet copies (bad copy at that) numerous ideas from both The Empire Strikes Back and Return of Jedi\\n- Rose....I'll leave it that. She sucks more than Monica Lewinsky in the Oval Office. \\n- Why should the audience care about ANY of these new bland characters? \\n- The Last Jedi takes place days after the Force Awakens yet Rey (aka: Mary Sue) is apparently already a Jedi master with ZERO training. Luke tells her that he will give her three lessons and only manages to give her like a 1\/4 of a lesson.\\n\\nI can sit here and continue to list everything wrong with The Last Jedi\\, but the list would be incredibly long. The fact is\\, this movie was poorly written\\, the acting was sub-par\\, the new characters are boring and unrelatable\\, they RUNIED legendary characters and killed them off in the most pathetic ways. This will be the first Star Wars movie that I will never watch ever again or own the blu-ray. In addition\\, I will not pay money to see episode 9 or any other Star wars movie going forward. The Last Jedi may have made a boatload of money but that doesn't mean it a good movie. The entire Fast & Furious saga proves that.","true":true}