{"101487":150799,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Look at humanity.  We've had 5\\,000 years to get civilized society right and we still keep screwing it up.  Okay\\, the reason for five stars:  This movie was meant to humanize the story.  It did that in spades.  You don't think people use humor in tense situations?  How long have you been an adult\\, like a few days?  I like tension as much as the next guy\\, but I don't like being kept on the edge of my seat for nearly three hours because it really is exhausting.  They made a VERY long movie that you walked out of the theater thinking\\, 'that didn't feel like a 3 hour movie.'  I agree with the critics on this one.  The story wasn't a full rehash.  There were some old plots that they brought into it.  There were some parts that seemed confusing.  However\\, if you actually study the Jedi mythology and understand their order\\, you understand the entire story line.  Yes\\, you didn't get to see Luke's whole life and mind changing experience.  Trust me\\, that would have made the movie like twenty hours.  They turned him into an old man that didn't really understand that he wasn't meant to be perfect.  If you actually watched the character progression of the first three movies\\, you saw the potential for Luke to lose hope.  You saw the possibility that he would make mistakes.  Luke's training wasn't perfect.  Obviously\\, after seeing the first three\\, you see the jedi weren't exactly perfect either.  Instead of working through the issues with the droid builders\\, they took a more militant approach.  Yes\\, they were tricked into it.  However\\, have you never been tricked into believing someone else was at fault for something when they were innocent?  This is a STORY.  It isn't meant to end happily ever after.  When have you ever seen happily ever after outside of children's stories?  Luke was still a whiner\\, deal with it.  It was a great movie.","true":true}