{"101487":189056,"Last Jedi":"Last Jedi","2017-12-15":"2018-07-18","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"TLJ  Ryan Johnson's entry to the third trilogy of Star Wars Saga. \\nLuke Skywalker is front and center compared to TFA. Hamill gives \\n(Hands Down) best performance As Luke Skywalker & Now Reluctant\\nRole As Mentor. Luke Has Taken Exile And Has Studied The Scripture\\nFrom The Jedi Whils. We (Audience) Learn Of Luke Skywalker's \\nFirst Failures As A Jedi since First introduced to him as a Infinite in \\nSW'S ROTS and then featured In SW'S ANH. Luke Appears broken upon\\nMeeting Rey & SW'S reintroduced to him and caught up to his backstory since \\nlast seeing him is in ROTJ. Rey is eager to start her Jedi training as Luke's Padawan learner but Instead finds a reluctant Jedi Master wanting to teach. \\n\\nSnoke\\, Kylo have regrouped since TLJ  & are on the offensive (ala) Empire in SW' ESB. Ryan Johnson gives SW'S Fans one of the Saga's best & Complex.                              \\n\\n                           \\nSpace battles in the entire SW'S Saga. Fans will need m than one viewing of TLJ to fully appreciate this Battle & all of TLJ. Our Hero's Leia\\, Poe\\, Finn & Rose (new Character) find themselves in a tighter spot than The Rebel Alinance during Rouge One and at the beginning of SW'S ANH. TLJ provides (Arguably) The best Light Saber duel since SW'S TPM Battle of the Fates and one of Most shocking moments inter entire SW'S Saga. Finn & Rose are deployed to find a Code breaker on A planet that houses what can  \\nThe described as an Industrial Military Complex. This new planet is ranLuj by a new entity that manufacture anything from Star Destroyers to X-Wing Fighters & Any Weapon a buyer has coin to spend To whoever has the money to pay. \\n\\nThe Climax To TLJ introduces another new planet and serves as and looks simular to Hoth.This planet has just been scraped clean of its natural resources from previous battles. \\n\\nBenito Del Torro's Character is spot on as Code Breaker and quickly becomes a welcome addition as does Lara Dern's Character.","true":true}