{"101487":121788,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"For me The Last Jedi has absolutely ruined everything I ever loved about Star Wars. I almost walked out and really wished I had given I now can't un-see all the crap the director kept throwing at characters I cared about. On top of that the writing was bad\\, didn't advance the story\\, didn't advance the characters\\, and was more about telling us how silly we were to have been fans in the first place. \\n\\nI'm all for jokes but they fell pretty flat and usually broke tension at the wrong time or screwed with the tone so I kept finding myself being thrown out of the film and just looking at my watch. I actually got pretty bored especially during the whole pointless casino planet side story. Rose was boring and I didn't buy the whole love scene at the end. And how did they not get blown to bits by the walkers or when Finn drags her back across the entire battlefield to the base? \\n\\nAlso was dismayed to see the hole Star Wars universe being torn down piece by piece. If light speed could be weaponised then why not use it earlier in this film or in fact in any of the films. If Yoda can strike a tree with lighting from beyond the grave then in theory he could have killed Vader\\, Snoke and Kylo Ren whenever he wanted. Felt there were heaps more plot holes. Visually amazing though. Probably the best looking Star Wars ever. Porgs appear to have only been included for merchandising purposes as they did not server the story in any way. \\n\\nYou know that awful cringe feeling we all got in The Phantom Menace when Qui-Gon Jinn started banging on about Midichlorians? That is how I felt during so many of the scenes in this movie. Don't get me wrong\\, there were also some good scenes but each time I started to think things would improve there would be some bizarre tonal shift\\, plot hole or clunky bit of dialogue that would throw me out of the movie. \\n\\nAll the critics are praising the director for taking the story in a brave new direction. What direction? The story really did not advance in any meaningful way. It would have been brave for Rey\\, having been rejected by Luke\\, to turn to the dark side and then made Kylo her bitch. That would have at least been interesting and opened up a whole bunch of possibilities for the next movie. \\n\\nI won't be seeing IX as I can't see the point. We all know Kylo Ren is a bit wishy washy and is hardly terrifying. We all know Rey is all powerful and is so perfect in every way that there is no need for things like having to work hard to get good at something. We have all been told there is no such thing as good and evil anymore. The plot of the next movie either will be Rey killing Kylo with a single thought or it will have them both sitting down for a space coffee and quietly musing  on the nature of conflict. Either way it will suck.","true":true}