{"101487":197226,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"With all the fan theories in anticipation of this movie\\, I feel like everyone who disliked the movie did so because they were expecting their own ?vision? of the Star Wars franchise. I feel like those who hated it only do so because they were expecting something different. But TLJ does its job introducing a new lovable set of characters to reboot the franchise. I personally loved it\\, and the fact that people are saying that ?true fans? shouldn?t enjoy this movie is unfair to people who have not seen it. I was reading all these negative reviews before watching it\\, and it definitely made me extremely worried about the film being bad. However\\, upon watching it I felt like a kid again. Excited and amazed by the galaxy far far away. Yes it has its flaws\\, but not enough to ruin the movie. Certainly not enough to claim that it is worse than the prequels. It?s a great time with great twists and is most definitely not predictable. Also\\, I?m assuming that these ?true fans? also reviewed the prequels\\, which all have over 60%\\, so if they thought Jar Jar and Hayden Christian Anderson were better than this\\, they clearly need to rewatch all of them with an open mind. It's also kind of ridiculous how people are upset by the logic of a franchise with talking fish as admirals and old men shooting lightning out of their hands. You came for a movie that takes place in a galaxy far far away\\, yet are questioning it like it is happening on earth.","true":true}