{"101487":129915,"Last Jedi":"Last Jedi","2017-12-15":"2019-03-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I can not tell you how many star wars conversations I've had about the prequels. Every star wars conversation led to discussing why the prequels weren't good and what Lucas should of done. Mind you I saw the phantom menace eight times in theaters. I still could find enjoyment in the films. I'm sure star wars fans can relate. After the force awakens (which I saw 7 times in theaters) I was excited because I thought star wars was going in the right direction. I didn't think the movie was incredible but I could appreciate the bow to the original trilogy and I knew that they would start to form their own unique story in the next two installments of the trilogy...\\n\\nThe last Jedi is a CALCULATED dismemberment or all underlying star wars themes\\, character traits\\, and overall lore. Watching this movie felt like being held down against my will\\, arms pinned\\, feet tied\\, and mouth forced open to recieve a wad of phlem mustered up from the glands of a gamorrean. \\n\\nWatching this movie was torture. \\n\\nIt's like finding out Bill Cosby raped all those women. You can never watch anything he has done ever again without that sulking feeling. No matter how hard you try you can not separate the man from his craft. Your mind keeps screaming out \\\"he raped women\\\"....as it should. \\n\\nThe original Star Wars trilogy will always be my favorite movies. Nothing can ruin that...but knowing what happens to Luke\\, knowing what happens to the universe...it stings. The only way I get through it is rejecting the plot of the Last Jedi. I simply pretend it isn't Star Wars...and in every way besides names and the title\\, it isn't. It's your ex girlfriend wearing a Star Wars hoodie. Sure she cheated on you\\, took your money for drugs\\, told everyone you had a small penis\\, and has never seen star wars in her life. BUT she's wearing a Star Wars hoodie so if you call her a lady dog who lacks any flutter of soul you're just a toxic person. \\n\\nIf you Google Star Wars you get the articles talking about it's toxic fanbase. Hayden Christiansen himself said it best. When asked if he had any advice for actor Kelly Marie Tran\\, who had received hateful messages on social media\\, he replied with:\\n\\n\\\"I don't know if I have any advice for that\\, but just...you know\\, don't take it too seriously\\, because...unfortunately\\, [bullies] are the ones that make the most noise. But the majority of people don't feel that way\\, so\\, keep that in mind.\\\"\\n\\nMind you that I despised Anakin in the prequels. I thought his character was horribly written and I was unimpressed with his acting...but when I went to the Star Wars con in Florida I was PSYCHED to she him there. I have no problems with the guy. It's nothing personal. As a matter of fact I don't think he did a bad job in episode three. I know it's not all his fault. \\n\\nThe very producers\\, actors\\, and directors are lashing out at the star wars community and they are grouping us all together with hateful people. I was pissed at the team but I do not hate them! Few people do! You cannot group all the harsh (but true) criticism together with trolls. Ryan Johnson is on record saying the same people criticising the last Jedi would have destroyed empire strikes back if that movie was released now. HOW? Nobody went to see Solo because of comments like this and because they don't view these movies as the star wars they know and love. Hate or no hate don't come after the star wars community as a whole. \\n\\n\\\"If you're not with me then you're my enemy.\\\"\\n\\\"Only a sith deals an absolute.\\\" \\n\\nThe creators need to understand that they messed up. Not even by star wars standards but by movie standards. The movie had no clear direction\\, a honeycomb's worth of plot holes\\, lack of depth\\, and lines that sounded as dry as Siri's directions. \\n\\nIt's worse than terrible. Money and pretty visuals don't make a movie good. Quite literally a cupcake with poop filling.","true":true}