{"101487":195891,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What the fuck is wrong with the creators of this movie!!!  0 stars.  Wait for it on DVD.\\n\\nI wanted to see the battle between good vs evil from the perspective of the warrior.  It's about conquering shit in the fucking galaxy!!!  It's called Star Wars! I wanted to see some serious fight scenes with light sabers; cuttin' motherfuckers up\\, using to the force to crush limbs\\, heads and shit\\, and having actors do some shit like in a chinese movie fight scene.  Go watch Last Hero\\, with Jet Li and you'll see what I mean. Motherfuckers should have been flying around smooth\\, altering the natural laws of physics like it ain't shit.  Instead they were clumsy and weak.  Need a damn Chinese director to make that shit tight for real!\\n\\nWhere the hell do they think they can get some weak ass bitch to be the last jedi?!! Like they wanted me to believe tom cruise was the last fucking samurai. She was weak\\, like him\\,  and had no damn martial arts skills at all.  Acting was horrible and predictable. \\n\\nBetter plot would have been to let Kylo ren tap that ass and turn that bitch to the dark side.  Later they both fight luke.   As Luke looks like he's done\\, Darth Vader comes from the other side to fight by his son's side and tears shit up.  You see what I mean?!!?!  Instead they bought Yoda back from the other side to burn a fucking stupid temple down with lightning.\\n\\nFuck all the nice little furry animals\\, aliens\\, creatures and beasts that look like they were born near the Chernobyl nuclear power plant.  And fuck all those weak ass social feel good messages!\\n\\nWhats up with all the overt feminism?!?!  When the hell do women tell warriors what to do?  The answer for true warriors\\, NEVER BITCH!  These women today want men to be emasculated.  This movie will be loved by rainbow boys and girls  and this movie wants to promote that fantasy.  But in the real galaxy\\, motherfuckin' Men of superior intellect and physical strength always rule!\\n\\nIf I offended you bitch ass motherfucka'\\, I don't give a fuck what you think!  This was written by a real OG.\\n\\nWill never watch another Star Wars movie unless they make it real and raw.  They had so much dumb shit in this movie that I can't believe they approved this script!\\n\\nLastly\\, I wrote this review because this site on rotten tomatoes is fucking rigged.\\n\\nMay the Force be with you.","true":true}