{"101487":144058,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It was a good Star Wars but not the best. For me\\, this ranks second from phantom menace in terms of good star wars movies.\\nFor the record\\, I enjoyed all the filma but the phantom menace was the least and this one came next for me.\\n\\nSo\\, my reasons for the two stars is the following in order starting with the main reason:\\n\\n1) Johnson abruptly ended the story of this trilogy at the beginning when he had Luke throw rhe light saber behind him. This was the final powerful scene of the force awakens and having it turn into a comedy bit really pulled the rug from under me.\\nYes\\, I understand the argument of \\\"well Star Wars has to change someday\\\" but my argument is that Abrams started a new set of classic style Star Wars movies and people loved it. Why change not even halfway through? Johnson has his own trilogy coming to reboot Star Wars\\, why now ???? Give the last generation of fans their final great Star Wars movies God knows we may not have many left.\\n\\n2) rhe force ghost fight at the end\\n\\n3) The boring casino scene. Total made for movie filler. Out of place  storyline\\n\\n4) Kylo ren being used in little comedic parts. Leave them to Poe and everyone else\\, leave the main badass out of it.\\n\\n5) Johnson making Lukes character into someone even Hamill the man himself said wasnt who the character should have been. This one is the last one because I understood why he didnt want to train Rey\\, he failed just as Yoda failed and Yoda also turned batshit crazy. However\\, Johnson wanted a new start so why even take this fact into consideration if he didnt want to continue the old style of Star Wars?\\n\\n2 stars for it being entertaining and pretty.","true":true}