{"101487":103383,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"And coming to late night TV two weeks later.\\\"\\n\\nAfter watching this train wreck of a movie\\, it is clear to me that this statement was made 40 years too early.\\n\\nSome of the most egregious problems with the movie are the following:\\n\\n1.  Poe's phone call to General Hux is simply cringeworthy.  This attempted use of humor immediately reduces the Hux character to bafoon status.  Can you imagine if Captain Antilles did the same thing to Grand Moff Tarkin in ANH?  This choice by the director was quite simply a horrible mistake.\\n\\n2.  The social justice complaints set forth within other reviews are spot on.  When will companies like Disney realize that people enjoy movies like Star Wars to escape their daily lives and the current political and national climate?  These themes have no place in a movie like Star Wars.\\n\\n3.  The complete destruction of Luke Skywalker's character.  Are we really to believe that the person who turned Darth Vader from the dark side would consider killing his nephew in his sleep?  \\n\\n4.  Force Facetime.  I guess the force now allows you to actually have conversations with people millions of miles away.  Prior force users could only \\\"sense\\\" events.  I guess in 2018 the force has been updated to 5G.\\n\\n5.  Luke throwing the lightsaber away over his shoulder.  Quiite frankly\\, this scene basically sums up how I feel about this movie.  It has taken everything that I enjoyed about Star Wars and cavailierly tossed it away.  \\n\\nCritics have attempted to explain away the negative audience reaction to this movie by claiming that \\\"no movie could live up to the expectation\\\" or that \\\"fans were disappointed that their theories were not confirmed.\\\"  \\n\\nI went into the movie with an open mind and certainly did not expect to watch The Godfather.  However\\, I didn't expect to watch Robot Monster either.  That's what we got;  Robot Monster.  In fact\\, Robot Monster has a better story and is more believable.\\n\\nVery disappointed.  This movie has done irreparable harm to a beloved franchise.","true":true}