{"101487":145789,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've been a fan since the beginning (1977)\\, so believe me when I tell you this movie is terrible.  It takes a giant crap on the entire franchise.  It takes all of the interesting story lines set up from the last movie\\, who is Snoke? Rey's background? etc. and just throws them all in the trash in favor of their new crap story.  The plot is based on a 2 hour long slow speed chase!  The rebels are out of fuel and can't jump to light speed\\, so the Empire ships (which can still jump to light speed) decide to slowly chase them\\, instead of using their light speed to just jump ahead of them or surround them?!?  SO STUPID!  The entire plot is moronic.  This is not a spoiler.  This movie could not be spoiled as it was still born\\, rotten and feted\\, it could not be more spoiled whether you've seen it or not.\\n\\nPumped full of lefty SJW politics.  All of the villains are white males.  All of the new characters are 'diverse'.  Lots of new female characters\\, but they made sure that all of them were homely or even abnormal looking (Rey is from the last movie so she doesn't count) to maintain their feminist creds.  More of this.  They specifically state that 'rich people' (who were minding their own business on vacation) are the 'most evil people in the galaxy'.  Worse than a Sith Lord I guess?  So Finn kills a whole room full of them.  Chewbaca is also evil for not being vegan\\, but don't worry.  I think he turns vegan after the crappy little mini-ewoks give him the sad eyes.\\n\\nHorrible side quest goes on for 40 minutes where Finn and this new girl go looking for some code breaker.  So Finn can jump away from the Empire ships no problem\\, but all of the other little transports can't.  They just float around getting blown up?  Again\\, huge plot holes and logic gaps.\\n\\nThe classic characters are treated like shit.  Leah uses the force to fly through open space like the wicked witch of the west.  It looked so stupid and fake I actually felt bad for the film makers at that point and embarrassed for myself watching such a poorly conceived spectacle.  Luke Skywalker (white male) is completely degraded in every way possible.  He tries to murder Han and Leah's kid in his sleep.  He milks a female alien and then sloppily drinks the milk spilling it all over his face like a retarded cave man.  Not kidding.  That actually happens!?!  Many more examples.\\n\\nThe slow speed chase is finally resolved when one of the rebels realizes if they take their useless crap ship and crash it into the gigantic all powerful Empire ship at light speed it will wipe it out.  So they use their last little bit of fuel to do just that.  Apparently no one in the galaxy had ever thought of this before because at the beginning of the movie most of the rebel fleet is completely wiped out trying to destroy another super huge Empire ship.  In fact if you look at the physics of this 'light speed ramming'\\, it would have been enough to destroy even a death star\\, so what was the point of at least 3 of the earlier movies?  No more space battles for Star Wars.  Just take a crappy little ship and light speed ram all of the enemy's capital ships or death stars.  SO MANY huge logic flaws in the plot!!  It's like they didn't even have a script and were just barfing this thing out as they went along.","true":true}