{"101487":121329,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First of all\\, Star Wars fans need to grow up. All this talk about this movie ruining people's childhoods is just unnecessary hate. Just because there were some things you didn't agree with\\, doesn't mean you need to come out in force and just destroy this movie with hate because it was something you haven't seen before. It's as if nothing will make many of the \\\"fans\\\" happy anymore and I just don't understand how they call themselves fans when they find a way to hate on everything that is Star Wars. There was a lot of hate because The Force Awakens was apparently too much like the original trilogy and then Rian Johnson does something completely different and people still hate it because it is completely different. This hate for everything is something that is seriously wrong with the world and I think people need to accept this movie for the brilliant piece of work it is. It got a 93% by professional critics and the unqualified fans who are just bitter because their fan theories were incorrect and they were shocked by certain twists start rating it poorly. Not everything needs to tie into the original movies (Rey and Snoke) and I think that the development of Luke Skywalker was great because it showed that he had flaws but he was able to come back from that. Luke isn't just some god like being who is incapable of emotion. he started his Jedi training really late and this is shown very well in this movie and how he is incapable of continuing in the Jedi way because he wasn't taught enough on the Jedi way. People think that he should be the perfect Jedi but how can you be when Jedi are typically trained at a very young age but Luke only had a very small window of actual training. I have loved Star Wars my whole life and I loved the direction they went with this movie and I loved how it was different and the twists were so good because I didn't see them coming. I am ashamed of the Star Wars fan base because of the way they have reacted to this movie just because it didn't go the way they wanted. It is extremely immature. This was a truly fantastic movie in my opinion and this is coming from a big Star Wars fan.","true":true}