{"101487":121380,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"first of the plot makes zero sense. it's the slowest\\, most boring car chase in history that could've been over with in minutes had kylo\\, phasma and some troops jumped in a smaller vessel and just flown over to the resistance and killed them. secondly\\, way to much dumb humor that ruins great dramatic moments and fluctuates the tone of the movie constantly to where you question again and again what type of movie it wants to be. thirdly\\, constant missed opportunities that could've made this movie great that they didn't take risks on. the director\/writer Rian Johnson acts as though and hints to the audience that he's going to take risks and make something different but it's ultimately a product of the same old same old. the movie could've been fantastic if Leia would've been the one to die a heroic death doing the kamikaze run instead admiral holdo who literally know one cares about because we just met her\\, if Finn's boring pointless subplot was eliminated\\, if a Jedi (Rey) finally would've been tempted and joined the dark side for once\\, if Luke would've survived having failed 2 apprentices and now him and the resistance were left hopeless and in dispair. it's entertaining but way too long and some of Luke's decisions and and (uncharacteristic) characteristics assist in the films downfall. ultimately it's more of the same in the star wars universe and wouldn't even start to compare it to empire strikes back which amazingly critics have done. would put it more in the middle of the pack or the bottom with the prequel trilogy . ","true":true}