{"101487":121417,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First thing No body hates Star Wars movies like Star Wars fans.They always make stupid theory which never come true. This movie takes very risky steps but the fans are not ready to accept it.\\nFans (during The Force Awaken):- It sucks because it is exact copy of A new hope.\\nSame Fans (Now):- It sucks because it is different than other Star Wars movies.\\n\\nNow coming to my review this movie is brilliant in it's own way. I know there are some flaws in the movie. But the movie is so good that flaws are overshadowed. The movie has excellent direction\\, action sequences\\, vfx\\, sound design\\, production design\\, very good performances and some good character development. The flaw is there in the character development as there are many characters in the movie some are under developed. And BB-8 is badass...\\n\\nDuring The Empire Strikes Back people thought it would be fun popcorn flick like A New Hope. But it was intense and grippy. Now it is regarded as best Star Wars movies till date.I think same thing is going on right now.\\n\\nGo n watch the movie... Don't listen to these stupid people..First thing No body hates Star Wars movies like Star Wars fans.They always make stupid theory which never come true. This movie takes very risky steps but the fans are not ready to accept it.\\nFans (during The Force Awaken):- It sucks because it is exact copy of A new hope.\\nSame Fans (Now):- It sucks because it is different than other Star Wars movies.\\n\\nNow coming to my review this movie is brilliant in it's own way. I know there are some flaws in the movie. But the movie is so good that flaws are overshadowed. The movie has excellent direction\\, action sequences\\, vfx\\, sound design\\, production design\\, very good performances and some good character development. The flaw is there in the character development as there are many characters in the movie some are under developed. And BB-8 is badass...\\n\\nDuring The Empire Strikes Back people thought it would be fun popcorn flick like A New Hope. But it was intense and grippy. Now it is regarded as best Star Wars movies till date.I think same thing is going on right now.\\n\\nGo n watch the movie... Don't listen to these stupid people..","true":true}