{"101487":184961,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is one big mess!\\nI was really disappointed. It's a decent action sci-fi movie but it definitely doesn't feel like Star Wars. The whole movie felt rushed and the audience never gets a chance to get into the characters. I respect the director for trying so many twists but most of them just seem forced and don't lead anywhere. It also suffers from an uneven narrative. There is so much going on in the movie that the audience never gets any chance to focus on anything. This could have worked if the characters were the least bit interesting and they're unfortunately not. For the exception of the classic characters like Leia and Luke\\, most of characters don't get any development. I have to say that Rey and Kylo Ren are definitely memorable\\, but the other new characters don't really bring anything new to the Star Wars universe. Another big problem of the movie is its pacing. Everytime I felt like something epic just happened or is about to happen it either doesn't leave any impact on the story or it gets ruined or it's over to quick. There are also a lot of ridiculous moments\\, that reminded me of the Prequels (talking about the Casino). There were also some moments of really bad CGI which is shocking considering the movies budget. For most of the movie I often got the feeling that they were trying to retell \\\"Episode V - The Empire strikes back\\\" with a few more twists which don't work for the films advantage. Not everything about it is bad and it's surely not the worst Star Wars movie ever but it's definitely a letdown for me and many fans and I hope for a big improvement in Episode IX.","true":true}