{"101487":132750,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If your a Star Wars fan this film is a complete disaster. It is obvious that Rian is either led by the Marketing department of Disney producing a film designed to move merchandise by creating and killing off on a regular basis characters in the same way as football teams change shirts every season or not a true Star Wars fan. As a standalone film\\, the Last Jedi is a good piece of filmmaking - it is a good mix of  Humour and action with unusually for SW characters staying true to themselves. You don't need to have ever been aware of anything related to Star Wars\\, he\\, in fact\\, has trashed Star Wars. This film is not episode VIII but Star Wars rebooted.  As an episode of the Star Wars saga\\, this is easily the worst basically pulling the old it's a dream trick. In the whole stable of \\\"Star Wars\\\" universe\\, it is probably third as an enjoyable piece of cinema which explains the good reviews. For me the Force awakens is the last Star Wars episode\\, everything now is not a continuation of the story but a marketing led endeavour in the spirit of the Marvel universe. The entire tenant of  Critics is not Star Wars fans which is why there is the disconnect between fans and critics review. This film says the last eight films are just totally irrelevant\\, the force is not something that just exists all around us and requires lifelong study and devotion never to be fully mastered. That hard work and a higher calling are irrelevant (guess that mirrors the social media age) to the force being nothing more than a virus that randomly infects beings who are instantly masters with god-like powers - new powers that don't make sense. Meaning that plotholes are now just so massive - come on Astral projection to just allow people to escape. If you can Astral project with that power you could just avoid all this by Astral projecting and wipe out the bad guys. It's as if the Marketing department has said - the force uses must have more powers than all the existing comic book characters - so you have to get rid of the Sith and Jedi no wonder there were so many reshoots after Disney execs saw the footage.","true":true}