{"101487":106196,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-25","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A technically proficient film\\, a bad Star Wars film. Ticks a few Star Wars movie magic boxes but has a Star Trek (episodic) main plot\\, unlikable characters and a messy understanding of the SW lore (and that's important to the people who paid $2+ Billion to see SW:TFA). Firstly the score is in legendary hands and though it lacks any memorable themes\\, it doesn't detract from the visuals. And that is still a good film score trait. The cinematography is some of the best the franchise has scene. And the SFX is for the most part quite enjoyable (but there is no reason they didn't have the recourses to achieve a high standard for SFX). But unfortunately\\, for us\\, the depth of the plot and characters is only skin deep and for the most part\\, the leads are under-utilised and at worse contradictory to what good cinema heroes\/villains should do. Character depth that only begun to establish in TFA is abandoned for no reason and unsurprising leaves you unrewarded for having any interest in them in the first place. New characters and their actions are confusing and unlikable. They respond on a more person to person level\\, dealing with their own melodramas rather and severely lack the ambition to solve the major threat. And as the film comes to an end - there has been no emphasis of any stakes or any continuation from where the characters where at from the end of TFA. The C Plot was pure filler with an all too real environmental message. Which is possibly my biggest issue with TLJ. The plot devices are too normal. Too human or real world (even with our bad jokes). Alien life is relegated to fauna more so in this SW film than any other. And whats worse is that they treat Chewie the same. Apart from the Nurse\/nun frogs on Lukes island\\, the aliens\/creature (a huge part of the SW magic remember)\\, are more like plush toys than actual fleshed out creatures. The casino aliens dont count. They were all the exact same.  Mark Hamill gives the best performance in this film. And he is a talented voice actor\\, wonderful as Luke but not a great actor. Yet he is the best in this film albeit portraying yet another messy continuation from a previously established character... and he agrees (until Disney told him to redact those statements. They are not in a court of law so they can lie about having no involvement in making Hamill do that. Its Hollywood after all). Ultimately TLJ is the combination of a money making conglomerate naively giving carte blanche to director\/writer who had a conflicting agenda and vision of the source material. And who also had the goal to be subversive for the sake of it rather than the need for it. If failure is the ethos of TLJ then\\, well done Disney. Now learn from it. Because the huge backlash for TLJ did happen.","true":true}