{"101487":103956,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Another cash grab by Disney that doesn't want to take the time or effort to understand why Star Wars was so exceptional.  With any story two things drive a viewers interest: 1) casting: Do I want to watch this person or group of people go on this adventure?  2:  Assuming I find the casting attractive and interesting\\, is the adventure they are going on entertaining?  Since this is a saga\\, there is another factor.  Does the story feel connected and a continuation of the previous films?  So the Last Jedi's new generation of actors I don't find compelling.  And the plot and character actions in the film are very bad.  Mark Hamill has publicly stated he disagreed with everything that the Disney writers decided his character Luke Skywalker would act and behave.  If you watch ep 1-6 (that were produced by George Lucas) you'll notice that Disney has disconnected from these events\\, plot points\\, character actions in their Disney Star Wars universe films Last Jedi and The Force Awakens.    Much speculation about the who\\, what\\, where\\, when on Snoke came to nothing when Disney kills off this character and in not in a convincing way.  This film is also very long at about 2 hours and 30 minutes with a huge and pointless subplot that is completely uninteresting or entertaining.  Essentially\\, the only thing this trash heap of a film is good for are clips.  You fast forward to a cool fight scene.  You skip over the writers idiotic diaologue and extraneous scenes and go to a part when Luke has an interesting talk with Yoda.  Its tragic that what was an amazing story has to be officially mangled like this.  All we can do as fans is write our own stories with our imagination about what really happened to Luke Skywalker\\, Princess Leia\\, and Han Solo.","true":true}