{"101487":135585,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I loved the Rogue One movie.  But\\, Star Wars 8 was just a piece of junk.  Rian Johnson has ZERO attention to detail.  I really wish they would have had the sensibilities of the people who put together Star Wars Rebels.  It's not hard to stay within the \\\"rules\\\" of the fantasy universe.  But Johnson obviously was lazier than lazy.\\n\\nI also realize there are two ways to watch a movie.  If you turn off your brain and just experience the movie as a roller coaster ride\\, it's actually quite fun.  But if you turn your brain on and actually think about what is going on... the movie falls apart in many different ways.\\n\\nI drew up a quick list of observations after seeing the movie.  It sadens me that it was this long.  But here are the things that left me questioning the movie.  (Hopefully there are explanations to a few of them... but many are just flat out bad story writing.)\\n\\n1 ) They didn't have their ships fueled?  \\n\\n2 ) They are a rebel base and their fuel is not on refueling ships? (Or cargo ships at the least.)\\n\\n3) And what's with fuel in the first place?  These ships have reactor cores that don't suck up tons of fuel like a WWII navy fleet would.  But ok... we have to \\\"buy in\\\" to the idea that the rebels were super sloppy and left all their ships on almost empty and didn't have any refueling ships.\\n\\n4) Only Poe (a single X-Wing) goes out to confront the dreadnaught?\\n\\n5) And they don't shoot him out of the sky on approach?  Just because he's on a radio doesn't mean his voice is coming from *that* ship.\\n\\n6) And no real Tie fighter force to protect the fleet as he goes in???\\n\\n7) AND he then takes out all the guns on a dreadnaught????  Singled handedly????\\n\\n8) But his guns go off line before the last gun is shot... he's not blown up\\, just his guns are slightly damaged.\\n\\n9) And BB8 is poking his prods at the panel like he's plugging up a leak in a dyke???  Do the writers have any clue on how electronics work?\\n\\n10) And then BB8 miraculously fixes the guns by slamming his head into the panel?  Gahhhhh!\\n\\n11) And the Bombers are sooooo slow????  This is space... even Y-wing engines could get them there faster.  But ok... the bombers have the wimpiest engines ever.\\n\\n12)  And Rose's sister didn't have a bomber over-ride in the cockpit???  Really... they designed these things like a WWII B17 where a separate person is needed to drop the bombs?\\n\\n13) AND it turns out the bomb release is a remote control device????  Like they couldn't put a backup circuit in the cockpit???  Or even give her a spare remote??? \\n\\n14)  AND she has to kick a ladder to make it fall down to her???  These bombers have gravity generators on them???  Really... the designers said \\\"Hey! This is a great idea... let's put gravity generators on these slugs and put crappy engines on them and then not put any backup systems on the thing for the pilot so they could actually drop a bomb.\\\"\\n\\n15) And then she does a miracle catch after the remote falls past her???  What kind of arms does she have?\\n\\n16) And only ONE bomber full of bombs was all it took to take out a whole Dreadnaught?????  This just doesn't make sense.  But ok... First Order Dreadnaughts have a weak spot in the middle that takes out the whole ship if you sneeze on it.\\n\\n17) Luke won't help Rey? He doesn't even have to teach Rey stuff to go out and help his sister.\\n\\n18) The extra long Fishing pole???\\n\\n19) And the Frog people who fix the island???\\n\\n20) Why is Chewie building a fire under the Millennium Falcon when he has food stores on the ship????\\n\\n21) Ok\\, the Porgs were cute and didn't overstay their welcome like Ewoks\\,  But they want Chewie to become a vegetarian???  Why is the Porg crying at Chewie when the cooked one is already dead?\\n\\n22) The First Order has a new device to track ships in hyperspace?  Usually they have a tracking device or a mole in the fleet to track them.  But ok.... new technology... and they only put it on one ship.\\n\\n23) Why doesn't the Resistance fleet just hyperjump in a couple hundred different directions???  The tracking device is only going to track one ship.  Each ship in the fleet could go in a different direction.\\n\\n24) And the Resistance ships are only slightly faster than the First Order ships????  Like they are a WWII navy steaming away on top of an Ocean???  This makes no sense.\\n\\n25) And really... they are almost on empty after one hyperjump???  This makes no sense.\\n\\n26)  And they reprimand Poe after only losing a few bombers while taking out a whole dreadnaught????\\n\\n27) And Kylo doesn't finish off the Calamari Cruiser after taking out the bridge????\\n\\n28) And Leia is able to force pull herself back in???\\n\\n29) But then she's in a coma after she saves herself???\\n\\n30) And Finn is trying to get in an escape pod??? An escape pod to where???  Right past the persuing First Order Fleet?\\n\\n31) And Rose is convinced not to turn him in because of a blinking wrist band???  She has no clue who Rey is.  She should let higher up officials decide if Rey should return or not.\\n\\n32) And Rose is convinced to go against Resistance commanders when Finn tells her he used to work for the First Order????\\n\\n33) And how does Poe know who Maz Katana is?  He never met her in the first movie.  And Finn only met her for a few seconds before running away.  Rey is the only one who talked to Maz with any meaning... and Rey is not on the Rebel ship.\\n\\n34) And why would Maz talk to Poe\\, Finn\\, and Rose???  Let alone help them find a code breaker while she is in a heated battle.  It makes no sense.\\n\\n35) And they steal a ship to go into hyperspace?  And no one has the idea to do that with all the other ships in the fleet in different directions???\\n\\n36) And back to the First Order... they are ok with just trailing behind the Resistance and taking pot shots at shields???  They have multiple Star Destroyers with hyperdrive technology that have pin point accuracy to jump in front of a planet (like in the movie opening).  They could easily have a few ships hyperjump away and then hyperjump back in FRONT of the rebels.  They could even do this with multiple small task forces to block multiple avenues of escape.  It makes no sense why they all just trail behind like they are ocean vessels in WWII with no options but to take pot shots from afar.\\n\\n37) Back on Achchoo\\, Luke only offers three lessons to someone showing force talent?  I'm sorry\\, but three is sadly inadequate considering his last failure.  And giving her no training equates to a greater risk of going down the dark side.\\n\\n38) And he's upset she is pulled into the dark side so quickly with no training?\\n\\n39) Owwww... my eyes... I can't unsee the multi breasted milk thing.\\n\\n40) And what's with the communication between Kylo and Rey.  This is really stretching the powers of the force.  It's like they are on some super improved Skype session where neither of them dialed each other.  And if Snoke was responsible\\, how could he find Rey when he never met her... but yet he couldn't find Luke????  And even when he found her to connect to Kylo... why couldn't he figure out where she was???\\n\\n41) And what happened to her 3rd day of training?  Did I miss it while I was in the bathroom?\\n\\n42) And then she dives into the dark side pit??? And it's totally not scary or threatening at all????\\n\\n43)  I mean really... seeing an image of herself in the mirror instead of Harry Potters parents... I mean her parents... is just not Dark Side of the force-ish.  If anything\\, it was enlightening\\, not something out of the forces of evil.\\n\\n44)  And Luke was horribly upset about her learning *that* message... that she can see herself in the mirror????  And at worse... she doesn't know who her parents are???  Well... that ambiguity is really evil... I'm just overwhelmed by the evil-ish-ness.\\n\\n45) And she believes Kylo after all she's been through?  Maybe his shirtless body affected her mental stability.\\n\\n46) And their force connection allows him to transport water through the distance?\\n\\n47) Ok... I did take a bathroom break\\, I figured this movie was so full of plot holes\\, I really wouldn't have a hard time if I missed anything important.  So I missed where they landed on the casino planet and any plot holes that may have occurred there.  I returned as Fin and Rose were being tossed in the brig.  Not clear what their infraction was\\, but I assume it was for not being high class enough or not enough money to be there.\\n\\n48) I guess it was nice to meet the person they needed in the brig. And he decided to break out with a credit card *after* they arrived and not *before* they arrived.  I must have missed something.\\n\\n49) And BB8 shows up at the right moment to help them escape with a coin cannon??? Ok... I really must have missed something.\\n\\n50) And then they escape through a garbage chute without BB8???? Ok... count me lost.  I'll blame it on my bathroom break.\\n\\n51) I liked the race track critters\\, but they paid for their escape with a rebel ring that Rose had\\, and she had to give it to a kid who had force powers????  It's a good thing Rose was decked out with exotic jewelry.\\n\\n52) Ok\\, nice chase scene and they almost fall off a cliff like the Millennium Falcon almost did in the last movie.  And they free the critter from its harness. (Not like it's not going to get recaptured by whoever gave it it's scars... but... whatever.)\\n\\n53) And... they are rescued at the last second by Code Guy and BB8 in a stolen ship? \\n\\n54) It's not clear how Code Guy then got them away from the authorities so easily.  You'd think a planet with a money filled casino would have a better fleet of space ships to protect the rich people and their money.  But I guess not.\\n\\n55) A mutiny?  Really?\\n\\n56) And sorry... the Steaming Iron spaceship mimic did nothing for me.\\n\\n57) And letting a medical Frigate get destroyed???  Having a minimal crew and letting them warp out would have been a better plan.  Or even an over full ship and letting them warp out earlier would have been better.  Letting it get destroyed... just plain stupid.\\n\\n58) And Rey being dropped off in a coffin pod... also very silly.\\n\\n59) The new style BB unit finding Finn\\, Rose\\, and Code Guy... also very silly.  Too many things are getting stretched in this film.  It would be more plausible that they'd get caught trying to board the ship in the vehicle they used than after-the-fact being spotted in freshly ironed uniforms.\\n\\n60) Cloaking devices?????  Wait... let me give that more emphasis... CLOAKING DEVICES?!!!!?????  What the heck... do think this is Star Trek????\\n\\n61) And where the heck did the Rebel planet come from???  They just motored up close to one???  While low on fuel of course.  Gahhh.\\n\\n62) And why the heck would they tell Finn about the cloaking devices over a radio signal to the First Order ship?  Just so they blow the only cover they had???  Stupid.\\n\\n63) Cloaking Devices?!!!!????  Sorry... that needed a second mention in case you missed it the first time.  This is the laziest writing staff ever to grace a Star Wars script.\\n\\n64) Really??? Code Guy needed Rose's pendant to break into the locking mechanism?  It's a good thing Rose was decked out with exotic jewelry.\\n\\n65) Ok... I get that Code Guy ratted them out when he got caught.  But then the First Order gave him lots of money and a ship????  This Guy should have been tortured and tossed in a cell\\, if not killed immediately.  Stupid premise.\\n\\n66) So now the First Order can see through the cloaks once Code Guy tells them????  But couldn't see through them before????  This also makes no sense.\\n\\n67) Ok... what did Rey really think was going to happen when she got pulled in front of Snoke???  They really should have just killed her off there.  But luckily for her\\, Snoke was dumber than dumb.\\n\\n68) And Snoke couldn't read Kylo's mind???  After all the mind tricks Snoke pulled through this whole movie... covering vast distances... without even having a paid in full Skype account... and he couldn't find a trace of Kylo force pulling the wrong light saber????  I have to call BS on this.\\n\\n69) And I'm sorry... but cutting Snoke in half was way too easy of a death.  This should have been a Rasputin hell death with Snoke's many severed bits living on to kill everything in their path.  Instead\\, he just falls over.  The end.\\n\\n70) And then Kylo has trouble fighting off the guards??? Here is a guy who can stop a laser bolt in midair for multiple minutes and wipe out all the remaining Jedi... and he has trouble with these guys???\\n\\n71) And sorry... the \\\"breaking a light saber in two\\\" with force pulls is just dumb.  It also makes no sense.\\n\\n72) And Rey is able to locate the emperors shuttle to escape?  Let alone fight off any defenders??? Let alone pilot it? And all with only half a light saber.  I guess it was a good thing it was all off camera.\\n\\n73) And Holdor commits suicide?  I mean... ramming the Cruiser into the Emperors ship was a good idea.  But it couldn't be done remotely or on auto pilot while she escaped\\, or by some poor droid left behind?  Or better yet... why didn't they do that to begin with and then warp out with all of their other ships.  They could have even used the Medical Frigate.  They wouldn't have needed a Code Breaker for that.\\n\\n74) Ok\\, this is just a nitpick... but really... they had to create the character of Holdor to do the Kamikaze?  They couldn't let it be Admiral Akbar do the heroic thing?  Instead\\, his character arc gets snuffed out in silence when the bridge is hit with Leia.  So sad of an ending to such a great character.\\n\\n75) And Phasma decides to go slowly with killing Finn and Rose.  Why?  And of course the crash comes at the last possible second in the over stretched death sentence.\\n\\n76) And why does Phasma attack Finn and not go for an escape vessel?\\n\\n77) And Finn falling off the ledge\\, just to be saved by an elevator????\\n\\n78) And then Phasma getting killed so easily after that?\\n\\n79) And BB8 in the walker and it gets ripped apart?  And BB8 is not destroyed in the process?\\n\\n80) And they manage to grab a shuttle while the rest of the troops are scrambling to do the same.  Dumb\\, dumb\\, dumb.\\n\\n81) And Finn and Rose get to the planet before the First Order with two Tie Fighters chasing them AND they squeeze in under the blast door just before it closes???\\n\\n82) What's with the crystal foxes?  I mean\\, they are cool looking\\, but nobody is concerned that a wild native predator has full access to the base?\\n\\n83) And it takes Yoda this long to finally appear to Luke and bop him on the nose and tell him he's learned nothing?  He couldn't have appeared a little earlier and saved the whole galaxy a lot of trouble???\\n\\n84) And really\\, the whole of Jedi wisdom was in just 10 dusty books?  It's a good thing Yoda burnt them to the ground.  It's a shame he didn't do it years earlier so Luke could move on.\\n\\n85) And just how did Yoda use force lightning from beyond the grave?  Just another unexplained Jedi trick.  I mean... why didn't go do that to Snoke?  Or the engines of Snokes ship???  Yep... burnt books is really helpful.\\n\\n86) And really\\, the whole First Order Fleet can't bombard the Salt Skiers?  Or at least Tie Fighters can't take out a handful of ships stuck in a 2 dimensional plane?  With or without the Millennium Falcon\\, they should have had enough Ties to follow the Falcon AND take out the skiers.\\n\\n87) Plus\\, why didn't they destroy Finn with the fire power they focused on Luke???  If it's because Luke wasn't moving and Finn was\\, they've gotta be kidding me.  With all that future technology\\, they can easily target a moving vessel that's not weaving and only going in a straight line to the most obvious target.  Huge plot hole there.\\n\\n88) And why would Rose not let Finn kill himself and instead condemn all the others in the base to die?  Rather selfish of her.  And it would really suck if you were one of the nobodies in the base.  \\\"Hey look! Finn is going to do a Commodore Decker on the Doomsday machine and save us all!  No... no wait... Rose just saved his butt and doomed the rest of us.\\\"\\n\\n89) And how did she catch up to Finn if he was going top speed?\\n\\n90)  I liked the whole force projection idea... but how did Kylo not figure out that Luke had a fully functioning \\\"Luke Light Saber\\\" when he and Rey just ripped it in half a bit earlier???\\n\\n91) And why did the force projection kill Luke?  After all he's been through\\, he dies a lame death like that???  He somehow overused his force energy like he was draining a battery???  Sorry Luke\\, you forgot to use Energizers when performing that trick.\\n\\n92) And Poe figured out to follow the foxes???  And Luke knew the foxes were their salvation?  And he also knew that Rey would show up at the back door?\\n\\n93) And the Millennium Falcon wasn't destroyed in the salt mines by falling pieces of rock salt?\\n\\n94) And there was a back exit from the salt mines?\\n\\n95) And Rey was able to learn how to do a force lift with no training what-so-ever???  Well I guess it's par for the course in these new movies.  She just magically can do what took other Jedi's years of training under a master.\\n\\n96) And really... this is a victory??? Out of a whole army and space fleet\\, the only thing that survived was one ancient YT-1300 freighter and only enough people to barely fill the interior of said freighter.\\n\\n97) And Luke gave up his life for this????  Maybe 50 people survived tops???  The whole Resistance fleet is gone?  And now even Luke is gone.  This seems like an insanely pathetic thing to die for.\\n\\n98) And the First Order couldn't spot the Millennium Falcon as it resurfaced and tried to load the people?\\n\\n99) And Rey can still force connect with Kylo even after Snoke is dead?  I'll buy into Snoke making the Skype connection in the first place\\, but now they are on unlimited minutes after he's gone?\\n\\n100) And they couldn't detect the Falcon trying to leave the planet?\\n\\n101) And what's with the stable kid showing off his newly acquired rebel ring and being able to force grab a broom???  Seriously... he can do a force grab?  No training and not even any contact with any force capable person?\\n\\n102) ok... I won't do a #102.  Since I was in the bathroom for the casino scene\\, I'll save this for when I have a chance to see the movie again on DVD or something.  (Sadly\\, I fear there will be more than 1 plot hole in that time frame.  But who's to say that one has to stop at 102? Rian Johnson is allowed to be as lazy as he wants and we are allowed to call him out for every infraction.\\n\\nIn the end\\, this movie had zero attention to detail.  It blundered along like a Bantha that was in the process of losing its poodoo.\\n\\nWell... thanks for taking the time to read this.  I hope it brought a smile or two as you reflected over the gross negligence that Rian Johnson presided over.  Let me know if I missed anything! :)","true":true}