{"101487":130934,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't know\\, I guess I am in the minority here\\, but I really liked TLJ. I saw it twice and both times I enjoyed it. The entire audience clapped at the end and everyone was talking about it afterwards. I am a huge SW fan and appreciated it going in different directions instead of rehashing everything all over again. We have 2 other trilogies to go back to and enjoy. Sure\\, it's not a perfect movie but to say that it is a terrible movie or the worst Star Wars movie ever? That's absolutely ridiculous. It's\\, by far\\, better than the prequels. Everyone seems to be upset that the story did not go their way. Good! Snoke doesn't need to be the new Emperor. We had an Emperor and he died. The end. Why do we need to know so much about him? The original trilogy didn't say jack about Palpatine yet you accepted him for who he was. It wasn't until the prequels that they gave you the backstory. The casino storyline was fine to me but could have been cut down a little bit. As far as Lukes storyline goes. I was genuinely surprised by all of it\\, in a good way.Did we really really need to see an older Luke in his 60's jumping around doing flips with his lightsaber? For me\\, it's not necessary. Some people seem to forget that the original trilogy was not that deep. It was campy\\, fun\\, funny and adventurous. It was not full of theories and deep content. I feel like these new movies are bringing back some of that content with a touch of theory talk. We are almost all assured that there will be surprising details in the final film and I for one am looking forward to it.","true":true}