{"101487":133805,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have never left the theater after watching a Star Wars movie on opening night with a feeling disappointed until I watched the Last Jedi.\\n\\nTo start.. I'll give credit where credit is due. It's a beautifully crafted film. From a production stand point it is a masterpiece\\, but being pretty can only take a movie so far\\, and Last Jedi felt like an empty shell. A beautiful shell\\, but still just a shell.\\n\\nThis film feels like its nets zero -- just cancels itself out.\\n\\nThe film picks up right where The Force Awakens leaves off\\, except that it doesn't. The status of the First Order and the Resistance have both been inexplicably altered to insert a plot-line for the Last Jedi that really just doesn't work.  In the (presumably) hours between the two films\\, Kylo Ren is more or less completely healed from the wounds he received on Starkiller Base\\, and the Resistance goes from having their fleet nearly wiped out to magically having an entirely squadron of bombers\\, A-Wings\\, and 3 large capital ships. The Visual Dictionary by Pablo Hidalgo tries to fill in these plot holes by saying that they were part of the Resistance fleet that was elsewhere in the galaxy at the time but I have a really hard time believing that Leia would not have committed all their forces to the attack in The Force Awakens. By the end of the Last Jedi\\, the Resistance is basically back to nothing -- where it already was at the end of the Force Awakens. Net Zero.\\n\\nThe majority of the characters in this movie were never allowed to make any meaningful impact. Anytime one was about to do something that would have moved the story along or impacted the plot in a serious way\\, it was either undone or stopped at the last second. The entire film is just a series of gotcha moments. Without going into details\\, this movie is about Failure. All of the characters fail\\, over and over -- which can't further the plot and isn't interesting.  The only realistic exception to this is that Admiral Holdo sacrifices herself in a very spectacular moment to save the remaining members of the resistance -- only this moment itself is also hindered because we don't really care about her as a character yet anyway.\\n\\nI think the best way to describe the \\\"net zero\\\" effect is with this scenario:\\nLet's say it's opening night of Star Wars Episode 9\\, and someone is going to go see it but they only watched The Force Awakens and never got around to seeing The Last Jedi so they ask \\\"What do I need to know?\\\".\\n\\nThere are only two moments in this film that someone going into Episode 9 blind would need to know. Just two. The rest of the story is totally irrelevant to someone going from 7 to 9.\\n\\n SERIOUSLY STOP READING IF YOU DONT WANT TO KNOW. The only two things you would need to know going from 7 to 9 are: Kylo kills Snoke and takes control of the First Order; and Luke (sort of) confronts Kylo and then dies. That's all. Nothing else that happens in the Last Jedi is important enough to NEED to know going into the next movie.\\n\\nThere's no depth in this story. It doesn't expand the Star Wars universe. \\n\\nYou hurt us Rian Johnson.","true":true}