{"101487":146386,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I want to see again and again! I was 7 when A new hope came out. I have been a lifelong SW fan. I've read all of the EU\\, and watched everything. Am I disappointed they didn't do the Zahn stuff? Yeah\\, but they waited too long\\, actors got too old.\\nI see people dissing \\\"it's not my Star wars\\\" too much change\\, then in the same breath \\\"they copied too much stuff!\\\"\\nYou guys are missing the point. Did you not see the framing and visuals? How about the foot slides prior to battle taken from samurai movies. Watch Jet Li's Hero. You will get  this movie better. This was about mythos\\, larger than life heroes. NO ONE will make a star wars as good as we remember. Because of where it is that we remember it. You can't top a member berry. This film made me ooh and aww in ways I have not done since I saw the originals. But it did it in new ways. This is a film of wonders. Have you EVER seen a starfighter filmed like they did with poe? It was like he was on a horse or a Harley\\, you could feel it respond to him. Some of the BEST piloting skill filmed. I'm not liberal\\, and the messages in this movie are kind of universal\\, not just leftist. This is a new legend. New heroes for new generations who will be rewatching these with wonder in 20 years and bitching about the new ones coming out. This a deftly made film. And luke was a bad-ass master samurai who got the respect he deserves. Just because we didn't see his adventures prior to Kylo's fall doesn't mean he hasn't had all of the heroics we wanted him to get. We just weren't there to see it. Ben did the same thing after Anakin. It's a beautiful parallel and love letter while creating it's own thing. Quit taking it all so serious and be thankful it's still here. It would have been worse to tread our old heroes along rather them ride off into the sunset.\\nTo address a few spoilery things-\\nLuke was not portrayed as a coward. He had become a guilt burdened pacifist. There is a difference. The thought to kill his nephew was just a split second sliver\\, I'm sure he had the same thought about Darth Vader. That second happened to be when Ben woke up. It created a tragedy that broke Luke. The guilt\\, the what-ifs\\, all the things Kylo Ren has done Luke feels upon his shoulders. He is eeking out a living doing daily tasks much like his life as a moisture farmer. They leave us to imagine all of his grand adventures. Given the time that passed between Bens conception and his training I'm sure there were many great adventures. \\nWho would want to watch a trilogy of 70 year old actors swordfighting and on a half-hearted adventure?\\nWe would have gotten Indiana Jones and the Crystal Skull\\, which was god-awful.\\nInstead we get Luke being old Ben\\, then Yoda\\, and finally at the end being a complete intimidating Bad-Ass who doesn't even need to fight to win. He came full circle then became one with the force. It's perfect! What more would you want from him? \\nLeia finally instinctually using the force in a breathtaking display out of kid trapped under a car instinct because she wasn't done fighting! It was amazing!\\nIt rightfully retires the old guard and is creating Legends for today. I don't want a retread of Grumpier old men in space. I want my kids to have their own mythological warriors\\, like Finn\\, Poe\\, Rose and Rey as they grow up. \\nWho wants to play with toys and act out adventures of old men and women? They don't. Because old men and women RETIRE\\, and let the younger generation fight. This film is about reigniting hope in the face of despair. The epilogue with the child holding a broom looking into the horizon was a callback to luke doing the same thing.. imagining grand adventures away from his banal existence. This was a beautiful film that was perfect for star wars. I don't understand the hate. I think there is no pleasing most of you.","true":true}