{"101487":152220,"Last Jedi":"Last Jedi","2017-12-15":"2020-09-01","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Loved this movie. THE LAST JEDI was the best\\, liveliest STAR WARS movie since EMPIRE and to honestly demand that the series adhere to the narrowest possible parameters for what a STAR WARS movie can be is everything wrong with mainstream filmmaking today. The fanboys who hated this movie and boy are there a lot need to seriously seek a therapist and get their brains checked out. My only gripe was Rose’s characterization but it’s become pretty minor for me now given the way The Rise of Skywalker made her a side character again! Kylo Ren and Poe Dameron are the best characters in this movie and it was great! They are my favourite characters of this new trilogy. The fan outcry is stupid and I love what Rian Johnson did with this movie! Genuinely enjoyed all of it! It made you care about the characters themselves and not about who Rey is related to or focusing on characters like Snoke or anything around that\\, every plot point you think is going to be important for this movie\\, they take it and slap it in your face and they make you focus on just the characters except stupid fan outcry plot points which is why the audience rating is overall so low\\, but realistically for anyone who has a brain this movie is the best of the new trilogy and one of the better overall Star Wars movies in the whole franchise. The scale was amazing\\, the cinematography was amazing and the plot points tease you and then tell you to screw off and I loved every moment of it. This is the best movie of the new trilogy and I can say that with full confidence\\, I don’t care about these idiot fanboys who are daft enough to enjoy what Rian Johnson gave us because this movie is epic\\, beautifully shot and incredible. The characterization is next level\\, they make every stupid set up from episode 7 irrelevant and I loved every minute of this movie (5\/5)","true":true}