{"101487":169119,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So\\, where to begin... This was both a very good entry and a disappointed one. I don't want to go into specific spoilers. \\nIn general\\, I think the poor audience reviews came for three main reasons: 1) after waiting for Luke to return to the screen (finally)\\, it felt like an opportunity that faled to live up to it's potential by far. The trailers to the Last Jedi seemed like a bait and switch as to what kind of full spectrum relationship we we're going to get between Luke and Rey\\, as did the look in Luke's eye's at the end of the force awakens.\\n\\n2) The underwhelming Casino story-line spread the screen-time too thin and the more important story-lines felt really rushed.\\n\\n3) Rey didn't carry any of the momentum from her hero's journey forward from The Force Awakens and wasn't really the star of this film.\\n\\nThere are many other flaws in the plot devices that we're used to get from A to B to C. The chemistry between Poe and Finn wasn't really utilized. Rian Johnson seemed really focused on creating his own new characters and they seemed to gum up the works with too many moving parts. The plot devices we're problematic.The humor generally was funny enough\\, but often was delivered at times that didn't really enhance but sometimes detracted.  \\nOn to the positives: Some of the twists and turns we're epic. Kylo's story-line was flawless and probably the most compelling character arc. He had great interactions with Rey\\, Snoke and Luke. There was some real genuine creative ingenuity even though it felt like Rian Johnson was overemphasizing making everything completely unexpected over getting the full emotional payoffs of the this epic opportunity. Some things worked in the best way possible and so many of the most important elements we're ultimately unsatisfying.\\n\\nHe also didn't leav the story in a place that's building up towards a climatic 3rd chapter. SO much destruction. It feels like it would take a whole film of building at least just to get to the point to really be ready to have the final installment of this chapter. For a couple days In was left with a feeling of mild dread after the movie.....that it hadn't lived up to it's potential on the central story-lines.","true":true}