{"101487":195648,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What did you do\\, Disney? ... I was very disappointed with this movie\\, but I didn't feel that way during the movie.  It was only afterwards that I was left feeling depressed or underwhelmed.  Star Wars is no more.  I love the original trilogy and even appreciate the story behind the prequel movies\\, although the acting was poorly directed in parts.  How does this movie carry forward the overall arc of Star Wars?  Rian and the folks at Lucasfilm have been navel gazing if they think this movie was any good.  George Lucas should be brought back for consulting.  The Force Awakens was basically a reboot Episode IV with many repetitious themes of A New Hope.  Still\\, it was entertaining and I was hopeful that it would go in an interesting direction with this film.  Smoke was a worthy enemy.  Kylo Res simply is not capable of being the antagonist in the next film.  I won't go to the theater to see it.  The Director and Lucasfilm must love this movie because it 'kills the past'\\, as if to put their own stamp on the series.  All the professional critics love it because they recognize Disney has become a monopoly not to be crossed.  If their goal was to wipe Luke Skywalker's legacy clean - they did a good job of it.  The twist that he considered killing a young Ben Solo is just ridiculous.  Stupid\\, actually.  The never ending chase scene is also absolutely stupid.  It doesn't pass the common sense test.  It seems like the story construct started out with an idea that the Resistance would be reduced to survival and Skywalker would sacrifice himself in the process... From there\\, it seems that the writing was lazy and did not connect some logical gaps and underwhelming twists.  Smoke was a great character whose death did not seem to match his lethality.  Also\\, I don't. understand why it took so long for the First Order to chase the Resistance ship.  Why did Finn have to go to some random planet to get a code breaker?   Rian should reconsider his line of work\\, as well as the folks at Lucasfilm\\, whose greatest accomplishment has been to take over George Lucas work.  They didn't earn it and they haven't respected the characters.   Star Wars was about Luke and Leia Skywalker with the Prequel movies providing the origin of their birth from the relationship of Anakin and Padme.  I don't understand how the third trilogy fits into the saga.  I hope Disney reconsiders giving Rian a blank slate from which to create a new series for the Star Wars Universe -- don't buy into the navel gazing.  What I find most annoying is Rian doesn't seem to be affected by his disastrous effort.  He's so full of himself that he can't see how he took the Star Wars saga off the rails.  Bring back George Lucas to consult and save this franchise.  You've done enough damage... I like JJ's effort with The Force Awakens but I worry his strength is not in pulling a plot line together\\, but to keep us enticed wanting more.  He is great at that and should do better in the next episode.  But\\, please give George Lucas a call.  He can't direct\\, but he knows how to put together a compelling story.","true":true}