{"101487":185272,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is what Prometheus was to the Aliens franchise\\, what Never Say Never Again was to the James Bond franchise.......an atrocity that should have never left the toilet paper that it was written on. \\n\\nCareful SPOILERS:\\n\\n-We wait 30 years to watch Luke toss the light-saber over his shoulder like it was a complete joke. So cringe worthy watch. \\n\\n-Did anyone watch Darth kick ass in Rogue One reflecting lasers and sending them back to his enemy? Luke was around longer and had an even deeper understanding of the force. Why couldn't he do the same to the AT-AT's and the rest of the Hitler youth?\\n\\n-Leia's lungs don't explode in zero atmosphere and pulls some Mary Poppins shit to come back. She was never a huge force player but now she's Neo from the Matrix...please.\\n\\n-Luke drinking alien tit milk and drooling like he ate his first box of Captain Crunch....I nearly walked out.\\n\\n-Captain Phasma(Gwendoline Christie from G.O.T.Breanne of Tarth) wasted in seconds. Might as well bring in \\\"The Hound\\\" to save her and add on to it's nonexistant character build up. She could have gone really far....look at Bobba Fett.\\n\\n-The whole casino scene was pushed by Disney like a 40 minute catalog for their new coming toys.\\n\\n-I guess Porgs are the new Ewoks....where's my hunting rifle.\\n\\n-Luke's fight with Kylo. WTF Luke is transparent and can't be hit but his lightsaber is still a damaging object of matter? Hologram that can do damage? GTFO\\n\\n-Benicio Del Toro....\\\"Sounds like a shit movie\\, ten minutes of work for 5 million bucks\\, ok I'm down\\\".\\n\\n-Rey and Kylo guard fight. Both can lift and toss objects with \\\"The Force\\\" but it's safer to go hand to hand the weapon masters? LOL\\n\\n-Luke has caretakers on a tiny island with couple of huts? Really? Was he that busy sitting there waiting to die?\\n\\n-Finn and Rose....boring....but Disney executives need to be politically correct to appeal to other minorities to cash in on them too. Waiting for the Punjabs with lightsabers in Episode 9.\\n\\n-While Luke's training took decades to fulfill....Rey could move mountains by the end of the show\\, yeah sure.\\n\\n-Laura Dern as a commander? Right....we're Disney and we have to make the feminist's happy too so we can get their money too.\\n\\nI could go on but you get it. Movie needs to be re titled ..... \\\"Star Wars: The Last Terrible Director\\\".","true":true}