{"101487":152250,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Loved what Rian Johnson did with TLJ. Was it different? Yes. Will it divide the fans? Yes. Was it (in my opinion) great? YES! I've been a Star Wars Fan for 25+ years so I am no stranger to the stories. I LOVE the OT. I'm also one of the rare ones who didnt hate the PT. They had flaws for sure but I still enjoyed them. Rian Johnson did what no one expected from TLJ and went there. He challenged everything we know about SW (and the force) and took it to the next level. He gave people what they had complained they hadn't got with TFA (which many called a redo of ANH) and didn't rehash ESB and still no one is happy. Complaints that Luke wasn't Luke and he would never do\/act that way.... ermmmm forgive me but didn't EU (now non cannon) Luke shuffle his way over to the dark side? By showing Luke as human\\, and therefore fundamentally flawed\\, Mark Hamill delivered his best performance to date. He gave us in Kylo\/Ben the Anakin Skywalker we deserved in the PT\\, so conflicted\\, confused\\, torn and utterly heartbreaking that Adam Driver's performance brought me tears multiple times. The scenes between Adam and Daisy stole the movie for me. I was entirely consumed when they were on screen together. Add in Carrie's last performance as Leia (which was magnificent) the feels in this movie were astonishing. Was it perfect? No. But it was the perfect set up for what will be a solid and well done trilogy by the end of Episode 9.","true":true}