{"101487":139720,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I see lots of critics and people attacking those of us that grew up on Star Wars. I can remember living out west with my mother at a time when imagination was our internet. She would take me to the drive-in (yes millennials there used to be theaters outside) to see the Star Wars films that were almost being played constantly. I was 6 years old and remember it very well. It was A New Hope and Empire Strikes Back being played together. I can recall my excitement as my mother clipped the speaker on the car window and us get settled in with snacks\\, drinks and a comfy blanket. \\n\\n I know it may be tough for a lot of you to believe but\\, movies like this did give us hope and sent a positive message to us youth. So\\, yes I am upset at the direction of the new movies and have a right to be. Would if have killed these new writers and directors to give the first fans what they deserved? Would it have been so bad for me to take my daughter to the movie and explain to her who Luke Skywalker was\/is and how he was a childhood hero. No\\, instead we get left wing lunacy shoved down our throats and Luke turned into a grumpy old man. \\n\\n It wouldn't have bothered me in the slightest if Luke would have been represented as the master Jedi he is and trained Rey the right way. Nope\\, not going to happen. Mrs. Kennedy made sure there will be no teaching a woman how to do anything from a man. Rey even gets the best of Luke somehow in this film. Anyways\\, I have said enough. Thank you Mr. Lucas for all the wonderful childhood memories. I will not be taking my family to another Star Wars movie again unless its another release of the originals.","true":true}