{"101487":172286,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Terrible script\\, horrible pacing\\, thematically shallow and forced. Before you automatically assume racism and sexism for my dislike of this film\\, I challenge you to see how this forced message of progressivism can be viewed as racist and sexist in its own right: The protagonist 'goodies' consists of a cookie cutter crew of token races. All led by women\\, including one with purple hair who apparently belongs to the LGBTQ community in the expanded lore (no seriously\\, look it up). Meanwhile\\, all the 'baddies' are white men\\, (Rian Johnson's view of Luke drops him in this spectrum). But it gets more complex and convolutedly sexist: within the 'goodies' the bad qualities are all blatantly attached to masculinity for resoundingly tone def messages. Poe is a constantly called reckless and dangerous with Laura Dern (purple hair) seemingly written into the script so she and Leia could laugh over his uncontious body after a failed 'mansplaining' mutiny. She later makes a heroic self sacrifice which completely undermines Rose's interruption of Finn's sacrifice in which she splains to him that 'we won't win by fighting\\, silly\\, we win by loving\\,' aka don't sacrifice or be heroic because war is bad...don't get me started on her animal cruelty message or Chewbacca's moment of choosing veganism. This film was intended as a statement but it was neither well concocted nor aware of its own contradictions. I want equality and diversity and animal rights and those can exist in a Star Wars universe but I don't go to the movies to be lectured and beaten over the head with Kathleen Kennedy's self-righteous narcissism. She and Disney are at fault for giving creative freedom to some random director who showed zero respect for the franchise. After this film it's obvious (for logical and intelligent viewers) that he is not the messiah they made him out to be. Gravity issues with bombs and laser beams are almost forgiveable but perhaps the biggest tragedy is the complete dismissal of Luke Skywalker. Those who know the real Luke know his portrayal in his movie is a travesty. Apologists will claim it's bold and thoughtful but it just plain isn't Luke. Get over yourselves\\, Disney. Creating a massive divide in viewers is not 'art for the sake of conversation'. It's just a bad movie. The question now is whether or not Kathleen is man enough to admit she misrepresented Star Wars here (and yes that was intended to sound as sexist as this film)","true":true}