{"101487":184664,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is fantastic. I see a lot of\\, now mature\\, amateur movie goers and legacy fans of the series with a lot of complaints and belly aching over episode 8. If you fit into this category\\, before you decide to start publicly knit picking about scientific realism and sticking to canon allow me to point a few key points out here. \\n\\nFirst of all\\, we were all kids when you first set eyes on episodes 4-7. Unless you were well versed in the complexity of astrophysics at the ages of 6 through whatever\\, you really need to shut up and remember the context of knowledge you had when you first fell in love with the saga like I did.\\n\\nSecond\\, George Lucas sucks! Let me explain. Lucas knew episodes 1-3 we're garbage from the start which is why he didn't make them first. Amazingly he did a great job with the original release of episodes 4-7 yet he still managed to later wreak all three with his CGI remastering of them. Remember that?! Now realize that he had decades to hone and refine episodes 1-3 but did that ever happen?  No. So faced with the impending doom of destroying everything Lucas himself created he had two choices: (1) push on and destroy it beyond repair or (2) sell it. Fortunately for all fans he chose the later. \\n\\nThis brings me to my third and final point. There is no way in hell Disney is paying 5.whatever billion to buy Lucas Films just for the rights to make and pay even more to cover all costs for three more movies (episodes 7-9). Disney will be milking Star Wars for another 4+ decades\\, if not longer. In doing so you can bet they'll toss out most original canon on the saga. \\n\\nAll this said I recommend all legacy fans of the saga sit down and first remember what it's like to be a kid and seriously consider what episode 8 would have been if Lucas had done it. Then come back here and offer a serious well thought out review.","true":true}