{"101487":130747,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I do not know where to start this movie is terrible. I had high hopes that Rian Johnson could bring us something great. The base of the story is a good idea laid out by The Force Awakens.  JJ made a good choice in that the force or the Jedi have not been seen since the events of Return of the Jedi\\, and that they are now more myth then anything.  Now a group of hero's making a last stand against a powerful enemy need the help of a once powerful and now broken lost Jedi to turn things around. But The Last Jedi try's and does create some new and great concepts to the Star Wars Saga. But falls flat on bring them to life. You have so many events that happen in the movie that you say wow that's cool only to find out that they have no meaning at all after they occur.  Just wasted ideas to fill in space in a movie. I hope that JJ can look at this film and turn the ship back around. There is little answered in this film only more questions created\\, and the Answers you do get your left thinking there is no way that can be right. Now I hope JJ is not left with trying to tie up all the loose ends and answering so many questions that Star Wars 9 is left to just to become a Q&A session.  I was a fan of Rian Johnson Loved his film Looper that is what gave me hope this would be great but was sadly let down.  JJ I have mixed feelings about his movies. Some I like some I don't. But I Pray he can turn this around and bring us back to a place that older fans are happy with and the younger fans will enjoy as well. Tall order to fill Good Luck JJ.","true":true}