{"101487":127484,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Here are some unorganized SPOILERY thoughts.\\nThis is the most divisive SW thus far\\, and that is exactly what this trilogy needed. Fans complained that TFA was a rehash\\, and now they're complaining that TLJ is too different and doesn't fulfill their expectations. Luke warned y'all: this is not going to go the way you think. It felt like Lucas films was trolling everyone clinging to their headcanons and just pulled the rug out from each of them in the best way. Rey's parentage should never have been the main question from TFA\\, and that is the failure of JJ's mystery box. \\nAside from the storytelling\\, this movie was beautifully filmed and performed. Rian was able to deliver something really chilling and compelling with the force bond scenes. All scenes between Daisy and Adam were painfully beautiful and full of angsty weird mutual pining that felt so new to SW\\, but also so right. Coming out of TFA\\, I was most intrigued by their relationship (Revan and Bastila anyone ?) and Rian delivered something that if concluded the right way in 9\\, could be one of the most epic angsty love stories of all time. \\nNew characters were alright\\, aside from Rose Tico who was incredibly compelling and likeable straight off the bat. Paige was great too\\, she deserved better. DJ was a huge let down. I wished things had gone differently with Leia\\, but nobody could know there wouldn't be another film with carrie :( \\nLuke was exactly how you'd expect after going through what he's gone through. The skywalkers need some group therapy.","true":true}