{"101487":149722,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Let me preface this (spoiler alert) review by saying it pains me to give such a negative review for a Star Wars movie.\\n \\nThe Last Jedi is a terrible movie and here's why...\\n\\n- Snails pace space chase for 90% of the film is stupid. Why is space fuel all of a sudden a thing now? Secondly\\, the moment when Vice Admiral Holdo was going to lightspeed kamikaze into the First Orders ship she would have been shot down before she got that hunk-a-junk even turned around. Cool scene diminished by a poor plot. \\n\\n- The jokes are terrible. Most aren't even funny and there are way too many. When everything is a joke it's hard to take the movie \/ character emotions or decisions seriously.\\n\\n- Luke's storyline. This was a complete waste of time. I was fine with the idea of Luke dying - it was inevitable. However\\, him tossing the lightsaber\\, wanting to destroy the Jedi scrolls\\, not help at all because Kylo Ren went bad? Hello? McFly! This is the same parallel with Obi Wan and Vader. Obi Wan didn't curl up into a ball\\, he passed on what we learned and fought. The other piece that doesn't make sense is how obsessed Snoke and Ren are with Luke. Why? Clearly\\, he's not the real threat and only possess half the Jedi strength that Rey has with effectively little to no training. Weak. Yeah\\, Snoke can force bridge the two most powerful Jedi's in the universe but can't see that Luke doesn't want in on this fight or is not as gifted. Joke.\\n\\n- Finn's storyline. Why was this even in the film? His role added very little other than his battle with Phasma. Finn should have stayed in a comma.\\n\\n- Canto Bight. Again\\, why? So we can learn that there's rich pricks that fund the First Order and Rebels? Gee\\, thanks for that information\\, next. Oh but wait\\, there's more! This place is so important because we learn that \\\"Oliver Twist\\\" and friends are the future of the next rebel alliance. Queue the shooting the star and weak music....Oliver's got a strong grip on that broomstick. I can see the First Order shaking in their space boots now. Good to know force powers are handed out like street candy now.\\n\\n- Snoke. Every movie works well with a classic bad guy and Snoke appeared to be that guy. Powerful\\, scary with unique powers. Well\\, he's dead now and with no back-story or clear agenda other than a force-feeling manipulation between Rey and Ren.  Another wasted storyline from the Force Awakens and onward.\\n\\n- Rose Tico. You seem like a great girl but your character sucked. It's not your fault\\, it's that the writers placed 90% of your storyline on the Canto Bight sub-plot which was terrible. The parallel story with your sister was tossed when gravity in space suddenly exists - bomb drop and destruction of the Dreadnaught.\\n\\n- Leia's force float. It's always exciting to see the force used in new ways. But the best and most effective ways are those that are simple. Lightsaber grabs\\, object toss\\, mind-reading...this was taken too far. Specially from a character that has shown little force ability other than to sense people. Plus\\, this looked so dumb on film. You know it to be true.","true":true}