{"101487":152526,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Luke is nothing more than a coward fisherman who loves alien milk. Leia does a Neo and flies through the Maxtrix. Who is Smoke? We'll never know. Star Destroyers with no tie fighters? Couldn't they have just jumped to light speed and reappeared in front of the cruiser to form a blockade? A high speed chase in space to see a space car run out of fuel. This is quite possibly the worst Star Wars movie ever. Star Wars is done for me. JJ  can't bring this one back to life. Luke has left the building people.\\n\\nToo many jokes\\, no character development\\, and no meaningful connection to the story or canon. Rey learned to use the force quicker than you could make a cup'o noodles\\, Finn and Rose learned to fly faster than Neo learned Kung-Fu\\, and Luke milks alien teets which Rey finds disgusting. Soon enough characters will be buying force powers at the local Rite-Aid. No training required to become a Jedi. I was born with it. I'm special. Um Ok. Darth Vader was the chosen one and could move objects after years of training and Rey does it right after getting a massage from Snoke. If The Sith know their apprentices always kill them\\, would you have your apprentice far away from you? \\n\\nHow did the animal know that they needed to find cover? Why do I know more about Rose than Snoke? Why did Leila slap Poe? Wouldn't a demotion or charges have been sufficient? Why not a force choke while you're at it?\\n\\nThe list goes on...I'm done with Star Wars. RJ needs to stay away from the series imo. Guess the force died with my childhood as did canon.","true":true}