{"101487":141517,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It is a true shame that all of the potential laid out by The Force Awakens was totally squandered . After the events of TLJ I fail to see how Disney could salvage this trilogy. Worse yet \\, all of our beloved characters \\, Luke\\, Leia \\, and Han lead terrible lives after they successfully brought down the Empire in “Return of the Jedi”. This film ruins any imagination or happy ending a fan would have hoped for. SPOILER ALERT: below are the worst moments\/reveals\/lack of reveals from this trilogy ruining film. 1. How did the first order come to power after the Empire fell in Return of the Jedi? Answer: Nope none 2 Who are Rey’s parents ? Daisy Ridley once stated in an interview that it was quiet obvious. Answer: her parents were junkies that sold her off into basically slavery. BIG WIN DISNEY\\, that shocking reveal makes “ No I am your father “ look like child’s play. 3. Who is Snoke. Answer: some old guy that uses the force . Also Answer: We don’t know and even if it gets revealed it’s kinda hard to be excited by what we learn when one takes into account once that he is currently chopped in half. Everyone can finally rest now that this epic iconic villain is dead \\, finally we have revenge and scarification for what he did as a character ( he did nothing) 5. Will Luke be awesome and train Rey? No he will not be awesome and acts more like Walther Matthau in Grumpy Old Men. 6. Will Leia FINALLY get to show if she is indeed a force user? Answer: of course she does\\, by flying through space ! 7. What happened to Kylo Ren and Luke at the Jedi Academy; Answer: nothing cool\\, that’s what happened . 8. What happened with the Knights of Ren. Answer: no reveal and no mention of them . 9. Where does the blue milk come from! Answer: from the rubber breast and nipples of a creepy Jim Henson Muppet. All in all it was terrible.","true":true}