{"101487":129892,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I cannot comprehend the negative reviews of this movie. And Mark Hamill has retracted his negative comments about the story arc for Luke Skywalker in The Last Jedi. Overall\\, my summary is that it was a real crowd pleaser with a little bit of hokem that got rid of the ridiculous need for Jedi Knights being shipped to a magical island in order to be trained. You just need someone with experience in the force to guide them. \\n\\nThere were a few places where the story dragged or strained credulity\\, (*SPOILER ALERT*) like when the princess was propelling herself through deep space after a blast that should have killed her. Much of the time spent on the magical Jedi island was boring and unnecessary. Luke made some poor choices (much as Ben Kenobi did before him) when faced with the dark side. The whole thing could have been a good 30 minutes shorter without losing any story. There was an unnecessary cute bird character that didn't seem to add anything to the story. I guess they were trying for a \\\"baby groot\\\" character. If so\\, they failed. \\n\\nThe action sequences were numerous and successful. The character of Rey was deepened and enhanced in her relationship to her brother\\, Kylo Ren\\, who killed their father\\, Han Solo. There was some cools stuff with Princess Leia's character and how she leads the resistance. My favorite scene in the movie was with BB8 saving everyone in a surprise move filled with suspense. And the stuff with Poe's and Finn's characters was satisfying. Honestly\\, I think Adam Driver\\, as Kylo\\, was clearly the standout performance. Although there was a brilliant little but brief guest star appearance with Benicio Del Toro\\, as the code breaker. \\n\\nThe only other problem I'm having with the Disney Star Wars movies is simple fatigue. I no longer go back to re-watch these movies. The ideas are stale and there is no fresh life in them. Unlike the Harry Potter movies\\, where it was all fresh and new like the books\\, these Star Wars retreads are clearly cashing in on George Lucas's franchise. I don't really have a problem with that. Lucas was terrible with the previous three movies. He couldn't be trusted to maintain the quality of the early movies. It would only take one more bad Star Wars sequel to ruin the whole thing. In fact\\, for some fanboys who disliked The Last Jedi\\, I'm sure they will never come back to watch another movie. For me\\, however\\, I am still hooked. May the Force Be With You.","true":true}