{"101487":169379,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers ahead! \\n\\nI ask every hater to watch TLJ a second time. This is real Star Wars and it is almost everything you can expect as a true Star Wars fan.\\n\\nRian Johnson restored faith in Star Wars and he made the best he could out of the shit he took over from Abrams.\\n\\nJohnson took a lot of risks to give us the best possible twists and great characters.\\n\\nFor example\\, compare Adam Drivers performance from episode VII with episode VIII.\\n\\nPeople were laughing at Kylo Ren the first time he took of his mask. The said \\\"what a funny looking guy\\\" or \\\"seriously? That's the villain?\\\".\\n\\nJohnson made Kylo destroy the mask and brought us a true villain not in the need of wearing a mask.\\n\\nJohnson made Luke throughing away his lightsaber\\, which had a symbolic character to me saying: \\\"what should I do with the shit you left over to me J.J.?\\n\\nRian killed Snoke now\\, instead of making him the next emperor. What a great twist.\\n\\nLea used the force\\, just like we wished get to be in VII. Luke was so damn strong at the end. Yeah\\, that's what I wanted to see. He twisted all of the Empire and the audience using the force like no one did before. Yes I disliked Lukes dead at the end. But\\, as Luke said: \\\"we'll see us soon\\, kid\\\". He'll be back in IX I bet.\\n\\nJohnson brought us Yoda back! \\n\\nThe whole movie is filled with love to Star Wars\\, to details\\, to the magic and life in this universe. The movie is based on a simple base plot\\, which carries a pretty complex build of side plots.\\n\\nI bet most haters just weren't able to realize the complexity of TLJ. This is Star Wars and we should be thankful and supportive.\\n\\nLove\\nAlex","true":true}