{"101487":181152,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film ist just ... meh.  \\nIt was entertaining for most of the time\\, but this is Star Wars\\, and quite frankly\\, I think one should be able to expect spectacular from this kind of name and budget. \\nAnd by spectacular I don't mean one fight scene after the other. I mean dramatic showdowns and fundamental revelations. Why build up Snoke as the big bad if it needs no great skill or sacrifice to kill him? Why do the same with Phasma - how did she even advance to her position if a former garbage man can defeat her in single combat while not even wearing armor? And why bring back Luke if you dial his conscience and maturity back to before Return of the Jedi? Just for the fun of it? Who cares about dramatic arcs and plotlines one can follow? \\n\\nThis film is loud and colorful and tries to tick boxes\\, but without genuine epic drama\\, Star Wars just isn't Star Wars\\, but some generic Avengers-type forgettable romp. Big boom - check. Some laughs - check. Intelligent plot? Real stakes? Fail!\\n\\nThe first one created good characters\\, even if the story was thin and derivative. This one had the chance to use that relatability and sympathy for the characters to create true drama. The fact that I didn't even shed tears when my favorite Star Wars character of all time died is very telling of what kind of film this is: it doesn't touch anything but your timetable and pocket and leaves you completely uninvolved. \\n\\nSee it - don't see. It won't matter either way. Unlike the first trilogy\\, this film won't stay with you.","true":true}