{"101487":134047,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have very limited free time now but I arranged\\, at some personal cost\\, to go to the cinema to see STAR WARS. I was excited to hear that they had replaced the director (which gave me hope as the last one didn't seem to care about the plot: Why couldn't the light-saber be in this pub\\, after all it has to be somewhere in the galaxy?)\\, it had Luke in it (exciting)\\, and I had also recently watched\\, and enjoyed\\, Rogue One. If this was a normal film then I would say that it was merely not worth watching. However\\, as it was STAR WARS it's awfulness left me feeling sad and a bit betrayed. My warning to other fans of the original trilogy - this movie should be considered harmful. No film has ever had the effect of making me sign up to one of these websites and leave a public comment before now. \\n\\nGood:\\n- Luke's ending was good.\\n- Luke was in it.\\n- Leia looked better in this film than the last.\\n\\nBad:\\n- It was boring and long.\\n- I didn't care about any of the other characters apart from Luke and Leia.\\n- It was so bad in places that it can only be considered funny (e.g:one fighter takes out a whole capital ship whilst the pilot prank calls).\\n\\nTo the writers and directors of any future Star Wars film. If you read this please at the very least don't do any of the following without including something in the plot to explain why this was a unique occasion:\\n\\n- Robots which are more effective than humans.\\n- Hyperspace mass driver weapons.\\n- Flying through shields.\\n\\nI don't know why I needed to type simple rules like these please spend some of the millions that it takes to make these films on the script.\\n\\nI know that the magic of the originals may be impossible to recapture. I won't be horrified as long as the film is competent. Just please make something at least as enjoyable as Rogue One. \\n\\nI know I should have stopped typing a while ago. Somehow I can't stop. This isn't even making me feel any better :(\\n\\n*Worst of all* - I feel like the last appearances of Han\\, Leia and Luke were wasted. These poor films can be remade or ignored but those actors won't appear in a star wars film again - sad.","true":true}