{"101487":131318,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I don't usually write movie reviews but since the Last Jedi has came out a lot of hate have been shown toward it. And I don't understand why people are so upset about it. \\nFor those who haven't watch the movie yet don't pay attention to haters' opinions. Make your own opinion of it and go see it. It is really worth a try.\\nThe only fact that TLJ has created such a division among the star wars fans only makes it more unique and captivating. \\nStar wars fans thought that TFA was too similar to the New Hope and now they are complaining that TLJ isn't like a star wars movie at all. What a contradiction ! Or maybe they didn't like it because it was original. It brings them out of their confort zone.\\nFans are upset that their theories didn't turn out to be true but what is TLJ  all about ? To let die the past\\, to turn the page and for me this movie illustrates it perfectly. It is a new chapter for the saga and we have to accept it. It is hard to accept the changement but Star wars needed it. \\nRian Johnson doesn't forget the first trilogy but wants us to discover a new story\\, something bold. \\nI am currently a student in animation and special effects and to be honest after watching The Last Jedi I was speechless\\, it was simply mind-blowing. I rarely feel this way after watching a movie.    \\nIt isn't like it doesn't feel like a star wars movie\\, it was one which dares to take risky decisions and it felt perfectly good. \\nI mean the special effects and the visuals of the movie are totally astonishing. It did feel like a masterpiece to me. And after the movie I directly thought  : « That is what I want to do after being graduated. It is inspiring and creative. »\\nEverything is refreshing and original from the scenario to the settings. \\nKylo Ren's and Rey's relationship is trully the cornerstone of this new trilogy and we cannot not be mesmerized by the chemestry between them. The battles are breath-taking and beautiful in a same time. There are great twits and cliff hangers during the entire film but it has the intelligence to lighten up with humour. The force is so well represented\\, we learn more about it.\\nThis episode is a great addition to the saga. \\nThe petition online is absurd\\, trully ridiculous and unrespectful for all the people who have worked so hard to create this movie\\, so haters think twice before critized so harshly a movie\\, think to all the work behind it. I was so shocked people would go this far. \\nThe Empire Strikes Back had also divided the fans back then\\, but still it is a masterpiece which has marked generations ! So why shouldn't we give a chance to this trilogy and wait to see the IX episode. \\n\\nRian Johnson has reinvented Star wars for the modern generation. It doesn't feel clichés and unlike most hollywood movies\\, the audience experiences great surprises and feel amazed. I would say that the strenght of this movie is that the director has taken risks and did assumed them. Who's to say that it is the worst movie of the saga ? People didn't react the same way about the prequels because it was Georges Lucas but now it is Disney so it would seem logical to bring it down ? \\n\\nJust go see this movie and make your own opinion. Don't be influenced by what you way read on the internet. I am glad to be part of the generations who can see and enjoy this new trilogy. It is one of the best Star wars i have ever seen.","true":true}