{"101487":198369,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Worst Star Wars film yet.  The entire film is anti-male.  It is horribly written and pays no homage to the original trilogy.  You do not have to castrate men to have strong female characters.  One of the greatest sci-fi movies of all time is Aliens\\, which has multiple strong female leads and didn't need to paint all men as idiots to make the females strong.  The Last Jedi is so bad I can't believe I'm even giving it a half star.  This tool of a director and the president of Lucas Film have destroyed the Star Wars saga.  No part of this film feels organic.  It feels like it was written by committee sending out multiple political messages.  It took Luke 3 movies to become a Jedi.  Characters like Anakin Skywalker and Obi-Wan Kenobi trained from the time they were little boys to become a Jedi's and master the lightsaber.  Rey has done nothing to earn the power she has. Every argument I've read explaining why she's so powerful and needs NO training is so stupid I cannot even believe somebody wrote it.  \\\"She's so powerful she needs no training\\\"  \\\"She was already was good with a staff\\\"  \\\"Luke didn't finish his training either\\\"  SO STUPID!!!!  The original trilogy absolutely shows the progression of Luke's training from a New Hope to ROTJ.  The training and evolution of a Jedi (or Sith) is part of the beauty of the original story.  Once you complete your training doesn't make you good or bad\\, but it does make you powerful.  Rey is powerful from day 1 and destroys the mythos of the force.  I have no problem with killing off the original characters and taking the film to new places\\, but destroying the Master\/Student relationship is flat out Star Wars blasphemy.  This director is SO arrogant he thinks he knows what the fans need and can change the rules of the force.  Rian Johnson is a HACK and Kathleen Kennedy is his Emperor.  Luke was the last Jedi\\, and I'm glad I can go back and watch the original trilogy\\, even if Rian HACK and Darth Kennedy have ruined it's future","true":true}