{"101487":148536,"Last Jedi":"Last Jedi","2017-12-15":"2017-06-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just saw it. It was awful! I felt confused while watching it because of so many plotholes! The stupid Finn and Rose romance plot\\, I would've taken that off! Less character development\\, super woman Leia\\, anyone could die out in space and be killed within seconds IRL! \\n\\nThe lightsaber battle with Rey and Kylo vs those red costume ppl scene was pretty cool\\, but not enough to entertain me. The comedy was lame\\, didn't laughed once\\, but a few audience did.\\n\\nAnd the way Rian wrote Luke Skywalker! It was terrible! I couldn't see him drinking those breast milk from creatures! It was disgusting! Who on earth would fucking do that IRL!?! The (sorta) battle scene between him and Kylo (Ben) was sorta cool. I like how Mark had enough energy in him to pull off those massive dodging moves! I'm surprised he's able to do that at his current age! But his death was just stupidly written!\\n\\nAnd the Rey's parents part? Why was that added? Ugh!\\n\\nAnd we hardly know anything about the Snoke character! Such stupid writing! It's like everything was rushed too fast on this movie so they just put it in and didn't even bother of character development\\, the plot or the fans! \\n\\nRian Johnson better avoid going to Comic-Con conventions everywhere cause he's going to get punched by a super hardcore fan of Star Wars one of these days! \\n\\nThere's so many things to add on why I didn't like it\\, and they even added in dialogue from the previous films when Kylo Ren asks Rey to join the dark side which is Darth Vader's line!","true":true}