{"101487":181961,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is a well made movie that is filled with missed opportunities and letdowns! Watching this movie was like having someone take a shit in my heart. They made Luke a coward and gave him no redemption. Dropped plot lines and threw away several characters. Where the hell are the Knights of Ren!? What about the other students of Luke that left with Kylo. Neither Rey nor Kylo received any training! The entire movie occurs over the coarse of like twenty-four hours which makes character development almost non existent! I Spent the whole movie waiting for that great moment that never came(excluding the throne room fight). Did anyone else notice that there is not a lightsaber battle in this entire movie? No two lightsabers come into contact with one another! Where the hell is Luke's green lightsaber? I enjoyed the force awakens to spite its many flaws. I never want to see this movie again and I no longer care about episode nine. I never thought I would say these words. Ryan Johnson should not be making his own trilogy if this is what he thinks star wars should be. The bad writing and screenplay are blatant in the way this movie's plot and characters constantly ignore logic.  As well as the uneven way that male and female characters are written and depicted showing an undeniable bias. There are alot of people that have yet to come to grips with the fact that while this movie is at times entertaining\\, a star wars film should be held to a higher standard than Transformers! The only thing to look forward to about this is the thirty minute honest trailer video they can make ripping this movie apart.  I could forgive alot about this film\\, but the way they depict Luke and the resolution of his story will go down in history as one of the biggest mistakes in movie history and a massive blow to this franchise.","true":true}