{"101487":191610,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Very disappointed in the direction RJ took this movie.  Every great moment was ruined by an equally head scratching one.  \\n\\nI don't have an issue with the way Luke ended but I do have a huge issue with everything else about his character. I don't believe he would ever be at the point mentally that he was. Yoda and Obi were exiled hermits too and were never that far gone...just dumb. No epic light saber\/force power duel between Luke and Kylo in the middle of the movie somewhere??? Massive lost opportunity.  \\n\\nSide missions that felt like filler nonsense... I understand they were meant to teach a lesson but man they did it in a very drawn out\\, boring and non-impactful way that ultimately made me less interested in the characters involved.  No back story about Snoke...nothing about the knights of Ren?  \\n\\nThe most boring space chase in movie history...if the empire has a fleet of ships why don't they just fly in some of those extra star destroyers and flank the rebel fleet....they had plenty of time to do it based on how fast Finn and Rose left and came back.  I like cool new creatures of the Star Wars universe in appropriate doses but at times I felt like I was watching Planet Earth \\\"Star Wars edition\\\".  \\n\\nLast and definitely not least...the forced humor that just completely ruined scene after scene sealed this movie's doom.   I saw this on Friday and wanted to wait a couple days before I left a review\\, thinking my opinion would get better...it's only gotten worse\\, especially after watching the OT on TV this weekend.","true":true}