{"101487":176523,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie had some great action sequences and did a great job of developing Kylo Ren.  Beyond that as a Star Wars film\\, it was a complete fail.  It was obvious that Rian Johnson hated Star Wars and never saw Force Awakens.  The major plot points from that movie like the map to Luke or Rey's parents were ignored or treated as if they were fan invented.  The theme stated in the movie is that the past should be destroyed which was basically the path that the prequel took that ultimately doomed them.  The director took this to heart completely wasting our chance to see Luke Skywalker again instead using Mark Hamill to play something else changing Luke's character from anything it ever was or could have been\\, changed how Jedi training works\\, and stomped on everything set up in the Force Awakens.\\n\\nAs for a stand alone movie\\, a 3rd of the movie was completely pointless other than to be a nod to \\\"Phantom Menace\\\" I guess to show that all rich people are evil or that casinos are?  Had the Resistance leader simply communicated to her followers when there was every reason she should\\, large turns should have been avoided.  It also felt like there was a large group of secondary characters were required to be in the movie and just randomly forced into scenes with little thought.  Lastly\\, while there were only going top be 3 lessons\\, there were only 2 without explanation of where the 3rd went or an attempt to close the loop.\\n\\nJJ Abrams has his work cut out for episode IX.  The first half of the movie should be damage control to wipe away the effects from this movie.  He seemed to understand that there is a connection to the past that should be revered while introducing new characters and new ideas to balance the 2 rather than play exclusively to those who never really connected with the original trilogy in the first place.  I am guessing Disney was never really going to let Rian develop a new saga and only announced he would in order to help with box office sales and give him the \\\"vote of confidence\\\" that coaches so often get right before they are fired.","true":true}