{"101487":184290,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is a hard pill to swallow...  1.  They completely screwed up Snoke by failing to explain who he is\\, where he came from\\, what he wanted\\, how he was able to stay undetected for all these years and finally how the hell he\\, who \\\"knew all and could see all\\\" failed to see the light sabre being turned towards him by Kylo.  2.  What the hell is up with space flying Jesus Leia propelling herself through space...  She was never trained in the ways of the Jedi and only possessed only a small spark of the force.  Is it because she is a woman?  3.  How is Ray able to not only stand toe to toe with Kylo and the red guards without any real training in the force or light sabre combat\\, but how is she also able to lift freaking mountains when we know that Luke had trouble moving a small rock at the beginning of his  training. 4. Luke's death was anti-climactic and they didn't even have him do a single action scene. 5. Luke deciding to kill his young apprentice is completely out of character.  Are you telling me\\, that the man who believed in the possibility of redemption for his father after his father literally killed 6 gorillion people including women and children would not even attempt to turn his child disciple back to light before deciding to cruelly murder him in his sleep. Is Last Jedi Luke really Palpatine in disguise?  7.  Was it really necessary to spend over 45 mins to lecture us on the evils of capitalism in that retarded Casino plot.... 8.  What is up with the purple her SJW gender studies admiral being the only person in the galaxy to know what to do save the rebels.","true":true}