{"101487":186704,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was in the end a disappointment. Too much cgi in some scenes. The interesting hints and questions from the previous movie are either thrown away or given what feels like lazy answers. I don't enjoy what JJ and paramount has turned Star Trek into but I'll will be glad to see him return for the final installment in this saga. I did have some issues with the last film but the tone and structure were far superior in it compared to this movie. This one is filled with cheap jokes every five minutes that just gets tiring and noticeable. Don't get me wrong this isn't a bad movie but it isn't great. The new Ghostbusters was a bad movie this was just okay. It has enough interesting things explored that we haven't seen in a Star Wars movie but it also has enough problems with it to take you out of the movie and think. At times it feels too cheesy and cliche. Is it original?? Not really as I said it's something we haven't seen in a Star Wars movie but not in the Star Wars property as a whole with the exception of Leia in space. I don't think even the extended universe went so far but there has been a Sith Lord holding a ship together in space before. It was filled with damages and holes so he must have been protecting the people on board from space as well. I would give this movie a 59 or 60% rating. I like Yoda returning but not how they handled Luke. I don't mind his change in attitude so much but I doubt he would just abandon his family the way he did. You could have had him seeking further train and unaware of how bad things have gotten instead of having the character turning his back on not only his family but the whole universe. We also don't get to see his full potential and how powerful his force powers have become. We don't really get to see any new force powers in general. There is battle meditation which is canon a very powerful ability to strengthen allies resolve and capabilities while also diminishing the opponents. There are force illusions. Ancient Sith magic. We could have seen Holocrons or Force  ghosts on the dark side that can possess or influence the user. We could have seen cathars\\, miralukas\\, or mandalorians all with a rich background. Even the original Jedi books in the movie is a plot point that goes nowhere and worst literally destroyed before the end of the movie. Overall this movie feels more poorly thought out and scraps the previous movie in order to do it's own thing which is not a proper way to handle a film in a saga. This is an example of how not to approach such a movie. It had some good moments but for the reasons above as a whole the movie failed to impress me. And a lot of the things it did start to explore are pretty hollow and not thought out as much as they should have been. The last movie also had it's problems but didn't plague the movie with comedy every 5 minutes. It set up some very interest story ideas even if it didn't explore the Star Wars universe as much as it could have. The structure and tone was far better in the last movie. This one felt more like Staw Wars 8: Kingdom of the Crystal Skull but even the Indianna Jones movie was better structured with the comedy. As a movie on a whole it was disappointing. I hope JJ brings back Luke as a force ghost and reworks the unanswered questions and hints from seven back into the final installment. For people asking about the knights of Ren. My understanding is that's who Luke is referring to when he mentions Kylo taking other students with him. Another giant plot point from the last movie just thrown aside. The ending also has a pointless closing scene and should have ended it on the scene before it. Hope was still alive with the rebels escape. The final scene just feels tacked on and out of place. And that is also another problem with the movie is that a lot of scenes feel out of place\\, redundant and tacked on.","true":true}