{"101487":140667,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I think Rian Johnson was watching Space Balls (1987 Director Mel Brooks) for his reference to this movie!!!  lol  The beginning starts off like an old Verizon commercial \\\"can u hear me now??\\\"\\, A clothes Iron for a segue... come on Really? What a joke!!!\\n\\nThe Good:\\n- CG is good (better be it's 2017) Light speed blow up of an unnecessary character was cool.\\n- The ending is tolerable... \\n- JJ Abrams is directing episode 9! (what a mess to clean up)\\n\\nThe Bad:\\n- Too many Forced Jokes (No pun intended)\\n- Rey is a \\\"nobody\\\"??? \\n- A movie for Critics\\, Rian Johnson and casual customers...\\n- Horses??? Did I pay to see \\\"Black beauty\\\" or Star Wars??? Don't answer that.  \\n- Vegas Casino???  I thought this was a \\\"galaxy far far away..\\\"??\\n\\nThe Ugly:\\n- Lea \\\"Poppins\\\"??? huh?? Lea floats in the ship but nothing floats out? Interesting... and who taught her how to keep warm and hold her breath in space???\\n- Snoke couldn't see Kylo's hand turning on the light saber?? He couldn't see that coming?? Really?? (That better have been just a hologram of Snoke..)\\n- Luke got his butt kicked by Rey... and she's a \\\"nobody\\\"?\\n- I guess \\\"training\\\" means using simple words and sentences like \\\"just breathe..\\\" wow\\, could someone \\\"train\\\" Rian Johnson to \\\"just leave...\\\" the Star wars universe?? Ha! \\nNo doubt he has skills\\, but it's difficult to use basketball skills in a football game... just sayin. Thanks for the effort! Could I get a refund please??","true":true}