{"101487":184024,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie has a lot of issues that were ignored or make no sense.  The Force Awakens sets up a good story for the new trilogy but Rian Johnson just ignores anything that happened in the previous movie altogether.  \\n\\nThe Last Jedi takes place immediately after the Force Awakens.  Despite the Resistance having a  major victory over the First Order in the previous movie\\, it has now become a weak garrison of only a few ships.  What happened within a few short hours within the story.  Did 90% of the Resistance just decide they didnt want to fight anymore? It makes no sense.\\n\\nRey presenting Luke with his fathers old lightsaber.  Luke's reaction \\\"throws it over his shoulder like its a piece of trash\\\".  This makes no sense.  Luke valued the heirloom in the previous installments\\, he would just toss it aside like an old pair of shoes that are worn out and you no longer want.  Johnson changed Luke's character entirely.  In the Force Awakens Luke had left a map to find him\\, when he's found we learn\\, that he just came to the island to die.  Why even setup a story line in the Force Awakens centered around finding this map to find Luke Skywalker?  It makes no sense.  Luke goes from being the most optimistic and hopeful person in the franchise to a cynical old man who's give up on life.  As Mark Hamill stated \\\"he's not my Luke Skywalker\\\" and I can one hundred percent agree.  He's Rian Johnsons Luke Skywalker\\, which is nothing like the original character.  Luke teaches Rey a few short lessons and bam she's the most powerful force user in the galaxy. It makes no sense.\\n\\nThe force awakens sets up Snoke as an interesting character that we are interested in learning about but what does Johnson do? He kills him off within 5 mins of being on the screen.  At the end of Return of the Jedi\\, our heroes are victorious and have beaten the Empire\\, by the time of the Force Awakens we learn that another threat has arisen \\\"Snoke and the First Order.\\\"  How did this powerful being pose such a threat to undo everything the Rebellion accomplished in Return of the Jedi\\,  how did he meet Kylo Ren to turn him to the dark side\\, where did he come from? etc.  Johnson doesn't care\\, he just kills him off and were left thinking why was Snoke ever created in the Force Awakens\\, he's useless without some back story or knowledge of knowing how he was able to accomplish so much.\\n\\nFinn and Rose's side quest\\, is a total waste of time.  They go to a casino planet to find a code breaker and for what? Nothing. They don't progress the story line any further. Their entire story line on the casino planet is for nothing.  \\n\\nThen above everything else\\, Johnson kills Luke off at the end of the movie because\\, what? He was exhausted from using the force.  Come on why would Luke just use the force\\, exhaust himself and die.  It make no sense.  \\n\\nI could write a few more paragraphs describing some of the pointless plots or points that happened in this movie but I feel like I'd be at my laptop a few more hours.  Rian Johnson should have listened to Mark Hamill when he said he disagrees with everything that he was doing to his character.  Its obvious Johnson has never seen the original star wars or just doesn't care about anything that it or the force awakens setup.  The original three movies and the force awakens may as well night have even happened since Johnson changed everything in the Last Jedi.  Overall Star Wars is dead and what could have been a great follow up to the force awakens is nothing but a big pile of shit.  A third grader could have written a better story that made more sense than what Johnson has given the fans.  This being a Star Wars movie\\, he was never going to make everyone happy but at least continue with the story elements (characters & plot points) that the previous movies setup.  Overall a horrible movie\\, I'm going to pretend that the new trilogy never happened and that the story stopped at Return of the Jedi.","true":true}