{"101487":199575,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Writing this review to point what I'm certain others have noticed - that many of the \\\"5 star\\\" ratings are total BS. What I'm typically seeing are brief\\, very basic statements by so-called real people providing reviews. Most only type one sentence or state extremely basic concepts about why they liked the movie (ie. \\\"Loved the humor\\, great acting....WOW!).  It is so obvious what is happening.  The other important point is that the score is presently holding tight at 51%\\, despite the fact that it certainly appears there are A LOT more half star ratings then five star ratings.  And this is going back several hundred reviews.  Perhaps I'm wrong but that sure seems to be the case on the surface.\\n\\nEveryone - yes even Disney - knows that \\\"The Last Jedi\\\" is terrible and they are in serious damage control mode.  They are even trying to shut up Mark Hamill\\, who was very vocal in interviews about his thoughts on the film.  It's so sad to see this happening and I feel terrible for Mr. Hamill.\\n\\nI would like to mention that I have watched Rogue One dozens of times and consider it to be on par with Empire Strikes Back.  Wasn't a huge fan of Force Awakens but hung in there hoping the return of Luke Skywalker would make a difference.  \\n\\nAlthough it will likely never happen\\, if Disney were to publicly apologize and create an \\\"alternate\\\" version of \\\"The Last Jedi\\\" that is much more along the lines of Rogue One and Empire Strikes Back\\, they might save a few hundred thousand die-hard fans.  What has happened is a total disaster to the Star Wars universe.  Terrible story\\, acting\\, etc.\\n\\nAs with all films which have sequels\\, the effects of poor execution take awhile to filter through to the bottom line. Sure\\, \\\"The Last Jedi\\\" will likely make $1.5 Billion at the box office and this will be seen by many in the media as a success.  However\\, Episode 9 - even if it's really good - will feel the effects of this utter\\, complete disaster.\\n\\nRian Johnson is delusional to think he got anything right with this film.  Such a disappointment.","true":true}