{"101487":170316,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-13","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi overall captures the essence of the Star Wars saga immaculately and does so in a manner entirely different to the approach of The Force Awakens. This continues from where we left with Rey who continues her quest to learn the ways of the Jedi from Luke Skywalker. Meanwhile Poe and Finn go on their own adventures whilst the threat of the First Order looms large. Rian Johnson has delivered a solid entry in the Star Wars franchise that builds on the new characters and relationships established in The Force Awakens but also doesn't forget to honour the history of the saga. The story here is rich with unpredictability and offers a number of genuinely surprising moments that will no doubt keep you hooked to the very end. Johnson also delivers on a number of incredible and exciting action sequences\\, some of which definitely rival all those that have come before. \\n\\nOne of the more exciting prospects going into this movie is catching up with all of our favourite characters both new and old and how the events have since shaped who they are. And I feel like almost every character is utilised in a satisfying manner true to their personalities and contributing in their own unique ways to the overall plot. The performances behind the characters are very emotionally rich and well executed across the board. Daisy Ridley shows how she has a firm grip on who Rey is and delivers a strong\\, layered performance that really stands out. Mark Hamill kills it as Luke Skywalker and in case you were wondering\\, yes he does speak this time\\, and that's as far as I will go speaking about Luke. Adam Driver does an incredible amount of work here to bring so much more understanding to Kylo Ren and the way his mind works that his development here is one of the biggest take-aways. You also have the rest of the cast from John Boyega and Oscar Isaac to Carrie Fisher all playing their parts as required. \\n\\nBut I wasn't too keen on absolutely everything revolving around the characters as there's one character unfortunately failed to really connect with. Kelly Marie Tran's character Rose and her storyline and overall arc throughout this movie I aren't a huge fan of. I just didn't resonate with the character as much as I believe her story called for and that did hinder my enjoyment of scenes following her journey. That's where my main negatives lie with this film\\, with the way some of the side plots develop in contrast to some of the larger events going on. I found myself being wholly invested in some of the side plots but dropping in and out of a couple others which is a shame. But every storyline has its moments of excitement just some more than others. \\n\\nBut then you get to the action sequences and whether it's a space battle or ground warfare it's just straight up incredible. The visual effects are astounding and the music plays into every scene amazingly locking you in to the awesomeness of all of these sequences. I'll keep my exploration of the action sequences to a minimum but just know that there are some absolutely beautiful shots\\, one of which my jaw literally dropped upon seeing it. But I have to once again highlight the fantastic job Rian Johnson has done with this movie pulling together so many moving pieces and making a very gripping\\, emotional\\, and most importantly; insanely fun movie. He bought his vision into the Star Wars saga and has created a product that I guarantee you have not seen in the franchise before. \\n\\nSo in the end I don't need to spell it out for you\\, you either like Star Wars or you don't if you do you're already watching this\\, if you don't I won't change your mind. It does drastically change up the game as far as the typical Star Wars formula goes but at its core it still exhibits all of the common tones and themes familiar to anyone who has seen even one of the other films. Much of this movie is shrouded in secrecy and for good reason because what it contains are moments that should be witnessed for the first time on the big screen. As for where this sits amongst the other Star Wars films\\, it's too early to tell but the handling of some storylines\/characters I ain't a huge fan of so that does hold it back a little. \\n\\n8.4\/10","true":true}