{"101487":175254,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is an insult to both the characters and to the audience. Overwhelming bad; please fire the writer! There was zero creativity to this plot; it just ripped off\/duplicated the movies before it and did it badly:  Kylo killing off other force trainees in the temple\\, Reys scene with the mirrors (remember Luke in the cave while training)\\, Rey coming in to save the day in the Millinieum Falcon\\, Snoke attacking Rey\\, etc. etc. I could go on and on. Some of the plot made no sense whatever. Leia flying after never using the force before--really? Rey magically mastering the force. The tree and the books--yoda--and then the destruction of the tree and books!. Good grief! What a mess! But the worst is Luke becoming a self-centered\\, unempathetic grump that doesn't even care about his family\/Leia. People do not violate the essence of who they are just because they failed. Luke cared\\, and would not have turned his back on everyone.. A total violation of his character. And then when Luke eventually decides to help the writer kills him off. (So why does Luke have brown hair in that scene?) Luke's character grounds\/is the force behind this series. And Mark Hamill is an amazing actor. The series loses it's soul without him. That the writer felt he needed to kill of the old characters in order to foster the new reveals his inadequacies\\, laziness\\, and failure as a writer. Daisy Ridley and Adam Driver act their hearts out but our given a redundant\\, weak\\, illogical plot to work with. Poe is an empty vessel. Laura Dern is miscast and the character seems brainless; why were most of the rebel transporters destroyed before her brain cells fired up and she realized she could ram the empire's ship? The over abundance of animated animals thrown in for laughs destroys the dramatic tension and reminded me of a children's animated movie. And the gamblers? Made no sense. The writer and director have ruined this series. I'm done with it. Shame on you!","true":true}