{"101487":156789,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-11","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not a good movie. I liked all the other star wars movies before this newest trilogy but these new ones are really bad. Sith lords are now relegated to having a 3rd really old looking senile and arrogant people that will die after doing one or two lightning shots (really unimaginative and a failure in character story telling that they let snoke die without learning anything about him other than face value stuff like he is a copy paste sith lord). Then we have Kylo Ren who is always looking like he will cry and is ... a copy paste again ... he is just like anakin in the 3rd prequel movie where he's an angsty teen with rubbish emotional development  because becoming a sith in your teenage years means becoming incredibly emotionally under-developed and struggling to have logical thought beyond an urge to seek power. No characters in this movie did or said anything intelligent but worse of all the movies were worse than the prequel trilogy because at the end of the day they at least added and illuminated some important story elements like how the empire got it's army\\, the politics of that world\\, how darth vadar came to be etc. The new movies don't feel like anything important happened and nothing ties in respectably to the older series and feels like a real continuation. New powers like creating illusions of themselves (across planets I may add) lost their value when they started pulling them out their butts illogically (like Luke who has not trained for years and still manages cross planet illusions). \\n\\nSadly the movie has a lot of crappy portrayals of boring characters\\, a hamstrung love scene from characters who didn't even show any romantic feelings before hand and then a butchering of the classic characters (mark hamilton himself saying the portrayal of luke was bad). Ultimately the movie is really\\, really\\, really bad. There's stuff to like but for a star wars movie I would have to say it didn't advance the world at all\\, in fact it only made me scared that they have ran out of ideas and will continue to make sith have one personality type.","true":true}