{"101487":133196,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I grew up watching Star Wars and couldn't wait for the new additions. The Force Awakens set the stage for a great episode 8... and The Last Jedi totally dropped the ball. I've never been so disappointed with a film. I don't even know where to start a list of failures with this movie. What makes this so bad is the incredible potential the story line had. The director and writers have squandered stewardship of a wonderful idea. I think Mark Hamill gave one of his best performances and deserved a great story. Unfortunately but wasn't given a even a good story. Fin and Ross's side story was week\\, disjointed and a waste of screen time. Luke never trains Rey. We never learn the back story on the Knights of Ren (or the First Order for that matter). The commander of the rebel cruiser (I can't even remember her name) made a great sacrifice but her character was so poorly put together that it drained the power from her sacrifice. It seemed as if this movie served no purpose other than to set the stage for future Disney spin offs (i.e. lets rush to get beloved characters off the scene so we can introduce week characters who can take the Star Wars saga in multiple directions with multiple movies and make lots of money for Disney). I like much of what Disney has done in the past (Toy Story\\, the early Avengers movies\\, Incredibles\\, etc.) but they blew this one. To love Star Wars so much only to be handed such a terrible product is disheartening.","true":true}