{"101487":145980,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never posted to RT and hopefully never will again.  I am one of those that grew up on Star Wars and have been a die hard fan since I was very\\, very  young.  That said\\, I just can't believe what I saw in the theaters.  I get the whole idea of \\\"Star Wars has to evolve past the Skywalker sage\\\" but did it have to be this fast?  And\\, this poorly done?  \\n\\nWhen TFA came out\\, I couldn't wait to see it again.  There was so much to unpack.  It also brought about many story lines that were very interesting and Disney pumped as major threads for 2 years following TFA: What is Luke going to do?  Who are Rey's parents?  Who is Snoke?  Who are the Knights of Ren?  Just to name a few.  Disney for 2 YEARS TEASED US THAT THESE STORY LINES WERE MEGA BIG DEALS...and you know how they resolved these questions...Luke nonchalantly tossing our favorite childhood toy over the cliff\\, Rey's parents revealed in a whim of a breath\\, Snoke\\, being the big bad guy that can use the force to move people around halfway across the galaxy...killed by a wanna be bad guy that got beat up by Rey who never held a Lightsaber the first time they fought in TFA.  And the Knights of Ren\\, which could totally have been really cool...not even mentioned.  Its like JJ Abrams set up Rian so perfectly and Rian managed to completely screw it up.  Every single story line we looked forward to seeing more of...was thrown aside for a new story line that we are to now seemingly care for.  But why?  Why sit and theorize for 2 years to have the story lines just tossed out that you set us up for?\\n\\nThese are just a few of the issues I had with the film.  I could go on an on about Luke and how big of a mistake that was to characterize him like that. It didn't make any sense.   I could go into how I don't really want real life themes in my Star Wars...ever.  I mean seriously\\, what soulless person in one moment wants to free the captured \\\"horse things\\\" and not the little children that are slaves?  And then the next moment wants to save Finn from himself as he's about to save the day and the entire Resistance?  I mean seriously\\, if Luke didn't show up Rose would have been the Resistance died.  And don't get me started on Leia pulling a Mary Poppins.  And what the heck is with the dumb humor that takes me out of the experience every time it is forced.\\n\\nI now am going to see it a second time not because I want to and look forward to it\\, but because I feel like I'll lose part of my Star Wars soul if I don't.  That's not a good place to be in as a Star Wars fan.  \\n\\nI wanted to see Luke as the Obi wan from A New Hope.  I wanted to see him train Rey properly and pass along the Jedi baton.  I knew Luke had to go as some point\\, but why in VIII\\, why not in IX?  I've been a fan for 35 years.  I deserved better.  Disney\\, you're going to be pumping Star Wars movies out for the next 50 years.  You should have given me one more go with my childhood in this trilogy.  I would have easily handed you my money.  Now\\, my childhood love is is staying with Chapters 4\\, 5\\, and 6...and I so badly wanted to include 7\\,8\\, and 9 into those fond memories.\\n\\nSo with all that said\\, I hope JJ Abrams can save the say in IX...and I hope that Disney takes back their offer to Rian for the next trilogy.  \\n\\nWays to save this current Trilogy:\\n1) Snoke isn't dead.\\n2) Rey goes evil and Kylo goes good.\\n3) Luke isn't dead.\\n4) Story lines from TFA somehow get resolved","true":true}