{"101487":116743,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Does anyone else think that the newest Star Wars and \\\"The Force Awakens\\\" are the worst installments in the franchise since Episode I? I would even say\\, much worse than Episode I\\, even with Jar Jar Binks and Anaken being ridiculously corny....at least Episode 1 had some pretty large scale battle scenes\\, the most badass villain of them all (Darth Mall)\\, amazing light-saber fights\\, and a plot that made since. \\n\\n- Kylo Rin has to be the lamest bad guy to ever hit the big screen. I mean\\, what does this guy really do other than cry and hit things when he's angry. He is a terrible light saber handler\\, and is such a little baby. \\n\\n- Luke brushing his shoulder off\\, and then doing the matrix move....LAME\\n\\n- Disney just came in and added the most corny humor and dad jokes to what is supposed to be a multi-plot and serious movie series (like Rogue One did so perfectly) \\n\\n- When they all say \\\"may the force be with you\\\" it's all so out of context and forced out its literally ear piercing. \\n\\n- what is up with Laya doing \\\"Mary Poppins\\\" float back to the space ship\\, wtf? \\n\\n- Anyone else catch when they dropped bombs on that big destroyer? You cant drop bombs without GRAVITY.\\n\\n- having this retarded space chase to a little moon where for some reason a little cargo ship is outrunning a starship and for like one hour they are just like \\\"ohhhh not so fast! I'm gonna get you!\\\" They couldn't think of anything else?\\n\\n- what was the point of Finn (also a bad character) doing the \\\"Independance Day\\\" suicide run to heroically save the day get totally interrupted by his new gf... with absolutely no repercussions at all? Like what was the point there? Not to mention they crashed in front of the Entire first order army... and the walked safely back to the bunker in like 5minutes LOL \\n\\n- and how the hell does R2D2 just show up in both movies out of no where just at the right time? And why the hell didnt he give up the map to Luke sooner? So dumb!\\n\\nROgue One is the only thing they have done right so far. \\nOnly thing good in the last Star Wars were the little orange penguin birds. Those guys are hilarious. \\n\\nTo me this feels like an utter butcher to the franchise\\, that I loved so much. JUST LIKE the ridiculously long\\, corny and terribly done CGI Hobbit movies that came after The Lord of the Rings. Which was serious\\, and awesome and had so much depth.\\n\\n...or when Daft Punk came out with Random Access Memories and stabbed everyone in the back who had been waiting 10years for another ALIVE or Homework album. Such a disappointment.... BOOOOOOOOOOO\\n\\nOk Rant Over","true":true}