{"101487":183233,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-31","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the worst SW movie ever made. Visually it might be the best. But the writing is all over the place. The tone is incredibly jarring and inconsistent with jokes inserted during a lot of serious moments. The plot is a mess as characters have to act a certain way for the plot's sake even though it doesn't make sense. The acting is also well done. Adam Driver and Mark Hamill are amazing. But the characters are shallow and uninteresting. They're either too powerful or too incompetent. Rey is the most out of place character in SW as she can do things that no force user ever could with the amount of training she received. Anakin and Luke look like incompetent children when you compare them to Rey which makes this movie stick out in the SW saga as being incredibly inconsistent with the Originals\\, the Prequels and even TFA\\, with plot points disregarded as if they're meaningless. This movie's biggest crime is how it throws away the characters from the Originals we've been loving for so long. We get a scene of Rose mourning her sister we saw for 1 minute in total\\, but we don't get a scene of Luke mourning his best friend Han who died in a way because of Luke himself. And the biggest disrespect this movie did is completely destroying Luke's character\\, having him do things he would never ever do. Luke in this movie is not the Luke we grew to love during the Original Trilogy. This Luke is completely opposite\\, written this way only to surprise the audience even if it makes no sense at all. And it doesn't. This movie disrespected Luke and the Originals so much by destroying them. And that is why this movie is the worst SW movie ever. No worldbuilding\\, bad pacing\\, bad plot\\, characters acting out of character\\, average soundtrack\\, disrespect towards the best thing about SW and a complete disregard of what happened before this movie. This movie isn't only a bad SW movie\\, it is also a bad movie. It is not because of our expectations. It is because of the writing. It could have been so much better and that's what makes it sad and frustrating. SW remains as episodes 1 to 6. The later episodes are just fan-fictions.","true":true}