{"101487":170153,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi is a fantastic installment to the Star Wars Universe. The movie may have had its flaws\\, but definitely had satisfying moments. Keep in mind this review is NOT SPOILER FREE. First let's address the bad parts of the film. We all know Leia is related to force users so it seemed odd that she never used it to her advantage except in the end of episode V. Well\\, she finally used it but in the worst way possible. It has always been known that a 'force jump' is a power used by those who dabble in the force\\, but never force flying. I have personally never been more confused than when I saw Leia turn into super man. Moving on to the next bad part\\, Luke's death. When Luke tricked Kyle Ren\\, it might've been the most badass Jedi mind trick I've ever seen. The only thing that would have made it more badass is if he survived it. I don't feel killing him off was necessary. Now onto the good parts of The Last Jedi. Snoke's death was a huge shocker\\, and on top of that it lead to one of the coolest Star Wars battle scenes. Rey and Kylo Ren's team up against the paetrolean guards was left many audience members in the theater on the edge of their seats. The next good thing about the film was Yoda's appearance. I don't think anyone expected that and I was very happy they went with puppet Yoda over CGI Yoda. A tear came to my eye when I saw his iconic head shape in the foreground. The acting in The Last Jedi was truly splendid and I hope to see the majority of them in the next installment. Rian Johnson took many risks in this film which I appreciated. He killed Snoke\\, Admiral Ackbar\\, Captain Phasma\\, and a lot of fan theories. I also enjoyed when Kylo Ren destroyed his helmet because Snoke told him it looked stupid. This review was written by both a Star Wars fan\\, and a person who hates the force awakens. This film will has me genuinely excited for the next installment and I would love to see Yoda and Luke training Rey as force ghosts and perhaps trying to turn Kylo Ren to the light side. I would rate this movie a 91% overall. It had few flaws and it had so many enjoyable parts to watch. Well done Disney. ??","true":true}