{"101487":189713,"Last Jedi":"Last Jedi","2017-12-15":"2019-10-31","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Top 5 worst movies ever made in the history of movie-making. At least 'The Room' made me laugh. This disaster was pure cringe for the full 2.5 hours. Nonsensical\\, incoherent\\, and out of touch with the fandom and any sense of Star Wars\\, the story is haphazard and the script is like eating a boiled potato with zero salt. This preposterously bad film in every way shape and form is the prime example of everything wrong and unsavory about movie making today... Unadultered garbage. This movie is like an  unfinished middle school project being handed in... Unadultered garbage. The people spoke. \\nWhat an utter disaster.\\n\\nSome incredible visuals\\, that's the only way I can justify half a star. Love Daisy Ridley as an actress. Everyone else's performance was stale and gimmicky. Rey was an extremely intriguing character in Force Awakens\\, but for some mysterious reason\\, Rian Johnson decided to \\\"subvert\\\" my expectations. Congrats Rian and Kathy\\, I didn't expect the movie to be so bad. I didn't expect Star Wars to die by suicide. I didn't expect the creators wouldn't have a clue about Star Wars\\, or storytelling. I didn't expect Rey to become an uninteresting\\, pointless and bland heroine. I didn't expect the movie would insult the intelligence of the audience by vomiting this lazy work. BUT\\, subverted! \\n\\nNo reason or motivation to watch the next one or what they would call they \\\"final\\\" one. This WAS the final one. \\nI stepped outside the theater still trying to figure out if I was purposely or unintentionally slapped by such a $hitty movie. I just stood aghast outside the theater\\, squinting eyes. I kept thinking about the line that Casper says at the end of 'Kids' - \\\"Jesus Christ\\, what happened?\\\"","true":true}