{"101487":98604,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Absolute trash city. the title of the movie should be called \\\"Star wars: trash city\\\". apparently the entire history of the canon means absolutely nothing now\\, and Disney has decided to ad lib the entire thing. First of all\\, apparently Leia is now sorceress. After three movies (four if you count her as a baby in Ep. III)\\, several books\\, and many comics leia  has shown zero force sensitivity\\, let alone the ability to survive long exposure to the vacuum of space before flyng to the safety of a distant air-lock. I mean come on! Leia literally is flyng through f****** space for the love of God. Luke turned from the hopeful hero in the original series to lazy\\, pussified\\, whiny man who draws his lightsaber on his nephew (ready to strike) without a work because I believes that Kylo Ren may be too far gone to the dark side. This is the same guy who literally\\, literally had his hand cut off by his estranged father and refused to kill him when he was in a fit of rage (Ep. 3). now you expect me believe this Bulls*** from Disney that he\\, while calm and collected\\, was ready to kill his nephew (whom he loved) on a whim? Once again Disney\\, wtf is going on? The question I really want to ask is how many blow jobs Disney had to dish out to the critics so that they would give their movie a 91%. Additionally\\, I think that rey is dope af. she is the baddest b**** ini all of star wars (in  my opinion). But what this about having zero training and being able to lift 10 metric tons of boulders out of the way for her  and her pals? I know what you're  thinking; \\\"but wait! in this movie she trained with Luke\\, a jedi master\\\". you would correct. But to put this into context\\, Anakin trained from a young boy up until he turned on the jedi council to be able to do similar feats with the force. If you think that it's accurate to have rey doing that s*** after a couple days of breathing exercises you need a psychological evaluation. Another point! in ep. III yoda (I think we can all agree that he is a powerful jedi) was spinning those weird disks and throwing them at palpatine with difficulty. I'm not buying this Bs. And yoda in this movie? name any! any! literally any point throughout star wars that a force ghost physically interacted with their surrounding in the way that yoda does in this movie. yeah. you can't. If yoda can light s*** on fire why didn't he just go kill snoke himself or at least help his homies out at the end battle of this movie. Now lets talk about snoke. a sith lord so powerful that he can take someone as strong as rey and literally over power her with one hand while delivering his evil monologue. Which I would have accepted had they given even a glimpse of his abilities or his origin. Darth sideous is lucky af that snoke was just lurking in the background while he was ruling\\, because snoke who have made him his little b**** boy. And what is wrong with the social justice warrior bs that decided to throw in with rose? \\\"now it was worth it\\\". Excuse me\\, what? everyone you know and love is about to be murdered by the first order and you're taking your time to smash a casino and then take even more time to free some horse-like animal. wow. Disney is preying on people taken up by the left-wing political ideas and those are nostalgic for some old school star wars details. From now on\\, I will only refer to this movie as Star wars: trash city.","true":true}