{"101487":131875,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I felt heartbroken after I've seen this movie. I'm a Star Wars Fan since my childhood\\, and I liked The Force Awakens and Rogue One. I can't understand why Disney and Lucasfilm allowed Rian Johnsen to ruin this new trilogy and the Star Wars universe we once knew. For me Star Wars has always been a fairy tale about good and evil. In this movie we got no good and evil anymore. All characters feel very grey. We see some heroes of the old trilogy die and even new heroes established in The Force Awakens get ruined in this movie. All men act like idiots and need strong women to tell them what to do. Luke Skywalker\\, the big hero of the old trilogy is a bitter old coward in this movie who talks about overrated arrogant jedi of the past. This destroys not only his legacy\\, it destroys the legacy of the jedi. He felt no need to save Han Solo\\, no need to stop his former apprentice from destroying the republic and even at the end he acts like a coward by not facing his enemies. He is just petending to do so. This is not Luke Skywalker anymore. Even the first order isn't that dangerous and evil anymore. Hux is destroyed as an evil character. Snoke is gone without any explonation if he is a sith or something like a dark jedi. The cheesy humor is terrible. \\n\\nThe force awakens just copied New Hope. But it felt like this was done by someone who loves Star Wars and respects the old trilogy very much. The last Jedi feels like it was done by someone who hates Star Wars. It's like Rian Johnsen doesn't even know the Star Wars universe. The force works differently\\, ships move differently and the illogical moments and plotholes are so gigantic\\, you can't overlook them. He says he's a Fan\\, but it seems he never even understood physics\\, rules and strengh of this universe. He destroys things we love without replacing it by something new and cool. I really hate this movie and I feel no desire to watch Episode IX in two years at all. I like JJ Abrams but even he won't be able to repair what Johnsen has destroyed. I can't believe Disney bought Star Wars to allow this to happen.","true":true}