{"101487":105234,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a lover of George Lucas' 1st 2 epic trilogies\\, as well as American Graffiti\\, even the Force Awakens was scary to see...but it was good. Abrams had respect for Lucas' style of character development and the glorious \\\"wipe\\\" style scene transitions. Comedy went to characters written for that purpose\\, and the story was full of developmental dialogue that furthered the plot and informed the exposition. Last Jedi was the complete opposite. Sooo many scenes...some of which were unnecessary. Injected comedic moments for every character so everybody could be funny. And more questions than answers. Snoke's importance to the story has officially been demoted\\, as we have no idea where he came from or why. The random gambler man seemed to be as significant as Lando...but I get the feeling we're never going to see him again. And Rose\\, though charming\\, seems to be a potential love interest for Fin? But romance as a whole was shoved to the side for scene after scene of masturbatory cgi and comic moments. So Rose is what? Another character? Just a friend? As irrelevant as Snoke? All I know is the first seven films have been BIBLICAL in the immensity of the character development of light and dark. The relationships have been trialed and tested. And growth of our protagonists has been noticeable. This film\\, instead of building from Force Awakens\\, seems to have attempted to separate itself from everything established. Fin has been given a character flaw late in the game. So has Poe. And Rey knows she's nobody now\\, but she was never tempted or had moments of lost faith. The second act is the time for the protagonist to fail...but all she did was keep chugging. Poe and Fine failed...but it's not their story. Trilogies are supposed to build on one another...and it's palpably clear that Rian couldn't care less about the story before or after his.","true":true}