{"101487":196240,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where does one begin with this train wreck?.  lets start with Rey's ability to get yet more Jedi skills with no training - millennials showing their entitled work ethic?  Then Johnson used Back To The Future's flux capacitor for hyperspace tracking.   He killed off Snoke giving us absolutely no background behind the man who assembled empire 2.0.   Johnson introduced new characters like a stream of consciousness poem by Virginia Wolff.  johnson killed off luke skywalker to mask his crappy plot\\, and destroyed 40 years of Star Wars story plot.     Finn was portrayed as a bumbling idiot in his zip lock bag; whereas every other character gets a bacta tank. The kid at the end of the movie reminded me of something recycled from a walt disney storybook cartoon prelude.    Episode 7 &8 are basically sci fiction's equivalent of Bill Murray's ground hog day: empire 2.0\\, darth vader lite\\, ape walkers\\, etc...    crystal foxes?   yeah\\, i guess they wouldn't burn everything from sun magnification through their crystal fur....    And who cares about that chrome bumper stormtrooper?  when johnson killed off captain plasma with a death worthy of Die Hard - absolutely no audience member cheered or gave a crap! why? because captain phantasic had no character development...   why was she evil?   i guess her bad fashion armor.....   Space bombers?    What about the space ship chase where 2 ships burns fuel in space\\, where inertia shouldn't require more fuel.      Then\\, why didn't 1\/2 the first order fleet hyperspace ahead of the rebel fleet\\, to stop the rebel fleet?    What purpose did the Benito Del Toro character have?  None.\\n\\nReally\\, the biggest issue is a crappy plot\\, with really lame filler material to distract us.   Like Luke milking a sea cow.    The entire movie used a bunch of garbage\\, for the sole purpose of  setting up Rey vs Ren in a love\/hate teenage relationship.     What is the point?  Can't you watch re-runs of Dawson's creek or Beverly Hills 90210 for the same plot?","true":true}