{"101487":145966,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never left a review for a film. Ever. I'm a lifelong fan but not a basement dwelling fanboy or Russian bot and I can watch any film objectively - even The Room! I even gave the prequels sort of a pass recognizing that there are good parts here and there from each entry. \\n\\nThe Last Jedi is a mess.The uneven jarring tone\\, plot and execution of this film makes Phantom Menace and Jar Jar look Oscar worthy. It's the first saga film I've seen where no one clapped after the lights went on.\\n\\nLooking back to when Mark Hamill stated that he fundamentally disagreed with the direction of his character... that red flag was honest truth and that's not the only issue that plagues this film.\\n\\nStar Wars \\\"was\\\" about taking us out of our environment\\, instead we forced back with ham fisted \\\"resistance\\\" jargon throughout the entire film to the level of \\\"The More You Know\\\" commercials after each sequence layered with templated quick quip Marvel humor to give each of the new untouchable characters a close up and wink at the audience to show how brave they are. \\n\\nThe sequence of \\\"super\\\" space Leia\\, while great to see her use the Force\\, was silly and jarring in the middle of a space battle.\\n\\nKylo Ren and the First Order with their powerful ships and canons are portrayed as bumbling idiots who cant even outflank the galaxy's slowest \\\"car chase.\\\" Theres nothing here to make the villains more sinister to raise the stakes for the last of the \\\"rebels\\\" who we all wanted to see win in the original films. The modern jokes applied to our galaxy far\\, far away especially between Hux and Poe completely take you out of the movie for just a cheap laugh and clap.\\n\\nThe side plot to Canto Bight goes no where if only to give Rose a platform to give her messages of life lessons to the audience. I'm not sure which line is worse. \\\"I hate sand.\\\" or \\\"I wish I could punch a hole through this city.\\\" And there's so much to dislike in this subplot. DJ\\, the chance character who just happens to be in the same cell and contracts for The First Order among many others. Finn seemed like he couldn't get away from this entire plot fast enough.\\n\\nHow is it Rose knows of Finn's legendary status if this film takes place only moments after The Force Awakens? Was there an awareness campaign sent across the galaxy? \\n\\nRey continues to master everything in the Force without any work. Her one lesson with Luke beyond seeing him fish and milk muppet breasts is sitting on a rock working on breathing techniques\\, staring into a fun house mirror and also force conversing with Kylo Ren that reaches \\\"sparkly\\\" vampire status.\\n\\nSnoke - either there's a twist to him in the 3rd film or killing him was just for the GOT \/ TWD trend of shock value for ratings.\\n\\nDialogue and scenes at times were completely lifted from Empire on Crait with the walkers and land speeders with trenched soldiers and Jedi with the throne room with the spire elevator\\, force removal of handcuffs\\, see your friends die through a view finder\\, and strike me down sequence.\\n\\nMatrix Luke with the dirt off your shoulder moment was just mind numbing and out of character. \\n\\nIf \\\"Spaceballs 2\\\" or \\\"The Room 2: Hi Mark From Space\\\" had been the titles for this film - perhaps this would have been a raving review.\\n\\nThere's no coming back from this. Jar Jar\\, you are free.\\n\\nI'm done with Disney and Star Wars.","true":true}