{"101487":187376,"Last Jedi":"Last Jedi","2017-12-15":"2019-03-29","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"THIS REVIEW CONTAINS MAJOR SPOILERS ONLY READ IF YOU HAVE SEEN THE MOVIE. Alright with that being said I left this movie on Thursday night with a lot on my mind and at a lost for words Rian Johnson took a lot of chances and risk with this movie some landed amazing some not so much. I didn’t want to write a review and give my thoughts on this movie until I saw it again which I did tonight with that being said I’m ready to give my thoughts. This movie starts with an amazing space battle. Oscar Issac as Poe Dameron is phenomenal he definitely had a lot more to do and Oscar knocked it out of the park with Poe in this movie from he’s amazing space battles to jokes he has it all in this movie. Mark Hamill as Luke Skywalker was amazing to watch. This might be Mark Hamill best performance as Luke Skywalker. The chemistry he had with daisy Ridley is phenomenal and they both kill it together on screen. Adam Driver as Kylo Ren is on a whole new level. What adam Driver does with this character throughout the movie is amazing and I can’t wait to see what he’s able to do next. I already mentioned her but Daisy Ridley brought her A game for this movie. John Boyega and Kelly Marie Tran both had awesome performances but the story line they had was weak and felt out of place in this movie. Some of the things I really enjoyed was the stuff on the island with Rey and Luke. Loved how it showed how much Luke doesn’t want anything to do with Rey and wanting to train her to show her why the Jedi should end. Also showing the back story to what happened between him and Kylo Ren when he was training him. I really liked the connection between Rey and Kylo which we ultimately find out Snoke it doing to trick Rey into coming to his ship after Kylo. I really liked how Poe had a lot more to do in this movie and felt more valued and had more to do and felt important to the story this time around. Something I really disliked and absolutely hated was how little Snoke did and ultimately meant to this movie and trilogy. He didn’t do much and we learned nothing about him and he just died off when Kylo killed him which does push Kylo as the main villain but felt like Snoke was useless and didn’t need to be in these movies at all. Like I said earlier I hated the story line with Finn and Rose them going to that island just to get a code breaker to get onto Snoke ship felt pointless and felt like it didn’t belong in this movie. It felt like they used it to talk about animal cruelty which felt out of place. Captain Phasma was the biggest let down. They had this amazing character that people loved and wanted more of after the force awakens and had books and comics about and built this character up just to get barley any screen time and to get killed off just felt like it was useless. The final battles was amazing and looks stunning. The Rose saving Finn pushed roses character more and built a connection between them. The Luke and Kylo battle at the end was good and bad at the same time. They didn’t do much in ways of fighting but the dialogue was phenomenal. I saw this coming but Luke died at the end of the movie but the way they did it was phenomenal and paid respect to his character and history. I left this for the end but Carrie Fisher as Prissiness Leia is phenomenal and magical she kills it yet again with the role of Leia was definitely emotional seeing her finally performance as Leia and what a performance it was. Interested to see what they do in episode 9 with Leia since she does survive this movie. But overall Rian Johnson took a lot of major risk and some landed and some didn’t I really liked this movie leaving the first time but seeing it again I now love this movie. I didn’t say everything that happened but most of it. Go check this movie out with an open mind.","true":true}