{"101487":134019,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have to say I am extremely disappointed. Here's why: (SPOILERS) \\n\\n- The pacing and structure are pretty bad. There's no tension at all\\, nor any stakes.\\n- The whole stalemate chase that fuels the main storyline is just plain stupid. Do we really have to believe that the whole First Order armada of mean and powerful ships could do NOTHING MORE than wait it out ? It's ludicrous and doesn't make any sense at all.\\n- Speaking of stupid\\, everyone in the First Order is helpless\\, dumb and incompetent; they've become a cartoonish caricature of the Empire. \\n- Rian Johnson doesn't know what to do with Poe and Finn\\, which is a shame because they are both very well portrayed by Isaac and Boyega. \\n- The Force is now a superpower that requires little training to master\\, a concept that borders on blasphemy. \\n- The Resistance is decimated in this film\\, yet no one registers the losses. At the end\\, they've lost pretty much everybody but a dozen of souls\\, yet they smile about their bright future. \\n- The horse sequence was so out of place\\, it felt like a Harry Potter scene for kids.\\n- Speaking of kids\\, I hated the end with the orphan looking up at the sky. I don't care about those kids\\, we've seen them for like 2 seconds\\, and they have absolutely no flavor other than being poor space orphans that can't act. I also can't tell you how much I hate the fact that the kid force-pulls his broom. The Force is now a superpower and you can use it without ever having been trained in it.   \\n- Leia flying effortlessly in space. I wish I hadn't seen that. It's not that the concept is totally wrong (It could make sense that Force users can channel the Force to withstand what other beings can't)\\, but the execution is very poor and out of place. Make it a struggle\\, at least! She just flies like Mary Poppins. It was one of the most cringeworthy moment of the film.\\n- Luke's death was poorly handled to my taste. It was so anticlimactic. If you're going to off him\\, at least do it in a way that is more cinematic than having him evaporated from exhaustion.\\n- Too many deus ex machina moments. For example we are specifically told that there is no way out of the rebel base at the end of the movie. Except a HUGE system of tunnels that is conveniently found at the last minute. \\n\\nI could keep on writing. There's so much things this film got wrong\\, it amazes me.","true":true}