{"101487":141829,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It looks like Disney can't buy reviews quick enough to cope with the kicking it's getting from the fans. This was very disappointing. It killed the trilogy for me as I no longer care what happens in episode 9. This is a classic example of bad story telling. The poorly written script destroyed the credibility of each and every character. \\n\\nHere are my main problems with the film in no particular order:\\n\\nTerrible slapstick comedy at the beginning.\\nA spaceship that takes an age to position itself over the enemy craft in order to release it bombs.\\nThe whole sub story of Fin and Rose.\\nRiding those stupid animals to escape from the pointless casino city. It was like watching episodes 1\\, 2 and 3 again.\\nWhy didn't admiral holdo (Laura dern with purple hair) just tell Po the plan? He wouldn't have tried a mutiny to take over the ship... which went nowhere anyway.\\nLuke was going to kill his nephew for sensing a little bit of dark in him? Not a chance.\\nPrincess leia flying like superman in space. oh my god\\, who thought that was a good idea\\, seriously.\\nRey having about 5 minutes of training and suddenly understands all about the force.\\nRey having zero light sabre training but can defeat all the imperial guards.\\nWhy didn't they destroy the rebel hideout on Crait from space with their huge guns?\\nLuke would never even consider murdering his nephew in his sleep.\\nThere's no other way out of this Crete fortress........ oh wait yes there is.\\nLuke's death sucked.\\nBB8 operating the imperial walker tank thing.\\nSnokes ship gets torn in half by another ship going thru it at light speed and the only survivors are Finn And Rose and a single ship they need to escape.\\nsnoke gets killed like a complete amateur as he's explaining how he knows everything about everything.\\nToo much CGI\\nBad CGI in some places\\nThe total incompetence of the first order in every scene. \\nwe know absolutely no more about any of the characters.\\nAre Rey's parents important..... nope just drunk losers that sold her.\\nKylo Ren doesn't receive any further training that was promised in TFA\\, but is now able to kill snoke and become supreme leader.\\n\\nThe list could go on\\, but it's pointless. They messed up big time with this film.","true":true}