{"101487":199524,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Wow\\, what can I say?  Well\\, besides the fact that Disney ruined basically everything that is Star Wars in this latest episode 8.  I want to make it clear why I created an account simply to give this movie such a bad rating and share my opinion of the film.  I have and always will be an avid Star Wars fan who not only enjoyed the original trilogy but also believed that episodes 1\\, 2 and 3 are underrated.  I have also played every Star Wars game imaginable\\, including the Knights of the Old Republic games (still no idea why Disney didn't just follow this pathway since it provides more freedom like they so obviously desire).  Still\\, I have no explanation for this piece of garbage that spewed from the bowels of Disney's non-binary\\, feminist agenda pushing a**.  The simple fact that I wasted hours of my life watching an interracial couple (nothing wrong with that but Disney come on no one believed it) that was forced to have \\\"chemistry\\\" do absolutely nothing and help absolutely no one was impressive in its own way.  The thing that you can't understand without watching the film are the numerous times that you wanted to claw your eyes out while screaming bloody murder in the theater\\, I'm talking about the scenes like the one with Leia (those of you who have seen the film know exactly what I'm talking about and that's a testament in and of itself).  However\\, the saddest realization of this film is that they could have saved it during the most interesting point of the movie but decided to ruin every possible positive outlook to the film because they obviously would have no idea what to do if they did follow through with it.  This simple story decision makes me hate (not in a sith way....btw they never use the term sith either) Kylo and hate anything Disney.","true":true}