{"101487":161624,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Painfully average for a Star Wars movie. The numerous plot-holes and underdeveloped sub-plots made the whole movie feel disconnected from the Star Wars universe. The humour was often corny and out of place and the only people who laughed in the cinema were young children. The addition and development of new characters like Rose and Admiral Holdo were pointless and as their characterisation was muddy\\, as if the writers were unsure of where they wanted characters like these to go in the story. \\n\\nThe entire section of the film involving the casino was boring\\, cringy and just tedious to watch. It had no impact on the actual plot and was a pointless deviation. This section reminded me of the disasterous episodes 1-3. Additionally\\, the casino section of the film felt inconsistent. On the one hand it is painfully childish and completely overuses CGI. But on the other hand\\, Johnson has tried to make some political statements and it falls flat completely. Issues like child labour\\, animal cruelty and greed are shoved into our faces but aren't developed into great detail so it feels shallow and a waste of time. This entire section of the movie should not be in it.\\n\\nThe villians were once again underwhelming. Although work was done on Kylo Ren and he doesn't seem to be as much of the whiny emo kid he was in The Force Awakens\\, the other villians were poorly developed. Snoke was a significant dissapointment. He was killed off extremely quickly and anticlimactically. Phasma was again a rather pointless character. All she really does is fight Finn with a big chrome toothpick and then falls into a pit of fire. \\n\\nI would go on but at this point I'm tired of typing. There are so many other things that bother me. The Last Jedi was not by any means a terrible movie\\, but it was far from being a good one.","true":true}