{"101487":132087,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If it didn't had the name Star Wars it wouldn't have been a bad movie. However the director and writer of the Last Jedi definitely didn't understand Star Wars lore or has no idea on how to write a coherent story. Many of the plots started in the Force Awakens have been thrown overboard for no good reason. Luke was setup in the Force Awakens as the galaxies best hope\\, he was the main quest. But in this movie Luke is a disillusioned grumpy old men that in the end didn't train Rey at all and only played a small part in the bigger picture before he died. Why did he leave a map to find him to begin with if he doesn't want to be found and wants the Jedi to end anyway.  The lore of the Jedi is introduced as this holy grail in the Last Jedi\\, but then Rey magically already knows everything and Yoda burns it all. Speaking about Yoda. Since when can Force Ghosts interact with anything? Why does he control lighting all of a sudden. Luke Projection on Crait baffles me as well. He's able to hold hands with Leia\\, clash with sabres against Kylo but when it is convenient he's a hologram or projection and thus can't die. None of this is explained nor why Luke died of this action. Snoke being killed leaves a huge gap. He was an interesting and mysterious villain that brought up lots of questions. But they will go unanswered since he's dead\\, nor do we care anymore. No Kylo Ren is the new supreme leader. Which is not interesting because he's still a very much flawed character and not pure evil. Something that you will need in a movie like this. I have no idea how they will continue with episode IX. In any case I've lost interest and can't be bothered anymore. There are too many flaws with this one.","true":true}