{"101487":178129,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The quick review:  This movie has a really weak and nonsensical storyline and tries to make up for it with special effects and boring choreography.  \\n\\n(below are just quick notes I wrote down after seeing the movie in the theater for the first time)\\n\\nthe good: there are some good scenes between the two main characters where the story starts to hold your attention.  \\n\\nthe bad:  those scenes don't build on each other in any reasonable way.     bad fight choreography and camera angles {can't tell what's happening in the fight\\, nor is there any buildup.  hmm\\, not to be mean\\, but the first thing it reminds me is that it's as if they tried improvise the 1960s campy tv batman fight scenes and kept the first take.\\,\\nstrategy and reasoning of the characters doesn't make sense (like characters don't react like adults\\, most of the time they act like children or tweens).  it's really an 80s saturday morning cartoon of making sense\\, its like an episode of GI Joe cartoon or He-Man\\, but those was way more fun to watch\\, and were only 30 minutes an episode.  while this thing is overloaded.  the level of cohesion of the story is very much like they mashed 8 random saturday morning cartoons together.  the logic of the each story doesn't make much sense\\, and they kind of just glued together instead of one over-arching series of events that builds up to a crescendo.\\n\\nif you like simple saturday-morning cartoon version of star wars\\, then this is the one for you.    When i saw a George Lucas versions of star wars (or also Rogue One)\\, i would leave the theater with a few \\\"WOW\\\" moments\\, and energized feeling. Leaving the theater after this movie i was just like i felt like i just wasted my time.  i was literally waiting for the movie to end at points it got kinda boring.  which is a bummer cause i liked another movie by this director (rian johnson).","true":true}