{"101487":194540,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Well\\, I think it is safe to say that Disney not only ruined this movie\\, but ruined the appeal of Star Wars for many.\\n\\nMy hubby and I are lifelong SW fans and grew up loving everything about these movies.  Our twin 12-year-old boys and 8-year-old daughter were raised on them as well.  Not sure who Disney's target audience is with this new episode but they missed the mark in my family.  This is the first year since my boys could speak that none of my children asked for Star Wars toys or memorabilia for Christmas.  This was also the first SW movie that no one in my family wanted to go back to the theaters to see a second (or third) time.\\n\\nWhat we were most disappointed with was the way this movie treated old characters and their legacies.  Jedis didn't seem to be held in the esteem they should have been and out of nowhere Leia and Rey suddenly seem very powerful with the force.  Luke was cranky and Leia can fly.  \\n\\nWe really wanted answers that The Force Awakens made us hungry for but got nada.  I can accept that the story doesn't have to go the way I may have wanted it to\\, but it should go somewhere for crying out loud.  Instead TLJ summed up any questions TFA triggered in a few disappointing scenes\/comments or not at all.\\n\\nLastly\\, we were all really unimpressed with some of the characters we grew to like in TFA.  Finn went on a pointless mission with another pointless character\\, Rose.  Their whole story arc could have been eliminated and the movie would have been slightly better for it.  We didn't care for Rose - found her to serve no purpose to the movie and the acting was not up to snuff.  Poe also didn't seem to develop beyond being a hothead that the women needed to deal with and work around.  These people either detracted from the movie or were underused.\\n\\nAll in all\\, we were just really disappointed with episode 8.  These are movies the 5 of us treasure and look forward to.  This one just didn't sit well with any of us.","true":true}