{"101487":141948,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"it really is about as lame as the audience scores on Rotten Tomatoes indicate. \\n\\nThe first cringe worthy moment is Leia\\, floating unconscious in outer space  using the Force to both survive the cold and vacuum of outer space to return to the ship she was just blown out of. The showing I was at a collective groan went up from the crowd. \\n\\nBut that's just the first head shaking moment. There are lots more. I've never been a fan of movies that have several sub plots of characters running around and then all miraculously (and it is a miracle in this movie since everyone in the rebellion lurches from one bad decision to another) ends up together at the end.  Excusing that I don't care for that - others might - the real problem is that the entire Finn\/Rose\/Master coder sub plot goes nowhere\\, accomplishes nothing. If you removed it in it's entirety you'd miss nothing.\\n\\nThe rebellion leaders make one terrible decision after the other - reaching the point where junior officers suspect the (temporary) leader of being a traitor and mutiny. \\n\\nKylo Ren  - the \\\"new\\\" Darth Vader - is just far to emotional and conflicted to be all that interesting and by the end of the movie he's killed his master Snoke - who is far more interesting and VASTLY under utilized in this movie. \\n\\nI feel like I ought to greatly dislike the end of Luke Skywalker. The entire projecting a solid image of himself across a galaxy (if Jedi's can do this shit how did they ever get hunted down to near extinction? Maybe you can kill one god - how do you kill of a legion of them?) And if the effort of such a projection\/ deception was going to kill him\\, why not just join with the rebels? Or at least get closer?  But oddly while I didn't like that ending\\, I didn't hate it. The original characters were going to be written out and new ones brought in\\, so whatever. \\n\\nThe fact that critics love this and the audience score is mediocre at best just reinforces - for me - that movie critics have almost no relevance for me anymore and I just need to check the places that reflect\/poll\/gauge audience opinions of movies.","true":true}