{"101487":169550,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS! THERE WILL BE SPOILERS IN THIS REVIEW! STOP READING NOW IF YOU HAVE NOT SEEN THIS MOVIE!\\n\\nI have never\\, NEVER been disappointed in a Star Wars movie. I'm the biggest fanboy there is in regards to this series. I loved all 7 prior to this one. I was so amped up to see this movie last night\\, I couldn't stand it. For 2 years\\, I've waited for this. Words cannot describe the feeling I had (and still have) after seeing this movie. From start to finish I waited for a huge cliffhanger. I waited for Luke to go all Master Jedi on someone or something. Instead\\, I got nothing. Luke is weak. He was bested in a duel by a force user who has no training in the Force. He lost against Kylo Ren\\, not once\\, but twice. His gift to this movie ... a force illusion. Yippeee!!!! Whereas his sister somehow is able to defy physics and death itself.  You mean to tell me that Leiah can defy death itself \\, but Luke dies after creating a Force Vision\/Illusion? The hell out of here ... \\n\\nWhat about the title? The Last Jedi? At no point in this movie is there a \\\"Last Jedi.\\\" It's a nonsense title. It doesn't even mean anything and doesn't hold true to its' name. \\n\\nSnoke. Who is this guy? What's his story? We'll never know. He's dead. What a major letdown. \\n\\nRey's parents are revealed. Another letdown. They were nobodies. \\n\\n\\n\\nI dropped $111.00 on this movie for me and my family to see last night. For the first time since the very first Star Wars movie\\, I feel like I wasted my money. I love Star Wars. ALL OF THE MOVIES! This one ... well ... it just lacked depth. It lacked story. It lacked everything that makes Star Wars\\, Star Wars. We're now left with 2 force users (a 3rd if you count a stable boy) with nobody to teach them the ways of the Force. So they will just \\\"wing it.\\\" But hey\\, with no training\\, Rey can move an entire mountain side of boulders with no problem at all. Something that even Yoda would struggle with. \\n\\nIn short\\, save your money and just watch this when it comes out on DVD or Pay Per View. How this movie has a 93% Fresh Rotten Tomatoes rating is absolutely mindbogglinlg to me.","true":true}