{"101487":161767,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"People are very angry at this movie because their theories were all wrong.\\n\\nAnything you thought was going to happen is wrong. The way this movie twists is absolutely amazing. As soon as you think you know what is happening\\, Rian Johnson has another surprise waiting for you.\\n\\nThis movie is not perfect and definitely has its flaws. Everything on Canto Bight drags ... a lot. The CGI on that planet is still very good but below par with the rest of the movie. The storyline itself on Canto Bight is very weak even though the acting throughout was great.\\n\\nThe way they handle all the main characters is unbelievable. This is where I will have to mention some SPOILERS. People have been posting their theories about Reys parents and who Snoke is\\, non of that matters in the grand scheme of the movie. The movie tells you that Rey has to rely on herself and stop looking back ... as for Snoke ... what a scene that no one expected. People complain about TFA being a rehash of the original\\, but cry when they do something new in this movie. Rey And Kylo have developed massively throughout this movie and even though you don't learn much more about their back stories\\, you learn a lot more about them as characters.\\n\\nLuke Skywalker is the character most fans are unhappy about. He is an idle of mine and is the man I am named after. Before the movie I said I would cry if he died. SPOILER ... HE DIES\\, but I did not cry. Why you may ask. Because it was perfect. Luke when out on his terms in an awesome way. The main issue most people have is he wants to be alone and has turned his back on the Jedi. To most people this un does everything the original trilogy taught you about Luke. I completely disagree. This shows you that even someone so strong can be broken by something massive. Betrayed by family and a huge mistake that he makes in the turn of Kylo\\, of course Luke has turned his back on everything he knows. Luke was never getting out of this trilogy as they are paving the way for the new Jedi\/First order ... there was no better way for Luke to go and from this he can have more of an impact in episode 9.\\n\\nThe only other issue I have with this movie is the comedy. Most of it lands and most of it made me either laugh out loud or chuckle. The problem was with the timing and this also effected the tone. Luckily the very very serious scenes involving the force\\, Rian stopped with the comedy. But in some scenes it was very unnecessary and took me out of the movie completely.\\n\\nIf you love Star wars\\, if you love Kylo\\, Rey and Luke you will love this movie. It expands the law and mythology of the force and has so many twists and turns it will have you guessing throughout. I can guarentee you will not be able to guess half of what happens in this movie. All the fan predictions are wrong and that is incredible. As a kid growing up with Star Wars\\, the greatest compliment I can give this movie is it had me smiling and thinking about it ever since I left the movie theatre.","true":true}