{"101487":190016,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Total trash!! \\n\\nThese paid reviewers and fan boys are trying to push the idea that these bad reviews are because people don't like the direction that the film took Star Wars\\, but that is utter BS. People don't like the film because it is a bad film. Star Wars and movies fans would have been fine if they killed off all the old characters in the first 5 min of TFA if these films were good. \\n\\n1. The jokes were bad...very bad.\\n2. You don't care much about any the the characters\\, not sure how anyone could care about the next film at ALL.\\n3. The space physics were so bad it pulls you out of the movie\\, one should be able to suspend belief but this movies pushed too much.\\n4. The boring PETA and anti-capitalist message that just waste our time\\, at least make your propaganda entertaining. \\n5. Return of the Mary Sue(not really everyone fails in this one)!!! The reason people didn't like the film isn't because Rey wasn't a Skywalker... The fans NEEDED Rey to have some sort of meaningful past(amnesia\\, past training) to justify her in TFA being such a Mary Sue. So\\, now with TLJ's explanation it ultimately makes her character and TFA even worse. \\n6. Super Leia  \\n7. Luke's ending is anticlimactic and lame. Just like his mother he dies from losing the will to live I guess.\\n8. Supreme Leader Snoke and Captain Phasma were a waste. Why create characters for no reason? Just to waste time(FILLER!!!).\\n\\nPlease skip TLJ and don't reward Disney for creating a bad product\\, it will be on Netflix before you know it.","true":true}