{"101487":170063,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi - 7\/10 *SPOILERS AHEAD* Reasons I loved it: ⚫ Acting was fantastic (especially Adam Driver and Mark Hamill). ⚫ The action was great. ⚫ The cinematography was gorgeous. ⚫ CGI is equally as good. ⚫ Really liked Kylo and Reys arc\\, along with Po's. ⚫Seeing Yoda was perfect. 10\/10 scene with Luke. ⚫ Reuniting Luke and Leia for a scene. ⚫ It's unpredictability and taking risks. Some good\\, some bad. Reasons I disliked it: ⚫Leia still being alive at the end of the film. Due to the unfortunate loss of Carrie Fisher (RIP)\\, I feel like this just creates problems for the next movie. Are they just gonna write her off and kill her off screen? Even though it's JUST been established she can survive the vacuum of space. Which brings me to my next point.. ⚫ Leia can use the force out of nowhere. I honestly don't mind this too much if they had just taken the time to explain this to us. Did Luke train her to do this? Has she always been able to do force powers? If so\\, why didn't she use them in ways to help the resistance\\, and not just carry the plot forward? ⚫ Finn and Rose's storyline. Didn't work at all. Whole casino sequence feels like a completely different movie. This screen time could've been used to set up our villains better. ⚫ ZERO development for Captain Phasma AND they killed her off. ⚫ The death of Snoke. Personally\\, I would be totally fine with this if they had just taken the time to flesh him out. But\\, considering I don't know jack shit about him\\, his death just irritated me and left me with more questions. How did he get into power of the First Order? How did he influence Kylo to the dark side? How does he know the ways of the dark side? WHO IS THIS GUY?? ⚫ The chase sequence. Okay\\, so\\, you're telling me Snoke's huge ship can't catch up to the rebels ship with\\, assumably\\, full tank of fuel? Even if not\\, they have TIE Fighters and bombers to shoot them down! So\\, stupid. ⚫ Some of the humor is awkward and shouldn't be in certain spots. It just doesn't have a natural flow to it. It's some times forced. But\\, not as bad as... ⚫ Finn and Rose's forced romance at the end. Just\\, no. ⚫ Rose saving Finn. Completely deflates a very emotionally heroic moment in favor for a cheesy sappy love moment. ⚫ Time inconsistency. We literally see Rey go through days on this planet with Luke. While the entire chase sequence takes place in just mere hours (Finn and Rose had to go find a hacker on Canto Bight and save the rebel ship in under 6 hours). I'm no rocket scientist\\, but seriously\\, whaaaatt? ⚫ Luke about to kill Kylo. That's just something he would never do. I mean\\, him wanting to kill Kylo just shows that he has dark side tendencies. That's a lesson already played around with in Empire. I could go on\\, but I'll stop there for now. And I feel like some of these negatives can be fixed in the next movie. But\\, for now\\, this movie just kinda left a sour taste in my mouth. I don't love it. But\\, it is enjoyable for the most part. ","true":true}