{"101487":129561,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am not sure how anyone who loved the original movies could like this movie.\\n\\nI went into it knowing every plot detail (from reading hundreds of terrible reviews on the movie) so the only scene that I might have thought was done 'well' did not have the gotcha for me. The movie is trash. The only thing watching it accomplished was making me hate these people even more.\\n\\nYou can tell the people at the helm of it are SJW who hate the originals. The whole force is female bs was in full force (ha) in this installment. Apparently there are no more aliens in the galaxy\\, just pointless female characters who nag the only people actually doing something proactive.\\n\\nEven my hubby\\, who went into it excited about another SW installment and with an open mind\\, hated it. I cannot count how many times he looked at me and asked 'What the actually f**k?' It was that bad. I will try to keep spoilers to a minimum.\\n\\nThere is a whole side plot with Rose (the most annoying character since Jar Jar) and Finn that could have been completely left out of the movie and it would not have mattered to the plot one bit. It was forced\\, contrived\\, SJW bs. If you watch this movie and do not immediately want to punch Rose in the face I am not sure we can be friends.\\n\\nI knew they had destroyed Luke's character going in\\, but it was incredibly painful to watch. He milks alien sea cows\\, bitches and throws tainties like an emo child\\, rambles like a drunken lunatic most of the time and then fails to actually show up to save the day and his sister. This is not the Luke Skywalker we have come to love.\\n\\nKylo Ren should NEVER take off his shirt again. Seriously\\, creepiest part of the whole movie. Do not even get me started on 'mind skyping' or how ridiculous every single thing on the island was. Everything except Yoda\\, who apparently has spent the past few movies smoking astral grass\\, was pretty much trash.\\n\\nI didn't hate Rey in the Force Awakens until I went back and tried to watch it recently. Then I seriously hated everything about her. I think I was originally so excited to see another SW movie that I looked over her epic flaws. They just make her 100 times worse in this installment. I was begging for someone to kill her.\\n\\nOops\\, spoiler. She doesn't die. She doesn't even really do anything in this movie that serves a point EXCEPT one scene where she faces Gollum and tries to turn Kylo back into Ben. I was actually rooting for her in that scene because I think Ben would be a much more interesting character than Kylo. They have to ruin that too.\\n\\nThat was only one of two scenes I thought were OK. The other scene is the 'face off' involving Luke\\, but I knew the giant spoiler going in so it kind of ruined it for me and even if it did not it was a pussy move on Luke's part. I wasn't aware that the most powerful Jedi since Obi Wan had grown a vagina since Return of the Jedi.\\n\\nI am just going to stop now because I can't even put into words what an epic piece of space trash this movie is. The people at the helm should be fired\\, tarred and feathered and never be allowed near another movie as long as they live. If only! This is where cinema is headed. Forget the past\\, kill it if you have to. Everyone is special\\, therefore no one is. You too can be a Jedi\\, with zero training\\, if you have a va jay jay. Everyone gets a light saber and a participation trophy.\\n\\nRIP\\, Star Wars. You will always only be a trilogy to me.","true":true}