{"101487":193266,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Warning: This review will contain spoilers.\\n\\nMy biggest gripe with this movie was the way in which they used Luke. The possibilities were endless\\, especially given the lead up with his failure training Ben Solo\\, his experiences with Vader and what he\u0092d learned from Obi-Wan and Yoda. A cautionary and ominous training session filled with warnings of the Dark Side would have not only enhanced the movie but Rey\u0092s internal struggles and the stained past of the Jedi order. Instead we get scenes of Luke living like a hermit who has given up. And that\u0092s about it. Even when he agrees to train Rey\\, it\u0092s shown as one session and then he gives up because he\u0092s too scared to train her. \\n\\nIn my view there were two ways the director could have used Luke: 1) as a legendary warrior coming out of hiding to save the resistance or 2) a wise Yoda-like master of the force who passed on his knowledge to Rey. As I\u0092ve discussed\\, option 2 didn\u0092t happen. We almost\\, almost got option 1 but alas it was simply an illusion. An illusion that drained Luke to the point of death. And we didn\u0092t even get a lightsaber dual this time the way we did in a New Hope. It was overall a failure and almost a bit insulting to the legend of Luke. \\n\\nThe rest of the movie was equally disappointing but I will say Kylo Ren\u0092s acting was superb and his character development quite good. If only we\u0092d gotten that with the other characters as well.","true":true}