{"101487":133581,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have a difficult time understanding what the point of the film I just watched was. In its most ambitious and daring moments it seems to indicate a shift from the Star Wars of old; the tales of eminence and prominence often seen in classic lore exchanged for a more topical story of individuals of no particular esteem\\, \\\"everyday heroes\\\" who can come together for the greater good. That seemed to be the takeaway\\, punctuated by \\\"The Last Jedi\\\" title\\, the fact that (spoiler alert) Rey is the child of degenerate nobodies\\, and that the \\\"Rebellion\\\" is seen in the last shot of the film as being a kind of street spirit that belongs not to the Jedi but the downtrodden who are the true heroes of the franchise.\\nBut then there's the rest of the film. In which heroic actions and moments of sacrifice are saved by moments of \\\"that was close!\\\" and \\\"woohoo we made it!\\\" In which the \\\"last\\\" Jedi isn't even the last Jedi. In which the sacrifice of the rebellion is just implied people dying in CGI explosions. In which the slave child in the final shot of the film had to be punctuated with some Jedi power because hey\\, nobody cares about nobodies\\, am I right?\\nThis film is the epitome of the soulless algorithms which construct modern mass-produced content. Trust me\\, in a few years you'll realize it's \\\"Attack of the Clones\\\" all over again. Beneath its topical Trump-era themes of resistance and anti-authoritarian rebellion is a drinking game where the overuse of the term \\\"resistance\\\" is meant to stimulate all the parts of your brain that make you think what you're seeing is something you would want to see again. You won't.\\nThe excess in having not one but TWO new Pokemon-inspired creatures\\, a pointless scene involving space reindeer\\, an \\\"evil\\\" BB-8\\, and a slightly modified AT-AT was like watching the marketing team push the Christmas toy envelope to see where it could bend. Oh\\, and did I mention we also have TWO new star destroyers?\\nThe Disney Marvel style comedy\\, in which a perfectly constructed moment of solemnness and dramatic tension is comically ruined by a character's unexpected moment of sass is everywhere in this film. It's so goddamn overused it borders on parody. The fact that the film's producers would turn the previous film's \\\"torch passing\\\" finale into a cheap gag where Luke tosses the lightsaber over his head for a laugh speaks volumes to how badly they rely on this crutch. It's like whatever jokester punched up the Ragnarok script was available on a 2-for-1 coverage sale.\\nWhile I think Mark Hamill handed in a great performance\\, the circumstances surrounding his character made no sense. What the hell was the point of Luke's pilgrimage to the lost Jedi temple? Nothing? Literally nothing? No new knowledge? No lesson? He found the secret & sacred location at the beginning of the entire Jedi order and it gave him literally no advantage? It was just a place to find Porgs? Okay.\\nAhem\\, moving on. *checks notes*... Daisy Ridley and Adam Driver were horribly misused. The strength of The Force Awakens was in the chemistry it allowed to blossom between characters. Star Wars has always been its most fun when we see the relationship between our heroes grow as friends\\, and watching Ridley and Boyega on the Millennium Falcon in the previous film had a lot of that same joy and felt like we were watching what would be the new crew to carry the series. However\\, watching John Boyega carry a meaningless subplot involving codes? Was it codes? Which never came to fruition was like having a root canal. Daisy Ridley's character had very little arc\\, and Adam Driver's purpose in this film (which was to become MORE threatening) was undermined in the final act. I love Carrie Fisher but she was NOT at a point in her career to carry this big of a role. And the scene in which she died\\, arguably what should have been a pivotal emotional moment in the film\\, was undermined in a moment of unintentional hilarity as she manages to somehow live.","true":true}