{"101487":133131,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ignore the wild manipulation by the vast numbers of trolls who are running this film down. This is a hilarious space romp\\, right back at its roots of what Star Wars was really all about - having some fun. The tone of the film is set from the moment that Stars Wars fans have waited 40 years for: the utterance of the first words from Mark Hamill - the hand outstretched for the Light Sabre\\, only for him to toss it over his shoulder and walk away. I laughed my head off - it was a true comedy moment and I could feel the ire that moment would have drawn\\, which made me laugh even harder. Star Wars had finally stopped trying to be super-serious lost in boring stories and was about to deliver something truly entertaining...\\n\\nThe painful over analysis of so called fans between films builds things up for themselves far too much and as a result expectation levels that each film must somehow be a masterpiece are silly. Star Wars has consistently been a failed franchise - 4 out of 8 films are dogs\\, but this is NOT one of them. If you ignore the fact that Rogue One was a disaster and should not have been made\\, The Last Jedi follows the Force Awakens nicely though I think it would have been a fitting end to Carrie Fisher if she could have floated off into space preserved in ice instead of coming back to life and moving back into the ship in a semi-ludicrous fashion. This one moment aside\\, the film is brilliant. Go see it\\, you won't regret it.","true":true}