{"101487":175115,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is a 2 1\/2 hour mess that destroys all the mythology and character relationships setup by the original trilogy and the Force Awakens. We are given new and relatively useless characters to focus on instead of the major plot questions setup by the Force Awakens. We are given a boring \\\"space casino\\\" scene to complain about capitalism and war profiteering which kinda makes it seem as though the average person in the galaxy does not give a care about the war. Rey apparently is just a jedi without training and will learn the force from her textbooks taken from a tree (jedis get homework?) and she gets to learn on the job. Luke is made into a coward that despises the Jedi and he really craps on the legacy of Obi Wan Kenobi. Did I mention Leia turns into superman and can fly across space with no air only to be too weak to open up a door...then needing to be put on life support! When she returns she can blow doors open like the cool aid man but whatever! Snoke is also a waste of a character with no backstory...he just mumbles destiny a lot then gets killed off in the cheapest way possible. Chewie has nothing to do in the movie except get shamed for eating meat....wonderful. Oh another thing....Luke never leaves that island! He does nothing but live with fishnuns on his island. Too many problems to list in this movie...it is not creative or fun. Disney showed its influence on the ending with a little slave boy using the force (magic) to move a broom and look up to the stars (when you wish upon a star). If this review has no structure it really is because the movie has no story or structure. Im done and not going to see the next movie after this heap of garbage.","true":true}