{"101487":184979,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is only getting 1 star because of the 2 action sequences I enjoyed. The entire rest of the film was so bad! There are pointless characters injected in for pushing \\\"strong and independent\\\" females\\, which leads to pointless scenes. We get it Disney\\, girls can be tough too. The movie tries to be funny (its not). Entire scenes are added to the film to push political agendas. Wealth inequality and animal cruelty are the two big ones. Wealthy people are all evil apparently and releasing a few animals for just a moment of freedom is a cause worth dying for (and having all your friends die too). There is an attempt at a romance between Finn and rose (new character) which was just awkward. The force is being used in many ways we havent seen before. Mind skyping\\, flying like superman through space\\, astral projection\\, casting lightning bolts from the sky. They built up Reys story in the first movie like she was someone important\\, her parents were space prostitutes who dropped her off. They built up emperor snoke like he was this all powerful Sith leader\\, he died in 5 seconds. They betray Lukes character. He literally squeezes alien tit milk into a pacifier to quench his thirst. Wtf?? Captain phasma was in this movie for 5 seconds again just to get beat in a fight by Finn. Rey is only strong in the force because Kylo ren is growing in thr force and apparently the force uses people to keep balance... Im sure some people will like this movie but I will not be paying to see the next one. Rian Johnson really screwed up a great opportunity. 1 star for thr 2 action scenes i enjoyed","true":true}