{"101487":185857,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie takes all the questions that you are left with at the end of Force Awakens and answers them with \\\"meh doesn't matter\\\". \\n\\nIt makes Finn someone who your supposed to like and cheer for honestly seem rather unlikeable\\, I mean trying to run away again really why should I care what happens to him if every time the first order shows up he suddenly can be found next to the nearest escape pod! Then there is the sorta relationship going on between Finn and Rose which apart from being cliche was boring\\, which brings me on to their side mission. Apart from being wasting time and dragging the movie out longer than it needed to be it was dull didn't feel like the Star Wars universe instead it was more the Fifth Element. On a minor note I was annoyed that Rose basically decided to ram Finn out the way stopping him from stopping the laser drill thing for the simple reason of \\\"notice me senpai!!\\\".\\n\\nI did like the fight scene with the red guards and would have given this film a higher score if the big bad that was being built up in the Force Awakens didn't get killed while in the middle of a monolog in the most pathetic way possible. \\n\\nThe scenes with Yoda were a bit jarring but overall I did like them however I feel they would have been better if it had been Anakin taking to Luke\\, but what do I know.\\n\\nBut the worst scene by far and the one most people seem to pick fault with has to be Leia Poppins it made no sense in the Star Wars universe and me and my mates all wondered if there was someone in the popcorn when we watched this!!\\n\\noverall if this had not been a Star Wars film it would probably be quite good but it breaks too many rule made over the years to be a good Star Wars filmed from a continuity point it didn't really mesh with the last film that well at all.","true":true}