{"101487":184249,"Last Jedi":"Last Jedi","2017-12-15":"2018-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is a disgrace and an absolute insult to the original trilogy. Even the Phanton Menace is a masterpiece compared to this bad hack attempt at story-telling. It undermines much of the interesting setup from the Force Awakens and leaves me with absolutely no reason or desire to see Episode IX. It demonstrates a real lack of understanding of how the physics of space work or how The Force works. It treats beloved original trilogy characters like absolute garbage and wastes opportunities to pick up threads opened by The Force Awakens and expand on them (Where are the knights of Ren\\, why have Luke do such a cool thing to avoid actually figting in a battle only to die afterwards\\, why is Rey so powerful without training? Why is the First Order so powerful? Why is the resistance so weak? 1 star for special effects and music. Other than that the movie gets nothing for plot\\, nothing for character development\\, nothing for understanding the laws of physics\\, nothing for understanding how the force works\\, nothing for any background on how Snoke came to power\\, why Rey is so powerful without training\\, how the first order came to power and why it is so powerful\\, why the resistance is so small and so weak. This movie really is a waste of time. I left the theatre with no desire or reason to see Episode IX. Since none of the questions presented by The Force Awakens were answered in The Last Jedi why would I waste my time seeing episode IX where they probably won't be answered either.","true":true}