{"101487":154124,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"mmm The rating on here is highly suspicious.  It was stuck on 49% for 3 weeks while it was getting slated daily.  On the other hand I see grown men giving this nonsense 5 stars and claiming everyone else is fan boys.\\n  I watched this nonsense for a second time to show my girlfriend how bad this was.  Course I streamed it not ever going to give anymore money for this garbage. She's not even a fan and she slated it.  Is that the bad guy? haha he looks like my younger brother.  Trust me people watching this a second time is painful and notably worse.  Anyone of us could of written a better plot\\, characters\\, and write anything that's believable even in sci fi.  \\nWhat really stood out was the ridiculous idiotic and sloppy writing.  Standing looking out a window waiting for her to fly back in? really? Is this a parody? Captain phasma disappears after the explosion and next scene shes 100 yards away walking towards the 2 most garbage characters in history of film production.  Rey can fy everything\\, has no fear\\, knows everything\\, can communicate with chewy and r2d2.  Why isn't daisy ridley not turning around and telling these hacks this dosnt work I can understand them?  As viewers we dont care nor embrace her journey because as she is she's super to everyone. Poe knows Skywalker is buying time? For what? where does he get that from? You buy time if you have a plan.  There was no plan. And who are they (poe) who are gonna take out the cannon?  As well as we have a fix piper flying 2 kinds of ships.  NO thought for Han solo? Anyone? Were they making these movies up as they went along? I don't entirely blame the director on this one\\, there should of been a 3 movie plan from the start with the same director someone who has a clue.  The ending do we really care? since return of the jedi were down to a few huddled inside the falcon\\, happy moods\\, and claiming that's all we need with a broken lightsaver in half.  Absolutely garbage story telling. There is nothing for anyone viewer to care about for the next movie. Im not interested in anything further.  Please people don't pay to watch more garbage.  40 years later we are at this stage.  Appalled at the lack of creativity a 10 year old can do better.","true":true}