{"101487":172617,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Thanks\\, Rian Johnson and Disney\\, for ruining the most precious franchise of my childhood and turning it into a marketing debacle. This movie is honestly the most disappointing premiere of any movie I've seen- ever. Including the Phantom Menace. I was done with this movie after the first twenty minutes when Leia turned into superman\\, came back to life in deep space and floated back to her ship. The movie just got more ridiculous from there. I have never\\, ever\\, been more disappointed in a movie or more let down. this was awful. Like\\, fate of the furious bad. Mariah Carey \\\"Glitter\\\" bad. I pulled my hat over my eyes and stopped watching. Disney has ruined star wars. Don't believe the hype. Wait till it comes out on Netflix. I'm so let down and disgusted\\, I never want to watch another of these again. This will forever change the franchise- it won't recover it's former mythical power or its devoted fanbase that keeps it going. I feel betrayed. I think a lot of fans who liked it or were lukewarm are happy they went to a star wars film and that it touched on a lot of the old story elements. This is true. what is also true is that it took all of those elements\\, and then jumped the shark\\, joked and slapsticked them like someone desecrating a church or monument. It's like if someone came to the National Museum of Art and starting drawing mustaches on all the portraits\\, then claimed this was new 'art.' Maybe\\, but at the expense of everything sacred. This is over for me.","true":true}