{"101487":98917,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Act I = BattleStar Gallactica \\\"The Chase\\\" (without any logic...because the 1st order has gas and could just jump in front).  The rest of Act I is also stolen from other films and stitched together Frankenstein-style (i.e. without fitting well).  Which ones...  The bombers...Pearl Harbor.  The 'Haldo Surprise Sacrifice'...that is Capt. Kirks' dad from the Star Trek Reboot.  The 'Rebelion against the chain of command'... That is the second movie in the Star Trek reboot.  C'mon guys.   Plagiarize something a little older if you don't want to be distracting.\\n\\nBut Act II... Original? No.  It is all Kung Fu Panda.  Luke is Master Shifu.  Rey is Po doing the wrong thing\\, and hijinks ensue.   \\n\\nAnd Act III?  Harry Potter\\, most of it.  The Rey-Kylo mind meld?  Yeah.  Well apparently it is because a fragment of Kylo's soul attached itself to the only living thing in the room when...  OOOPS  WRONG MOVIE.\\n\\nThe final battle?  Pure Harry Potter And the Deathly Hallows part II. Imagine\\, go watch that Harry Potter flick again\\, and every time someone says \\\"Harry Potter\\\" in ACT III of that film just insert \\\"Luke Skywalker\\\".  You might find the image is easier to retain than anything in 'The Last Jedi'.   Alternatively\\, watch the 'every gun on Luke' scene in the last Jedi and whisper to yourself\\, \\\"Inner Peace.   Inner Peace.\\\"   Yeah\\,  Kung Fu Panda II had the exact same scene...and done better.\\n\\nLuke's end?  Back to Kung Fu Panda... Good bye Ugway!   And thanks for all those apricot petals blowing in the wind! (Like the fetid uncreative gas rising from TLJ's poor mind-boggled writer.)\\nEvery.\\nScene.\\nIs.\\nFrom.\\nAnother.\\nFilm.","true":true}