{"101487":123974,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Good SFX good Music - That's it.\\nThe rest is simply terrible.\\nThe plot is so senseless and illogical it hurts.\\nI could write a book about the stupid ideas and irrelevant story arcs - the bland characters. Mary Sue Rey etc.\\n\\nBut what they have done to Luke is beyond words. They changed his character so much and dealt with him so disrespectful that it breaks my heart.\\n\\nAlso it seems that they want to transform the Jedi into superheroes that can do almost everything. Perhaps by doing so they can open the door to movies such like: \\\"Avengers vs Jedi\\\".\\n\\nI watched all the films with my children - and they liked them all - I even bought them some merchandise.  But guess what even my kids didn't like the last Jedi. \\n\\nWe won't see the final movie of this trilogy on cinema. We will wait for it to appear on TV and certainly won't buy anymore merchandise\\,\\n\\nSome advices for Disney:\\n- Care far more about the fans and less on \\\"new audiences\\\". Because the fans carry the fascination over to the next generation by themselves. A lost fan lost won't promote it to her\/his children or friends.\\n- Spend more time (and money) for a good script. \\n- Get advice for the script by people who actually saw the movies and read some books (because I doubt that this is happening).\\n- Leave politics out of the movie\\n- Since you have killed the only remaining candidate (Luke) Introduce a male character that isn't a moron.","true":true}