{"101487":186649,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie was hard to watch as a long time Star Wars fan. The music and visuals were stunning! The symbolism of the dark side and light was almost better juxtaposition than the Empire Strikes back. Kylo and Rey fighting together was awesome! \\n\\nHowever\\, I had a lot of problems with this movie.\\nIt felt like the plot was written by an intern rather than a serious script writer.\\nGeneral Hondo waiting till only a handful of the resistance ships were left before jumping into light speed made no sense with her character.\\nHer unwillingness to share the escape plan to Poe which caused a mutiny was stupid.\\nLeia floating like a fairy was ridiculous.\\nHer lack of injuries was unlikely and made no sense with the rest of Star Wars lore.\\nFinn and Rose's story line had no plot significance except to make a political point against the 1% and support animal rights.\\n\\nI love female protagonists in Star Wars. Jyn Erso\\, Leia\\, and Padme are wonderful characters. I love these characters because they struggle and make mistakes. They feel like real people who may not make it through the movie. Rey is an awful character. She never physically struggles. She is good at everything. I don't feel like she is ever really in danger. No villain can touch her\\, and she is the strongest force user of the new series with no equal.\\nThe treatment of Luke in this movie made very little sense with his character. He is very loyal and protective towards his family. He had hope for Vader even after Vader killed his mentor Kenobi and even at the risk of being killed by the Emperor. Luke would never threaten his own nephew no matter how close to the dark side he was. He saved Vader from the dark side. Also\\, he would never leave Leia to fight the First Order alone.","true":true}