{"101487":106410,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A total waste of time...this movie should never exist...is good as a movie but as a Star Wars movie is a total insult and garbage throw it in the big Star Wars fans...if you agree and like it this movie then good job\\, Disney will make more garbage like this...and finally ruin Star Wars forever...if you allow this to happen then forget that you are a Star Wars fan...the reasons why this movie is a insult because all our big questions from The Force Awakens were answered very poorly and make no sense for what episode 7 tease us with...Now this film finally make me to believe that Rey is really a Marry Sue..even if I defended her 2 years...who Snoke is and why he is so powerful..nothing...they butchered all important characters like Rey turning her into a really Mary Sue who has no training at all but she is so powerful...this movie killed Luke Skywalker and leave us with the impression that he is now just a silly old man and a coward who tried to kill his nephew for having dark thoughts?! OH COME ON!!! He turn back to light Dark Vader who was fully dark and evil and he never tried to even talk with his nephew for fuck sake! I don't buy that Disney! Even Mark Hamill said he need it to act and play a different character for this movie\\, this wasn't Luke Skywalker...what about Leia...poor Carrie Fisher...her character is destroyed...yes some people might be happy to see her using the force...and trust me I'm one of them but not like this Disney! Not like this! She did something no one can do without any training at all...so then Luke was the most weak force user character from all Star Wars universe? If he need it so much training just to lift a rock...\\nThis movie ruined Star Wars for me! Star Wars fans don't let yourself tricked by awesome visual effect and poor jokes from Disney!","true":true}