{"101487":175479,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-24","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is the absolute worst Star Wars movie in the saga. Don't be fooled. There is no way this movie is 91% fresh\\, that would be like critics saying \\\"Batman & Robin\\\" is a far superior film to \\\"The Dark Knight\\\"  \\nThe Last Jedi is a movie basically made out of greed.  Any reality or common sense in this film is completely out the window. \\nThis movie is a horrible mess filled with plot holes\\, rehashed ideas\\, WTF moments and dumb decisions.  Disney has decided to push their politics (while milking any last remaining cash from original Star Wars fans) instead of telling a good story that makes any sense within the entire Star Wars saga. The humor in the film falls extremely flat. Most of the jokes with Rey and Luke are just so brutal to watch. I feel for Mark Hamill in this one\\, because you can tell he hated being in this stupid film. \\nThe stupid cheesy lines of dialog in the film are as bad as any in the Star Wars prequels.  Luke comments on Leia's hair?  Luke and Leia (two character icons) and haven't appeared together on screen since 1983\\, and that's all he has to say??? The saddest thing about The Last Jedi is the total lack of respect and judgement that Disney and Rian Johnson has shown to everything that was created before it. Watching this movie is like watching beloved old friends being marched into Disney death camps. But Disney will still show Chewbacca\\, C3PO or Yoda for a second or two just to remind you you might be watching a Star Wars movie. This was Disney's FU to original Star Wars fans. The Star Wars magic is gone and it isn't coming back.","true":true}