{"101487":130648,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I didn't understand the hate and low audience rating before but I do after watching it. I could barely keep myself watching. I'm admittedly not the biggest Star Wars fanboy but I'm shocked this was released to theaters in its current form.\\n\\nSome spoilers below.\\n\\nPrank call. Felt flat\\, why did they do that.\\n\\nWhat happened to literally all the plot threads set up in TFA?\\n\\nHan Solo just died\\, isn't anyone sad? He should be more than a plot device to add conflict between Kylo and Rey. \\n\\nLeia flies? Okay no problem\\, so why can she open a door to vacuum and there is no air sucking people out. This is a movie about space..\\n\\nWhy did they use Snoke so cheaply. He comes out of the shadows and is thrown away like so many other characters and plot threads.\\n\\nThe helmet. The shadow of Vader should be a huge thread through these three movies. It's not now.\\n\\nKnights of Ren. Who are they. Where are they. Why not use them to foreshadow?\\n\\nRey beats Luke in training.\\n\\nLuke's ghost should have the same look as him why did he show up with a freshly dyed beard?\\n\\nThe chubby girl chasing Finn's character like a 14 year old. Why? What did that serve.\\n\\nThe casino. What?\\n\\nHow is it the balance of power is exactly the same after a moon sized base was just destroyed and the resistance in essence won?\\n\\nWhy the fuck does something being bigger make it stronger again? I've had enough of gigantic ships and death stars.\\n\\nPhasma. What a waste of a character.\\n\\nI honestly had a hard time even paying attention to this movie. It felt like it took all the plot threads of Star Wars\\, ate those along with the script and took a big steamy shit and stepped on it. It's hard to believe they greenlit this movie.\\n\\nPositives: The effects were good & it had the look and feel of star wars. It's just that everything under the hood was completely different from what I expected. If the goal was to subvert expectations I felt they accomplished that but it was at the expense of a quality movie and didn't fit the Star Wars brand one bit.","true":true}