{"101487":169053,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So to date we have had a remake of Episode IV (TFA)\\, a film that's the opening crawl of Episode IV (Rogue One)\\, and now this. Is it a remake of Episode V? No. It's the boring bit between IV and V\\, where the rebellion leave their base on Yavin IV and relocate to Hoth. That's the plot Rian decided to go with. \\n\\nAmazing.\\n\\nOh\\, and if that was too creative and bold for you\\, Rey's side story is swiped from the original trilogy as well. Quick stop at Dagobah for some DIY Jedi training. Then skips straight to the throne room confrontation with the Emperor. Cuts all that boring character development and world building right out. How exciting. How visionary.\\n\\nRian's decision to set this film immediately after TFA hobbles it from the start. And it was done\\, so he claimed\\, because the end of TFA was so captivating.\\n\\n\\\"When I started coming up with the story\\, I realized that I wanted to immediately... I didn't even really think about it\\, the notion that we were going to end up breaking kind of a long standing Star Wars tradition and for the first time this movie is going to start right where the last one left off. Because I don't want to skip ahead. That last moment of VII. I want to see what happens next.\\\" Rian Johnson\\, Star Wars Celebration Europe 2016\\n\\nThat's incredible\\, Rian. You wrote yourself into a corner just because you wanted Luke to toss the lightsaber over his shoulder. The whole plot of this film was immediately restricted so we could get that emotional payoff. Was it worth it? \\n\\nIn every interview I have watched\\, trying to understand how this film ever got made\\, it's clear that Rian does not give a shit. Or Ram Bergman for that matter. He seems to be avoiding the attention that RJ and KK are getting\\, but he deserves a shout out too. He helped Rian to craft this gem of a movie and doesn't get any recognition for it. Good job. You should be proud.\\n\\nI wish I cared about this franchise as much as Ram and Rian do.","true":true}