{"101487":127644,"Last Jedi":"Last Jedi","2017-12-15":"2018-10-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Hi\\, My name is Greg. i am 23. I have never taken the time to review something online before. I never thought it necessary. that has changed.\\n\\nThis movies ruined star wars for me. This movie...\\n\\nThis movie ruined Luke Skywalker \\n\\nthe unpredictability of the the force awakens does not make it good. every twist seems to come with its own plot holes and at times even shake the foundation of star wars. \\ni studied political science at one of the most liberal colleges in the country\\, i am no foe to political correctness. but\\, i believe\\, that the constant pc pushing was so nakedly obvious and so shoved down my throat\\, that it drastically took away from my viewing experience. When Admiral Holdo goes into hyperspace and destroys the opposing ship\\, the moment is supposed to be glorious. All i could think about was how that one instant ruined space battles for the entire star wars franchise. Every space battle should just be hypspacing transports into battleships. \\n\\nwhen rose crashed into finn to save him\\, how could she even be remotely confident that he would not die? why did she rescue finn if he was going to save the rebellion? wasnt her whole family murdered by the first order? \\n\\nwhy is luke skywalker not luke skywalker. Luke was always hopeful and optimistic. luke was an icon of hope. why turn him into a shmuck? what is there to gain? god. i'm so dumbfounded. \\nwhy make luke a  holigram magic thingy if youre going to kill him anyway?\\n\\nit's been a long time since i first watched the last jedi. These thoughts have festered in me for a long time. If you liked the movie\\, i'm happy for you. I don't mean to take away from your experience at all. But\\, for me\\, this movie ruined star wars. \\n\\nI can only hope that jj abrams rises to the challenge of repairing rian johnson's torn up plane before it crashes. \\n\\nThank you for reading","true":true}