{"101487":167710,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So disappointing after such a well done film like Rogue One. It’s like this movie was written for children where the effort required to suspend disbelief is very minimal. Unfortunately this is a slap in the face to the adult fans and when you have a 40 year old franchise\\, that’s just an a-hole move. Thanks\\, Disney. Many times I was thinking to myself\\, this is stupid. In seemingly all the scenes with the “Resistance””\\, they acted like they didn’t have any grasp of military tactics or how to handle themselves. What are they resisting exactly? I never understood that in The Force Awakens. Aren’t they the Army and Navy of the New Republic?Seems like they want you to push the “good guys vs. bad guys” I believe button and not explain a thing. Technology was poorly used as a cheap plot device to create drama because they didn’t write a good enough story and develop the characters well enough to create drama. Running out of fuel and tracking ships through hyperspace? Massive shields protecting the ship from huge turbo laser blasts\\, but a TIE fighter blows up their bridge? Does auto-pilot not exist in the Star Wars galaxy even though they have droids to do everything? The whole side mission to the casino planet was a giant waste of time. Crappy writing again. If they needed a slicer for their ridiculous techno problem\\, don’t you think Lando may have been able to hook them up? The Jedi scenes were ok\\, but the background for why Ben Solo turned was stupid. Staining Luke’s character and not providing good character development to show Ben and Luke’s relationship turn sour to show it’s tragic nature was again\\, crappy writing. Just like the crappy writing for Anakin’s character in the prequel trilogy\\, you didn’t really care why Ben or Anakin turned to the dark side. If you have to see it\\, and I can’t blame anyone for wanting to see it\\, please wait until it comes out for rent on iTunes or something else. Don’t waste your money on overpriced tickets at the movies. ","true":true}