{"101487":193011,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Visually stunning. \\nThat said\\, writing\/script was a total mess. \\nSPOILERS\\nLessons viewers learned from the movie? Don't read important books containing wisdom if they're boring\\, because \\\"failure is the best teacher\\\"; the rebels will win because they'll save each other\\, said by one of the characters responsible for killing hundreds while trying to save them.\\nThe sole black main character again starts a coward and is no longer a romantic interest of the heroine; instead she's attracted to the bad guy she's hoping she can change or the rebellious white guy hero.\\nI liked having the movie give another look at morality besides light and dark... except\\, after briefly touching on it\\, it again falls back to light and dark morality.\\nDid you hate how the new Star Trek movies introduced technology that destroyed their franchise? (Transporters eliminating the need for starships or being able to cure death?!?); Well\\, apparently JJ Abrams must have had his meaty hand on this too. Be prepared for a new rebel weapon that can take out whole imperial fleets at the cost of a Droid and hyperdrive equipped fighter.\\n\\nWhen Fanboys tell you that all the Star Wars movies ignored science and physics... Should we just ignore it? Or do we demand better science in science fiction?\\n\\nRogue One has been the only redeeming Star Wars movie in recent times. This movie finally convinced me to no longer see these movies in theaters. I'll watch em at home when I can stream em","true":true}