{"101487":184641,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is everything wrong with modern cinema nowadays. The director values flashy lights\\, special effects\\, and good cinematography over good storytelling and character development. Rose could have been kept out of this film completely and if anything\\, it would have improved it just a little bit. This movie cost about 200 million dollars to make and yet\\, more effort was put towards how the film looked over attempting to cover or repair the amount of plot holes in this film. How did Poe not get blown up by the First Order's dreadnought at the beginning of the film when no lone fighter has ever had a chance of attacking a star destroyer head-on in the original trilogy and other SW films? How does General Leia know how to use the force? Just because she has it like Luke Skywalker\\, that doesn't mean she knows how to use it. It's another reason why Rey is one of the worst characters in the saga. She has no character development because her character is already well-developed. She's not relatable for 99 percent of women and even for the majority of men\\, and is definitely a Mary Sue. Hyperspacing into other ships creates dozens of new questions for every single movie in the saga. Why didn't they try this on the Death Star? Why didn't they try this on the Super Star Destroyer? \\n\\nWhy not try it on the Starkiller Base??? They could have used a kamikaze droid to pilot vehicles straight into enemy targets. Who was Snoke\\, what is his backstory\\, and what is the origin of the First Order? I've never seen a film have this much potential and hype\\, but come up so short. Good job\\, Rian Johnson. Why didn't Holdo just tell Poe her plan right from the beginning? Oh yeah\\, it's so we can have an absurd mutiny scene onboard the main ship to serve as a weak subplot to waste some time. There was not much creativity in this film. Aside from ruining past characters\\, the new episodes once again copy from the original trilogy. The ending of TLJ was copied from the Hoth battle in The Empire Strikes Back. They even made the stormtroopers look different even though weather shouldn't be a concern on a salt planet unlike on the cold planet of Hoth. That's what you call a pathetic excuse in attempt to sell more toys and merchandise. How could Finn drag Rose's body a quarter of a mile across the salt ground without getting spotted and\/or shot at by the walkers at the end of the film? Not to mention\\, they completely ruined Luke Skywalker's character from the original trilogy. He would never abandon his friends or tell people to go away after spending so much time and effort to put together a map for someone to find him. There is no continuity in this film and it subverted my expectations for all the wrong reasons. This was the worst film in the saga.","true":true}