{"101487":146891,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I was shocked to see the disappointment from fans\\, but not surprised to see overall acceptance from the film critic base. This is a gorgeous movie and Disney obviously spares no expense. CGI is used sparingly so the universe is immersive and believable. As far as the fanatic's major complaints there were only so many options for the writers when it comes to Luke and his actions. He actually follows the actions of his counterparts Yoda and Obi Wan fairly closely. He lived in isolation and was reluctant to run back into action. He says it himself \\\"I am supposed to defeat the entire First Order with a laser sword\\\"? And that is a valid question. Snoke's identity is also a huge talking point\\, but who really cares besides those who made predictions? The original emperor was also mysterious and unknown throughout the entire original trilogy\\, although yes he lasted until the end. \\n\\nOverall this movie was just as enjoyable as The Force Awakens\\, and my 6 year old I seem to feel the same. Although it was a little too long for him\\, the time flew by for me. I can't get enough of this universe\\, regardless of how useless the Finn and Rose subplot ended up being. Yes some will argue that this movie didn't push the story forward\\, but it did dig a hole for the Resistance to climb out of in Episode 9. I look forward to that conclusion\/confrontation. For me The Last Jedi was a way for all the major characters to fail and learn from that failure\\, just as Yoda proclaimed.","true":true}