{"101487":127159,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Hatchet job. Absurd plotholes. Unbelievably terrible dialogue. The \\\"now its worth it\\\" line from the idiotic Canto Bight subplot and the insanely dumb \\\"saving what we love\\\" line on Crait were particularly bad. One\\, as why would taking a fecking harness off an animal who is going to be recaptured in ten minutes be worth sacrificing the entire Resistance\\, especially when they ignored the slave children! And secondly\\, beacuse Finn was actually saving who he loved and sacrificing himself in the process!\\n\\nRey is a ridiculously overpowered Mary Sue. She has done nothing to deserve this (all those hints in TFA that perhaps she had Force training in her youth which made it almost forgivable to be so inexplicably powerful were ignored and it now cannot be justified).\\n\\nThe First Order offer no real threat whatsoever. Instead of the terror of ultimate evil and a totalitarian regime we have an emo crybaby and Mr Bean.\\n\\nI could go on. A LOT more.\\n\\nBut let me finish by saying that the treatment of Luke Skywalker in this movie made me want to weep. One of the greatest heroes from our childhood\\, reduced to a coward who would abandon the Galaxy he once fought to save\\, abandon the Force and Jedi Order\\, and abandon the family he loved\\,  to the point that he would consider killing his twin sister's son! The son of his best friend! His own fecking nephew?!! WTF?!!!\\n\\nAny emotion regarding Han's death? Anything regarding the destruction of several planets? How about any concern about Leia? Chewy? R2D2? C3PO?? Anything??? No.... Just reduce him to a random coward and then get him off the screen as fast as possible so we can focus on Mary Sue Rey.  \\n\\nI have no interest in further Star Wars movies by Disney. I won't be buying any merchandise. I will show my children the Original trilogy and the prequels and tell them that anything after that was terrible terrible mistake that they must avoid at all costs to prevent any further heartbreak... it really is that bad.","true":true}