{"101487":183829,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie falls for the same problem that the the prequels do\\, they just try to do too much and it all ends up being too uninteresting. But like the prequels\\, there were a few good points I enjoyed. the beginning scene was phenomenal... until it was undercut by bizarre humor and weird looking cgi. There was also a greater character development with Kylo Ren\/Ben Solo and a little bit with Rey.\\n\\nUnfortunately\\, the politics and side quest story and overall message of the narrative was not only poor Star Wars\\, but flat out bad writing.\\n\\nDo you know what nihilism is? it plagues the entire movie. Nothing matters. forget the past. Did you expect one thing? We're going to do the exact opposite just because we can.\\n\\nI mentioned the middle of the story earlier. This was without a doubt the worst part of Star Wars. Not as bad as Jar Jar\\, but pretty close. Those stupid Never-ending story creatures made the narrative feel like a never ending story. not to mention the on-the-nose politics. George Lucas has always been liberal\\, but the politics in the original and prequel trilogies was subtle. there was nothing subtle about the animal rights message that freed the mistreated creatures while leaving the slave humans to fend for themselves. It was just bad.\\n\\nLuke Skywalker's send off with the twin suns was beautifully poetic... but a severe mistreatment of his character. Not to mention his hopeful mentality that was lost in Rain Johnson's mind. Fans had every right to be upset.\\n\\noverall\\, it was a poor movie with a few good spots. But that was not enough for me to recommend it.","true":true}