{"101487":178867,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The sad thing about Star Wars: The Last Jedi is that it is generally a great movie for anyone except Star Wars fans. For young audience members that kicked off their fandom with Force Awakens I can imagine this movie gave them exciting twists and turns with the characters they most closely associate with Star Wars. For fans over the age of 15 the feeling is absolutely different.\\n*SPOILERS INCOMING*\\nFor those of us that fell in love with Star Wars through the original trilogy\\, the heroes Leia and Luke remain central heroes\\, shining lights of hope in a sea of darkness. Both characters were given hopeless\\, I'm-getting-too-old-for-this treatments. Mark Hamill suggested that the Luke Skywalker that he played in the original trilogy was not the same character he played in Last Jedi and I could not agree more. Aged Luke is miserable\\, cut off from the force and hopeless. This movie has Luke consider murdering a defenseless boy because he senses darkness in him after ending the original trilogy being the unstoppable optimist that saved his father from darkness despite all odds. In sum\\, Luke's new actions are entirely uncharacteristic. What is worse is that the movie delivers a truly epic Luke Skywalker moment toward the end only to follow it up by eliminating Luke from any future involvement in the franchise. Luke was our hero and we wanted more Luke\\, what this movie gave was an uncharacteristic return and an untimely loss of our original hero for seemingly no reason. The great tragedy of this movie is that Hamill may never be able to reprise his role in such a way to end his tenure as Luke Skywalker in the positive way he wrapped up at the end of Return of the Jedi.","true":true}