{"101487":142744,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's fascinating that so many critics are giving this film a high score. The excitement of a critic towards a film must partially be based on the number of unexpected twists. I'm sure that's how this monster was written. \\\"If everyone thinks x will happen\\, we should do y.\\\" This doesn't just apply to what you thought the story direction was before the film began. In fact\\, the story itself is full of \\\"gotcha moments\\\" where they purposely lead you to believe a thing is going to happen...only to have a rug pulled out from under you. Perhaps today's critics offer extra points for this? I just don't now.\\n\\nThe \\\"gotcha\\\" tactic negatively affects well-known characters. When critics rate a film they usually consider plot\\, screenplay\\, acting\\, music\\, etc. But if Hollywood is going to keep \\\"rebooting\\\" or \\\"extending\\\" properties and characters from our past\\, a new meter needs to be added. Perhaps call it \\\"stewardship of property\\\" or \\\"stewardship of fan base.\\\" On that measure\\, this film would fail miserably. This is not proper use of the force (flying Leia); this is not a wise Yoda; most of all\\, this is not Luke Skywalker. Even Hamill has stated this. \\n\\nIn Return of the Jedi\\, Luke refused to kill Vader-a confirmed murderer of thousands\/millions of people. There's no no way an even (older) wiser Luke would ever consider killing his nephew at the smallest hint of dark power. But even if there was an event where Kylo killed all of Luke's students-Luke wouldn't run away. He would find Kylo and try to convert him. If he couldn't convert him\\, Luke might fight him at that point but he certainly wouldn't unleash Kylo on the galaxy.\\n\\nBTW\\, where are 3PO and R2? Why does BB8 get more screen time than R2? So a younger generation can grow? Is that what people want from episodes 7\\,8\\, and 9? Lucasfilm had other options. They could have easily used these three films to focus on the characters we know and love and used the tag \\\"a Star Wars Story\\\" on a new\\, younger storyline. \\n\\nWe were mislead to think this was still the Star Wars we grew up with.","true":true}