{"101487":195216,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-06","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What a mess! \\nThat was my initial reaction at the end of this movie. Before watching it I read some reviews by critics that said it was the best Star Was ever and that the story was very original. I cannot believe that they saw the same movie I did. The story was a bad mix of Empire Strikes Back and Return of the Jedi\\, not original at all in my opinion. And in my personal ranking of Star Wars films this one ends up even lower than the Ewok Adventure.\\nWhy is it a mess? Because of very poor story development: the First Order are all idiots and the Rebels deserve a Darwin award for poor leadership\\, bad communication\\, stepping away from trusting a small group of people with an important life saving mission and choosing to fly into a death trap. There are no real villains left: Snoke was killed super easy by Kylo without ever being a threat to anyone\\, Kylo doesn't develop beyond the tantrum baby that wants to rule the galaxy\\, chokes at killing his mother\\, gets his ass kicked by a completely untrained Rey all the time and becomes less and less threatening in every scene. Almost all of the built up questions from the Force Awakens were \\\"answered\\\": What about Snoke? Oh\\, he's dead. What about Rey's parents and last name? They were deadbeats and no one cares. What about Luke? He became a disgusting sour old man\\, gets no redemption and then just when he starts to get back on track dies for no reason. What about the incredible powers Rey has without any training? Oh\\, that's normal see even some random kid can wield the force without training. The fact that they didn't solve the issue with Carrie Fishers death when they could have easily done so as Leia's role in this movie was fairly insignificant and there was a perfect opportunity in the story only adds to the feeling that this is a mess. \\nTwo stars remain out of the standard 5 stars that a Star Wars movie would get from me for the visual spectacle and the fact that I do like the new cast. Too bad they are forced to act out such a poor story.\\nFor the first time ever I am not looking forward to the next Star Wars movie as I cannot see an acceptable way forward\\, Kill Leia off in the opening crawl? Recast? CGI? No good options there. Rey's power for no reason situation has come too far to be fixed and in the conclusion of a trilogy the rewards of character growth should be reaped so there is no time to realign the character with the power if such a thing is even possible. Kylo is a very weak main villain and also not ready for the end stage of a trilogy in my opinion. But most of all I guess I just do not trust the people that are currently making this new trilogy. The Force awakens was A New Hope for me not only in the sense that it played copycat on that movie but also because the Star Wars feeling was back and the old cast was handing over to an exiting new cast with a lot of potential. Sure there were some problems with the story that left some questions needing answers but I believed that was all fixable and I liked it. The last Jedi did not fix any of the problems but rather doubled down on them and created plenty more while not moving the story forward at all (apart from lots of characters dying nothing really happens). And now J.J.\\, who is not known for bringing things to a satisfactory conclusion and who created some of the unaddressed issues in the first place\\, needs to bring this to a conclusion he cannot copycat his way out of......\\nIn my opinion Disney should postpone the next chapter in the trilogy\\, get some better writers on board\\, re-shoot and re-edit The Last Jedi to a movie that makes sense and re-release it  before continuing with the saga. I promise I would go and watch it and I would forget this ever happened.","true":true}