{"101487":133398,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I had really high hopes for The Last Jedi as I'm sure all of us did . In my opinion I didn't hate The Force Awakens or Rogue One. Personally I feel like Rogue One is one of the best Star Wars films. Next The Force Awakens was done magically. It built the characters strong and made things seamless from ROTJ to TFA. I only had two complaints. How quick Rey focused the force to have the Stormtrooper release her and that Chewie and Leia didn't embrace after Han died. The Last Jedi felt like a quickly put together film that had no direction. Rian Johnson started writing it after reading the script of TFA so that should tell you how rushed it was. The biggest mistake they made was to have Luke be sent off in the first place. Right then and there it ruined any chance or hope I had for the movie and that was after all the other questionable acts that were transpiring throughout the film. Secondly the reasoning behind Kylo Ren going to the darkside was weak and not well thought out. Phasma had little to no story in it and after the comic of Phasma being released you'd have thought she would have a bigger role. Finn seemed to take several steps backwards in the development of his character. Poe I hated in TFA but he was semi decent in this one. He had the most character development in my opinion. Almost like he is more important than Finn. Rey was hardly trained and where the heck did she come from flying the Millennium Falcon in the final battle scene? It was almost like she appeared out of no where. There was tons of filler\\, too much.  I feel robbed and let down. I don't understand how they could not truly answer any of the questions we had after TFA and then just forget about them rewriting EVERYTHING. This was the first Star Wars film that I left the theatre disappointed and feeling completely let down. Luke deserved so much more.. Leia did too. What was up with the whole Mary Poppins scene? It was almost comical. I'm not sure what was with Snoke\\, unless he didn't actually die? But if that's the case why do that in the first place? When Rey was with Snoke and Ren it felt like ROTJ which that was the only part I enjoyed. Them teaming up was pretty sick. I feel bad bashing it as it is Carrie Fishers last role but it was really bad. The entire film was a empty filler leaving nothing to build on. I know they are turning their focus to new characters but they are disrespecting the legacy of the original characters by the way they're portrayed and written off. Definitely my least favorite in the franchise and I fear what the trilogy that Rian Johnson is going to make will look like. Hopefully JJ Abrams can try to correct the mistakes made in 8 when he begins directing 9. It'll be a task in a half. Rian Johnson threw out everything Abrams built and left him bacially nothing to build on for Episode 9. May the Force be with Abrams to fix the mistakes Rian Johnson made.","true":true}