{"101487":135083,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'll start by saying I'm a lifelong Star Wars fan. \\nI've spent thousands of dollars on merchandise over the course of my life and I've seen all the movies hundreds and hundreds of times each. I've read most of the \\\"Expanded Universe\\\" novels and many of the comic books. Luke Skywalker was my hero when I was a kid. The Original Trilogy is great\\, obviously. I had lots of issues with the prequels but they were enjoyable overall. Jar-Jar was unnecessary and terrible. Most of Episode I was terrible\\, in fact\\, but we got some great lightsaber duels and a few other high points. Episodes II and III were pretty good\\, even considering the cringe-inducing relationship between Anakin and Padme.\\n\\nThe Force Awakens was a pretty weak Star Wars movie. I've only watched it twice. Once in the theater on opening day and once at home. There's no real need to see it again. At least it felt like a Star Wars movie. Kind of. But that kind of apathy isn't what I'm looking when it comes to Star Wars.\\n\\nRogue One was...OK. I saw it one time in theater and started watching it one time at home and didn't finish. Again...Return of the Apathy.\\n\\nTHIS movie. The Last Jedi. Who are Disney\\, Rian Johnson\\, and Kathleen Kennedy making this movie for? Certainly not Star Wars fans. Future\\, potential Star Wars fans? I don't know.\\n\\nIt's not even a good MOVIE\\, much less a good STAR WARS movie. It's a literal insult to anyone who is capable of making a rational judgment about movies. I have to say that\\, because there are a lot of people who can be entertained by anything and will like anything that they're told they're supposed to like. \\n\\nI'm not going to list all the things that were wrong with the movie. That's been done ad nauseum on Rotten Tomatoes already. There is very little actually RIGHT with this movie.\\n\\nWhile Kathleen Kennedy is in charge of Lucasfilm and while Rian Johnson is attached to a new Trilogy and while Disney insists on stomping on a property that means so much to so many\\, I will not be seeing any future Star Wars films.\\n\\nSolo: A Star Wars Story comes out soon. I won't be seeing it.\\n\\nI won't be seeing Episode IX.\\n\\nDisney and Kathleen Kennedy have made it clear to me that they do not need and\/or want my money. They disconnected from me\\, I didn't disconnect from them.\\n\\nI created a Rotten Tomatoes account for the sole purpose of leaving this review and doing my part to lower the average Audience Score rating. That\\, and hanging on to my money\\, are the only way I can communicate to Disney that they really screwed the pooch when it comes to Star Wars. \\n\\nThanks\\, but no thanks\\, Disney\\, Rian Johnson\\, and Kathleen Kennedy.","true":true}