{"101487":182745,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is probably the worst film in the franchise.  It manages to make TFA completely irrelevant while simultaneously busting major portions of what we know as canon.  In addition\\, the entire movie is filled with massive plotholes from beginning to end.  Things like....\\n\\n1.  Why spend 18+ hours chasing ships at sublight speed to close what appears to be less than 50km if distance while other ships are jumping in and out of lightspeed to the other side of the galaxy?  \\\"Smaller and lighter\\\" indeed.  Even the most basic military tactics could have made the rest of the movie irrelevant\\, but don't let that bother you...\\n\\n2.  The hyperspeed-kamikaze.  In isolation it seems awesome.  But if you actually think it through\\, you realize that\\, if this was so easy to do and there was no defense against it\\, it would be the primary mode of warfare in the galaxy.  Unmanned lightspeed kamikaze weapons.  Since it is not\\, we're left with either an inexplicable lack of a defense against it\\, or no explanation against why nobody has ever thought of it before.  \\n\\n3.  Sucker-punching snoke was a complete waste of a character\\n\\n4.  More evidence that Kylo has had extensive training yet still is barely on par with Rey who has had what\\, two short meditation sessions and a 2 minute lightsaber kata?  More \\\"girl power\\\" at the expense of believability and plot.\\n\\n5.  Canon-busting Yoda having massive atmospheric lightning powers in ghost form.  Canon-busting \\\"Jedi can apparently sublime into the force once they're at peace\\\".  \\n\\n6.  TFA and TLJ make the First Order appear to be so entirely inept that one struggles to understand how they have gotten this far.  \\n\\n7.  All the build up for Rey's parents meant nothing.  As are most of the other mysterious unknowns from TFA (Obi-wan vision\\, etc).  Depending on which particular question we're talking about\\, either the answer is \\\"there are no answers\/aka we just ignored that it existed) or the answer is something pointless.\\n\\nHonestly\\, at this point\\, I doubt if I'll even bother to see the next movie in theatres.  Wait for netflix.","true":true}