{"101487":133443,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I had to wait for a day to digest everything. And there are more than one flaw in this movie. It has gotten to a point where the more I think about it the more I believe that Star Wars is now completely gone. Jackass feminists like Joanna Robinson (Vanity Fair) believe is because fans don't really mean anything we are just showing hatred because we didn't like it. When it comes to Star Wars and the Star Wars community it is huge and it does hurt a lot\\, especially when it comes from someone that doesn't understand anything about it. I never cringed at a Star Wars movie before until I have seen this. This is the movie that was suppose to answer questions. Yet all I get was a death of a Supreme Leader that I don't even know how the fuck he got into power and I read all the god damn books that are considered cannon. The books and the movies of late are usually the same thing. Over powered female characters and their male counterparts that are bumbling blockheads. It is now in the recent movie as well. There were tasteless jokes that have no point what so ever. Like Kylo Ren needs to put on a shirt. Why would he be half naked in the first place? Stupid shit like that. A whole entire useless sub plot for Rose. That was just fat on the steak. It could have been done without. It was a crap plot surrounded gloriously through CGI. One of the biggest things that did strike a nerve for me was the flashbacks. No Star Wars movie has a flashback scene except for the Force Awakens Which was done very nicely due to the force. We were promised more of Captain Phasma\\, and that was just just a joke. This whole movie was a joke and a lot of people are not taking fans seriously because they do not understand that there is more to Star Wars than just gender bullshit. When it comes to Luke Skywalker it wasn't Luke Skywalker. Compared to what he was like in the episodes 4\\, 5\\, and 6 this isn't him. Especially when it came to the expanded universe which a lot of people don't even know that did exist for a time. This movie just makes me angry just even thinking about. No one got any answers from the prior movie\\, everything has been done before in prior Star Wars films. It like Disney if just toying with everyone because everyone has a nostalgic factor. They just think that the fans are stupid\\, because all they want is money. The funny thing that I can think of is that Star Wars only exists because of the fans. If is wasn't for the Thrawn trilogy by Timothy Zahn. It would have been done a long\\, long time ago. (this is only an opinion not a statement) I\\, however am not taking this lightly and I will not be made a fool out of. This movie is a disgrace to the Star Wars franchise and I want Disney to fucking fix it!","true":true}