{"101487":171012,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Such a frustrating disappointment and wasted opportunity.  The strong visual effects and some nice settings and set designs are not enough to save this film from a raft of problems\\, from bad pacing and a plodding story line; to nonsensical extensions to the fundamental laws of the Star Wars universe (ridiculous force powers and hyperspace physics); to utter lack of believable on-screen chemistry between the characters\\, old and new; to disgraceful re-characterization of an old hero (Luke) for no good reason or payoff; to overbearing ideology superseding good storytelling; to \\\"Hey\\, look at this! Bet you didn't expect that! I'm sooo subversive...\\\" arrogantly selfish direction that shocks viewers without delighting them; to numerous dropped story lines and setups from Episode VII that go nowhere; to humor that veers into spoof territory; to weak villains; to characters so unreasonably capable you catch yourself saying \\\"oh\\, come on!\\\" repeatedly; and much more but I will stop there.  \\n\\nDoesn't Lucasfilm understand you can't grow the audience by annoying the best and most faithful customers of the brand to pander to a market segment that is largely indifferent?  I saw the original trilogy in theaters many times (11 times for 'A New Hope' alone) and bought a lot of merchandise over the years.  I saw the prequels and TFA twice each.  I saw TLJ once\\, but that will be all.  The more I think about TLJ\\, the less I like it. How many repeat tickets and BlueRay discs are the presumed 'new fans' buying? Answer: not many\\, and not nearly enough to grow the total audience when old fans feel driven away.\\n\\nAnd here is where Episode VIII really fails: as the middle act of a three-part story. There's nothing to look forward to for Episode IX: we can't see Han\\, Luke\\, and Leia together; Rey is essentially all-powerful already; Kylo is contemptible but hardly menacing; the Resistance is practically gone; basically\\, there are no big questions left to pique our interest.  The only reason to see it is to see whether JJ can somehow pull off a miracle and make something that is worthy of our attention and dollars as the conclusion of the sequel trilogy.  I won't be a customer if Episode IX (\\\"I? Icks!\\\") is more likely to annoy me than entertain me\\, disgust me than inspire me\\, or make me want to forget I ever saw it rather than tell everyone about it and drag them to the theater. \\n\\nIf you have the chance to sit this one out\\, skip it.  Don't buy the BlueRay or otherwise signal to Disney that you think this is an acceptable product.","true":true}