{"101487":159053,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok\\, I'll kick off by saying this film was marginally better than The Force Awakens... but it was still a horrible film. \\n\\nThe Good:\\n- Fantastic visuals and cool battles.\\n- The film explains *some* of why Rey was so effective in the last film\\, slightly off-setting her 'Mary Sue'-ness. This improves her character a fair bit. \\n\\nThe bad:\\n- So many unfunny jokes shoehorned in. The original trilogy had 3. 3. Jokes are fine but they really affect the pacing and make the films less serious than their predecessors. People can argue 'the films are for kids' all they want; in previous films we've had decapitations\\, insinuated drug use and a lot of fantasy violence. The series has never been wholly for kids.\\n- A very\\, very BORING plot Finn plot arc that is irrelevant to the film as a whole.\\n\\nThe Ugly:\\n- Plot holes galore. I won't spoil the movie for anyone but it is truly ridiculous if you actually think about the story past the bright explosions. \\n- Pacing is terrible.\\n- So many questions from the last film are left unanswered or effectively retconned. Who are the knight of Ren? Who is Snoke? etc etc.\\n- The characters\\, despite the actors best efforts\\, are as likeable as cardboard and have as much depth. \\n- Old loved characters are barely seen or are so different in personality they might as well have been written in as different characters. e.g. Ackbar (gone quick) or Luke (totally different).\\nWould I bother seeing this again? No way. The only way to salvage the series is to retcon this entire film and start again.","true":true}