{"101487":158587,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Now I know how fans felt when they saw The Phantom Menace; Disappointed.\\nSpoiler Warning. It's not like The Force Awakens was a masterpiece but this film is a dramatic drop in quality. Tonally it's a mess. On the one side Last Jedi is possibly the darkest installment but at the same time the humor is Jar-Jar leveled. As far as plot is concerned it feels like those movies that switch directors mid production. Why is there a Casino Royale\\, save the animals story taking up a third of my Star Wars movie? The characters are treated with the most disrespect. Po almost kills the entire Rebellion with his suicide missions but he's never truly reprimanded. They repeatedly forgive his bone-headedness and he doesn't learn anything. Finn regresses so much its as if he doesn't remember the previous installment. Snoke is completely disregarded. Favorites like Admiral Ackbar are killed off just to get a cheap emotional reaction. Phasma gets 5 minutes. Rose is just nothing. Vice Admiral is nothing. Chewbacca is nothing. The only characters who seem to have relevance and evolve over the course of their arcs are Rey\\, Kylo Ren\\, Leia\\, and Luke but even they are tainted.\\nLeia keeps dying but not really in the most ridiculous ways\\, for instance space Mary Poppins. Luke doesn't teach Rey how to use her force abilities\\, just the philosophical side of Jedi training yet she is still just as talented in the force as Kylo\\, who's been trained since childhood in both the Light and Darkside. The greatest flaw though is that the plot between Rey and Kylo. There is a great Star Wars story about a new generation of force users trying to learn from their pasts while also rejecting them\\, culminating in Kylo killing Snoke and offering to team up with Rey. Real shame the movie only devotes a third of it's time to this plot. Real shame the movie immediately answers the question of will Rey explore the dark side. Real shame the movie ends with destroying the Dreadnought and the Resistance escaping and then just keeps on going into a a not Hoth battle.\\nUnfunny\\, disjointed\\, too long\\, too dumb. You did a bad job.","true":true}