{"101487":132485,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"If you aren't really emotionally attached to Star Wars and just want to watch an action film then you will probably like it. If you however you really love the essence of what George Lucas created and has caused it to survive for 40 years then you will probably hate it. This film has literally destroyed 40 years of Star Wars.\\nPutting aside the underdeveloped plots the wasted characters\\, the poor story telling and the fact that they don't seem to have a coherent story but are just making it up as they go\\, this film attacks every thing that  made Star Wars great. You can now never go back to experiencing the originals in the same way. You will never have that feel good sense that we had at the end of Return of the Jedi\\, because now we know that the Republic never really won\\, the Empire was never really defeated and Luke Skywakker was a coward and utter failure who has been sitting on his backside for the last 35 years without training a single Jedi (rendering the tile Return of the Jedi\\, rather redundant). Compare this with how Obi Wan positively dealt with his failure in the original\\, by positively training a new conduit for the rebirth of the Jedi. It is almost like Ryan Johnson WANTED us to hate Luke so he could just kill off the character and move on. It is a great shame to see such a wonderful thing destroyed by corporate greed and directors who don't really know what Star Wars is about. Star Wars was George Lucas's brain child and he should never have sold his legacy\\, because now it is dead.","true":true}