{"101487":129944,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I can see why George Lucas never wanted to make any more Star Wars.\\nHow can you improve on perfection? The story dates to the 1970\/1980 the reverse hero's journey was told well via a space movie. It was more about Darth Vader's redemption\\, than about Luke as a hero and this is what makes it so magical as the hero was Darth Vader\\nThe depth of the story could be felt by those seeking an action movie or those looking for a deeper message of personal growth for one's own life journey.\\nThere was a time when all boys wanted to be Luke Sky walker\\, all girls wanted to be Princess Leia and all angry people wanted to be Darth Vader. Letting go of these childhood memories is hard but something we all must do if we are to grow into adults and tell our own hero's Journey to help and support those around us.\\nAs we grow we pass on the knowledge to the next generation with the hope they live a better life than we did.  In other words\\, Star Wars fans\\, you need to get over it\\, as the younger generation will never understand the emotional connect we had with the characters. The characters are disposable like a bad razor. \\nWe have moved in to the attention economy and that means short burst of dopamine in rapid succession otherwise the audience is going to check there Facebook feeds in the cinema\\n\\nI gave force awakens a 7 but 90% of the story was wasted and an anticlimax now\\, the rating goes down to a 2 as most of the movie was a waste of time.  My understanding of storytelling is you don't put things in a story if it has no meaning\\, it just causes distraction. \\n\\nThe movies main plot character is Kylo Ren I hope so otherwise why would you kill off snoke. and his journey to the dark side and back maybe.  I guess we will see the Knight of Ren come into play in IX.  Adam Driver performance was A grade and was a stand out in the movie he personally can get a 9 star from me for performance and for how much he improved from the last movie.\\n\\nLuke Light Saver seem pointless at this stage or is there more but judge form all the pointless plots I'm thinking not.\\n\\nSnoke seems pointless at this stage this was a massive let down\\, but it does make way for Kylo to be a supreme leader and we can see his rise to power. I hope\\n\\nFinn pointless\\, like pointless and I think he will stay pointless after all we need a token black guy in the movie. Fin obsession with Rey is disturbing any women would think that sort of behaviour would be creepy in the modern age.\\n\\nFin and Rey romance or is it Rose and Fin or are they going to have a three some that would make the film cover all the diversity issues.\\n\\nLeia's new force powers and Luke's new force power seems pointless one keeps one alive and one dies from it. Come on you need to treat the audience with a bit more respect than that.  Please I beg you to look at writers that do the miniseries now they write great stories. Hire the team from Breaking Bad that would fix most of the story telling problems.\\n\\nLuke is back to his wimpy self\\, what was the Return of the Jedi all about. The hero's journey was wasted he learnt nothing but back to my point maybe it was never about Luke but about Darth Vader and now Kylo Ren.  Lucky Yoda comes back as a force puppet ghost.  He can now interact with life on earth and make lightning burn trees.  So that is what OBI one was talking about when he said to Darth Vader strike me down and I become more powerful than you could possible imagine. Hope Luke can come back with some lightning action.\\n\\nWhy did vice Admiral Holdo have it in for Poe she told everyone the plan before him?  Poe is the number one pilot ok\\, so he got demoted\\, really.  I guess fin and Rose would not have been in the movie otherwise. Lesson learnt from this one. If you're not going to tell a fly boy something his going to go by your back and stuff up your plan anyways so you might as well tell him the plan.\\n\\nRey's new amazing force power now opens the way for anyone to have super amazing force powers just like picking up a broom and within weeks we just went from fine dining to eating at Macca's. The force now has no meaning\\, purpose or needs no special training just collect scrap metal or sweep a stable for a while and you're one with the force. Look what happen to Leia she picked it up while getting blasted out of the control ship. No need to put her in a Tauntaun the force will keep her warm. I guess this gives the writer the freedom to go anywhere now.\\n\\nNot sure why there was such a political motivate piece with the Rose and Fin going to Canto\\, free the animals go vegan\\, put down rich people for making weapons and selling them to both side and using kids as slaves. Not sure that was needed\\n\\nThe Crait battle was epic but really rushed can we get back some of that time from Canto\\nBeside Snoke getting cut in half we get a battle with the Elite Praetorian Guards for most of it\\, it was great\\, but Ben and Rey force powers kicked their arse way to easy.  How bad arse are the next Villains going to be\\, so they can beat Rey\\, that's not going to happen because she can create a hologram of herself\\, give Leah hans dice and kiss her good bye and then of course the dice have a force power of their own which can hang around long enough to disappear in Kylo's hands.  I person think Leah is very rude for dropping the dice anyways they were a present.","true":true}