{"101487":106928,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A visually stunning injustice to a beloved franchise. This movie was both AWESOME and REALLY BAD.TLJ is full of gorgeous space battles and awesome moments (which on their own are great). But\\, in the larger context of the entire saga\\, it ripped the heart out of what we all loved about Star Wars like Mola Ram in Temple of Doom. The nerd in me left the theatre stunned\\, confused and conflicted because I really did enjoy TLJ in the moment. But\\, once I had a few nights to ponder and digest.. this film did not live up to the hype and detracted from SW movie magic. \\n\\nSeeing Yoda - awesome.\\nSpace battles - awesome.\\nMon Calamari Star Cruiser ramming the Supremacy at light speed - one of the most epic cinema moments of all time.\\n\\nRay's continued mastery of the force without an ounce of training or explanation. Her parents reveal better be a misdirect. \\nSnoke is an arrogant nothingburger. He better be still alive\/the whole thing was an Astro Projection.\\nLukes character was assassinated and sent off in the worst way possible. No justice is done here at all.\\nLea's moments in the movie were cringe-worthy and \\\"WTF?\\\" inducing \\nPlot was poorly constructed\\nCharacter motivations were flawed (JUST TELL POE THE PLAAAAANNN)\\nThe casino scene\/side mission completely useless - movie would have been better if they figured out a different way of getting Finn into Supremacy and spent the time on Luke and Ray\\nPhasma underwhelmed again\\nI can keep going...... But.. I'm starting to feel the 2-star rating is a little generous.. so I will end right here.\\n\\nP.S.\\nJewbacca kills and cooks a porg... then won't eat it?!? C'mon!","true":true}