{"101487":100859,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A huge disappointment & a huge missed opportunity on many fronts\\, not the least of which would be Luke saving the galaxy & continuing with his hero image - going out with a bang\\, if he must be killed off.  But why\\, we are then left with all the heros we came to love being killed off - to make room for what?  Finn is a bore\\, his new girlfriend is ridiculous\\, & Ray is marginally interesting largely due to her interaction with Ben Solo.  ....nothing left for nostalgic fans to savor or even return for.  The movie has great effects\\, but a horrible story-line.  It was well acted\\, for a bad script.  None of our questions were not answered.  Some things were answered in ways fans didn't want.  There were many inconsistencies - is there now gravity in space?  Can you now use hyperspace jumps to destroy ships or even death stars?  If so why not just have droids fly ships at hyperspace jump into any enemy ship?  The 'force' can now be used to avoid \\\"space death\\\" & enable people to fly?\\nAnd the entire segments of Finn & girlfriend going to find a code-breaker was utterly ridiculous in soooo many ways - not the least being the all-too-obvious political overtones.  Many have noted an assault on white males.  I'm not sure I'd go that far\\, but could not help to note that every hero was female & Hann was knocked off as a loser (in VII) and Luke as a recluse coward in some ways; Poe made bad decisions\\, and all other white males were NAZI like 1st Order villains or the demonized 1%ers who gained wealth at the expense of others.\\nI walked out of the theater with mixed feeling & total disgust after reflection","true":true}