{"101487":180900,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film had the potential to do something great and it just squandered it.. \\nIt threw everything out from the force awakens. That's fine. You can do that if you're going to go into some interesting directions. Something new and creative... But no... It went nowhere...\\n\\nIt was a really long slow boring space \\\"car chase\\\" with a useless side story at some casino planet that had no point except to tell us there is corruption... All the while during this slow space chase characters and leaving and returning to the chase. \\n\\nLots of nitpicky logic plot holes that would take you out of the film. Some examples...\\n-Ship shields seem to work sometimes and sometimes not. A single X-wing can take out all the auto turrets on a frigate.. Where are the shields?! Also when Leia gets blown out of the ship. Where are the shields?\\n-Bombers are slow and get shredded up like paper.\\n-They \\\"drop\\\" bombs in space.\\n- If they can suicide lightspeed into ships. Then they could have always done this in the past to kill big ships.\\n-Why didn't the purple hair lady tell the plan to everyone so they wouldn't lose confidence in her?\\n\\nWhy didn't look come to the actual planet instead of force astral project? It would have been more badass.\\nLuke would never want to kill anyone if he thought they were going to the dark side...\\nAkbar should have piloted this ship into the other ship. If you're going to kill him off. He would have went out as a hero. But this new character we don't know anything about is going to be the hero?\\nKylo and Rey should have teamed up at the end and create something new for the series. Make the series go into a new creative direction. But nope. It's the same where we left off.. \\n\\nSo frustrating...\\nIt was entertaining but so many frustrating things that happen. \\nI was so looking forward to this film. I enjoyed the last two new films. But this was just so disappointing and sad.","true":true}