{"101487":167896,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So I finally went and saw E8 last night and managed to avoid any spoilers during the wait. Tried not to ad any here. I'm looking forward to discussions about the film and story. Overall I really liked it and feel like we're back in the rails again after E7. I remember describing E7 as\\, \\\"5 year old Craig loved it\\, 43 year old Craig understands that Star Wars movies are for kids and it wasn't really meant for him.\\\"\\n\\nI feel like E8 struck a balance (or at least tried to) between two generations of Star Wars fandom. 5 year old Craig loved E8.....and 45 year old Craig felt a lot....A LOT....of feelings during E8....and isn't that what films are supposed to do. \\n\\nMost of all I think E8 added a new layer of complexity to the saga....the concept of grey. Gone is the binary light side\/dark side conflict. I like that luke addresses the hypocrisy of Jedi. Do you every see Sith use mind control\\, which discipline really embraces freedom and free will? etc....  The two remaining force sensitives act within a full spectrum of emotion....Rey hates Kilo....and that's ok. The source of Kilo's conflict is love\\, and Kilo is undisciplined\\, has no control over his emotions and that's ok. \\n\\nThey are different shades of grey\\, and the universe if apparently full of future force users who will be finding their own paths and shades based on their relationships\\, experiences\\, values\\, and hearts.  \\n\\nWe won't win by killing what we hate....we'll win by saving what we love. Pass on what you have learned.","true":true}