{"101487":166713,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Set this movie a hundred years into the future and make Kylo Ren a great-grandson of the Skywalker clan\\, and it would be great.  But as a sendoff film for one of the greatest film heroes of all time\\, it is an abomination.\\n\\nAs SO MANY have pointed out\\, the writing staff have destroyed Luke Skywalker as a character with his attempted murder of young Ben Solo.  And this\\, more than anything else.  More than the useless casino scenes with Rose and Finn.  More than the fever-pitched hype around Snoke building up to nothing.  More than the Grandmistress of all Mary Sues becoming an expert with a lightsaber overnight.  None of it is as much a slap in the face to fans of the original than this one point.  \\n\\nThis is Star Wars as told by millennials.  And the millennials have proven that they have no understanding of character development\\, nor of mythology\\, nor of the Hero's Journey.  Rather than speaking to all of mankind\\, which is what episodes IV\\, V and VI did\\, Star Wars: The Last Jedi\\, like The Force Awakens before it\\, speaks only to a small subset of the population.  \\\"Woke\\\" 18-35 year olds   You know the type.\\n\\nThe ones who stroll in to work two hours late and then complain about needing \\\"mental health days\\\" while simultaneously expecting a raise and promotion every six months.  For them\\, character development boils down to a 2 minute training scene where the main character realizes that \\\"zhe\\\" has all the skills needed to complete the tasks at hand within \\\"zer\\\" already.  Chiron?  We don't need no stinking Chiron...\\n\\nMillennials...  You've ruined colleges.  You've ruined the workplace.  Now you've ruined Star Wars.  Thanks for nothing.","true":true}