{"101487":193223,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"WARNING CONTAINS SPOILERS! \\nNot an awful movie\\, but an absolutely Terrible Star Wars film. If you are a true Star Wars aficionado you will hate this movie with a passion that can only be matched by the Phantom Menace. \\nEstablished canon is ignored and Luke Skywalker's character is butchered beyond recognition by Johnson. I spent the entire movie waiting to see \\\"Jedi Master\\\" Luke kick dark side butt and although Hamill gives a great performance even he can't lift the absolutely terrible story Johnson has written. I very much agree with Hamill that I fundamentally disagree with every choice he made for Luke's character. For gods sake Rian\\, didn't you think it might be a good idea to listen to a man who pretty much IS Star Wars? For a movie with so much potential you are left feeling that Rian Johnson made a list of the top 100 ways to infuriate the fans and included every single one into this absolute pile of dross. Sure its funny in parts and the Porgs are cute as a button\\, but despite a good performance by Ridley\\, Rey's character is yawn worthy and appears to suddenly be gifted the powers of a Jedi Master without any kind of training. Given that the Skywalker family are more or less born of the force and none of them could magically attain their powers this seems like utter crap and will leave you frustrated and despondent. I was so looking forward to Luke \\\"passing on what he has learned\\\" but Johnson somehow didn't seem to think that this was necessary either! The casino scene is utterly pointless and reeks of the over the top CGI nonsense of the Prequels. Rose is also an irritating and unnecessary character who does as much to ruin the film as Young Anakin did in Episode I. I actually wanted to slap her after the line \\\"Now its worth it\\\" As if those creatures are actually going to go free. The bad guys have speeders and starships you stupid girl! Johnson didn't seem to know what to do with Finn's character and seems to have written in a totally arbitrary side story just to give him a part\\, which is a shame as I loved the chemistry between him and Rey in Force Awakens and there was so much opportunity to develop it further in this movie. In fact on reflection I agree with many other fans that this movie is as bad a Star Wars movie\\, if not worse\\, than the prequels (maybe not episode I) and really sticks its fingers up to the established canon of the original trilogy and the expanded universe as a whole\\, which in my view is absolutely unforgivable. Since when could blue glowies interact with normal matter! And are you really suggesting that a Jedi Master as powerful as Luke Skywalker supposedly is could magically die just because he was projecting himself using the force... Utter utter bullshit. No expanded universe author would get away with doing this so how has Rian Johnson been allowed. When are Disney going to learn not to fix what ain't broke! Snoke is killed off far too easily and its frustrating beyond belief that we don't learn his identity (I think all the fans were hoping for Darth Plagus which would have tied in beautifully with the prequels and explained how there was suddenly this ultra powerful Sith Lord floating about) The chase between the First Order and the rebel fleet is ridiculous beyond belief\\, ignores the laws of Physics and leaves so many plot holes that you will find yourself bored and frustrated\\, since when were Mon Calamari cruisers supposed to be so fast? and why is it that Medical Frigates and other support ships seem to also be magically gifted this power just by virtue of being associated with them? \\nWhilst its truly great to have more strong female characters and I would have loved to have seen more of \\\"Jedi\\\" Leia\\, Vice Admiral Holdo is arrogant and incompetent and you are left feeling that she is a \\\"stupid woman\\\" rather than the strong female leader she should have been. Mon Mothma would never have been so idiotic! The whole escape could have gone much more simply had she just revealed her plan from the get-go instead of pointlessly frustrating Poe. How dare Rian Johnson call himself a Fan! Please Disney don't let him anywhere near the Star Wars universe ever again. \\nThe critic that claimed that this movie was just as good as Empire should be taken outside and shot for getting our hopes up. Comparing Irvin Kershner's masterpiece to this utter nonsense is nothing short of blasphemy.","true":true}