{"101487":145688,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I understand now why Mark Hamill said he totally disagreed with Rain Johnson's ideas for Luke Skywalkers journey. Lukes entire story history has been nulified\\, he's a wimp now. Getting invested in Snoke's mythos was a complete waste of time.  Knights of who?? Mary Poppins Organa...wtf???And the whole Canto Blight (in the story) sorry - I mean 'Bight' was a stupid pointless diversion. And who is Rose and why the heck do we care?? Best part was when i thought she'd died...but no. But wait! Perhaps  Benicio del Toro's character 'D.J.' will be cool like Han or Lando....but no. Again\\, like Rose\\, his was a completely pointless character\\, but I guess Rain couldn't figure out anything else for the character of Finn to do. I'd put that down to poor writing plain & simple.\\nThis is absolutely the worst Star Wars movie yet. people hated the prequels and they were kind of cheesy but in my opinion that was purely the way they were made -  everything was shot on blue screen which helped to make the acting a little wooden; it didn't help that George Lucas's dialogue was awful and cringy\\, but at their core the story was solid. With The Force Awakens JJ Abrams played it safe and it worked. Whilst it was an obvious rip off of A New Hope it kind of played into everyone's expectations which made it popular\\, he also built up our expectations for The Last Jedi - which rain Johnson completely obliterated. I was so so disappointed in this movie and I was so so so looking forward to it. Visually it is a stunning movie - story-wise it was awful in the fact that most of the movie is a cartoon chase of the Resistance running out of gas and the mighty First Order unable to catch them... Aww man\\, Rain... this was just so so stupid. \\nI have to stop now because I'm just making myself sadder and more disappointed. You will of course have to go and see this movie because like me you are a Star Wars fan & you are invested in the characters and you want to see what happens to them - but be forewarned: you will be disappointed. I really hope JJ Abrams can resurrect it with episode nine but he will be working for Disney\\, so there's that...","true":true}