{"101487":177720,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The only thing I learned from the movie is this: the whole galaxy is in ruins because men and women can't trust and respect each other. I mean: if anybody told Poe (by the way: a totally uninteresting lifeless character) what was the plan he never sended Finn and Rose to a distant casino planet (where every character was designed to do a silly 1sec joke) and they never ever had the chance to meet a code braker who never ever had the chance to sell them out! The plot is a mess... a real mess. I mean: what kind of galaxy ruler is that who's chasing a small fleet with another small fleet? Where are the rest of the fleet? And how can you answer that hokus-pokus with Leia? And why anybody wasn't surprised? And how did they let her in from a 0 atmosphere environment? And how can you drop something in a 0 gravity environment? And what was Kylo's motives? What were Ren's motives? And who was Snoke? As far as I can tell\\, the movie was already created and they got a director with lack of talent to do the dirty job and bend everything for Disney's favor. Disney's only plan was to get rid of the old characters so they can create their own lifeless\\, politically correct people who won't hurt anybody's safe place. Only Mark shines but he's not enough to save this betrayal. And I never count the CGI\\, because it's just icing sugar. Average camera use\\, bad story\\, lack of character\\, lack of motivations\\, too many scenes copied from The Empire Strikes Back. No. Not recommend it.","true":true}