{"101487":130208,"Last Jedi":"Last Jedi","2017-12-15":"2018-05-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I could forgive Darth Vader screaming No in RotS. I could forgive the horrible dialogue about sand in Attack of the Clones. I could even forgive Jar Jar Binks. But I could not forgive this film. \\n\\nOn the day this movie came out my dad and I went to our local cinema to see it. We were both fairly excited to see the next installment of the new trilogy. My dad\\, while mostly only partial to the OT\\, did enjoy Face Awakens and Rogue One (the latter of which was his favorite movie just behind Empire)\\, shared my excitement to have our questions answered. \\n\\nSadly what we were given was a poor excuse of a film that did nothing but slap the fans in the face for having expectations. My dad assumed that Rey was Luke Skywalker's daughter\\, and while I felt that was too obvious\\, I too figured she came from something interesting or important. Considering how much TFA alluded to her history. Instead she's literally no one. \\n\\nRey No One is a super powered bad ass Jedi who never needed no training and will never face any hardship. Thanks Rian Johnson\\, thanks for making me no longer care about this blank slate of a Mary Sue. \\n\\nI'm not mad that my and my dad's theories were wrong. Honestly\\, I'm not. But I still wanted something interesting and compelling. Maybe she could have been the left behind daughter or granddaughter of emperor Palpatine? How interesting would it be to see her struggling with such information? Knowing that her lineage is so dark and trying to keep from falling to the dark? Well we'll never know because according to this movie she's nothing. Anakin in the prequel trilogy was more interesting then this\\, and that's just sad...\\n\\nFinn is a joke in this movie. Everything he does in this movie is pointless. There is only one moment where it seems like he is about to do something amazing and worthwhile\\, but it is completely underminded by a character\\, who I shall make no further mention as she has no place in this movie.\\n\\nCasino world sucked\\, moving on. \\n\\nKylo Ren is possibly the only remotely interesting character left in these films. It's a shame that these movies are actually making me root for the bad guy. Considering it's been shown that he's no match for Rey I actually want to see him win in the next movie. I was always a fan of the underdog. \\n\\nWho the hell was Snoke? Where did he come from? How did he turn Been Solo? Where are the Knights of Ren? The movie doesn't know and neither does anyone else. I doubt the director even cared. \\n\\nPoe is probably the only member of the resistance who I could get behind. He makes a risky decision that costs some soldiers their lives and gets demoted for it. No. This is a war\\, and he made a calculated risk that paid off. Sure a few soldiers lost their lives\\, but they were able to take down a huge ship that is a heavy blow to the First Order. And when he asks captain purple hair what the plan is he is treated like crap. And told nothing\\, for no reason. \\n\\nChewbacca is so underused in this movie. \\n\\nThe Porgs.suck.\\n\\nHow did Leia survive the vacuum of space? The force? She never had any training\\, how could she accomplish this feat. Care to explain movie? Also it is a disgrace to Carrie Fisher's memory that this is the last film she will ever be associated with. Rest in peace Carrie Fisher\\, you will always be remembered as the fiery princess of Alderaan\\, who refused to cower in the presence of Darth Vader and the empire. \\n\\nLuke Skywalker. Words do not even begin to describe how betrayed I am by his portrayal in this movie. Luke Skywalker is a beacon of hope. He's the hero who stood in the face of danger to protect his friends. He crossed blades with one of the most evil intimating people in the Galaxy. He even went on to redeem Vader\\, someone who everyone else believed was past saving. Luke Skywalker would not throw his deceased father's lightsaber over his shoulder like a piece of trash. He would not become a hermit and wait for death while his own nephew laid ruin to the Galaxy. And he certainly would not act like an angry\\, old\\, bitter man. This was not Luke Skywalker. Mark Hamil himself said so. Hamil might have retracted his earlier criticisms of Last Jedi\\, but it's obvious that Disney told him to keep his opinion to himself. I am saddened to see Luke Skywalker like this\\, for no reason. In a better film I could get behind this\\, especially if he grew from it and changed\\, but no. Other than Mark Hamil giving it his all with what he had to work with\\, there is nothing good in this. Mark Hamil\\, Luke Skywalker deserved better than this. \\n\\nIt really is a shame. You had the original cast and you couldn't even show them on screen together once. Luke died a pointless death\\, as did Han. Carrie Fisher's dead in real life... depressing.\\n\\nThis movie is a garbage fire. Nothing about the plot makes sense. The OT characters are bastardized\\, and the new cast I could care less about. (Except for Kylo\\, and that's only because I want to see him finally beat Rey. A girl who has had no training in the force...)\\n\\nAll the hype I felt from TFA is gone\\, I don't care what happens in the next movie because this movie has left me with nothing. Nothing to look forward to\\, nothing to be excited about. \\n\\nI hated this movie. \\n\\nI could go on\\, and I would like to\\, but this review\/rant has gone on long enough. I will however give this movie sone compliments. It's well shot\\, the visuals are nice\\, and there are at least a couple scenes that we're a treat for the eye.","true":true}