{"101487":175547,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is very successful in my opinion. I feel that all of these latest disappointed reviews are all based on a hyped expectation of theories for all the associated Last Jedi Characters. Rian Johnson has created a film which throws away your expectations and startles you with everything that happens. This is where the Star Wars fan base splits in half. You'll either like what he's done or you will not. \\n\\nFor me I fully enjoyed what he's done but i can also understand why people are disappointed. We all had these built up dramatic ideas but they've all been seen before in the Star Wars films! So Johnson has created the unexpected. \\n\\nThe Force is a key aspect in this film its quite magical for what can be done and i'm very pleased we're seeing this side of the force. I hope to see more Dark Side use.\\n\\nLuke's character was suitable for who he was and where he was based. It totally makes sense for how this trilogy has been set up. I don't agree with one certain scene in this film (flashback scene) it just doesn't make sense!! This is why I've rated this film 4 stars.\\n\\nLast Jedi is a great experience and a great addition to the franchise and it is a perfect middle film. It leaves us wanting more and gives episode 9 the chance to round off and answer the consequences of 8.\\n\\nYou should definitely see The Last Jedi but go in with the mind set of 'Expect the unexpected' \\n\\nIts dark\\, its funny\\, its dramatic and beautiful to watch. - Enjoy!!","true":true}