{"101487":183784,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"THIS MOVIE DOESN'T GO THE WAY YOU THINK IT WILL\\n\\nTL;DR\/NON SPOILERS: The movie is appropriately titled as the Last Jedi because it really feels like the end of the Jedi as people but the Jedi as lore and importance\\,as well as the end of the franchise with this movie. I will say this is perhaps the most divisive star wars movie\\, either you will love it or hate it. The star wars fans who love the lore\\, love what the Jedi stand for\\, and were expecting any character development or an expansion of the star wars universe will be disappointed. Those who aren't as familiar with the franchise and want to just see a fun film will enjoy this movie. I am giving two stars because I felt the cinematography\\, action\\, and comedy were good. For an explanation of why this film only gets two stars please read my spoilers section where I dive deeper into the negatives.\\n\\nSpoilers: \\nNo Direction:The film overall makes so many bold choices that by the end of the film I was left wondering how JJ Abrams will even be able to make episode 9 and I was also left wondering why this film was even made. The main plot is the last of the resistance is on the run from the first order\\, yet all we get at the end of the movie is a continuation of the resistance running away. Yet the movie leaves plot holes as to how the resistance who only 30 years ago took down Vader and sidious is now literally reduced to 20 people and Leia hiding in a cave. These questions could have been answered had we gotten more character development from snoke and the rise of the first order but that takes me to my next section.\\nSnoke: The almighty and mysterious Snoke that star wars fans have been theorizing about for years is literally killed by Kylo within the first hour of the film by a simple push of the button on a lightsaber. There was no epic battle between Kylo and Snoke\\, and more importantly there is no explanation as to who he was\\, how he rose to power\\, and what his whole purpose in the franchise was\\, Ultimately one of the most important people in the franchise created in TFA is stripped of every importance in this film which becomes a common theme in this entire movie for all the characters.\\nRey: The next biggest letdown was figuring out Rey's parents were just junkers who sold her for drinking money. I get what message they were trying to send here and that Anakin's upbringing was similar\\, but the problem here is that it does not explain how she is so powerful and how with little training in this movie she is able to do the things she does in this film which further degrades what it means to be a Jedi by making it seem like almost anybody can be like Luke Skywalker with absolutely little effort which to me is like telling kids the are all going to be millionaires without working a day in their life. \\nLuke: The beloved pop culture figure Luke Skywalker is stripped of almost everything we loved about him in the original trilogy. You find out in the movie that he is the one that caused Ben solo to become Kylo Ren because he attempted to murder him in his sleep because of the dark visions he saw of Kylo while training him. I do not mind that they tried to add some darkness to Luke's character\\, but convincing me that the incorruptible luke from the original trilogy who couldn't even kill the father who tried to kill him would kill his own nephew is bs. Later on Luke finally comes to save the resistance and his sister by taking on the whole first order by himself. I loved this scene and was waiting for him to take down all the at-at's with the force and see the true power of master Luke Skywalker\\, but no.... instead he lets himelf get hit by blasters and you see him reappear which was cool\\, and then Kylo comes down to face off with his uncle\\, and I was even more excited and was ready for this movie to have its own legendary lightsaber battle but no... instead we get luke dodging swings with new force abilities and we later figure out he is just a hologram who was being created by the force on the island Luke was on. This was overall a cool scene but it is completely destroyed and imo destroys the entire film by having Luke unexpectedly IN THE LAST 5 MINUTES ascend into nothing which basically means Luke can only be a force ghost having done very little in the film besides being a hologram before randomly dying. Again this movie's direction and character development are disappointing.\\nLeia: Leia is one of the best characters in the film\\, the only gripe with her is that you think she dies but she superman force flies herself to safety which only introduces more plot holes to the film and was a very cringey scene overall.\\nRose\/Finn: A useless story arch that rivals JAr JAr Binks from the prequels. These two are sent to find a code breaker to help the resistance escape by not being able to be tracked in light speed which leads to a journey of CGI and Disney product placement. In the end\\, they are caught and betrayed by code breaker and ultimately they don't need the codebreaker because Holdo decides to just suicide bomb the entire first order fleet by going light speed directly end to them which destroys every ship which could've easily been done on autopilot. Really the only reason they are there is for an unbelievable love interest and killing phasma\\, other than that they could have both been cut out of the film so the film could be only 2 hours long and you would not miss anything.\\nPhasma: Overally a useless charcater in the franchise. I honestly dpn't understand why she is in the movie or even existed at all other than to sell toys. She only again has about 5 minutes of screen time and again faces off with Finn and Finn defeats Phasma in a non stellar fashion and Phasma's charcater is gone. There is no badass character development or anything action related to making us see how Phasma is anything of importance or to fear which again shows this movie driving character development further backward. \\n\\n\\nConclusion: Overall this film is like watching a Star Wars movie that tries to take eveything you know about Star Wars and burn it down. If you love the lore and the universe of Star Wars you will most likely leave this film with more questions than answers but not good questions. And you will probably leave the theatre more angry than when you entered which has never happened to me with a Star Wars movie. I liked the The Force Awakens even if it was a copy of a NEw Hope it still introduced new characters and good questions that were just waiting to be answered in an exciting way. Well this movie answered these questions but it is the direction and how lazily these questions were answered that makes this film such a disgrace to the franchise. I am truthfully worried for episode 9 especially with Carrie Fisher passing\\, it means that there will be little they can do wtih the original trilogy characters and with the little character development and meaningless plot in this movie I can't help but wonder how is JJ Abrams even going to close out this trilogy in a believable way? Only time will tell.","true":true}