{"101487":159085,"Last Jedi":"Last Jedi","2017-12-15":"2017-05-11","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok. Last Jedi was a lot to take in upon first viewing. I was definitely in the camp of mix feeling right after the credits rolled. There is a lot to process and a lot of dots to connect. My advice to all the disappointed and negative fan reviewers is to see it again. My second viewing the opposite\\, things fell into place\\, made sense of what Rian was doing tonally and thematically with Rey\\, Ren\\, Luke and the Jedi in general. Rian turrned this all onit's head and he pulled it off. I actually like how he got rid of Phasma and Snoke who are chacters that were holding the Rey\/Ren storyline back but would love to see JJ address the origin of First Order & Snoke rise in a flash back in ep IX possibly. The over the top humor almost goof ball at times I was thrown off by the first time and was stall annoyed by some of it the second viewing but it was not as bad or distracting from story the second time. The humor was necessary and well done MOST of the time but there were at least 4-5 lines or small scenes I would like out (too many porgs). Also the Canto Bight storyline still dragged down the pacing and felt off still the second time. I love Rose & Finn's relationship but this casino scene reminded me of goofy Lucas prequel banter.  I can not wait for ep. XI.  Please go see Last Jedi again. It'll be worth it and calm your nerves and reservations. It's actually one of the nest in series\\, better than Force Awakens in a humble opinion of a Star Wars fan since I saw Return of Jedi when I was 3 in the theater back in the early 80's.","true":true}