{"101487":189000,"Last Jedi":"Last Jedi","2017-12-15":"2019-03-09","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"TLJ could have been good if it wasn't the sequel in a trilogy inside of a saga. The themes were ok but all of the twists were just to surprise the audience and did not service the overall story. New characters were introduced while old characters and story lines were set aside to allow room for them. Subversive story telling only works in small amounts. You can allow for some abrupt changes from the first movie but literally everything that was set up in TFA was cast off as if it didn't matter. They need Luke to fight the first order\\, nope he doesn't believe in the Jedi any longer. Who are Ray's parents\\, well they are no body. Finn\\, oh let's just send him on a pointless side mission and destroy his story arc by not allowing him to sacrifice himself. Who is Snoke and what are his motivations\\, well he is powerful enough to link two people across the Galaxy but can't see Kylo moving a light saber\\, let's just kill him. Let's say Luke tried to kill Kylo and then let's kill him without anyone actually killing him. The subversive nature of this film doesn't make it interesting or deep\\, it just destroys any sense of congruent story telling throughout a trilogy. This film just goes to show why having two writers that have two different visions should not direct sequels. I just hope JJ can fix it with the third film\\, because the only way this film could work is if the third film fixes it's mistakes. Please bring in the Knight of Ren! 3 out of 10","true":true}