{"101487":152785,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(MAJOR SPOILERS) Star Wars: The Last Jedi is an extremely mixed bag. For Star Wars fans\\, this movie will be seen as the “meh\\, yeah I guess it was pretty good” film of the franchise. Of course it was not as poor as The Phantom Menace\\, nor was it anywhere near to being on par with The Empire Strikes Back. I left the theater feeling entertained\\, but taken back at some of the poor plot choices and lazy character development. My first major problem that has to be addressed is Snoke. In The Force Awakens\\, he was mysterious\\, menacing\\, and felt like one of the most powerful beings in the galaxy. We spent 2 years dissecting his character and coming up with countless theories to who he was\\, and in this movie\\, I was expecting all of this to be revealed and then some. Instead\\, he just got killed. It was as if Ryan Johnson looked at Snokes character when directing this movie and was like “You know what\\, I don’t like him and I don’t want to establish who or what he is any further; lets kill him without any explanation and call it good.” Snoke is obviously more powerful than any other character in the entire franchise\\, being able to use the force on people threw holograms and being able to make connections between two people (Rey and Kylo) threw the force. But\\, why? Why is Snoke so powerful? Where did he come from? Is he an ancient sith? Is he The Emperor’s brother? Was he even trained? Where did he come from? The outer rim? Was he conceived by the force like Anakin? Was he Jar Jar Binks? No! Apparently he is just some old dude that is randomly powerful because why not and wears Hugh Hefner’s robes. And then he just gets killed! That is not what any of us wanted and it doesn’t make a lick of sense. Another issue I have\\, and it is minor\\, is some of the humor. Right off the bat Poe makes a cheap joke that feels so out of place it’s painful. It was something about Hux’s mom. What! This is Star Wars not a Marvel movie with a million random quips scattered about. I get that Star Wars has always been a little humorous\\, but in the originals\\, it felt natural and like it had a place. This is just something else. It’s not a major problem\\, but still one that needed to be addressed. Now we move into the subplot with Finn and this new character Rose. Unlike other people\\, I really do not have a problem with Rose. However\\, there little adventure to Casino paradise was the fat that should have been cut out of the movie. When engaging and important events were happening with Luke and Rey about the Jedi order and when the last remains of the Resistance were fighting for their lives\\, we jump to Finn and Rose riding space horses. This completely screws up the tone of the movie and it is so unnecessary it’s insulting. How did they even get there you ask? Oh well they needed a way onto Snoke’s ship to disable their new device to track the Resistance threw hyper space. So they call up Maz and she’s shooting up something and tells them that a “master codebreaker” can be found on the Casino planet and he will be wearing a red rose pin or something (and then the actual codebreaker isn’t even the one used\\, it’s this random stuttering guy whom I actually like). This sounds like some kind of side quest you get in Skyrim. And it is just that\\, a side quest. It doesn’t have to he there. What could have been written instead is the stuttering guy being a rebel and sitting down the hallway of their ship and they found him there\\, and then go as they did from there. Instead\\, there had to be some statement made about animal cruelty and richness leading to evil. The battle on crait was alright to me. The resistance looked like they were against the wall and they had to overcome it. I liked it. I liked Kylo and how it showed how much he despised Luke. I enjoyed how Luke projected himself threw the force in a much more powerful form than it would have been if he actually fought him so the Resistance could escape. It was new and I liked it. However\\, after the distraction provided by Luke\\, we go back to him on his planet in his actual form\\, staring at the suns like he does in A New Hope. It’s poetic and beautiful\\, and it would have been a great final shot of Luke in the movie. But then he... dies? He just dies. He disappears and dies. Why? Because im guessing his battle with Kylo threw the force took all he had. Still\\, I would have rather that not have been the way he went out. In the end\\, the Resistance gets away in what I guess is a happy ending. There is about 20 of them left\\, but they got a Porg! Thank god for that. The final shot shows a slave boy from the casino planet force pulling a broom and then proceeding to sweep with it. This scene makes Finn and Rose going to the Casino planet a little more justifiable\\, but not by much. What we are left to believe is there is a whole new generation of force sensitive beings in the galaxy just waiting to be trained\\, and this will be what Episode 9 is all about Im guessing\\, along with more tension building between Rey and Kylo battling over their own interpretations of the Force. Overall J.J. Abrams had quite a mess to clean up when directing Episode 9\\, but it could have been uglier. There is still a lot to be enjoyed and it is a good movie. The Last Jedi will sit in the middle when ranking all the films from worse to best because of poor plot choices. It’s not bad\\, it’s not great\\, it’s “pretty good.” ","true":true}