{"101487":140881,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I thoroughly enjoyed this movie! I felt the need to give an opinion because there are so many negative opinions to this movie and I don't get it? I also don't get the politicizing of it either? This movie is well written because it is balanced. There are multiple stories happening and for me\\, the director did a great job at portraying each story and to how they all intersected. I enjoyed the humor\\, especially the opening scene with Hux and Poe! I loved Carrie Fisher's acting in this movie a lot better than in the prior film. She seemed to have more energy and she just looked better for some reason. I liked Luke's story arc I get that some people say it was out of character for Luke\\, but one also has to consider how much time has passed since he was the hero. The thing to understand is that this trilogy is not based around Luke\\, Leia\\, & Han. They are the supporting characters to the next generation. If you go into this expecting a continuation of the old trilogy\\, then you will be disappointed. This is the next story in this universe. Much like WWI heroes aren't the same heroes from WWII\\, but some of them helped the next generation in the next conflict. Its just progression and even if I didn't like the story\\, the Star Wars universe is cool enough for me to always want to come back to. By the way\\, my 4.5 star rating is because I felt the beginning jumped around a lot and I thought the Leia in space scene was odd and possibly unnecessary.","true":true}