{"101487":177405,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie was really bad\\, they should have called it the first order strikes back. I'll give it one star for how pretty it is on screen but everything else is just bad.\\n\\nSpoilers:\\n\\nyou had the Hoth scene re-done on the red planet.\\nHon\/Leia kiss re-done with Finn\/Rose only it was out of no where and wasn't set up so it felt wrong.\\nLuke wouldn't train Rey at first until someone else convinced him just like Yoda wouldn't train Luke till he was convinced.\\nRey left Luke only after 2 lessons when he said he'd give her 3 just like Luke left Yoda before he completed his training.\\nHe left to help his friends\\, she left to help Ren.\\nHon and everyone was double-crossed on cloud city\\, Finn\/Rose was double-crossed by the hacker they found.\\nRen tried to get Rey to rule the galaxy with him\\, Darth Vader tried to get Luke to rule the galaxy with him.\\n\\nAll the plot points are the same just done in a different way with different characters. Then there was the really bad things that didn't make sense. Vice Admiral Holdo\\, a person we just found out existed\\, sacrifices herself when so many other loved star wars characters could have done it. It would have been a great send off for Carrie Fisher who died a year ago. We kept jump cutting from other story lines never really getting to know more about the characters. One of the smaller ships that ran out of fuel had the Captain die even though he knew he was low on fuel and could have just got off the ship with the crew. Finn\/Rose went to the casino planet that had a pointless dead end plot point. On the planet Rose said all the rich people where evil. this is starting to be big trend with Disney putting politics into it's movies. even family members of Disney are getting in on it https:\/\/twitter.com\/nowthisnews\/status\/945765688806842369 . The dark lord Snoke was killed and we don't even know who he is or why he is so powerful. The \\\"funny\\\" scenes where out of place or bad like the General Hux can you hear me joke. This movie was worse then Phantom Menace which got a 59% fan score on rotten tomatoes and Last Jedi has a 52% fan score on rotten tomatoes.\\n\\nI would love to have a good Star Wars movie but without the politics of feminism or race put into a movie. just make the best movie you can\\, we don't care about the gender or skin color! \\nhttps:\/\/www.youtube.com\/watch?v=4ASzo6aMtVo\\nhttps:\/\/www.youtube.com\/watch?v=uhE3Ox9pdLw\\nhttp:\/\/www.telegraph.co.uk\/films\/2017\/12\/14\/rian-johnson-calls-women-people-colour-direct-star-wars-films\/\\n\\nThis stuff is destroying Star Wars and the film industry as a whole.","true":true}