{"101487":128772,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"How to destroy the Star Wars Franchise? Well you have it with \\\"The Last Jedi\\\" - \\nFrom the useless Casino scene to the anti-climactic reveal of Rey's parents - I thought that the prequels were bad\\, but I have to admit that this IS the bottom of the barrel. \\nPlot holes are so many and so numerous to count. Examples:\\n1) Why would Luke leave a message in R2D2 if he is not interested to join when the need is dire and his twin sister is begging for help and best friend was murdered. (here goes the whole of \\\"The Force Awakens\\\" raison d'etre.\\n2) Why did they attempt the cloaked transport run to the planet right after the initial light jump? \\n3) Kylo Ren and two fighters destroy the bridge and of the rebels main cruiser- then what happened? - the tie fighters just retreated instead of finishing the job? \\n4) In the entire galaxy\\, apparently there is not a single First Order ship that could jump ahead of the rebel fleet to ambush them - including the ones chasing it!\\n5) Dreadnoughts have no shields apparently  - and yes a single fighter can take out every canon on that dreadnought -  very believable indeed!\\n6) Interesting - General Leia cannot order the bomber fleet to belay Poe's order - interesting command structure\\n7) General Leia is a Superwoman - just like that - with no training and any background in the Canon to support anything remotely similar to that. \\n8) Casino scene completely useless and did not add anything of interest to the main story - and was completely nullified when they did not end up disabling the tracking device. \\n9) Luke attempted to murder Ben - his nephew and the son of his best friend? are we talking about the same Luke that flew from across the galaxy and surrendered to Darth Vader on the off chance that there is still good in him? Out of character from Luke don't you think! \\n10) Finn apparently had a scratch injury from the light sabre since he woke up few hours later - \\n11) Death of Luke Skywalker - how can anyone screw this - I mean we waited 40 years to see what Luke can do - apparently just a Matrix-style dodge is about it....\\n12) Death of Phasma - what a waste of a character and an amazing actress. Really pathetic. \\n13) This is supposed to be a dark movie - the humor was lame and at points killed the flow of the story and what it is supposed to present\\n14) Death of Snoke - this is the guy who is supposed to be more powerful than Palpatine and he gets chopped in two - while he is saying that he knows Kylo's every intent and every thought\\, blah\\, blah\\, blah. Pathetic. \\n\\nI can go one but I will spare you the agony...","true":true}