{"101487":180414,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"They plot was terrible and what they did to the characters was just disgusting for the sake of this movie franchise. \\nThe biggest pitfalls of the movie are that the main \\ncharacters are: \\nPointless\\, meaningless\\, unimaginative\\, and most \\nimportantly not Star Wars. \\nThe movie is beautiful to look at but very poorly \\nwritten with too many plot holes. \\n\\nLuke: They ruined Luke with this movie. Has no level \\nof mastery with the force. He is a coward waiting to \\ndie\\, defeated on an island which had great \\nsignificance in the previous movie. Why would there \\nbe a map to his location if he never wanted to be \\nfound? Luke tried to save the galaxy from the most \\nevil man in the universe (his father) because he \\nbelieved there was still good in him. WHAT THE \\nFUCK IS HE DOING TRYING TO ASSASSINATE HIS \\nNEPHEW!? They undermined his force abilities in the \\nfinal scene. They could of done something epic but \\nthey made him die the little bitch he was the entire \\nmovie. \\n\\nSnoke: From what we can see\\, snoke's training is \\nequally as meaningless as Luke's. He tries to \\ncomplete kylos training by killing Rey which mirrors \\nanakins execution of dooku. We never know where \\nthis guy is from. He's seemingly omnipotent yet kylo \\nvibrates the lightsaber on his metal chair and stabs \\nhim in the kidney. A pointless death to a pointless \\ncharacter which unfortunately had potential. \\n\\nPurple Haired Bitch: This scum of a leader is at the \\nforefront of plot holes for this movie. She kamikazes \\nthe rebel transport into snoke's capital ship... This \\nabsolutely destroys Star Wars lore because it \\ncircumvents all the cool technology previously seen \\nmost importantly all the Death Stars. Why doesn't \\nthe empire\\, first order\\, not just program droids to \\nkamikaze into cities\\, planets\\, ships\\, etc\\, at light \\nspeed? Why couldn't the first order ships close the \\ndistance? Also if she were to just explain the plan\\, \\n1\/2 of the movie wouldn't have happened. The entire \\nspace battle was poorly thought out. I guess this is \\nwhat happens when u have another pointless female \\nleader... \\n\\nRey: If the plot needs it she's got it. Uninteresting \\ncharacter with no motivation other than the fact that \\nher parents are drunks. Yep. She's not a kenobi. She's \\nnot a sky walker. She's a fucking nobody. Which is \\nabsolutely fine but when you can beat kylo ren and \\nroyal guards in a lightsaber fight with no experience \\nand zero training... No fuck you Disney that sucks. \\n\\nKylo: Arguably the most interesting character only \\nhampered by the fact that they don't want him to be \\nhis own character. Disney wants him to be the next \\nDarth Vader. \\n\\nLeia: She becomes Mary Poppins. (In the same scene \\nGeneral Akbar is killed whimsically) \\n\\nPoe: He's the ex machina and the savior which \\nmiraculously defeats anything in his path including a \\nDreadknot with his faithful companion bb8 and his \\nrusty X wing. (In the same scene gravity applies to \\nspace bombs) \\n\\nFinn: Pointless character in a love triangle between \\nRey and his chink girlfriend that sacrificed herself so \\nthat he wouldn't sacrifice himself to save the \\nrebels.... WHAT? Oh btw this janitor kills Phasma after \\nthe entire hangar is blown and kills an entire \\nbattalion. Leaving only the main characters alive.... To \\nfight... For the death.... Bye Phasma! \\n\\nRose: Why are you in this movie? The \\ncasino planet was completely pointless\\, didn't feel \\nlike Star Wars\\, and detract from the entire plot. The \\nmovie came to a screeching halt. \\n\\nGeneral Hucks: Nazi comedic relief \\n\\nThe Last Jedi-Destroyedstarwars\/10","true":true}