{"101487":159064,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok. In summary\\, this movie is like the very best planned Christmas dinner ever! All the trimmings\\, pigs in blankets\\, roast potatoes cooked in goose fat\\, cranberry sauce\\, simmering gravy...all the very best things from my childhood (my first cinema trip was to The Empire Strikes Back in 1980 with Mum)! \\n\\nBut unfortunately in this case\\, the chef got the timings very\\, very wrong. The turkey was severely undercooked and ultimately lukewarm. We all got Salmonella and spent 48 hours being violently sick. And then...the shits. Diarrhoea. Bad. Oh no...The Last Jedi just ruined Christmas. \\n\\nAnd is it just me\\, or did The Last Jedi just completely rip off Battlestar Gallactica? A rag tag fleet of small ships being slowly pursued through space by the Cylons...or in this case The First Order. Really? And it was all over the place! \\n\\nSo The First Order with all its military might (and multiple massive warships...Star Destroyers) can't destroy a single Resistance cruiser (with newly found Star Trek style shields - that pissed me off)! \\nHaving to wait until each small ship in the very small fleet runs out of fuel before taking it down? Then Kylo and some Tie Fighters fly through the shields\\, destroy the bridge and then just leave? Why not finish the job? And then what...Leia finding superhuman powers\\, overcoming the vacuum of space with some new force skill not seen before or revisited since? Just...plain...weird. \\n\\nThen there is the completely pointless trip to the gambling planet (Canto Bite?) to free some weird space horses? Shit\\, we need to give Finn something to do! And there is then some bizarre social commentary on arms dealing and the universal distribution of wealth. The most unbelievable love story between Rose and Finn! I'm  assuming it's unrequited? Pointless...and they have the chemistry of a damp Porg. Actually\\, the Porg's were pretty ok! \\n\\nThen...Hondo? What? Wasted new character. Waiting until almost all the escaping transport ships have been destroyed before launching her kamikaze run? She was committing suicide by staying anyway...so why let hundreds die? Just so pointless and silly! That makes no sense. \\n\\nPhasma being completely underused yet again - is she just a marketing vehicle or what? Speaking of marketing... Crystal foxes? Nuff said. And Snoke... the big bad architect of The First Order and of Ben Solo's ultimate turn to the dark side\\, killed off with no explanation or back story. Admiral Ackbar (it's a trap!) just blown in to space...what? Why? What a shame! Barely acknowledged. Surely Ackbar could have taken the Hondo role? That would have made so much more sense! \\n\\nAn almost solid Yoda force ghost that made no real contribution to the story...just a feeble fan service. Then we get on to force projections and meetings that didn't really happen...or did they? The dice can also travel across the universe? And the answer to the big question finally revealed....who are Rey's parents? Oh\\, they were just some drunk junk traders from Jaku who sold her for booze! Was this just a middle finger to TFA? \\n\\nThis movie sucked...like Luke Skywalker sucking on the bloated sixth nipple of some weird green milk producing space cow. That's how much it sucked. TFA had its issues but TLJ is a very sloppy story\\, poorly directed and mostly pointless. This did nothing to further the Star Wars universe and just destroyed some of the magic - with ultimately nothing to show at the end...other than a bad case of franchise food poisoning. \\n\\nSo...not really very happy with it.","true":true}