{"101487":196299,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where to begin.  Is it any good? Yes it is good. Is it empire strikes  back? No it it not as good as any of the origonal trilogy.  Is it better than the force awakens? Yes and no. Is it better than rogue one? No it is not. Is it a mature film or a kiddy fest ? Both sadly.\\n\\nThe film is a gloriously dumb mess with poor writing and direction and a lack of much needed editing.  The acting can be poor and the characters under developed as much as their bizarre motivations.  The cgi is terrible as much as it is  beautiful and for every awful cgi creature there seems to be an excellent puppet.\\n\\nThere are some genuinely funny moments as much as some cringe worthy out of place slapstick and many of the best actors and loved characters feature far too little ...and cp30 is told to shut up in the most disrespectful way.\\n\\nI'd say it lacked wonder and magic and so maybe miss the big screen and watch on the smaller screen where maybe a fan edit has removed the bloated fluff.\\n\\nBig shout out to the excellent Carrie F. And almost as good Mark H. Who reallybsre the much needed likable adults in the films. Leia positively shines and so good to see them back again.  Such a loss for the franchise as she was far from gone and unlike Ford (in TFA) she like Hammil seemed to actually want to be there.\\n\\nAlso what's up with the AtAT..they look like gorillas!  \\nLastly I'm sick of every professional review claiming that the RT score is rigged and just 4chan fanboys.  I'm a huge fan and I've paid my money and I'm saying clearly that for the cost of the film\\, the legacy\\, pedigree and cast and crew we should of had a much better more coherent film.","true":true}