{"101487":132951,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I gave this half a star because it has \\\"Star Wars\\\" in the title.  Otherwise it was trash.\\n\\nThis movie has no original plot.\\n\\nThe franchise doesn't have a coherent story anymore.  \\n\\nIt treats the audience like it's incredibly stupid by clubbing the audience with overblown rhetoric\\, over the top villains and repeating the word \\\"Hope!\\\" over and over again as if we missed it the first time.\\n\\nThe Force is now just a galactic cheat code allowing the most random people to do incredible miracles with absolutely no training whatever.  Instead of allowing the Force to remain the elegant mystery described by Yoda in The Empire Strikes Back they're just using it as a tool to sell toy light sabers to every kid in the world because\\, you know\\, anyone can use the Force like a god now.\\n\\nI couldn't care less about any of the new characters although I would pay money to watch Po die horribly.\\n\\nLuke is in turmoil but his father and his first teacher (Anakin and Obi Wan) don't even check in with him?\\n\\nThe message to the audience is clear. All of those who have been fans since 1977 should fade into the background with Luke Skywalker because the Star Wars universe you knew is gone and not coming back.  Its all about selling Micky Mouse Light sabers and Disney Star Wars cruises.  No one is interested in telling a story; not even a bad story.  So next time don't insult the world and just put up a 15 minute light saber battle\\, have another Death Star blow up\\, have someone yell \\\"Hope!\\\" and then let the new space puffins dance around the Millennium Falcon to the strains of the Star Wars theme.  \\n\\nA movie only a fanboy could love.","true":true}