{"101487":181151,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film is the worst in all of the Star Wars. Luke Skywalker is portrayed as a loser\\, who goes into hiding for the weakest reason and then when he on the island he drinks green nipple milk which is horrible to see that one of my childhood heroes being treated with such disrespect. \\nFinn is not used properly and might as well not be in it because let's face it\\, Rose is a strong independent woman who needs no man because she's way to busy shoving progress politics down our throats like \\\"Slavery is bad\\\" and \\\"Don't hurt the Animals\\\" in a casino planet scene that is painful to watch and is utterly pointless to the whole movie.\\nWhich all could have been avoided if Admiral Tumblr actually told Poe what her plan was\\, rather than just give her the weakest reason the in the history of all military decisions\\, because your good at what you do! Sorry but what the fuck? Poe at the beginning of the film saves the Rebels or Resistance because they are the same thing now (Original I know) by blowing up a Dreadnought which is called a fleet killing and in the process\\, he loses a lot of ships doing it. However\\, because Leia can't deal with this fact demotes him? Why? Because he's a man\\, I can't find any other reason for it and I press anybody else to find a valid reason. \\nI've saved the worst until last! If you've seen this movie and saw the scene with Princess Leia who gets sucked out into space when Kylo Ren squadron attacks the Rebel fleet\\, and think it is okay? Then what is wrong with you? She's like Superman and Mary Poppins uses the force to fly her way back to the ship. Ugh! and for some reason when they open the airlock they don't get sucked out into space. \\nI mean the more I think about this movie the more I hate\\, I haven't even mentioned all the problems of this movie because I don't have time. Like Rey\\, the biggest Mary Sue going. Or Killing Snoke with any info on who or what he is. \\n\\nThis movie is one big middle finger to the entire Star Wars Fanbase\\, and don't say to me that it's for the kids or a new generation because if it was then why place old Star War characters like Han\\, Luke\\, and Leia? F this movie I wish I could enrase it from my mind!","true":true}