{"101487":199878,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Yikes. Heteronormative much? Star Wars 7 (aka Force Awaken) led us diehard fans to believe that there was a budding romance between protagonists Finn and Poe Damoron. We waited anxiously with baited breath in hopes that we would finally get to see a genuine male\/male (interracial) relationship on the silver screen. Star Wars was going to finally break the mold by presenting viewers with a gay couple we could root for but instead Disney pulled a classic bait-and-switch. I guess they had to cave into the demands of all the homophobic people that are in charge of things right now so they could convince their backwards manchild audience to cough up fifteen dollars. Fingers crossed that Finn is just doing this for appearances and Poe is actually the object of his heart's desires\\, but with the way things are going lately I wouldn't be surprised if Disney\/Lucasfilm decide to churn out more exclusionary trash for their overwhelmingly straight white male gamer audience. The believability of the film is strained further by this forced cishet \\\"romance\\\". Finn is way too hot for Rose. It would be more believable if her character was trans\\, but again\\, that wouldn't play well with Disney's \\\"core demographics\\\" (aka BLORMPF voters aka the real life First Order). Disney will not be receiving another dollar from me after this stab in the back. I was literally shaking when I saw the on-screen kiss. I had to explain to my four bi-curious nephews (all of whom are under 8 years old) that it would be okay and that in the end the good guys would win. But in this age of Drumpf stealing our internet\\, I'm not so sure...","true":true}