{"101487":148358,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just horrible. I am a die hard fan but this thing was an insult to any true star wars fan. I am not interested in what some people say is a liberal movie. I am a liberal dem so I guess using that logic I should like it but that stuff has nothing to do with how bad this movie is. The stupid jokes from the start made me shake my head. They are literally playing the verizon \\\"can you hear me now\\\" gag on the radio from a star destroyer to a x wing fighter! WTF?!!\\n\\nIt only gets worse. I can't stand it when the good guys get saved by a miracle at the very last second. This seems to happen in Walking Dead all the time now but in this movie its taken to another level. spoiler ...princess laya survieves unprotected in space and can fly. i don't care how powerful in the force she is that's just dumb. The resistence uses bombers but in space there is no gravity so the bombs wouldn't even drop! At the end Fin and rose are about to get beheaded but the entire place explodes and kills hundreds of bad guys but good guys are fine. The story is just as bad. They are all over the place and everything seems rushed but drawn out at the same time. They make Luke out to be a guy who would scream \\\"get off my lawn\\\" all day. I don't know who the hell Ray likes. The explain nothing about Dooko. And Ben should be pissed for Luke planning on killing him without even talking to him about anything first! Yoda seems to be on drugs. Not even sure why that purple chick took over for the resistence. The empire has the worst security in the universe and never upgrade. The resistence also needs to learn to shoot their weapons from their space ships instead of dragging them down to the planets which take forever to set up!!! And at the end when Fin is going to komakazi into the big ray gun rose slams into him at the last second to save him but yet they end up far away from the crash\\, right next to the rebels again! What??\\n\\nThis movie treats you like an idiot. I know this isn't real and I'm totally find with that but there needs to be a bit of logic. There is no logic or fun in the movie. I'll watch the next one for sure and if you like star wars you should see it as well but if you don't like it don't be a sheep. Say something about it in hopes that Hollywood will listen and treat us with some respect!","true":true}