{"101487":169287,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoiler( duh) Luke skywalker changes and makes choices he never would. I liked the change. I was hoping he would be more tense and on edge but still wise. He ended up seeming broken. I think ok that's fine but why. The the reason is he caused kylo to turn to the dark side. That's all fine until I realized the way he turned kylo to the dark side is the opposite of what he did with Vader. He tried to save Vader but tried to kill kylo. He would have none better because he dealt with a similar problem in Vader. That sucked but what was worse was that he died after doing nothing. I'm ok if he uses his force projection uses the force to destroy all those walkers from across the galaxy and then dies but what he did should not have killed the great Luke skywalker. Then go to Finn. Finn felt like he was just padding run time. I love him and his entire character. I just think he doesn't have a lot of character development so it doesn't matter what he does. When he was about to die I felt good and bad at the same time. I would have been sad to see him go but happy because it would have been a perfect end for his character who wanted to run but dies saving the resistance. It was heartwarming and meant a lot and then....... rose freakin saves him. And then Mary poppins\\, sorry leia. When she died it would have been a great moment for kylo to be mad and sad and have mixed emotions. It would have been a great send off for Carrie but she has to pull a Mary poppins and use the force to fly back to the ship and save herself. Then there's snoke. YOU CANT HAVE ALL THIS HYPE AROUND A CHARACTER AND THEN JUST KILL HIM. I'm sorry Ryan but jj set snoke up perfectly and now he's dead. Snoke has some serious power considering he could get information out of Rey and kylo couldn't. Finally A COUPLE OF BEEPS DONT COUNT AS INCLUDING THE LINE I HAVE A BAD FEELING ABOUT THIS IN THE MOVIE. overall it's a great film but Star Wars traditions are broken. It's poorly written for the characters in the original trilogy. Not to mention yoga is telling odd jokes now. JJ set this up perfectly but this movie leaves JJ with barely anything to work with. I was crying coming out of the movie not because of emotional stress but because of how bad it was. I'm sorry JJ because you have nothing to work with and are a great director. I'm sorry to the fans who buy all sorts of stuff and then get this. And finally I'm sorry to George Lucas who created the greatest films known to man that got ruined by Disney. I have seen this 3 times hoping to see something I like but I just can't get over it. I hope you all have a great day and that JJ gives us a movie we deserve in 2019","true":true}