{"101487":175462,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"- The Last Jedi is Rian Johnson losing a Senate seat in Alabama. Riding llamas through Las Vegas???\\n- Why is there a Hunger Games\/Fantastic Beasts subplot AT ALL?? Does NOTHING for the story-the codebreaking sequence is literally totally ditched. Wasted\\, BORING 30 min. In the middle of a Star Wars movie.\\n- Rose is a terrible\\, useless\\, annoying character.\\n- Why do Finn and Rose go all the way across the galaxy for THE MASTER CODEBREAKER and then randomly get put in a cell with a perfectly good codebreaker who just happens to be waiting to escape when they need him? \\n- Halfway through the movie I actually thought \\\"I wonder if I'm going to watch this again.\\\" I should *never* think that in a Star Wars film. I still can't believe it crossed my mind. I LOVE Star Wars. I saw the Phantom Menace and the Force Awakens four times *each* in theaters. I am NOT a hard Star Wars critic.\\n- SO. MANY. BAD. JOKES.\\n- Bill Weasley is so freaking annoying.\\n- We both know the two characters with fake-out death scenes should have died or not had those fake-out death scenes.\\n- NO backstory on Snoke???? NOTHING on Rey's parents?? These were major questions from TFA! Rey's lineage was a MAJOR theme in TFA. No continuity with Abrams. Hopefully J.J. saves these in Episode IX.\\n- Also\\, I initially thought The Last Jedi was original. Upon further reflection\\, I've realized that he freaking copied and pasted almost every major plot point from Empire Strikes Back and Return of the Jedi. No idea what they're going to do in Episode IX because The Force Awakens already stole everything from A New Hope.","true":true}