{"101487":122953,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Giving this film 1 star because it wasn't terrible in its own right. But for me it destroyed the legacy of Star Wars going forward. \\nWhy do all movies seem to have to have such forced humour in them these days? Just to get a cheap laugh and appease a very small number of morons? \\nStar Wars did have some subtle humour in it previously but this effort was worse than listening to Dad jokes repeated over and over. \\nIn terms of character development\\, this was non-existent for the majority of the core characters. The only one who seemed to develop in some way was Po and even that wasn't great. \\nRey's Jedi \\\"training\\\" or lack thereof was a wasted opportunity and I can only imagine that they were afraid they would be accused of copying the Luke Skywalker training scenes from all those years ago. \\nThe Luke storyline was pathetic at best and nothing he did in this movie represents the character from previous films\\, something which Hammill himself would likely agree with (and did as far as I am aware). \\nKylo Ren is still a whiny little kid that doesn't want to share his toys... nothing more to say there. \\nSnoake... waste of time! \\nPorgs... Lets sell some toys...\\nChewbacca\\, R2D2\\, C3PO and any other original characters... on Borrowed time and only make an appearance to have a spurious link to the original movies. \\nI was really looking forward to this movie after TFA but came away feeling nothing but disappointment and I couldn't care less about episode 9 at the moment.","true":true}