{"101487":158977,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Okay so it has been a week and the statute of limitations are up. That being said...\\nSpoiler Alert.\\n\\nWith The Last Jedi\\, Star Wars has cemented itself as a Disney property. I'll be honest it feels like the magic that shaped the tone of the Originals is completely gone. Which is fair to an extent\\, but not If you are going to follow the same characters and story. I am not going to further gripe about the two and a half hour slowest race in space as it was not what was wrong with this film. The problem with The Last Jedi is the way it handles and depicts the characters and plot that had been been developed over 40 years and eight films of Star Wars. The character of princess Leia was always a character of importance; However she made it known that she was never above the story or the rebellion. She stood in the face of the Empire and the Sith and lied to them and when the threaten to destroy everyone she loved she did not budge. In this film she lets someone die in her place. That to me was the very worst part . Disney is using the fan value of the original cast to provide excitement\\, but they are merely pawns to bring people to the theater. \\n\\nDisney is also using their usual method of creating so many plot lines and main characters that they cannot possibly give them enough screen time to create any real character development. I have no connection at all to any of these characters. This film made some character progression in Kylo and Rey that I liked\\, but right when it started to go deep it would jump to another character. I understand that Disney does this to sell merchandise and toys\\, but Star Wars has never sold itself short of that. So the only other reason for it is that Disney does not know how to write good characters anymore. I had high hopes for this film\\, but alas it fell way\\, way short.","true":true}