{"101487":161672,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Parts of this movie are good - but there are a lot of things wrong with it. If you go in with low expectations\\, you may be pleasantly surprised. ;) \\n\\nThe acting is not bad\\, some of the underlying ideas are good\\, and the sets are interesting\\, but it is at least an hour too long and it is not hard to think of things to cut! I literally turned to friends during this movie and grimaced; saying\\, \\\"There's more!\\\" :(\\n\\nIn addition\\, this film really struggles with striking a balance between being funny and serious and between being magical and believable. \\n\\nThe best of the Star Wars films (and many of the current super hero blockbusters) are great at having serious dramatic moments and moments of humor\/levity. But\\, in this movie\\, many of the sight gags and plot points are goofy (and just seem out of place). And at the same time many of the characters (and a ton of the dialogue) are way too serious. At least four characters in the rebellion give mini species that go something like: \\\"We are the spark that will ignite the fire that will become the light that will serve as the beacon for the entire universe.\\\" ;p Seriously? \\n\\nIt also crosses the line for me a few too many times in providing entertainment that's believable. There are some memorable fight scenes in this movie (that stick to what has been conventionally possible in the Star Wars Universe); but there are huge chunks that give our heroes god like powers that are not very well explained (and kind of come across as cheap\/easy ways to resolve things). A huge subplot in the movie also hinges on a character not passing on what seems like basic information (for no plausible reason)\\, there are animals that seem to purposefully like crashing into buildings (and have the ability to run up cliffs)\\, characters magically appear\\, etc. I'm all about suspending disbelief for entertainment\\, but a lot of this did come across as lazy writing and bizarre. \\n\\nI'm hopefully that Abrams return for the next movie will give these actors better material (and the rest of us a movie that's more worth our time).","true":true}