{"101487":139725,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I seen an article on Yahoo were a crazy bunch of dumbass Star Wars fans I'm talking about the ones who think that only George Lucas could possibly write and Direct a great Star Wars movie these brain dead fools are starting a petition to try and get them to redo the last Jedi they're out of their freaking minds this is the craziest thing I've ever heard of. News articles I've tried to explain how rotten tomatoes audience score can be manipulated because one person can vote 10 times for movie and give it 10 bad reviews and that's exactly what's going on because there are three other reputable review sites that have given just the opposite audience opinion then rotten tomatoes rotten tomato has some problems that they need to correct it into those comical fans that they're going to re-write the movie if they get enough people to sign a petition they're out of the ever loving mind it is absolutely the craziest and stupidest thing I've seen yet as of today this doesn't count Mondays box office take in the US it's at almost $480 million so you think they're going to re-write the movie freaking morons there's just not much more to say because this is the dumbest thing I've ever Heard of in my life. These people are absolutely delusional good luck with your petition. While you're at it since you like starting petitions see if you can get the minimum wage raised healthcare for everybody for free and mandatory paid vacations because you would have about as much luck with this as you were getting them to rewrite the last Jedi","true":true}