{"101487":97534,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A bit of backstory before I get into The Last Jedi. I was born in in 1980 just after Empire Strike Back hit the big screen. The earliest memory I have is sitting a few feet away from the tv watching a video shop rented A New Hope... and I must have watched it to death before we had to return it. Star Wars has been there for me in some pretty bad times in my life which is why I feel a bit guilty about writing this. The 90s hit and even tho there was no Star Wars until the special editions came out\\, I was still a huge fan... in 1998 when I saw The Phantom Menace trailer\\, I nearly exploded  because I didn't even know Lucasfilm were making a new trilogy.  Which I loved by the way... they were made by The Maker (George Lucas). Anything from his mind is Star Wars and would always be accepted by me... 2015 saw the release of the first Disney Star Wars movie The Force Awakens. I was really excited and went into the cinema with an open mind... 10 minutes into the film I wanted to walk out. I wouldn't say I hated it\\, it just didn't feel like I was watching Star Wars but at least it had some good and interesting characters that I thought would be fleshed out in The Last Jedi. I was sadly mistaken. So on to my review of the latest Disney instalment of Star Wars.\\n\\nThe Last Jedi\\n\\nAgain in the first 10 minutes I was unsettled about the type of humour in this movie. It was silly and misplaced and unfortunately that unsettled feeling lasted all the way through because there was too much humour and also felt forced. This episode should go down as a bad comedy not a space opera. Loads and loads of examples of bad\/lazy writing. Plot hole galore. Remember me saying about the interesting characters one the force awakens?? Well they were thrown away or forgotten about. There were one or two parts that I got into but sadly they weren't able to pull off what I thought was going to happen (don't want to spoil anything else I'd explain). A certain puppet looked really bad and acted totally out of character at one point which made me cringe a bit. Our favourite hero Luke was made to look like a coward and it is obvious that the writers\\, director and decision makers at disney have a very different view of luke.\\n\\nThe one good thing about this movie is Star Wars can only get better\\n\\nThe really sad thing about Star Wars now is even though disney release sub par Star Wars movies like this\\, we as fans will still flock to see them at least twice just because it's Star Wars. And the Critics seem to have to write a good review else they might get on the wrong side of corporate Disney.","true":true}