{"101487":200176,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"You see the good looking See's Candy box on the counter... It has treated you quite well so far. You open the box with great anticipation and spot your next treat. You bite into it and suddenly an unpleasant sensation takes hold of you. You quickly realize that you got the one with the disgusting red filling. You immediately spit it out\\, but the bad taste still lingers... and you can't wash it down with another one BECAUSE EPISODE 9 ISNT OUT FOR ANOTHER TWO YEARS AND EVEN THO ITS PROBABLY GONNA BE BETTER CUZ OF JJ IT WILL STILL BE HORRIBLE CUZ OF THIS ONE.\\n\\nI'm not going to go into specifics... because there are just sooooo many things wrong with the movie... and you can read other reviews for the specific flaws. I do not think ANY of the blame should be placed on the actors\/ costume designers\/ John Williams\/\/ SFX teams... because they did amazing jobs. It should be placed solely on the man at the top: Rian Johnson. \\n\\nI am going to blame Johnson\\, because his name is on the film. The Disney execs and Kennedy only care about money\\, so they should be judged off the financial success of the franchise and not its artistic integrity. If Johnson didn't like what they were forcing him to do he could have pushed back harder or walked away... but... he didn't... he put his artistic name on the project so it is his artistic reputation on the line.\\n\\nFrom a writing standpoint... Rian Johnson is way out of his league in TLJ. This movie required a top tier writer\\, and it becomes apparent within 2 minutes of the film that Johnson isn't even close to being one. If you were to preview one segment alone you would probably say 'O this is pretty good.' But together it does NOT fit as a story arc.\\n\\nSorry... artfully connecting the dots is what separates your average english major from a big boy Hollywood writer. And this is the biggest of big boy Hollywood movies... so Johnson should be held to the same standard. His overrated Looper story and subsequent critical acclaim of it must have gotten to his head... He clearly isn't a top tier Hollywood writer and he put it on full display for everyone to see.\\n\\nJJ Abrams worked and maneuvered the strict Disney boundaries and came up with a watchable and pleasant movie in The Force Awakens. He wisely centered the movie and the writing around the climactic point of Rey catching the lightsaber. Sure there were many flaws with the movie\\, but the overall story of the film allowed the climactic point to ring. Johnson's movie fails miserably at this.. and makes me really wonder why Disney trusted such a treasured and great franchise with a guy whose body of work is not only small but mediocre.\\n\\nUpon watching The Last Jedi it almost seems like he had a personal vendetta against JJ. As one reviewer adequately put it.. he opened every single one of JJ's mystery boxes to reveal nothing inside. Yes.. its fine to do that with some of them... but when he does that with every single one he retroactively makes Force Awakens a worse movie in addition to handicapping the future of the franchise.\\n\\nNow.. onto the dialogue... ANOTHER telling sign of a seasoned Hollywood writer. The dialogue was more primitive than a Marvel movie. At times it feels like you are watching Dora the Explorer with the amount of plot spoon fed to you. Also\\, the jokes just plain sucked. I realize humor is very subjective.. so if these jokes were meant to be funny then I guess they were meant to be funny to that one drunk guy in the audience laughing at everything because he just got a promotion at his soon to be dead end job. Remember the Daniel Craig stormtrooper scene or C3P0 intro in The Force Awakens? Pretty solid blockbuster humor. Sorry... just pointing out again how JJ did it better.\\n\\nJohnson had so many beautiful works of John Williams to draw from. Its quite easy really.. Insert John Williams music... Structure an uplifting sequence around it... and BOOM! you have cinematic gold... This was easy money... and he didn't go for it even once. And no... the Yoda blue glowie sequence is not that uplifting... Rewatch Yoda raising X-wing in Dagobah (ESB) or Rey catching lightsaber (TFA) to see what I mean.\\n\\nIt is really hard to see if this guy even gets what makes Star Wars so special after watching this... this... thing he made. I quit drinking alcohol\\, but felt it necessary to stop at the closest bar afterwards to save myself from a mental breakdown.\\n\\nOn a final note.. if anyone trusts Rotten Tomatoes critics.. then they are out of their mind. A certain entertainment company will soon own 60% of the market. Do you think any of those critics are going to risk their careers by spitting on that company's golden egg?","true":true}