{"101487":174531,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Force Awakens (TFA) and JJ Abrams set Brian Johnson up with a no fail scenario. He provided a new young hero and characters that were loved by many. Brian Johnson managed to make a story that was uninteresting and managed  to take a positive iconic character and change him into a curmudgeon. Johnson exiled Luke to an island where he lived and he died. Johnson would not even let Luke face Kylo Ren. Luke never even trained Rey despite misdirection of television and movie trailers. He shut her off at every oppurtunity to have Rey steal Lukes books and leave in the Falcon. \\n\\nWe also found out who Rey's parents were and they were horrible people who sold her off to the junk dealer. So much for the Skywalker saga. Episode 9 has now exhausted all Skywalkers. If you want to say that Kylo Ren is a Skywalker you are technically correct. But\\, there are no heros of that line left and with the passing of Carrie Fischer there are no iconic characters left. \\n\\nI can see why Mark Hamill did not agree with the direction of Rian Johnson. Despite that Mark Hamill did do an outstanding job as an actor. Rey went from a beloved character that I really cared about to just another character in the movie. \\n\\nPositives:\\n- Funny moments\\n- Porgs\\n- Chewie\\n- Chewie and Porgs\\n- Kylo Ren (excellent)\\n- Mark Hamill (excellent)\\n\\nNegatives\\n- TLJ stripped all the setup from TFA turned it sour\\n- Rey is the daughter of junkies sold to a junk dealer\\n- A Skywalker saga without Skywalkers\\n- Luke living on an island and died on the island \\n- The last fight in the movie between Kylo and Luke was not even a fight. Just a diversion with a force projection that killed Luke.\\n- Yoda scene unfortunate it was...\\n- Poe slapped and slapped down several times.\\n- Fly Leah in the vaccum of space. \\n- The final fight on Crait was setup like Empire but was about as disappointing as you get.\\n- Poor writing","true":true}