{"101487":175587,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi may have been true to its name despite the Mark Hammil's line at the end of the movie that would dispute this. For a cinematography experience it mayhave been great for the critics to evaluate\\, if only it did not have to be connected to the long-loved story line of the Star Wars series. Long time amateur Star Wars fan- not a professional here(I have never read a Star Wars novel out of the \\\"expanded universe\\\" but\\, have kept up with all of the movies and much of the mini-series having grown up around it.). \\n\\nUnfortunately and again we are left with almost no meaningful character development\\, only a whiny villain\\, and the abandonment of every theme that made the Star Wars movies what they are. Any promise of mysterious revelations produced by Abrams has been successfully snuffed out. Now Disney can hit the reset button and make as many films as they want with the Star Wars name without worrying about trampling any long-existing themes or plot elements- they've already done that. I mean has Disney accepted the same as Hammil's character- accepting failure then cowardly doing nothing about it except dissapearing on a planet across the galaxy from the action?\\nThis is the legacy of the most influential character in the Star Wars universe? The abandonment of theme and plot for progressive elements and cheap humor is Disney's MO these days so i should not be surprised.\\nIm not going to see the next film in theaters. Theres nothing left to see other than the extent of Disneys money-grab.","true":true}