{"101487":116923,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"DO NOT READ MY REVIEW IF YOU DO NOT WANT TO SEE SPOILERS\\n\\nThis review is a result of episode 8 as a stand alone and not toward a possible 9 (where Disney could reveal Kylo was a liar and the reason why he told Rey if she knew what he saw when he touched her hand\\, would cause her to turn to his side\\, was because she would turn dark knowing Kylo killed her father) In the same way episode \\n6 not 5 revealed Luke and Leia to be siblings.\\n\\nFrom the moment Poe made fun of \\\"General Hugs\\\" and talked about his mom I knew this movie was going to be a POS. Didn't realize Star Wars was on the same comical caliber as The Marvel Cinematic Universe which is based off of comics. After re-watching Episode 1-6 and seeing younglings killed I noticed a severe inconsistency with this universe as of late. I feel the comedy aspect could have been picked up in spin offs\\, not the main movies. Why does every movie HAVE to have an even amount of comedy nowadays. The Dark Knight didn't require comedy to be an amazing film. \\n\\nPoe had several people killed with his asinine plans and ideas\\, and we are supposed to look at him like he is some amazing leader ready to take over for Leia? REALLY!? How can anyone think this story is coherent.\\n\\nI love how Rey has never had a teacher or been trained in Kung Fu but some how she has mastered every technique. Since when has a martial arts student suddenly been able to master and perform flawless techniques without a teacher or training? Humans in Star Wars have NEVER done this and neither in real life.This is the reason why people were frustrated with E7. It is terrible writing to start off a character needing no development. Heck even Leia tells Rey they don't need anything else after the resistance is destroyed. NO SH!T\\, especially when you have written a character to be so perfect.\\n\\nWe come to segment of the movie where Poe agrees that Rose and Finn should go off and find this codebreaker. This entire portion of the movie was to illustrate to the audience that maybe the resistance isn't all good and maybe the empire isn't all bad. At the end of this little section of the story we find out that Finns efforts were all in vain JUST like episode 7\\, where he goes to rescue the perfect character who doesnt need rescuing. Disney\\, why would you allow one of your main characters(a minority figure)\\, to be portrayed as useless in 2 films in a row. I love Boyega and you let Rian Johnson destroy his character in the worst way. Which leads into my next tantrum.\\n\\nFinn not performing the most courageous act in history\\, sacrifice. I know everyone else felt it as Finn was about to collide with the battering ram cannon\\, that swelling in the throat\\, and the tears starting to form as finally his character does something meaningful. To only have it ruined by Rose with her line that \\\"We won't win by destroying the things we hate; we win by saving the things we love.\\\" OH REALLY??? well that is trumped by the comment Luke makes about war just beginning... last time I checked wars were won by ruthless tactics not by handing out flowers. \\n\\nAt one point Luke sees Rey leave and goes to burn the sacred Jedi texts to have Yoda assist with some lightning. Luke turns around and verifies with Yoda that it is time for the Jedi to end where Yoda nods and tells Luke yes. OH REALLY??? That is why Luke on Crait tells Kylo that he will not be the last Jedi? WTF were you thinking Rian Johnson? This script is far less coherent than the last turd I watched\\, Bedeviled.\\n\\nThe acting\\, sound effects\\, visuals\\, music(oh the lovely\\, amazing music)\\, and costumes were beautiful and praise worthy and with the failure of the script I firmly believe everyone did thier part except Rian Johnson. I love the cast and almost everyone who worked on the film even poor Kelly Tran\\, but Rian you should feel ashamed.","true":true}