{"101487":115728,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Difficult to give a proper rating now \\, I'll give it 3 stars for the time being.\\nMany people here write ''meh \\, ok movie... 1 star'' \\, ah ???\\n\\nSPOILERS:\\n\\nFirst I want to mention the points that didn't bother me but seem to be the main complaints of people who dislike the movie.\\n\\n1. It shits on the jedi and the force \\n- No \\, if anything it shits on the prequels \\, the force has never belonged to the jedi \\, the force is above the jedi \\, the force is above everything \\, the jedi simply made some sort of religion out of it and use the force for good purposes \\, the force itself is neutral \\, you have the dark and the bright side.\\nYoda never trained Luke with the light saber \\, he taught him about the force \\, the jedi don't matter \\, what matters is the force.\\n\\n2. Rey is too powerful \\n- Rey isn't more powerful than Luke \\, its established that Luke is a decent pilot early on but the first time he jumps into an X-Wing and gos into combat he does great and  at his first attempt to use the force he succeeded and destroyed the death star\\, he always had these powers but wasn't aware of it but he had Obi Wan who kept him on the ground in order to prevent that things get over his head and he might be seduced by the dark side\\, he barely trained with the light saber under Obi Wan and didn't train with it under Yoda at all \\, yet he was capable to hold up against Vader pretty well.\\nRey defeats Kylo because Kyloe was severely wounded in Ep.7\\n\\n3. Snoke\/Rey's parents\/Kylo Ren\\n- Good move to make Snoke just an evil guy who gets killed\\, we didn't need even bigger and meaner emperer part 2 like we had even bigger and meaner death star part 3\\, makes you wonder where Snoke was in the OT to begin with.\\nRey's parents being nobodys was also a good move \\, we have this entire galaxy how come everybody must be related ? were all the previous jedi related ? makes no sense since jedi are not allowed to have something to do with the opposite sex (blame the prequels) and have you ever thought that Kylo could have lied to Rey ?\\nKylo Ren is unpredictable and uncontrollable \\, hes the most powerful of all \\, because hes in the grey area of the force which prevented Snoke from reading his mind and Kylo's bright side overpowerd Snoke's dark side powers in the scene where he killed him.\\nKylo Ren isn't only a Skywalker but also a Solo and Han could have been a pretty badass Jedi himself if he wanted to.\\n\\n\\n4. Luke being out of character\\n- Over 30 years have past \\, time and experiences change people \\,and its explained why hes so broken .\\n\\n5. Everybody fails\\n- Same as in Empire\\n\\nNow to what bothered me about the movie\\, I'm not going into many silly scenes and some of the humor that didn't work because while it weakens the movie it doesn't ruin the overall experience of it.\\nHowever everything that happens besides the interactions between Kylo\\, Rey and Luke though entertaining didn't serve any real purpose \\, especially Poe's arc was handled terribly \\, I really hated what they did to this character \\, couldn't Holdo simply tell him what the plan was ? such a cheap and also dangerous move to teach him a lesson\\, really awful.\\nBut my biggest problem is what actually concerns me is the future \\, or better said Ep. 9.\\nThis really feels like the final act of the story to some degree or as if we need 4 movies in total now \\, unless the final episode will be 3h long.\\nResetting Kylo simply to the evil guy at the end felt also cheap \\, the entire final act of the movie really harmed it \\, in the final episode we will have again empire vs rebellion\\, the SW universe is very limited \\, at this point you can only \\nalienate SW fans \\, you stick too close to the SW formula and people will call it a rehash or remake and unoriginal \\, you deviate from it and people will react the way they did with TLJ.","true":true}