{"101487":189008,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"TLJ feels like it was directed and written by people who have never even watched the PT\/OT.\\n\\nThe Last Jedi was terrible. I would rather watch Attack of the Clones a hundred times over than watch this disaster of a movie again. Between the hatchet job on Luke's character and his arc in the OT\\, the forced comedy and tonal issues\\, Rey's force abilities being completely unexplained (I think they are changing the force into a superpower that requires literally no training now based on the scene with the kid at the end)\\, the heavy handed shoehorning-in of the \\\"next generation\\\" characters who I find to be completely underdeveloped\\, unlikable\\, and annoying\\, offing Snoke without any backstory or answers. And the biggest WTF moment which was Leia flying through space and turning what at first I thought would have been an acceptable sendoff for Carrie into one of the most weirdest and distracting scenes in the entire franchise. Even Laura Dern was disappointing\\, there was something about the way she acted her character that was off-putting and didn't really work for me. This movie was an absolute trainwreck. It felt like TFA and TLJ had completely different tones to the point that it was distracting. The way TLJ handled force powers and Rey's unbelievably fast transition into force-god makes me feel like this universe is cannibalizing its own rules and the dissonance between the 3 trilogies is reaching ridiculous levels.\\n\\nMy issues with Luke's character in TLJ is that he faced down Palpatine and Vader in the OT\\, always believing there was good in Vader and successfully redeeming his father. Seeing the good in others is central to Luke's character. Kylo Ren has done absolutely nothing to earn the same level of respect story-wise and from the audience as Palpatine and Vader. He's a nothing\\, a poser. That has been established by TFA. So Luke's conflict with Ren feels so...wrong. It doesn't make sense. He was being manipulated as a teen by Snoke\\, and Jedi Master Luke couldn't do anything about it and actually considered murdering him in his sleep before Ben even attempted anything? After everything he accomplished in the OT? Are you kidding me? TLJ not only retroactively makes TFA worse\\, but also makes the character journeys of both Luke and Anakin less meaningful.\\n\\nI can't be the only one extremely annoyed that they never bothered to flesh out the New Republic AT ALL? Or at least explain how Snoke was able to create such a strong military in the shadows to be able to overthrow the government? Now that the writers established that Snoke was a joke deserving no background or context in lore with his anticlimactic death\\, we're supposed to believe that the New Republic was just that weak and incompetent?\\n\\nPositives: Benecio Del Toro\\, the creatures\\, seeing Mark Hamill again even if his character was butchered. I'm glad Rey's parents ended up being a nonfactor\\, I was holding my breath thinking the movie was going to disappoint me further with an awful reveal.\\n\\nI miss George. The Sequel Trilogy is severely lacking in the coherent vision and themes present in both the Original Trilogy and the Prequel Trilogy.","true":true}