{"101487":170017,"Last Jedi":"Last Jedi","2017-12-15":"2019-09-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars movies cannot be reviewed as stand alone movies. They have to be reviewed within the context of the Star Wars Universe. This movie fails in both areas nonetheless. \\n\\nWe don't need realism in science fiction\\, but we at least need it to be believable in the context of its own universe. One spoiler I'll release because it happens very early in the movie and has little significant impact to the outcome.\\n\\nPoe leads a strike force against the First Order fleet. As the odds turn against him\\, Leia orders him off numerous times. She is the commander of the alliance\\, or whatever the rebels are now called. Poe ignores her and orders the bombers to strike a First Order dreadnought. Virtually every vehicle in the strike force is destroyed. They do accidentally manage to destroy the dreadnought\\, but at a huge cost in lives and machinery. \\n\\nInstead of having Poe arrested he is simply demoted. In any military force in our known world\\, Poe would have been locked up and court marshaled. In time of war he would have been sentenced to death. Not in Star Wars\\, though\\, for some reason. Leia even goes on to say later in the film that she really likes Poe\\, even though he sent dozens of people to their death against her orders only a few hours before.\\n\\nThere are countless bizarre events that occur in the movie. A pointless mission to another planet. A revenge battle between two characters whom we don't really care much about. The sad\\, tragic death of a character we only met about thirty minutes before and have no emotional attachment to. The death of someone we assumed would be a huge\\, major character but whom we really still have no idea who he is. A new major leader of the Rebels whom we never met before and will never see again. A secret that is kept from mutineers that didn't need to be a secret except I guess it added to the running time. People using force powers that were created only for the plot of this movie. \\n\\nThe only redeeming quality in this movie is the interaction between Rey and Kylo. If the movie had focused most of its time on these two then it may have worked. As it turned out\\, their relationship was more of a side-quest in the overall story. \\n\\nWhen I first saw the movie I thought it was great. Yet I got home and thought about it and kept saying how this didn't make sense and that didn't make sense and what was the point of this or that.\\n\\nWatch it for free if you can. Just don't expect much.","true":true}