{"101487":112715,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Careful! Spoilers abound!!!\\n\\n\\n\\n\\nA more skillfully assembled film than The Force Awakens.  It was lovely to see Mark Hamill play Luke again on the big screen.  The picture was beautiful.  It had many funny moments and a few unexpected surprises to boot. \\n\\nThe film unfortunately suffers from the box that JJ Abrams stuffed the Star Wars world into during The Force Awakens. Rian Johnson does a decent job of cleaning things up though.  Killing off Snoke was quite welcome.  Johnson deals with Luke's fall from grace as best that could be done.\\n\\nSnoke's mere presence weakens Kylo Ren's character the same way Quigon-Jinn weakened Obi-Wan's.  It seems no writer is willing to lay full blame on precious characters for the decisions they make in the Star Wars universe.  Obi-Wan should have been given full ownership defying Yoda to train Anakin.  It would have made him much more human and tragic.  Why couldn't young Ben Solo merely have a fascination with the dark side and turn to it all on his own?  Then there is the fact that Snoke's mere existence starts begging the question \\\"Who is this guy?\\\" and \\\"Where did he come from\\\" which instantly starts demanding a larger story be told which a feature film can't afford.\\n\\nMy biggest issue with the film is it's lack of point-of-view.  The original Star Wars movies that we all love so much focused on Luke's journey from farm boy to Jedi Knight.  The Force Awakens seemed to continue that concept with Rey but in The Last Jedi the story is bouncing back and forth between so many characters the film does not feel like it's anyone's journey anymore.  \\n\\nThen\\, unfortunately\\, Leia is robbed yet again.  The CGI character Maz had what should have been all of Leia's lines in The Force Awakens.  Now Laura Dern ends up what should have been Leia's role in The Last Jedi.  But I don't know how Carrie Fisher's death affected this.  The decision to put Leia into a coma leads me to believe they did not finish filming her scenes even though I thought they did.\\n\\nThen there is Luke.  We all fell in love with his journey in the original movies.  Because of this I have many mixed feelings about his role in the film and his death.  It's really hard to see Luke fall so low.  That is good storytelling though!  Take your most beloved character and take them to their lowest.  But I feel like I needed to see more Luke\\, especially more Luke and Ben.  The entire story turns around what happened between these two but we barely see them together.  Luke's astral projection was awesome.  A fantastic way for a Jedi to fight a battle but to kill Luke off so soon?  If Rian intended to kill off Luke why not bring Luke and Ben together for a super powerful Jedi battle?\\n\\nBy the way Lando should have answered that beacon.\\n\\nThe biggest loss with the new Star Wars trilogy was not getting Han\\, Luke and Leia on screen together.  I would have also liked to have seen the state of the galaxy empire free.  It would have been nice to show what all the hard work and sacrifice Leia\\, Luke\\, Han and the rebellion led to. It just seemed like they never stopped fighting.  I wanted to see a free galaxy but one that might be in chaos and Leia has the hard job of being a diplomat instead of a freedom fighter.  Then Kylo Ren comes along and wants to bring back the old glory of the empire and some people actually embrace it.\\n\\nBut it's extraordinarily hard to make a movie like this.  Dealing with so many fan expectations\\, studio execs and deadlines is not for the weak of heart.  So I tip my hat to Rian Johnson.  I like forward to a new trilogy from him.  For he will be free to create a new world within the Star Wars universe that we are not so all emotionally attached to.","true":true}