{"101487":134296,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I just hate what they did to this franchise. There was so much source material they could have pulled from the books and expanded Star Wars universe. They still could have written their own unique storyline\\, but had some really fun and interesting characters to build around. Yet they used none of it. Why?? I think the entire reason they refused to use any of it was so that they didn’t have to pay royalties to whomever they pulled their material from. Their greed to squeeze every dollar out of what already would have been a cash cow....led to the fans getting boring bland characters like Rey\\, Snoke and Kylo. There was no creativity in the overall appearance of any of these characters. Look at Ashoka\\, Maul....they just look so cool and different - instead we just have a girl with zero training who’s born perfect at everything\\, your great grandfather in a nursing home robe and one temperamental teenager with a marginally cool mask he never wears. Lucas couldn’t write dialogue to save his life\\, but man did he know how to paint a picture. His universe was so expansive\\, so diverse....such a shame Disney and by extension Rian Johnson and JJ Abrams made it all just so bland. But beyond the characters themselves\\, the story is just meh. So in 20 or so years\\, Luke accomplished....next to nothing? And why not start with the Jedi academy....show Kylo as a young Jedi....show the students and teachers...show some actual character development. Some depth! Show Kylos eventual turn to the dark side. I think if they had started the trilogy in this fashion they wouldn’t have had such vitriol from the fans. It’s just a shame. This trilogy had so many possibilities to it. It would be great if they just owned up to it\\, but chances of that happening are slim and none. Instead they are now in a position where they have to double down on it for 9...they really have no other choice. The damage has been done and gotta see it through to the end. But you can bet heads will (eventually) roll over this debacle. ","true":true}