{"101487":168806,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So much wrong with this film:\\n\\n- The humour is grossly off and honestly the first 5 minutes made my heart sink. Yes\\, there have always been light hearted moments (I can stand BB-8\\, the Porgs etc.) but every moment has its gravitas broken with a flat joke e.g. when Luke sees Leia for the first time after many years or between Poe and Hux. Simply put\\, the Marvel style humour does not work in Star Wars.\\n\\n- The departures from the lore. I actually liked Luke's perspective on the jedi order as decadent\\, a failure etc. but then you have Leia floating through space without any training\\, and Rey (who I actually really like as a character) being a complete Mary Sue e.g. defeating Snoke's bodyguard\\, Kylo in the previous film etc. without any training. Compare this to Anakin or Luke who we saw get trained over three films and it's completely off.\\n\\n- The handling of Luke. Luke was never my favourite character but how he goes from finding the good in Darth Vader to attempting to kill Ben Solo and being a hermit on a remote planet milking wildlife for green milk; neither sticks with his character or makes sense (why did he leave maps to him if he went there to die?).\\n\\n- Failure to deliver from TFA. Episode 7 wasn't perfect (I'd give it 4\/5 starts) but it set-up a new trilogy with the Knights of Ren\\, Snoke\\, finding Luke\\, the First Order\\, the Resistance etc. This film does its best to either ignore the plots (e.g. where are the Knights of Ren) or tie them up (kill Snoke\\, have Luke die etc.). Rather than materially move the plot forward or set-up the wider universe\\, it seems insistent on rehashing the old Empire \/ Rebellion story (except this time the Rebels are all on a single ship and we have no context). Honestly\\, it would have been so refreshing to have Rey join Kylo and move on from the Resistance \/ Rebellion.\\n\\n- The Villains. Snoke was actually a very interesting character and I would have been happy exploring his origins more (or focusing on having him supplanted to provide a new twist vs. the original trilogy). Instead he just dies. Phasma was also a very cool character who achieved nothing in either film. Finally\\, General Hux is a) very miscast and looks far too young to be taken seriously; and b) at this point is something of a joke character (what has he actually achieved other than a bit of shouting?).\\n\\n- The plot holes e.g. why a dreadnought has no shields against a single X-wing or why the Resistance can simply out-run the First Order; couldn't they call in some additional ships or simply have a ship or two hyperspace out of back in? Also\\, mixed feelings about the hyperspace kamikaze; couldn't it have simply been used on the deathstar?\\n\\n- The heroes (plot). I have no problem with TFA characters (again I like Rey and Finn) but the casino side quest was awful; I appreciate it was trying to land a politically correct message about wealth and animal cruelty etc. but it was very hamfisted. Honestly I think DJ was actually more convincing with his moral relativity; at least it didn't feel so forced!\\n\\n- The heroes (casting). For the record I have zero problem with diversity but I'm made conscious of it due to the positive discrimination. You have the previous director saying \\\"you look around that room and you see the whitest room in the history of time. Its just unbelievably white. And I just thought\\, we're casting this show and we have an opportunity to do anything we want\\, why not cast the show with actors of colour?\\\" or the current director saying it's time Star Wars was directed by a non-white or woman. I don't want to care about this stuff but with poor casting for Rose or Holdo I feel like I have to. Rose in particular was dull and pointless: says you can't win a war by fighting\\, falls in love with Finn after a few hours and delivers the aforementioned hamfisted political views (hey - I don't like animal cruelty or gross inequality but pick a topic and deliver it!). if the casting was better maybe it could have delivered (though the script writers clearly need to be of better quality also).\\n\\nOverall\\, will not watch a Solo Story and may come back for Episode 9 if the reviews are positive.","true":true}