{"101487":166500,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Seeing the hype and the ridiculously high ratings around this\\, I feel I have to try and balance the scorecard and tell you why this film isn't half as good as the Disney media train would lead you to believe. \\n\\nAs with many of the big action Hollywood blockbusters at the moment the plot is basically an afterthought. I don't mean this subjectively\\, I mean the plot makes very little sense at best. The entire film is based around the main characters blundering along making one bad decision after another. We know their decisions are bad because other characters tell them it's a bad idea\\, or they fail at reaching their own goals. However at no point are the characters punished for this. Every bad decision is rewarded by good luck that magically helps the characters out of the hole they've dug themselves into. For me this is bloody awful writing. I was always told\\, use chance to get your characters into trouble but use their skills\/personality to get them out of it. This film doesn't follow this in the slightest. \\n\\nAside from the bad plot\\, the film has bad villains. The Star Wars franchise pitches good against evil. The problem with this film in particular (and probably also The Force Awakens) is that the bad guys simply aren't that bad. They\\, like the good guys\\, bumble through the entire film. It's just mistake after mistake. Why to the rebels fear them? They couldn't catch a cold let alone a Jedi.\\n\\nIn general the film seems to be pitched at a much younger audience than the original films and as a consequence no real evil is shown on camera\\, it's not even eluded to or implied\\, there's no specifics. The problem with this is that the worst thing the big bad baddy seems to have done is shout at a couple of is incompetent employees\\, hardly the behaviour worthy of damning a man as evil. In fact if you pay attention during the film the good guys are responsible for murdering thousands more extras than the bad guys. \\n\\nOverall the film doesn't feel like the middle of a trilogy. The Empire Strikes Back was a dark film leaving the audience feeling like all hope was lost by the end\\, but this film struggles to create any long term anxiety for the goodies at all. In fact they could wrap up the final film in about 20 minutes as there seem to be fewer barriers to their ultimate victory at the end of the film than at the start\\, making me really fear for the quality of the third film. \\n\\nFor fans of the old films they'll struggle with the old characters they came to know and love. They aren't treated with any respect for the personalities they cultivated over the franchise's history. Character struggles that made up huge swathes of the previous films are reversed without adequate explanation\\, it felt like character assassination. Others are reduced to comic relief without any real reason to be included at all\\, other than as a throw back to the originals (and maybe to sell more merchandise). Disney also have embellished the force. It seems forced at this stage of the franchise to introduce new powers and redefine which characters use it. Again something the fans of the old films will find annoying. \\n\\nOne of the most pointless scenes is an attempt at explaining the religion of the force. The last time this was attempted they went for the pseudo-scientific approach with Midi-chlorians and it was widely regarded as awful. In this film they avoid that by talking in banalities\\, the scene goes on and on and every piece of dialogue has been intricately designed to say nothing. \\n\\nDisney's DNA is all over this film. The universe's wildlife has been designed with the specific purpose of making beanie babies rather than fitting in with the weird and wonderful creatures of old. Also Disney's version of humour blights almost every scene. The comedy is forced\\, often irreverent\\, and caused audible groans throughout the theater I saw it in. \\n\\nThe thing I find most offensive about this film is the zeitgeist's insistence that it's not just good but worthy of the 92% score it has at the time of writing this. The film is objectively bad. What it does is trick the audience into thinking they've seen something substantial by bombarding them with noise\\, a constant dirge of music and shrapnel flying through the shot at all times. Basically it's one rotating shot of someone standing up short of a Michael Bay movie. I implore you all to really think about what makes a good film and then critically think about what this film offers and see if they overlap at all\\, I'll bet the cost of the ticket to the next Star Wars film that they don't. Please demand more from films\\, like a coherent plot\\, films should be a conduit for story not just special effects.","true":true}