{"101487":130415,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I did go see Star Wars The Last Jedi yesterday and while it wasn't as terrible as I was expecting it was still pretty bad. It may be that I am just to attached to the old universe. I watched Episodes 4-6 twenty to thirty times\\, Episodes 1-3 probably just shy of ten each and read all the books in the Extended Universe. That being said I think the audience score of 56% on rotten tomatoes is a good representation. I didn't mind the new characters and I did like some of the humor in the movie. The movie itself isn't a bad movie but it decimates the character of Luke Skywalker. The guy who in episode 6 walks into a den of criminals lets himself get captured not once but twice all in order to save people he cares about suddenly has given up all hope and is waiting on an island so that he can die. I mean I understand character development and that people can change but if someone can change that drastically then give Donald Trump another 30 years and he will be Mother Teresa. This movie firmly destroyed everything about the Star Wars universe I loved. Everything the Rebellion fought for and established in episodes 4 through 6 is gone. The new government that was established was literally blown up and now there are maybe 15 to 20 people left in the resistance. The Return of the Jedi I felt clearly established that the Jedi were returning with Luke at the helm. However\\, this movie clearly established that Disney is now in control and they are washing away all of the old universe. If I hadn't been so invested in Star Wars I probably would have loved this movie\\, I think the problem I am facing is that I loved the old movies and now they have been made almost entirely irrelevant and the characters that were in them have been terribly tarnished. I view this movie as the death of Star Wars and the birth of Disney's cash cow.","true":true}