{"101487":133643,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have been an avid Star Wars fan since I was 8 years old. I was born in 1987 so I grew up watching the Original Trilogy on VHS. I am someone who did not like the prequels\\, yet became overcome with joy when I found out Disney was buying Lucas Film and were making Episode 7.\\n\\nWhen Episode 7 came out while I agreed it was some what of a rehash. I could understand the need to launch a new adventure while still connecting to the original trilogy. The repeated themes and constructs did not bother me\\, as I knew The Force Awakens was just a stepping stone into a brand new trilogy. I did think parts of it were lazy and if they had more time they could have gone in a totally different direction. But overall I feel it served it's purpose enough.\\n\\nSo two years later\\, and two years of waiting we get The Last Jedi. From what I had read online\\, early reactions were saying the film was weird and Rian Johnson went a totally direction with it. I was excited upon hearing this and especially since hearing Rian had grown up a Star Wars nerd. Finally someone to really DO SOMETHING after being given the reigns. \\n\\nSo last night I went into the movie excited as ever and thinking I was going to walk away loving it.\\n\\nSo here is my review of the The Last Jedi and I will sum it up in 2 words: Missed Potential. \\n\\nWe have waited 30+ years to see Luke and what he accomplished after the ROTJ. We have waiting 30+ years to see to THE FULL EXTENT OF HIS POWERS. We have waited to see where he's been\\, what he's become\\, and what's he's up to now.\\n\\nWhat did we get? a weakened Luke who ran off to die on some island. We get some stories about how he built a jedi academy and Ben Solo was his student. And now because Ben's bad he wants nothing to do with the Jedi. That's basically it.\\n\\nWhat we get in this movie is Luke training Rey for about 5 minutes and then having a talk with Yoda for about 5 minutes.\\n\\nThen a projection of himself having a fake confrontation with Kylo Ten\\, then poof he's gone.\\n\\nWe are left with:  zero idea of how his force power has grown and literally zero action. WHAT!? What about the 30 years between now and the ROTJ. That's it? This is how Luke Skywalker's saga ends? \\n\\nWhat a total letdown.\\n\\nIs this really the best they cold come up with? Is this really what they think fans would appreciate it? I actually would have been more interested in George Lucas' take for Luke's final act. I wonder what George feels about all of this.\\n\\nNow it's clear to see why Mark Hamill was giving interviews saying he did not agree with the direction they took Luke in this movie.\\n\\nI could nitpick the rest of the movie. There were things that worked and things that didn't work. There were useless plots\\, wasted space\\, wasted new characters\\, etc. But in the end the way they handled Luke was atrocious. \\n\\nI now have zero interest in seeing Episode 9 and I do not have any faith in Disney to faithfully tell any new Star Wars stories.","true":true}