{"101487":145716,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-26","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I understand why people don't like it as much\\, but honestly. I liked it\\, right from the beginning. After watching it multiple times it only reinforces how great I think it is. Are there parts I don't like? Yes\\, of course (looking at you Canto Bight)\\, but I think on the whole\\, the movie didn't play it safe. It gave Star Wars fans something new and interesting. \\nI think the Rey\/Kylo Ren relationship is one of the most compelling story arcs in the whole series. He was too powerful at too young an age and the adults in his life didn't know how to deal with him. He had no one in his corner. It's no wonder he was so easily manipulated by Snoke and the dark side. But now there's Rey in his life. She will be his guiding light. She also feels like no one was ever in her corner. And the person she thought was going to step into that role (Luke) didn't. Ben was there\\, and he did help her. She sees the good in him and wants so badly to save him. In the end\\, even though they fought together\\, She can't stay\\, he won't leave\\, but they're connected. I ardently believe neither of them can kill the other. They're 2 sides of the same coin. I want her to help redeem him so badly in 9. I want them to dissolve the first order together\\, but I'm afraid the 'redeemed Skywalker' trope is too tired. Please JJ Abrams\\, don't ruin this for me.  \\nI like Luke's arc\\, as well as Poe's. I thought they both really developed as characters. Initially I really disliked Finn's story\\, but after multiple viewings I changed my mind. Rose and DJ are like the angel and devil on Finn's shoulders. DJ was what Finn was; Focused on saving himself. Don't join\\, run away. But Rose is the opposite; duty\\, honor\\, courage. He struggles throughout the movie with both sides of himself\\, but Rose and the resistance win him over. I'm hoping in the next movie he'll be less selfish. I don't know where they're going to take his character. \\nOver all I thought it was a fantastic addition to the series. It wasn't perfect\\, but I liked that it wasn't cookie cutter. I am so excited to see what JJ Abrams brings us for 9!","true":true}