{"101487":130641,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I didn't think The Last Jedi was a particularly good film at all (I have mixed feelings about it). I thought Rogue One was great (and the Force Awakens pretty good too). However\\,  the Last Jedi was a mess: (i) bad writing (including shoehorning dialogue and famous lines from previous movies into the new movie); (ii) bad design (i.e. the First Order is simply the Empire but with more guns stapled onto everything); (iii) too many characters who somehow all deserve significant screen time (which resulted in a bloated movie with plots that simply went nowhere\\, e.g. the detour to the casino planet felt like both an afterthought and detracted from the urgency of the major premise of the film); (iv) the conceit of the movie did not really work for me and seemed internally inconsistent  (e.g. (a) the First Order could have ended the Rebel fleet at any moment; (b) why would Rose crash a vehicle into Finn which could have killed them both and still ultimately doomed them as the cannon they were trying to disable was still functional and a threat to the rebellion (it didn't seem like a virtuous act\\, plus they crashed right in front of the whole First Order army with no consequences) (c) too much plot armour for the hero characters (again Rose and Finn somehow being totally unharmed on the Star Destroyer when it was rammed by the Rebel admiral when a legion of Storm Troopers instantly died around them; and super Leia flying through space was strange (this didn't seem to be necessary at all)); (vi) pointless conflict between rebel characters which again is more just a product of our time rather than adding much to the film. Finally\\, I don't think the movie handled Luke Skywalker well at all (it was a disservice to the source material and the three movies which made him an iconic character).","true":true}