{"101487":129493,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-12","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am honestly unsure how to rate this movie. Many people will blindly give it a 4\/5 or above because of the nostalgia it draws out\\, but the plot left much to be desired. The plot was littered with ex machina moments to progress the plot (events just happen randomly without build up because the plot requires that a certain character not die or that a plan fail). Without going into spoilers I'll leave it like that. Artistically the movie looked great and the acting was nothing short of perfect. Score of the movie was of course perfect. My main gripe with the film is how many coincidences and plot armor moments there were within the film. There were so many of these moments I often found myself wondering why I was still watching.\\n\\nI'll list out a couple of the moments that I felt came out of the blue for no other reason than to advance the plot and maybe someone can explain them to me better. (Spoiler warning turn back now)\\n-Princess is on bridge when it gets blasted and is sucked out into space. She then proceeds to freeze. After freezing she somehow has not died yet and uses the force to bring herself to another shop. Po somehow sees this one person among all the debris and opens the door for her.\\n-Snoak.... they build up this sith baddie in the past movie and even in this movie as being much more powerful than kylo\\, luke\\, and rey. U mean to tell me that someone who can literally throw people around in a room while on the other side of the galaxy is cut in half by an angry and angsty boy and a girl who fell into the black asshole of an island and has barely any jedi training? Yawn\\n-Rey has no real force heritage but is just magically gifted to be as strong as kylo who has trained under two of the most powerful force users in the movies. Hmmm...\\n-Rey and kylo fight off the knights of ren\\, and defeat almost all of them without trouble only to have an epic struggle against the last two of them for the sake of having a cool and suspenseful fight scene.\\n-Luke seeming to astral project himself and trick everyone into thinking he is really there fighting only to find out that this trick cost him his life and he becomes one with the force.\\n-the rebels are seemingly trapped in a base. C3po clearly states when they first arrive that the only way out is the way they came in. Yet 30 minutes later he retcons his own dialog to say that there are tunnels in the back of the base. Also the only reason the rebels decided to look for tunnels is because they assumed that's how like got in\\, which we know he didn't because astral projection and shit.\\n\\nThere's other moments I'm forgetting but these are the ones that really kept me from being emersed in the story.","true":true}