{"101487":196446,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While I loved The Force Awakens\\, I had a hard time getting over Han's death (ya\\, I know I need to get a life).  But\\, in time I came to terms with it and agreed that it was probably part of a bigger storyline.  The Last Jedi makes me feel that his death was in vain. \\n\\nI was hoping to see development in Rey (who I thought for awhile was Han's daughter) but that didn't really happen.  I was hoping to see Kylo Ren (who is Han's son) evolve.  Even if he evolves in a bad\/dark way\\, I wanted to see something but that didn't happen.\\n\\nI have always been a Han fan and always thought Luke was just ok.  But throughout the OT\\, we watched him progress from a whiny kid to a man with substance and depth.  TLJ has made him into a whiny old man instead of the guy we saw refuse to kill Vader and helps defeat the Empire.  Now we are told he tried to kill Han's son - his nephew - in his sleep?  Not the Luke I knew.  It seems that whoever worked on Luke's script and arc in this movies has never seen the OT.\\n\\nMore time should have been devoted to developing Rey and Kylo.  Finn and Poe were given shortshrift too.  Instead we see them being stood up by some new characters that frankly did not need to even be in this movie.  \\n\\nWhile I liked the new guy (the hacker named DJ) he was underdeveloped and only in a few scenes.  I'd like to see him in future films (if I can bring myself to watch another one).  But I cannot stomach seeing even one more scene with Rose.  She really rubbed me the wrong way and I found that I really disliked every scene she was in\\, because I really disliked her.  I could have gone the rest of my life without hearing her lines which were either lefitist propaganda speeches or incredibly cheesy.  I really hope she is not in any future installments.\\n\\nSo\\, the real problems for me with this movie were the poorly written script\\, underdeveloped characters and misrepresentation of characters that were inaccuate.  Could have been so much better and that is what makes it so disappointing.","true":true}