{"101487":146123,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've waited to watch it again on DVD and yep I was right back in December with my first impression. It's so bad it's of a I wish this wasn't associated with Star Wars and can they delete this from ever having existed and start all over again. You could write an essay on what is wrong and very little on what is right. I'm not advising rehashing episode V as per JJ's TFA did of episode IV but surely these highly paid Hollywood individuals could have come up with a unique and original story line and plot for this film that carries on in a vein of what we know in this created universe. I'm sure even the most casual viewer of the Star Wars films given the title and their background knowledge could have come up with a better story and plot that would be umpteen times better than this turd of a movie. Here the story is crap\\, the plot just as crap\\, some of the characters... well I don't care for (not the actor or actresses fault) while others I'm interested in are either killed as with Holdo or mere cameo's like Phasma and what the hell was the idea with giving DJ a stammer. Scenarios make no sense even with looked at with a modicum of common sense\\, supposed cliff hangers or big story moments are just discarded as meaningless if this was homework it would be ungraded. I've no issues with the actors and actresses as they can only do what they can with the script and how the director wants them to portray their part I suppose so bravo to Hamill for putting up with filming this as in his shoes I'd have been pulling my hair out at what they were filming and doing. If I was George Lucas I'd be seething. I've got to watch episode 9 just to see how JJ Abrams rescues the steaming pile of turd of a story he's been handed by R Johnson and I hope that individual is never allowed near this franchise again as this will...will go down as the worst Star Wars film ever....","true":true}