{"101487":190487,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"[Uá´~á´...á´á´>á´á´... Êá´á´ Éªá´á´¡ á´?Ò\\\" Sá´>á´Ê Wá´Ês TÊá´ Lá´sá´> Já´á´...Éª: Sá´~á´?ÉªÊá´Ês á´¡á´ÊÉ´ÉªÉ´É¢]\\n\\n{So here is my updated review of Star Wars The Last Jedi. If you do not like this movie beimg torn apart\\, I would not reccomened reading it. But if you want a review from a different point of view\\, read it. Also I'm not gonna try and change your opinion on it. I'm just stating mine. So let's start off with what I do like about Star Wars The Last Jedi. There are things I do like.}\\n\\n[LÉªá´<á´s]\\n{So the things I do like about Star Wars The Last Jedi is the\\, acting. Everyone did a good job with what was given to them. Mark Hamill\\, Carrie Fisher and Adam Driver were the standouts. The visual effects\\, also looked great. The CGI for the most part looked great. Nothing looked fake to me. Another postive is the action scenes\\, the action scenes were all well done. The fight with Rey and Kylo Ren vs the Praetorian Guards was so well done. Kylo Rens style of fighting is so entertaining to watch. Also the space battles were amazing to watch as well. The battle of Crait was short but fun to watch. A stand out character for me was Poe Dameron. He was funny as hell\\, and Oscar Isaac acts perfect as him. The soundtrack in Episode 8 was decent. Easily wasn't John Williams best... But it wasn't his worst. Also I loved seeing Yoda. So glad to see him in Episode 8. Also with what we got of Snoke I really liked him.}\\n\\n{So those are all my positives for Star Wars The Last Jedi... Here are my negatives.}\\n\\n[DÉªsÊÉªá´<á´s]\\nEverything else is what I dislike. For one\\, before anyone says anything. Trying something New Is not a reason to love it hate a movie. Being risky isn't a good reason for anything. Especially if it ruins characters. But before we get into characters. I'm going to go into plot holes and subplots that don't work.\\n\\nFor one\\, why did Captain Phasma\\, give up the fucking codes to Starkiller Base shields in the first movie. She has blaster proof armor! Why was she scared she'd die! That actually makes no sense why she did that. Also\\, the First Order killed the New Republic planets in 7. But in 8 they are somehow in control of the galaxy. This took moments right after 7. So that makes no sense at all.\\n\\nAlso the fact they ruined. It was said that Snoke is more powerful than the Emperor. That he came from the Outer Rim. You wanted answers for whom this person was? We you don't get any as Kylo Ren KILLED SNOKE! ARE YOU FUCKING TELLING ME THAT THE MOST POWERFUL DARK SIDE USER\\, COULDN'T SENSE KYLOS THOUGHTS! YOU DIDN'T TRUST KYLO EARLIER IN THE MOVIE. And people say\\, \\\"Oh the Emperor didn't sense Vaders conflict. So how could Snoke on Kylo?\\\" The difference is\\, The Emperor trusted Vader more than Snoke did for Kylo Ren. Also are you telling me that Snoke could not hear a fucking Lightsaber move on a metal chair!!\\n\\nNow as for Luke Skywalker\\, they ruined his character so much. Han acted like older Han\\, Leia acted like a general. But both acted like themselves. Luke acted nothing like himself. Luke became a coward. Also why would Luke leave a map to himself for the Resistance\\, if he didn't want to be found. TFA said Luke wanted to find the first Jedi temple. Lies!!! He wanted to die a pathetic old man away from his sister and best friend. Now as for Luke trying to kill Ben Solo as a kid. WHAT THE FUCK! Luke saw good in Vader\\, the second most evil person in the galaxy. He always wants to see the best in family. He didn't do that for Ben. He was going to kill his best friends son\\, And sisters son! WHAT!!! That's not Luke Skywalker at all. And if Han and Leia can be themselves 30 years later. Why couldn't Luke. And why DID YOU KILL OFF LUKE!! He had a X-Wing he could leave in. But he ended up being dead on the island by being exhausted using the Force... So you are telling me Luke still couldn't do that\\, And go to his sister to help her. He still could've lived or died a hero. But he died a coward. Ruined!\\n\\nNow the Casino stuff was so out of place! It did not need to be in this movie. It took it to a terrible stop and ruined it. 30 minutes of this shit. Not 10! 30! It wasn't a Star Wars movie anymore when that happened. Also by the way\\, The whole Casino shit was a waste of time. Thanks to Finn\\, Poe and Rose. Many Resistance members died. Because the stupid Holdo character\\, refused to tell him. If she told Poe the plan. NO ONE WOULD DIE!!! So stupid.\\n\\nAlso the reason for Rey being so strong is stupid. The explanation was terrible... TERRIBLE.\\n\\nWhy did we get a Luke Skywalker drinking milk from a creatures tits? Why did we have to see that?\\n\\nThe DJ character and Captain Phasma are wasted. Especially Captain Phasma. But DJ was just a boring version of Lando. Instead of DJ character\\, it should've been Lando.\\n\\nRose and Finn love story was rushed so much. She knew him for 12 hours and loved him. Why?\\n\\n{So this is my review or Star Wars The Last Jedi. This movie is crap in my opinion. It ruined Star Wars in the future. Luke Skywalker is now a coward. And everything was just bad. I give Star Wars The Last Jedi a 4.5\/10","true":true}