{"101487":188201,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was not the Star Wars movie you were looking for. I'm a bit in awe of the fact critics arrived at a 93% fresh rating when there was just so much wrong with this movie. As much as The Force Awakens was retroactively slated for being too close thematically to A New Hope\\, The Last Jedi was like watching a mixed up version of the series best chapter\\, The Empire Strikes Back. While Empire should have been a great movie to build a framework around\\, the results were mixed at best. \\n\\nThere were hugely anticipated questions we went into this movie hoping to get definitive answers for\\, like Rey's lineage and Snoke's background and we got virtually nothing as an explanation. These were things that were left on a tee by JJ Abrams\\, and it feels like Rian Johnson hit a weak grounder back to the pitcher.\\n\\nIt felt like Johnson had no real ideas for what to do with Finn\\, so he created this odd couple scenario with new character Rose. Their adventure just felt like an excuse to introduce a new planet and for Lucasfilm to briefly show off their new character designs. Their plot served as a vehicle to lineup an encounter between Finn and Captain Phasma. She popped back into the story with virtually no setup and left just about as quickly. She's this trilogy's Boba Fett\\, a character who looks cool\\, but when push comes to shove gets embarrassingly owned.\\n\\nIn watching the movie I started to get this feeling that maybe Rian Johnson wasn't the right director for a Star Wars movie. While JJ Abrams heavily leaned on nostalgia to create The Force Awakens\\, it felt like Johnson's frenetic jump cuts were more cheap tricks to hide the fact this movie didn't have great dialogue in comparison to Episode VII. This movie felt overstuffed and the run-time unnecessarily long. I think JJ Abrams has his work cut out for him to wrap up this trilogy in a satisfying manner after Johnson's work on The Last Jedi. Instead of excited about the idea of a Rian Johnson helmed new Star Wars trilogy\\, I'm now quite apprehensive that he can bring a tight\\, cohesive new vision set in the Star Wars universe. \\n\\nYou want ships that can't jump to lightspeed and are trying to evade Star Destroyers? AT-ATs that land way too far away from the base they're attempting to attack? Evil forces ambushing the Rebels as they abandon their base? Jedi training? A movie ending that looks very dire for all the protagonists? Go watch Empire Strikes Back and be happy. While I know that nobody is going to skip The Last Jedi\\, know that this isn't nearly as the critics reviews seem to gloss over. This isn't the Star Wars movie you were looking for. Move along.","true":true}