{"101487":116081,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Disappointing.  This is a beautiful movie loaded with all kinds of bling and sparkle to take your mind off the fact that there is a weak story filled with holes.  Sadly - I need to put spoilers in here to make my point so don't read ahead if you don't want spoilers.\\n\\nHere we go.  So right from the start the movie can be summed up as soon as Luke takes the saber from Rey and throws it over his shoulder.  Done!  That is the premise for this entire movie.  Everything most people know and love about Star Wars is nonchalantly thrown away in favor of clearing the slate for a new bunch of stories.  For me - Star Wars has always been about the Han\\, Luke and Leia and how the galaxy relates to them.  The Force Awakens did a very honorable job of beginning to pass the torch to a new generation.  This movie says \\\"The hell with that!  We want a clean slate and we want it now!\\\"  Rian Johnson and Disney arrogantly take the story away from the fans and insist that the Star Wars galaxy is bigger than Han\\, Luke and Leia and their part is done.  That is why the fans hate this movie.\\n\\nSo here is some of why this movie is disappointing.  First thing is we take General Hux - a military badass who is to Kylo as Tarkin was to Vader - and he is reduced to comic relief with his robot ironing board.  Would Tarkin have carried on that conversation with Poe?  No!  Lucas had too much respect for the character.  Next it's Luke on the island.  We are to believe that after our hero Luke Skywalker defeated his father and became a jedi\\, he went on to train up a fleet of new jedi and pass on his knowledge.  After he loses his nephew to the darkside - and consequently his entire Jedi School to the Knights of Ren - Luke\\, the only survivor\\, crawls out of the rubble and decides to...give up?  Die in exile?  That doesn't seem right.  He gave R2 half of a map to where he was going and gave the other half to Lor San Tekka - who conveniently was on Jakku with a very force sensitive\\, mysterious young girl.  When Lor gives the map to Poe he says\\, \\\"This will begin to make things right.\\\"  Meaning that finding Luke is the first step toward defeating the first order.  Why would Luke leave clues if he didn't want to be found?  Seems to me that JJ Abrams intended for Luke to have gone off to find the Jedi temple so he could become stronger and rise up against this new threat - not die in exile.  But apparently Rian Johnson didn't want to go that way.  An old school Star Wars magic opportunity was lost and a valuable plot resource was wasted.\\n\\nSo now we delve into the spider web of minor story lines that weave confusingly through the remainder of the film instead of the familiar and functional story telling pattern of the other Star Wars films.  We are expected to believe that a giant\\, massively powerful First Order ship can't go a little faster than a Rebel escape ship.  This entire plot point depends on the fact that the rebel ship is out of weapons range and will remain out of it until it runs out of fuel.  Hit the gas Hux.  Get a little closer.  Geez!  Sounds like weak\\, amateur writing.  But nonetheless - in the absence of Leia\/Mary Poppins (with new plot hole filling force powers) they bring in a new leader who believes in NOT telling anyone what she is planning.  So Poe\\, who is a great addition to the Star Wars family\\, secretly sends Finn and Rose on a fools mission to find a coder in the middle of a casino planet among millions of people and creatures with their only clue being that he will have a purple flower on his lapel.  Oh and get there and back before the ship runs out of gas.  Um...huh?  Who thinks this is good storytelling?  \\n\\nAnd what a waste of Maz!  Mysterious creature who has seen it all - and somehow has come into possession Anakin's lightsaber - and advised Rey that the lightsaber had called to her.  Why?  Who is Maz?  How did she get the saber?  Why did it call to Rey since it was made by Anakin and used by Luke?  Another wasted plot point that Johnson didn't feel was worthy of our attention.  I'm not even going to mention the disappointment of Rey's parentage.\\n\\nSo Finn and Rose return with a different code breaker than the one they went to find and he sells them out - but not before Poe discovers that Admiral Holdo had a plan that was friggin common sense.  Seems to me that Poe could have come up with that one.  So the pointless code breaker character informs the First Order of the rebel plan and shifts their attention to blowing up the escape ships.  Poe's plan is actually made responsible for the death of some 300 rebels and this is simply because Admiral Holdo couldn't be bothered to tell Poe what her plan was.  That is weak!  Again - immature and lazy storytelling.\\n\\nShift over to Supreme Master Snoke.  Who up close looks great but when he stands or moves around he looks terrible.  Lucas was making more realistic looking CG characters in Phantom Menace.  Well somehow - right after he says he can sense Kylo's every move\\, Kylo is able to distract him enough to turn the light saber and ignite it through him.  Luke could have done that to the Emperor in Return of the Jedi but he didn't.  Why?  Because its weak!  It degrades the character of Snoke and makes him impotent.  So this giant evil creature who rose up in the ashes of the empire and built the entire First Order\\, seduced and trained Kylo Ren\\, has tremendous control over the force and wreaked terror throughout the galaxy - is actually just a deformed old guy with no relevant backstory and pretty easily killed off.  Hugely anti climactic.  Doesn't work!\\n\\nIf you can get through all these things there are many more like them waiting for you.  This movie was a wasted opportunity and I'm not sure if it can be saved in 9.  They quite literally put a bullet in the head of the Star Wars universe that the longtime fans love.  I understand they want to make room for new stories.  And I see that people are praising Johnson for taking things in a new direction.  And all I can say about that is that there are those of us who believe Star Wars is the story of Luke\\, Han and Leia and there are those who believe Star Wars is about the Star Wars universe.  I don't think Rian Johnson was creative at all.  I think his story is weak and it slaps the longtime fans in the face.  \\\"Let the past die.  Kill it if you have to.\\\"  The Skywalker story deserved a better ending.  This is not the Star Wars you are looking for.  Move along.","true":true}