{"101487":129332,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am a huge sports fan and a huge movie buff\\, especially Sci-Fi\\, Comic Book and large Epic adventures. So obviously I have been a Star Wars fan as long as I can remember. If I had to use a sports analogy for The Last Jedi\\, it would be like watching Peyton Manning early in his last season with the culmination of him being benched temporarily. For years\\, Peyton's play was legendary and mythical...it held reverence and overcame all it's flaws because of the core brilliance. But to start thelat last season...it looked like Peyton\\, he sounded like Peyton\\, but in your heart\\, you knew it wasn't him anymore and that this was the end. This Star Wars to a younger generation may offer excitement and anticipation for the future. But the core of original Star Wars fans looking for glimpses of past glory and performance will be highly disappointed. Even the ghost of Yoda looked ridiculous. I literally fell out of love with this new era of Star Wars and will have to hold on the memories and rebroadcasts of the originals to scratch any itch for the series moving forward. In spite of my disdain for this film\\, thr larger problem they have moving forward is the lack of an iconic or multiple iconic characters. Darth Vader is arguably the greatest villian of all time. Han Solo was Harrison Ford\\, a high level well known actor. And Mark Hamill's young Luke Skywalker was a legendary protagonist. There is not the same connection to any of these new characters despite any charm or appeal they may posseess. There is a glaring and huge gap between Vader\/Solo\/Luke and any current main character\\, especially the incompetent Kylo Ren. Star Wars for the new generation is better for video games and cartoons. The time on the big screen stage has passed this franchise by and I can honestly say I have no enthusiasm for anything coming out in this line moving forward. Good luck Star Wars...may the Force be with you...you need it.","true":true}