{"101487":130209,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I could go into great detail as to what they did wrong but no need to beat a dead horse especially when it has been so negatively articulated and dissected so intensely that the dead horse is embarrassingly mutilated beyond recognition...much like the beloved characters\\, story\\,  and legacy of Star Wars saga if they continue on this route. I loooved the last two and fully expected and wanted to like this movie but sadly and much to my dismay I can noir give this a good review. My favorite thing about this movie were the cute little critters that were completely pointless in the grand scheme of things which only trends with the majority of the stories in this movie. If you enjoy disappointment or don't know anything about the Star Wars world or how it works then you may find this movie entertaining maybe but also still very long.  If you are a huge fan go into it with the expectation of watching a movie like say The Room and just know that the creators clearly expected us Star Wars fans to blindly and unquestioningly accept their clear lapse of judgement and respect for the fictional world that was meticulously created long before they were allowed to create this nonsensical movie.  I don't know how it was rated so well by critics and my only conclusion is that Disney must have payed them off or scared them with their magical powerful presence within the industry into saying good things and tricking us all into wasting money on this seemingly thrown together copp out and pitiful attempt at a Star Wars movie. Why didn't they keep the previous director? Did nobody tell them they were going in the wrong direction and the plot lines were bad out of fear? What movie did the critics watch?  I've never felt more disappointed and misled by a movie in my life. King Arthur was better than this and far far better quality in effects and plot lines than this piece of crap and somehow that  got rated lower ny critics... which leads me to my next point.  I'm beginning to realize I can now trust critic's opinions at the same level of about as much add I can trust the electoral college...thanks for making that so clear now. Overall this was supposed to be the highlight to a truly terrible disillusioned year and really it only served to solidify the suckiness and polarized split among so many  and their opinions even when it comes to this beloved fictional world. Go watch the Greatest Showman at least when you leave that movie you'll feel exactly how you expected you would feel rather than robbed\\, confused\\, and conflicted because your fictional world betrayed and disappointed you in pretty much every way possible.","true":true}