{"101487":142534,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's a very well made movie. Otherwise\\, it has a lot of social justice motifs that really detract from the quality of the film. Rey is never really tempted to go to the dark side\\, and Kylo is just made out to be an evil man through and through that was an inherently evil male since he was a child. \\n\\nThe pink haired\\, domineering general who didn't tell Poe Dameron what her plans were when it would have been prudent is a clear ode to radical feminists. Leia described her as not caring how bad she looked while serving the light; sometimes\\, people act nasty because they're bad people or are wrong.  \\\"My actions might make me seem like a horrible human being\\, but I'm really fighting for the good! You just couldn't see my goodness because you're a foolhardy man!\\\" Luke would also not have to have died if Finn didn't have his decision to sacrifice himself to give the Resistance time to escape stolen from him by a woman neither he nor the audience really cared about. Sometimes you do indeed have to fight people you hate in order to save the ones you love; evil people need to be fought against. As soon as the woman blurts out this line and passes out\\, the Nazis then proceed to blast open the door and incur a much larger loss in Luke than they would have had in Finn because of her decision. Hopefully J.J. can salvage the trilogy in his final outing. Disney\\, please stop encouraging up and coming directors to shoe horn in tired and regressive \\\"social justice\\\" themes into your films. Eventually\\, it will come back to bite you financially.","true":true}