{"101487":133774,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have never been so disappointed in a movie.  I'm posting this review in the hopes that it will contribute\\, if only in a tiny way\\, to persuading the executives who control the Star Wars franchise that they need to do better than this if they expect to maintain the draw of the Star Wars brand.  The theme of the movie would seem to be \\\"kill the past.\\\"  That includes not only the original movies and the prequels but also The Force Awakens.  It's as though Disney or Rian Johnson or someone felt that in order for the franchise to evolve\\, all or nearly all of the existing characters (including the characters from The Force Awakens) needed to be demeaned or degraded or simply killed off in a perfunctory way.  The attempts at humor felt like mockery.  People have been speaking of all the \\\"twists\\\" in the movie.  Simply defying expectations\\, though\\, isn't a \\\"twist.\\\"  The movie repeatedly defies expectations by telling us that what we were led to believe was meaningful in The Force Awakens wasn't really meaningful at all.  It's like setting up what would seem to be a murder mystery in the first movie of a trilogy and then in the second movie ignoring everything that the first movie set up and telling the audience that the deceased wasn't really murdered at all but instead died of natural causes in her sleep.  That certainly would defy expectations\\, but it wouldn't be a \\\"twist.\\\"  Neither would it be \\\"refreshing.\\\"  It would be a cruel joke on the people who were drawn in by the first movie.  As to Rian's Luke Skywalker\\, I'm baffled.  There is no joy in seeing a hero demeaned and degraded.  I was left feeling bewildered and incredulous.  Is this entertainment?  I felt neither joy nor sorrow\\, simply disbelief at the writing and directing.  At the end\\, we're misled into thinking that Luke has found his courage.  The \\\"twist\\,\\\" though\\, is that he really hasn't.  He didn't face Kylo Ren himself.  Instead\\, he sent a hologram to duel in his place.  Then in another \\\"twist\\,\\\" he dies immediately after the duel\\, apparently of exhaustion from over-using the force.  What the first \\\"twist\\\" (the force hologram) led us to believe was meaningful the second \\\"twist\\\" (Luke's death) shows to be meaningless.  If Luke had gone in person\\, maybe he would have died.  Instead\\, he projects a hologram in his place\\, and he dies anyway.  Is this \\\"refreshing\\\" storytelling?  A good movie conjures joy or sorrow or both.  The Last Jedi conjures nothing but disbelief and disappointment.","true":true}