{"101487":169471,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"(spoilers)\\nLooks great and that is about it. crappy random storyline and only gives use more questions. that the next movie has to explain somehow to please the audience. Or they are just as stupid as with the last jedi and create another thousand questions. The problem with this movie is that its called starwars. remove it and its oke.\\n\\nThe huge middle finger to the 'old fans ' the crappy plots and killing snoke off in the most stupid death ever so kylo becomes the supreme commander\\, a little boy that doesnt even know why he killed his father. Luke being portrait as a person that has given up to life itself (and almost murdered a pupil because he was scared). This is the same person that faced darth vader and palpatine without fear. Poe dameron destroying all turrets from a stardestroyer with 1 x-wing. because the turrets are to slow?? they are fucking lasers?. Leia going superman for a few seconds. somany little pranks....resistance bombers have zero armor and almost zero speed (who made those ships?) Also the weapon trade dealers seem to be villains now in the movie. And i have many more things but i just cant remember it because the storyline was just so boring to watch. oh yeah luke dies a pointless death to give the resistance a group of like 20 people a little spark of hope.\\n\\nI couldnt help but see some symbolic stuff in this movie. like Luke milking the cow. remembers me that this movie is indeed only made to make cash. Also on the last planet the whole planet is covered with salt. maybe just enough salt for all the wounds it made to all the older fans.","true":true}