{"101487":139588,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw the movie and was disappointed. This is Star Wars\\, it is supposed to be of a higher quality film then the average film. It's supposed to be more than just a movie. This movie just didn't do it for me. \\n\\nI had a very hard time trying to understand the main story. There were many things completely abandoned from the last movie such as Snoke and Kylo Ren's mask.\\n\\nI didn't like at all how Luke Skywalker acted when Rey came to meet him and Luke out of all people was going to kill one of his own students Kylo when Kylo was asleep one night? Really Luke Skywalker... a murderer? Surely killing your own students is not the Jedi way. \\n\\nThe joke comedy act with the prank call at the very start of the movie really upset me because it felt like the movie wasn't taking itself seriously. Yeah\\, try joking around with a hardcore drug dealer like that and see what happens. \\n\\nAt the very end of the film Luke \\\"dies\\\" after he is done meditating by vanishing into thin air. In my opinion\\, this was stupid. \\n\\nThere was also many unlikely events in the whole movie which made me think that the movie was just stupid. For example\\, the forced love story between Finn and Rose. The fact that both of them were arrested just for parking in the wrong place in the casino area. The fact that Rose saves Finn's life by crashing into him at the last second. And the fact that none of the ATAT's shot and killed both Finn and Rose while they were sitting ducks kissing each other in the middle of a freaking battle. \\n\\nOverall I was very disappointed.","true":true}