{"101487":145792,"Last Jedi":"Last Jedi","2017-12-15":"2019-03-09","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I’ve been a huge Star Wars fan my entire life. I love the original trilogy. I think the prequel trilogy films are mostly bad\\, but I’ve come to accept them for what they are and enjoy watching them with my kids. I like the Clone Wars cartoons and video games like Knights of the Old Republic (Still one of my favorite Star Wars stories in any medium). Despite a few complaints (ANOTHER Death Star?!) I thought The Force Awakens was good and was excited to see where they took the series and characters from there. Which bring us to The Last Jedi. Where The Force Awakens played it safe (almost TOO safe) with the Star Wars formula\\, this is a film that is all about subverting our expectations and giving us something new. This\\, in my opinion\\, is the main reason the film is so divisive. The things that we expect to see in a Star Wars film don’t always happen. The hot-shot pilot goes against his orders and...it...doesn’t work out? All of the heroes don’t turn out to be secretly related (heroism\/power isn’t genetic?!)\\, Luke isn’t a confident badass who has all the answers?! Honestly\\, I can understand why some fans may have been disappointed. You can definitely make the case that this is not a great “Star Wars movie” depending on what that means to you. However\\, I don’t think there is a convincing argument out there that this is an objectively bad movie on its own merits. Personally\\, I love the film and I would rank it as my second favorite in the series behind Empire. I do want to make one more point here for the people who are confused by how divisive this film appears to be\\, based on the user reviews. While many people don’t like the movie for valid reasons like I mentioned above\\, there are also a lot of people online giving this film negative reviews for pushing a “SJW Agenda”. The only “agenda” i can see is that the movie has women and people of color in it. The plot doesn’t revolve around this or treat any race\/sex as better or different from the others. In fact most of the roles could be recast with someone of a different race or gender and I don’t think it would change the script at all. If people find that upsetting or threatening\\, I think that is more indicative of a problem with their own views than the film’s. The fact that some of these people feel passionately enough about this to dedicate the amount of time that they do and create multiple accounts to “review bomb” this movie just blows my mind. I guess what I’m trying to say is\\, don’t put too much stock into reviews\\, including this one! Ultimately\\, as always\\, you should watch the movie yourself and form your own opinion. ","true":true}