{"101487":174439,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The first part of this does not contain any spoilers. I just want to start out by giving a general idea of how I liked the film for people who haven't seen it and then later get into stuff for people who have seen TLJ. \\n\tI thought this movie was overall fantastic. I would have to get it 4.5\/5 stars. After spending some time thinking about it I have to say that this is better than Rogue One and TFA. Many people are saying it is the best SW movie since TESB and I would have to agree. If I believe it is actually better than TESB I'm not so sure. I would have to watch this movie a few more times to decide on that. With all this being said\\, like all films\\, this was not perfect. There were some things that I did not like about the film that I will be getting into on the spoiler filled part of this review. Basically\\, all those things were very small though and did not hurt how great the movie was much at all. The rest of this review will contain many spoilers.\\nWARNING: SPOILERS AHEAD.\\n\tBefore I get deeper into my opinion of TLJ I want to give everyone reading this a little background on myself. I am currently 19 years old. I became a huge fan of SW when the prequels were coming out. I believe the first film I ever really watched was ROTS. So\\, I was only like 7 or 8 at the time I first became a SW fan. I have since seen all the movies countless number of times\\, have watched the Clone Wars TV show\\, and am currently catching up on the Rebels TV show. I plan on getting into reading the canon books and comics soon. I believe it is just important that everyone knows that I\\, in fact was not around when the original trilogy came out. It seems to me that older generation SW fans hate TLJ while all the younger SW fans love it. I am not saying this is true in all cases\\, but it appears to be a common trend. As a younger SW fan\\, I do love TLJ. \\nIt seems to me that most older SW fans hate TLJ simply because \\\"it doesn't feel like a Star Wars movie\\\". Many complain about Luke's death being stupid and Rey's parents being nobody significant as being dumb as well. Other people complain about Snoke being killed off so quickly. People complain about how the plot doesn't make sense\\, with most of the film being all about this slow speed chase that could have went a million other different ways. A lot of people are throwing a ton of hate at the humor as well. So\\, basically what I am getting out of all these complaints is that everyone is mad\\, for the most part\\, because their theories weren't right. In my opinion that is all an absolutely ridiculous reason for not liking this film. \\nI will admit\\, I did think some of the humor thrown into the movie wasn't the best\\, but everyone has a different sense of humor. One thing that bothered me a lot was Leia floating back to their ship after being blown into space\\, thought to be dead. The idea of her using the force to get back to ship was really cool in my opinion. The way she floated back over to the ship like Superman\\, well it was just kind of... awkward. I feel like if she could have gotten back to the ship in a way that didn't look like she was floating back would have been better. Something that bothered me at first was Yoda as a force ghost. It seemed weird to me that he appeared in CGI but looked like the puppet from the original trilogy\\, but the more I thought about it I realized that it only made sense for it to be like that and for him to act the way he did from the original trilogy. It just wouldn't make a lot of since for him to act and look like Yoda from the prequel trilogy. \\nBack to a lot of the main reasons why people don't like TLJ and why I think they are bad reasons to hate the film. \\nFirst thing\\, Luke's death. Alright Luke being a force ghost or whatever before he actually died was AWESOME. A lot of people think it was dumb and that he should have just came to Crait. People argue that he should have had a much cooler\/epic death. I think it is nice that he was able to get a good\\, peaceful death on the planet he had been on for years. It just makes it even better that before his death he is able to help bring more light to the galaxy one last time. \\nNext\\, Rey's parents. There are a lot of angry fans out there because Rey's parents have absolutely no significance in the SW universe whatsoever. Everyone had fan theories that she was the granddaughter of Sidious or Kenobi\\, or was a Skywalker herself. I'll be honest\\, I thought she was going to belong to one of those families as well. Now people are fuming because none of the fan theories turned out to be right. I personally think it's cool that her parents ended up being some people that just gave her away for alcohol or whatever. This just shows that you or your family don't have to be anyone special for you to be a hero. For me\\, that just makes Rey's story even better. \\nSnoke's death. Alright\\, this is not the first time SW has killed off an awesome villain so quick. The same thing happened in TPM with Darth Maul. I know he comes back in TV shows and everything but that is later. I can understand being kind of upset about this because this just makes him \\\"another wasted villain\\\" like Maul was. You must admit though\\, that whole scene was sweet. And the fact that Kylo kills him makes it SO much cooler. So\\, I mean I'm not really upset that he died so quickly just because of how it happened an everything afterwards in that scene being so epic. I do wish we would have gotten more background on who exactly he was\\, but I am sure the fans will eventually get that in a book or a comic\\, or something like that eventually. \\nThe plot. I can understand why people thought that the plot overall was bad. It seems kind of odd that there is this day long\\, slow speed chase. Rian Johnson makes it work though. He makes it make sense anyway. They have some TIEs come in\\, included Kylo. They eventually have to back out though. Then they try to shoot at it with their cannons\\, but the Resistance ships are just out of range. The First Order knows that the Resistance ships are going to run out of gas soon. So why waste resources trying to use TIE fighters that might get blown to bits and continually trying to shoot at their ships when they can just wait for them to run out of gas and blow them to bits when they are virtually defenseless. I have seen some complain as to why the Resistance waited so long to escape undetected. The answer to this is simply\\, they needed to find a planet to hide. Another big part of the plot that people complained was pointless was pretty much everything that Finn and Rose did. To many it seemed like a big waste of time because their plan ended up not working. This part of the film seemed to deal a lot with developing Finn\\, and especially Rose's characters. I will admit\\, the Rose and Finn kiss just seemed out of place to me. \\nWith all this being said I hope this might change some opinions on TLJ. As I said\\, I know this movie was in no way perfect\\, but it is much better than many fans are giving it credit for. I mean TESB was the lowest grossing film of every SW movie\\, and it apparently did not have great reviews when it first came out\\, but now it is widely viewed as the best movie of the SW franchise. Perhaps the same will happen with TLJ. For myself personally\\, I have this ranked second right behind TESB. I would not be surprised that after watching it a few more times it might become my favorite. \\nI'll leave on this final note. To the Star Wars fans out there that are constantly throwing hate at the recent movies\\, I wish you would not do this. It doesn't make sense to be a fan if you are constantly bashing the direction the movies are going in. I know it is hard at times\\, but it is important for the SW fanbase to trust what Disney does with the Star Wars franchise. In my opinion they have been doing a great job with it so far and continue to improve with each movie. I cannot wait to see what the future holds with SW. I only see it becoming better and better. Just because the movies are not like what they are in the original trilogy does not mean you should just hate them. Everyone should be more accepting with what Disney is doing with the franchise in my opinion. Just because they are doing some things differently does not make it bad and it is certainly not \\\"ruining your childhood\\\" like I have seen many people say. Things had to head in a different direction with the films eventually to keep things interesting\\, and Disney along with Rian Johnson did a fantastic job of it. Once again\\, I hope all the fans that are quick to throwing hate towards TLJ become a little more open to the film. It was a wonderful addition to the saga and I know that the movies are just going to get better. I hope whoever reads this review likes what I had to say. If not\\, I am open to hearing what you might have to say. May the force be with you all.","true":true}