{"101487":183789,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie doesn't just have plot holes.  The entire movie IS a plot hole.  As a Star Wars fan since I was maybe 3 years old it just makes me sick what they have done with this series. \\nThe problems really started with The Force Awakens\\, but while that movie had issues\\, this sequel takes a nose dive right into the ground.  \\nThe four young main characters of the film are Rey\\, Poe\\, Finn\\, and Kylo Ren.  Each of these characters is effectively ruined by the end of the film.  \\nRey\\, as the Force-user of this series\\, doesn't really need any training.  In The Force Awakens she picks up a lightsaber for the first time and defeats Kylo Ren with it.  This would be like Luke defeating Darth Vader in A New Hope.  But anyway\\, we are told throughout The Force Awakens that Rey needs to find Luke who is missing.  Why?  To get trained\\, we assume.  The entire first movie is a buildup to the cliffhanger scene at the end where Rey meets Luke\\, and then the film rolls to credits.  Yet in The Last Jedi\\, Luke doesn't train Rey at all.  She accomplishes nothing while she is on the island with Luke\\, except for the fact that she is able to connect with Kylo Ren through the Force\\, which is one of several Force-powers that we\\, as an audience\\, have never seen before.  \\nPoe is emasculated in this film.  He's supposed to be the Han Solo of this series but he is told he is making bad decisions time and time again by the female leaders of the resistance.  \\nFinn might as well not have even been in the movie.  He is treated right off the bat like a joke.  After trying to heroically save Rey and nearly being cut in half at the end of The Force Awakens\\, we see him walking around half naked in a water balloon.  Because why?  I guess it was supposed to be funny.  He then spends the rest of the movie running around with this new character Rose on a fool's errand\\, trying to find some device that will do something to help the Resistance ships escape the First Order because the First Order has some tracking device that blah blah blah blah.  Its all a big plot device that doesn't make much sense and doesn't matter anyway by the end of the movie.  \\nFinn and Rose also spend time on a Casino planet saving a bunch of anime-horses from being abused while at the same time leaving a bunch of children in slavery.  They could have saved the kids from slavery and left the horses but instead they went with saving the horses.  \\nNear the end of the movie\\, Finn has a chance to save the Resistance by destroying this big cannon that the First Order is going to use against the Resistance.  He attempts a suicide run but is stopped suddenly by Rose.  Because why?  I have no idea.  Her stopping his suicide run made no sense.  Now the First Order is just going to kill them all\\, right?  As far as she knows anyway.  Also they're having this little love scene right in front of the First Order.  Why the First Order didn't kill both Finn and Rose right there I have no idea.  \\nKylo Ren\\, and really the entire First Order for that matter\\, are no longer threatening villains.  Kylo was defeated by Rey (who had no training) in the first movie\\, so why should we as an audience feel threatened by him?  \\nSame goes for General Hux.  In this opening scene of the movie\\, instead of having an impressive battle sequence\\, the director of this film opts to have a joke scene where Poe calls Hux and plays some kind of phone game with him\\, and Hux falls for it.  This is supposed to be funny but its not.  What it does is basically render Hux a non-entity.  We no longer care about him or are threatened by him after this.  \\nCaptain Phasma?  Another wasted character.  She shows up for 30 seconds and dies.  \\nThey bring Admiral Ackbar in just to kill him off screen. If Admiral Ackbar had been the one to do the suicide run with the Resistance ship instead of Admiral Holdo\\, it would have mattered.  We care about Ackbar.  We don't care about Holdo.  But they killed Ackbar off screen.  \\nThe entire sequence with the First Order chasing the resistence fleet makes no sense.  Why doesn't the First Order just hyperspace jump in front of the resistance fleet?  Why don't they send starfighters to kill the Resistence fleet?  Why does the Resistence just send everyone out on transports like Finn and Rose did?  None of it makes any sense.  \\nNot sure why Leia was in this movie either.  We see her using the Force for the first time to save herself from space.  Here's two problems with that scene.  One: she uses the Force to get back to the ship\\, but how does she get into the ship through the door without killing everyone inside it?  Two: if Leia was so powerful with the Force\\, why doesn't SHE train Rey? Why does Rey have to go find Luke if she's already got a powerful Force-user right there who can train her?  Not that Rey gets trained by Luke at all anyway. \\nThe saddest part of this whole movie is Luke.  Luke is the hero of Star Wars.  Luke risks everything in Return of the Jedi on the belief that he can save his father\\, Darth Vader\\, the second most evil guy in the universe\\, from the dark side\\, and he succeeds.  Why would this hero then turn around and try to murder his own sister's son in his sleep just because he sensed a little dark side in him? Luke would never do that.  Never.  He also would not hide on an island while that same nephew murders Han Solo and blows up a planet with the Starkiller death star thing.  The Luke of this movie is basically a coward.  \\nWhat this movie has accomplished is that it has essentially rendered the sequel trilogy null and void.  There is no reason to continue with Episode 9.  None of these characters matter anymore.","true":true}