{"101487":142027,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I trusted the critic reviews so i was really excited to see the movie when it on release here in the Philippines  and on that day as soon as my little brother came home from school  we rush to the theaters with our expectations high and saw it slowly sink to utter disappointment when the first  Marvel jokes started showing up every time taking away any seriousness for the plot.We were packed with a sizeable crowd  of children and their parents too that afternoon and none of them were laughing just goes to show out of place their humor was.Secondly  the flat characters like Rey having no struggle at all to use her powers that made any or coming Jedi Teachings pointlessly  ridiculous \\,Poe the only \\\"new\\\" character my little kid brother care about do stupid things all over the place made him one of his pissed off to together with the rest of the cast Before that he was really excited to buy last Jedi toys because of the hype now he`d rather have trash jar jar binks toy than any last Jedi toys whatsoever\\,Finn and Rose is utterly useless and a waste of plot and time just like all the rest and Luke who started just as a simple farmer boy to a galactic hero become like this is saddening too see  because at the end of it all they want his legacy to die to make way for their own version of Star Wars they think is the better one and lastly The surprising twists the critics praise over is a betrayal of anything that stand for what made Star Wars special that is our last straw and to our eyes Disney Star Wars is an abominable non-canon of the True Star Wars.","true":true}