{"101487":145931,"Last Jedi":"Last Jedi","2017-12-15":"2019-07-11","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never been as frustrated and disappointed watching a movie as I was seeing this in theaters. I wanted to love this movie. I really really did. But so much of the writing and dialogue and \\\"subversion\\\" is just soooo stupid. I threw my hands up multiple times during my screening like \\\"WHY?\\\" The characters constantly forget their motivations and the whole Canto Blight sequence felt completely out of place. Like Finn and Rose forgot they were on a countdown to save their friends. Rose is a problem. Her character is an idiot but it seems like the film wants us to side with her. Same with the Colonel Huldo character. The movie throws away Luke\\, throws away Ackbar\\, throws away Phasma\\, throws away Snoke. Luke throws the lightsaber\\, after supposedly laying clues all last movie for them to come find him\\, turns out he has no interest in anything anymore and doesn't even care about doing the right thing. (who the hell is this new Luke guy\\, anyway?) Leia is apparently a force user\\, is immune to the vacuum of space\\, and can unconsciously save herself from an atmospheric blowout. Rose stops Finn from sacrificing himself to save everyone left\\, for NO REASON. Instead she's fine to let them die\\, and her line afterwards is so so so dumb. And letting Luke just DIE??? SERIOUSLY??? I was pissed. Yes I'm critical. I'm critical because I'm INVESTED. I LOVE Star Wars. This just wasn't it. It wasn't Star Wars. It looked like it\\, had characters from it\\, sometimes felt like it  a little bit. But it wasn't it. It's obvious Rian Johnson and whoever put him in a position of power did not have the same care for the Source Material. (PS i love having women and people of different ethnicity on the show\\, as long as they remember there is no Earth in this show. These are all supposed to be aliens\\, so give them some alien backstory\\, make them interesting! Don't think just because they are people who haven't been featured in Star Wars as prominently until now that that in itself is enough! Better Writing Please. Thank you.)","true":true}