{"101487":162064,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Phenomenal. Correct. Brilliant.\\n\\nLoved how Luke grew into a Yoda\/Kenobi hybrid hermit. Loved the turns and twists that kept me from expecting the expected. So many movies today are straight\\, boring lines that telegraph their turns in the first scene. Yes we expect happy endings or at least some good triumphing\\, however the path to those guaranteed endings are often so clear that a 1st generation self driving car couldn't crash into on them.  \\n\\nAnd humor. Oh god can we please have more humor in movies. So many films are dull\\, lifeless and one note with no rise and fall or tension that the only thing surprising in them is that the soda you're drinking in the theatre costs $7 and the only time your adrenal gland pumps is when you find out that the soda is the cheapest thing at the concession stand. \\n\\nIt is literally impossible to fulfill audience expectations for a 30+ year old science fiction\/fantasy franchise. \\n\\nThose wanting Luke to be an out of the box heroic hero forget how reticent both Kenobi and Yoda were. Without that hesitancy there would actually be  no arch. No tension. No obstacles.  No story.\\n\\nAnd a torch had to be passed or perhaps tossed over ones shoulder. The second (spoiler) Luke tossed the sabre I was game.\\n\\nWhat people are really noticing is that they wish\\, at some level\\, that instead of the prequels\\, George could have given us sequels to fill in the gap and let us see what happened to Han\\, Leia and Luke while the actors were young enough to tell us those stories. But time passed and we are here where we are. The biggest obstacle the franchise has is that there is so much secondary material in the games and cartoons that was filling the void left by never making those sequels that there are gaps in the story telling that started long before Rain shot a frame. \\n\\nMy faith has been restored. I look forward to seeing what Rian does next and how Abrams will finish the trilogy. \\n\\nMay the force be with you all.","true":true}