{"101487":127128,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Hasn't Disney been paying attention to what has happened in the comic book industry for the last few years? Pushing the SJW\/Feminist agenda in Marvel comics has failed spectacularly. Pushing this in Star Wars will also fail. The reason? The typical SJW\/Feminist are not interested in the superhero genre. They are not willing to spend their time or money on these products. Their only concern is in hijacking platforms to spread their message at the expense of everything else. Weak-minded docile male feminists are willing to go along with this in the hopes of increasing their sexual market value.\\nThe destruction and humiliation of Luke Skywalker is a goal of the SJW\/feminist agenda. The male power fantasy. Anything male and competent is bad. Men need to be humiliated and put in their place by \\\"strong independent purple haired women\\\" (but if these women need a tire changed or a jar opened then they know who to call) Women are sugar and spice and everything nice.\\nRey's character is ridiculous (Ridley does a great job with what she was given though). If Rey is to be a role model for young girls and women I think the message is terrible. \\\"No work or effort is required for you to be competent. You can be awesome simply because you're female!\\\". Real life doesn't work that way. It takes hard work and effort to master skills no matter who you are. Rey masters the force because... girl power?\\nThe subplots are meaningless in this movie. They go nowhere and add nothing to the story. Token diverse characters rammed in because diversity is good for it's own sake. A waste of time.","true":true}