{"101487":180847,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film dives into so many different sub plots which all combine to the main plot which is weak with the sub plots being 2\/3 being good. The finn rose sub plot is undeveloped and is meant to be the saving grace of the resistance but fails to develope the character that saves them all abandoning the previous \\\"greatest code breaker\\\" for a guy that \\\"was close to the code creator\\\". The destruction of the first order fleet is quite stupid as all ships are wiped out by one ship that jumps to hyperspace into the capitol ship then zig zagging through the rest of the fleet.  The first order fleet itself is dumb as it places the capitol ship at the front leaving it to fend for itself and making it easier to kill. The film does this twice making it easy for the resistance to kill the fleet or make it retreat. The film does not make the odds look tiny it makes them look like 50\/50 in every fight I'm the film. The force ghosts  making impacts to the physical realm and like being a force vision but not looking like a force ghost or vision as everyone can see him is also a weak lore breaking point which really peaked my disinterest with the film. Overall o had the film was quiet bad but the humour in the film and character development of major characters was quite good. Rose and luke abandoning things the hold dearest like their beliefs and possession was a bad thing. The film was not mind numbing but it was quite bad handling lore of star wars. This would have been a great film if it were not in star wars but it was star wars and it brings itself down because of it.","true":true}