{"101487":147319,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I went into TLJ thinking it was going to be a continuation of TFA and everything Star Wars could be. I came out confused\\, angry\\, and wanting to “let Star Wars die”. I signed into Rotten Tomatoes just to leave the review that every true Star Wars fan should write. We need to combat the paid reviewers that are on Disney’s payroll or anyone that are afraid of the mouse smearing their name. Spoiler Alert!!!! I’ll start with the positives (there are about 2) - amazing visuals. We get to see Luke Skywalker in a Star Wars film again! And he talks! But wait nothing he says is worth hearing. that’s all folks... Now for the negatives (hint - there are a lot) I think I should start with how Disney has thrown out the established Star Wars mythos and made Rey way more powerful then even Yoda or Palpatine. She is able to lift 50+ boulders with complete ease while Yoda in Ep 2 had to concentrate and let Dooku escape while he struggled to hold a big metal pipe from crushing Anakin and Obi-Wan. Yoda had at least 800 years of training and was the most powerful Jedi living. She exhibits the same strength in the force as Palpatine when he’s throwing Senate hovering booths all over the place at Yoda in Ep 3. Sorry but no... this isn’t Star Wars. Kylo almost kills Leia and everyone on the bridge but doesn’t pull the trigger so the Tie fighters do it anyway. This would affect someone but not Kylo. If it does we don’t know and we should know. His mother is dead and it’s the first orders fault. Ok let’s just continue on... Leia is blown out to space. That’s how we think Leia dies because RIP Carrie Fisher. Nope she Superman’s back to the ship. She does something that no Jedi has done before. Let alone a person with zero training and who has dedicated her life to politics and has never used the force physically. And survives the movie... not sure what’s gonna happen there since ya know Carries dead.... Snoke was setup to be a powerful villain with a good back-story. Showed amazing force power but then dies like a little punk and now every Snoke theory ever doesn’t matter. Kylo is now the baddy. Great. Rian Johnson literally tells us that we need to let the past die. Let everything that we’ve come to love about Star Wars die. Sorry but the reason why you’re selling is because of what’s come before. You can’t just kill it and expect people to keep coming. There is apparently now gravity in space. General Holdo doesn’t tell anyone - including Poe the plan to survive the First Orders attack and therefor leads Poe to start a mutiny. Holdo and Leia laugh and say how much they love Poe for being such a rebel. Ok. Sure. Luke Skywalker people! Our hero from our childhood. The guy that saves the galaxy and goes on to be the most powerful Jedi ever. He’s now a jaded old man who literally sucks the tit of a creature and gurgles blue milk. If that’s not enough he admits to almost killing his own nephew in cold blood because he sees a potential dark future. Wait. We learned in ESB that the future is hard to see - always in motion the future is... all this did was taint the character of Luke Skywalker. Luke comes to save the day. But not really. He just shows up as a force projection while he’s still on his lonely island. He distracts the first order and Kylo long enough for the Resistance to escape. Then he dies anyway - because he’s exhausted his power? He transcends into the force. Wow. Thanks Disney for that. Years of waiting to see our hero from childhood save the day and he kind of doesn’t. Then he just dies. I could go on and on. I was left with a feeling of emptiness and hopelessness even though Rian tried to end his film on an inspirational note. It did not inspire. ","true":true}