{"101487":171879,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Terrible. I'm far from a SW fanboy\\, I'm a 36 year old who has casually enjoyed the franchise since the 80's. I didn't care for the prequels\\, but was excited to see the new trilogy and hoped Disney could bring the franchise back to life. I loved TFA\\, I thought it reintroduced some old characters while giving the audience new characters to carry the films forward. There was some great setup and I loved the mysteries that were introduced and looked forward to finding the answers in the final two films.\\n\\nOf course\\, Rian Johnson absolutely dropped the ball. The two big mysteries that were teased in TFA - Who is Snoke? Who is Rey?... well\\, don't expect any answers here. Rey is nobody. Snoke is inconsequential\\, you don't need to know who he is. Huh? What was the point of TFA? \\n\\nMy only hope is J.J can save this mess in the final film. Although any cleaning up of Rian's mess he tries to do will seem choppy - we should have answered these questions in the second part of the trilogy given the overall arc and in the interest of sound story telling. \\n\\nAnd don't get me started on the SJW overtones. Overt feminism\\, liberal political metaphors\\, animal rights.... future generations of fans will look back on this film and laugh no doubt. \\n\\nA true missed opportunity. I've spent the last two years really excited for this movie\\, and now I couldn't care less if Disney just turfs the whole franchise and we never get another episode. Here's hoping that Solo is at least as interesting as Rogue One\\, and doesn't follow in the footsteps of this mess.","true":true}