{"101487":135089,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'll start this with the statement that the best movie I've seen recently is Wonder Woman. Absolutely awesome action movie and female lead! With TLJ\\, I just don't understand why we needed to turn a legendary character (Luke) that we've been waiting 30 years to see again into a sketchy paranoid old man who no longer wants to be a Jedi\\, drinks from a 4-tit walrus\\, and wants to kill his nephew. WHAT?!? Seriously?! That's where this story went? TLJ took up waaay too much liberal politics and white male bashing and turned a beloved long time movie character...and all the other white males in the story... into stupid\\, wreck-less\\, flyboy\\, pathetic men. \\n\\nLook..Gal Godot was amazing in Wonder Women. I like Daisy Ridley as Rey. She's great. Leia is great. I\\, like most people\\, enjoy lots of strong female led movies. I've really liked countless popular movies with so many of our loved female stars. The whole country has. It wasn't a problem for Rey to be the next Jedi. Leia is a great general. Most people weren't even fazed in TFA that the most evil and ruthless military in the galaxy is now captained by a female (Phasma). Fine. We want more strong female roles. Ok. make those movies then. We'll watch. But do we have to swap over every known male hero now? Should I expect to see Tom Cruise as a janitor in the next Mission Impossible? Better yet\\, do we need to make the point in MI8 that he's reckless\\, careless with lives\\, and we shouldn't hero worship him. Rather\\, replace him with a woman who is supported by characters representing each ethnic minority group. Then make all the white males people of low intelligence and pathetic character. Finally to have the female lead just tell everyone at the opera to stay calm and just exit the building? NO! That's not why we are watch the male led movie in the first place!! Why do you think so many people liked Star Wars and it became one of the most powerful and lucrative sagas ever made? Because we didn't like Luke Skywalker and all the patriarchy in it? We did. Men and women alike.\\n\\nIt's so disappointing that politics leaked into a such great saga and just ruined a 30 year wait to see a childhood hero again. As well as seeing politics leak into a movie that you fully expect falls into the action hero genre. You're going to this movie to escape from real life and expecting ridiculous hero things to happen. Just like Wonder Woman charging onto the battle field all by herself. We all so wanted to see Luke unleashed. So all the critics applauding the underlying social justice messages like you're so smart and that you looked so deep into these powerful storylines hidden in the movie...give me a break. You're just scared to stay what you really think  so the media doesn't attack you like Matt Damon. You're telling me that's what you wanted to see out of Luke? And a space ship in a movie running out of gas with slow escape pods getting picked off was a way better story than another amazing fighter jet scene from Poe? And it's not awkward at all to waste screen time with the SJW warrior casino scene? \\n\\nYeah\\, I'm white. Yeah\\, I'm a man. I grew up in a rural poor community on welfare. Saw a shit ton of drugs and crazy things already by elementary school. I've worked out of that and insanely hard for everything I have. I'm so tired of the white male bashing from the left. I look forward to going to the movies to get away from it. I want to see a hero\\, Male or Female. I want to experience some nostalgia.  This time\\, although there were some good scenes and decent action...and although Rey is an exciting character... I really didn't escape with all the intentional and forced 'white males suck' politics being rubbed in my face.","true":true}