{"101487":155820,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Never have I quit a movie before I got halfway through it. I'm the kind of person who tends to stick through even the worst just to see how bad things can get. I'm an avid Star Wars fan I grew up loving Star Wars I've read dozens of Star Wars novels I seen all the movies multiple times I even own Star Wars merchandise that being said this movie what's terrible I don't know if it got better towards the end but the beginning just got me to the point where I had to stop. The humor or attempts at humor were Beyond lame there's a conversation in the opening scene between a pilot of the good guys and a commander from the bad guys that is so out of place in a Star Wars movie that I actually was offended and that's not something that ever happens to me. I stuck through the Force awakens even though some of the humor left something to be desired but this movie is like low-grade Marvel superhero type humor. The writing it's all over the place Integrity of the series it's just thrown out the window for this one and about 45 minutes in do you realize that every person in charge seems to be a woman. I'm all for diversity but it's something that can definitely be overdone and this movie is a prime example of how to take it too far. I'm actually not able to call my cell Star Wars fan anymore and it appears that me and half the people that review this movie all think that this movie should not have been made. I might go see the next installment but it's going to have to be a vast improvement to get me back on board. Ask for the professional reviewers that have made this movie have a 90% fresh rating it just goes to show how out of touch professional reviewers are and I have a feeling that the obvious social equality issues that Weeknd the overall quality we're avoided topics which is understandable in today's everybody offended climate. If you enjoy Stupid humor and are easily app East that I recommend this movie if you are a true Star Wars fan I would Retreat to your novels and act like this movie never existed","true":true}