{"101487":167524,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So after 14 hours of thinking about the movie\\, I have to say that I hate it more now than I did when I left the theater. The one redeeming quality in this trilogy is Kylo and Reys story. All the poetry and feeling of the other trilogies is there and is the only time that this movie feels like actual Star Wars.\\n\\nAdam Driver is absolutely stunning so far in the Trilogy and the comparisons to Ewan Mcgregor are apt. He brings so much passion and emotion to a trilogy sorely lacking in it. Surprisingly\\, Mark Hamill clearly hated what they did to his pride and joy character so much that it turned him into a horrible actor. Nothing\\, and I mean NOTHING that Luke did makes sense in respect to his character at the end of VI. His regression is not only poorly explained but baffling in every manner of the word.\\n\\nAnd that's just the beginning of the inconsistencies. I could literally spend the rest of my day typing them out\\, so I'll just hit the big ones. Why doesn't everyone just kamikaze their cruisers into enemy fleets if it's so effective? Why not just sacrifice one ship to destroy the dreadnought? Why didn't the First Order just kamikaze a single empty ship into the fleeing rebels? Why didn't Holdo have a droid execute the hyperdrive suicide? Here I go typing out inconsistencies all day\\, and this is just the first topic! Needless to say Rian Johnson has no regard for the rules that have been established in this universe over the hundreds of hours of canon. The other huge glaring issue I have with Rian's universe is the Force. Using the Force as an excuse to get the story do whatever you want it to do is just lazy. The scene with Leia \\\"I must go\\, my people need me!\\\" floating back into the ship was just a complete disconnect for me. Yes\\, Jedi are powerful\\, but they can't be allowed to do whatever the they want. It completely takes any sense of credible threat away. Bounty Hunters made a living hunting Jedi?! Really\\, how?! They can survive in the vacuum of space like a water bear! Again\\, this is really only the beginning of The Last Jedi's disconnect from the rules that Lucas had painstakingly laid out for the universe.\\n\\nOnto the story. The first hour or so of the movie was completely ineffectual and could have been omitted. How this amount of filler made it into the movie is just wild to me. The scene with the Casino planet was really the only world building that the movie tried to do\\, and while it was beautiful and breathtaking it was also useless. I suppose that happens when you have to shoehorn an entire movie into 18 hours. Why Rian chose to shoot himself in the foot with that decision is mind boggling. When Poe stopped to take in the view I stopped taking their mission seriously. That whole sequence needed to happen in a more thought out and less time constrained way. World building is vitally important and it should amplify story-telling\\, not hinder it.\\n\\nLike I said earlier\\, any part with Kylo Ren and Rey was awesome\\, sans Luke. The scene with Snoke was incredible\\, and it could have had even more weight if they would have taken the time to explore Snoke as a real threat. Clearly he was a gifted Force wielder\\, but not strong enough to sense Kylo's betrayal? I mean\\, it's kind of what Sith apprentices do\\, you know? Either way\\, the way it happened was badass and the ensuing action scene with Rey and Kylo fighting back to back was one of the coolest in Star Wars. Again\\, both actors were effective and when Rey told Kylo \\\"don't do this\\\" when he asked her to take his hand there was real weight there. If episode 9 can focus on everything that makes Kylo Ren and to a lesser extent Rey great characters it will have redeemed a lot of what I hated about the Last Jedi.\\n\\nAs for the last part of the movie\\, I covered how inconsistent and broken the plot devices were. Luke using a Force Hologram was actually the only new implement of the Force I liked. Yoda being able to effect the real world as a Force Ghost is fairly rule breaking as well. Why isn't Yoda constantly raining hate on Sith if he has this power? He's a Force Ghost\\, not really much else to do to be honest. Why doesn't a Force Ghost show up to finish Rey's training (admittedly this could still happen in 9 and would be great)? Where are the other Force Ghosts? It makes sense that Anakin would show up to be a Father to his son in such a time of turmoil. I can understand wanting to minimize the use of Force Ghosts because they are pretty broken from a power level point of view. The last issue I had with the last part of the movie was Rose's \\\"saving\\\" Finn and the woefully cringy kiss afterwords. if Rose was on a suicide mission to save Finn\\, why not just do the deed herself and ram the canon? She was almost certainly going to at least kill herself by running into Finn at such a high speed (or not\\, this universe doesn't actually have rules) so she might as well have done it for him. The kiss was me coming completely unplugged. Not only was it forced\\, both literally and figuratively\\, but it didn't even make sense. As far as either of them knew\\, they had delayed the inevitable for about thirty seconds and doomed the rebellion completely and gotten dozens killed for no other reason than to do whatever that was.\\n\\nLast thing I'll mention is the characters and world building. Both are almost non-existent\\, and the use of bad jokes to fill the void where real character progression is supposed to be is tragic. Finn and Poe took huge steps back and the inclusion of so many small characters that we'll never care about made it all into a jumbled mess. Throw in the forced 18 hour timeline for no good reason and we have ourselves an actively bad plot structure where somehow Adam Driver found a way to shine. Give that man a raise\\, good god.\\n\\nOverall\\, the Last Jedi is a disappointing movie and a travesty of a Star Wars film. I wish JJ all the luck in the world recovering from this abomination and I hope that somehow someway Rian Johnson doesn't end up getting his own trilogy.","true":true}