{"101487":177190,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie was fairly well put together and did have moments that made me laugh.  Visuals were nice...that said I feel like this movie just took a HUGE dump on my childhood and love of Star Wars.  I can accept where Luke started in the movie and where Luke ended in the movie\\, but everything about Luke in between was a pile of crap.  Rian Johnson literally destroyed Luke's character and made everything Luke was not matter.  How is it that in the Force Awakens Han seemed more capable to bestow advice people would want to listen to than Luke a Jedi Master?  I have no questions about the next movie in this trilogy; they answered all the main questions I had and the ones they didn't answer I don't really care about any longer.  I see online people trying to come up with questions to make the next episode seem interesting\\, but seriously there is no need to make this a trilogy since they could end everything with The Last Jedi.  This movie had so much promise and I tried all I could to love this movie\\, even overlooking the Mary Poppins scene and the needlessly added trip to Canto Bight\\, but then they took a HUGE dump on a beloved character in the Star Wars Franchise (which is what drew me into the franchise in the first place).  There is no way I could call this a good Star Wars movie.  Mark Hamill sums it up best with this statement\\, \\\"\\\"He's Not My Luke Skywalker\\\".  I wish this movie could be eliminated from the Star Wars franchise\\, but it cannot be undone nor removed.","true":true}