{"101487":130182,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-10","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I completely understand the hate this movie has RECEIVED over the last few months\\, but I disagree with some of the hate. I love this movie. it's one of my favorite star wars movies to date. to me I rank this movie right behind the episode V.\\n\\nrian johnson attempted to break the star wars formula that has existed for the last 40 years\\, and personally he succeeded in an amazing way. \\n\\nhe took the one note characters that have become boring over the years and transformed them into these complex humans that could exist and ADMIT their own mistakes. Luke skywalker can't MAINTAIN this INFALLIBLE persona that everyone has known for years. He  needed to become this Luke Skywalker. he points out the faults of the jedi order that the PREQUELS attempted to portray. he knows and understands the problem that the jedi order represents. it says in the movie that the jedi are only an idea. you don't need the name to be a good person. that is something that parents try ot tell their kids for years. you don't need to be apart of an ORGANIZATION to do something important or good. you just need to be good. \\n\\nyes\\, snoke was slightly wasted in the movie. he was killed off earlier than i expected\\,but it helps kylo complete his character arc in an impressive way. it was an HOMAGE to the FANTASTIC vader arc. he survives his predecessor and instead of following in anakin's footsteps he creates his own. he take over the empty void that was left behind. plus\\, if you remember when episode vi originally came out we knew nothing about the EMPEROR and he was killed off that movie. the prequels and  the clone wars FLESHED out sidius's character. without those cannon series we knew nothing about him. \\n\\ni know i didn't touch on all the problems that people have with this movie\\, but i hope i SHED light on a few EXPLANATIONS for the problems that you may have had with the movie. i still love this movie and think that this is one of the best. also\\, i hope that soon you'll be able to enjoy the movie as much as i do.","true":true}