{"101487":116829,"Last Jedi":"Last Jedi","2017-12-15":"2017-05-28","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Does Star Wars: The Last Jedi meet expectations\\, surpass\\, or fall short of them? Find out in my spoiler FREE review of The Last Jedi down below. Star Wars: The Last Jedi is the ninth installment in the Star Wars saga\\, and the eighth episode in the franchise. Continuing what was established in 2015’s The Force Awakens with Rey\\, Finn\\, Poe\\, and Kylo Ren by starting Episode 8 off right where Episode 7 ended. The Last Jedi had a lot to live up to. Not only in bringing Luke Skywalker back into the mix\\, but by taking the franchise in a direction that didn’t feel too familiar. Which was the main complaint with The Force Awakens. Luckily The Last Jedi is unlike anything we’ve seen in this franchise before. For better or worse for most fans that went in with sky high expectations of what Star Wars: The Last Jedi should have done. The Last Jedi instantly subverts the entire franchise and it continues down that path for the entire film. Director Rian Johnson fully taps into the Force by showcasing the true potential of what the Star Wars universe can be. From the thrilling opening sequence that sets the stage for an odyssey-like adventure of Star Wars that we’ve yet to see\\, it’s a psychological tear through the structure of Star Wars mythos and legendary characters. A film that showcases just how powerful the Force can be through stunning imagery and moving performances by the entire cast. Mark Hamill and Carrie Fisher are the standouts here in a near franchise best turn as the Skywalker twins. Carrie’s final bow is an emotionally moving piece that takes Princess\/General Leia Organa to new heights. Hamill’s return to Luke Skywalker is better than you could’ve imagined. Playing a fearful and isolated Luke that contrasts beautifully to the ambitious Luke from the Original Trilogy. Hamill and Fisher work wonders with the younger cast as they fully step into the roles of their characters. Oscar Isaac’s Poe Dameron gets more time to shine as the cocky pilot\\, and newcomer Kelley Marie Tran as Rose Tico is a beautiful find. Some of her lines stick out like a sore thumb\\, but the potential is certainly there. All of these characters get their moments to flex their abilities through the eyes of Rian Johnson. Heading into The Last Jedi the cinematography was already a surefire highlight\\, but it’s better than anticipated. The use of lighting and the capturing of it is tremendous here. It’s not particularly subtle\\, but the light will always shine through when the characters believe all hope has been lost. Johnson’s ability to choose a shot is up there with The Empire Strikes Back as a franchise best in what the director is able to convey. Through the imagery we feel a sense of power radiate off of the screen and ingrained into our eyes for decades to come. You’ll feel Star Wars come alive in ways you have yet to see. Where Johnson’s direction flusters is dialogue and still working out the kinks in direction. The dialogue here doesn’t quite measure up to the Star Wars standard. The seamless banter and discussion of the universe’s inner workings feels less authentic. New characters that join the endless catalogue of characters like DJ (Benicio Del Toro) and Holdo (Laura Dern) are the embodiments of this example. As for Johnson’s direction he has to figure out what matters to the story he’s trying to tell. There are a few scenes that can either be shortened\\, or even extended to really convey his vision properly. The Last Jedi is the longest Star Wars film yet at two and a half hours\\, but that doesn’t mean it’s the best in terms of content. To conclude\\, Star Wars: The Last Jedi is an unexpected welcome to the franchise. It’s a clear subversion of the Star Wars franchise in an almost egregious manner. It takes what you know about Star Wars and adds more to the ever growing story to this galaxy’s history. It’s a film that takes our expectations of what a Star Wars film should be\\, and shows us what it can be. It doesn’t abide by fanmade rules of what has to make it into the final cut of any of the films\\, and it doesn’t have to follow any franchise tropes to showcase it’s familiarity. We’ve already become so associated with the franchise that a step or two away from what we know should be anticipated and that’s what Johnson does. It’s a very bold film that could have easily sunk the franchise with one blind side tackle from an artist that just wanted to make his vision of Star Wars come to life. Johnson understands that for the “blockbuster” to evolve\\, it has to start with Star Wars. It’s a deconstruction of the universe that practically gives The Force Awakens a dirty look for not attempting to be something more. It’s a gateway to a section of the universe that has yet to be grazed. If Star Wars has always been poetic\\, all seven episodes that precede this are typical rhyming schemes\\, and The Last Jedi is a haiku. Star Wars: The Last Jedi gets an 87\/100","true":true}