{"101487":123002,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"God Damn it.  Someone else wrote my feelings down better than I can express them...So I am just pasting his comments from another forum. His name is John Smith and he posted on Slashdotcom.... Anyway\\, here are his thoughts...I agree 100%\\n\\n\\nJohn Smith\\nI left The Force Awakens anticipating what Luke would be like\\, what Rey would learn about her parents and why she was so absurdly powerful for someone with no training\\, how Snoke became so powerful and knowledgeable\\, why Finn changed sides and what the importance of his character is. I got answers to almost nothing and a depiction of Luke that was a disgraceful 35 year disappointment. \\n\\nAt this point 2 films in I find Rey\\, Finn\\, Poe and now Rose to be extremely boring characters with no character arcs. I don't have any reason to care about any of these people because nothing is really changing and they don't seem to have any depth or any serious challenges to overcome. All 4 of them are boring generic characters. Luke\\, Leia\\, Han had unique personalities. The Luke of RotJ was a completely different man than the farmboy in ANH. Han changed from a self-serving nihilist to a guy who actually cared about others and a cause. Leia went from being a prissy bossy headstrong politician to a hardened commander to a warrior on the battlefield. The characters transformed dramatically over their trilogy. \\n\\nIn this new trilogy we got a cast that is not really standing out or internalizing any life altering or character changing events. 5 planets got destroyed\\, freedom is on the verge of annihilation and yet they all seem pretty personally unaffected by the events. This is disgraceful amateurish storytelling. Give these characters emotions of pain\\, despair\\, heart\\, joy\\, discovery\\, genuine chemistry and love. Let them fail hard and feel it. Let the new characters change dramatically. Let the actors act and show some range. I saw several ships of resistance fighters get blown up and there was no genuine sense of dread that we just lost our friends and we're next. Admiral Akbar a military legend dies and everyone just moves on immediately like no big deal. Beyond having zero reverence for Star Wars whomever wrote this trite garbage of a movie has no sense for the gravity of loss of life. \\n\\nIn this trilogy people\\, ships and planets are discarded like soulless toys. Rather than being menacing and scary like their Nazi inspiration\\, the First Order are slapstick with two leaders who lack the respect of their subordinates. This is Disney's depiction of WWII where the Nazi's are a joke so they don't scare kids. This new trilogy isn't bad because it's taking chances it's bad because it is doing nothing worth paying attention to.","true":true}