{"101487":124132,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Gorgeously Filmed Rubbish\\n\\nLast Jedi is a bad film. It is indefensibly bad. You can like a poor movie\\, just don't fool yourself into thinking that it is a good movie. I too like plenty of bad films; for example\\, 1980's Flash Gordon. I am under no delusion that Flash Gordon is a good movie\\, but God help me\\, I absolutely love that film. I can turn my brain off and just enjoy the colorful spectacle before my eyes.\\n\\nStar Wars is not a \\\"turn off your brain\\\" film experience. It has higher themes and values that run through each and every chapter\\, which carry with them a lot of character development and story arcs. Higher brain function is necessary to follow those character journeys and understand the various themes as they develop and grow into something more (good or bad).\\n\\nOn top of that\\, we expect good story telling; that is\\, objectively reasoned plots and circumstances. The Last Jedi has no redeeming qualities on any level as it pertains to being a good film. Yes\\, it was gorgeous. Perhaps the most beautiful visual experience ever seen in film. With one or two exceptions\\, Last Jedi was a stunning optical masterpiece. In addition\\, the sound was mind numbingly awesome. Every hum and clatter\\, every resonance and vibration\\, and even the use of silence\\, was an amazing delight to the ears.\\n\\nUnfortunately this all rings hollow as The Last Jedi collapses under the weight of poor writing and the inability to convey and actual story\\, that is never free of enormous plot hole chasms. Some of this stems from taking everything Force Awakens started and tossing it aside like it never happened. Worse than that\\, Last Jedi makes every single Star Wars movie ever made\\, pointless and useless. At the end of this film\\, we are literally back where it all began; the overwhelming Empire is in control of the galaxy and the fledgling rebel alliance is trying to survive\\, \\\"hoping\\\" to find a way to defeat the evil foe. Episode 9 has the great honor of being the third \\\"New Hope\\\" in the Star Wars saga.\\n\\nI hear some critics and fans call this a bold new direction and the most original Star Wars story ever. How idiotic. This move is a worthless mash up of the Return of The Jedi and the Empire Strikes Back\\, with elements of a New Hope thrown in for good measure. Not to mention that the humor in this was over the top and in your face. At times I was wondering if this was a parody of Star Wars or if I was watching Spaceballs. Other than a little prequels stuff\\, Star Wars humor was always a part of the stories\\, not slap stick silliness or sexual innuendo jokes. Every time Last Jedi had a serious scene - POW - goofy humor and then right back to serious without a breath between. Takes you right out of the experience.\\n\\nLet's get into this\\, starting with the rehash garbage. Stolen From Empire: 1>Attack on Rebel planet. 2>Empire chasing rebels on the Falcon (actually the main plot of Last Jedi). 3>Hopeful Jedi goes to master for training. 4>Cave with dark side presence. 5>Hopeful Jedi leaves without completing training. 6>Rebels visit high roller city for help. 7>Walkers assault hidden rebel fortress. 8>Hyperspace problem that needs to be solved. Stolen From Return of The Jedi: 1>Jedi senses there is still good within Sith. 2>Jedi lets himself be captured. 3>Jedi confronts Sith and Master Sith. 4>Master Sith toys with Jedi to prove how powerful he is. 5>Master Sith dies. 6>Master Sith's big shiny new toy gets destroyed. 7>Master Jedi dies because he's too week to keep going; he's done enough. 8>Master's ghost shows up to give Jedi a pep talk. Stolen From New Hope: 1>Sneak around death star to turn off tractor beam so you can escape. 2>Cool droid fixes X-Wing so hero can take final shot. 3>tracking rebels through hyperspace to find their home base. 4>Luke admires double sunset (because fitting end?)\\n\\nThe main plot of this film is a space chase to make a phone call for help\\, with a side story of training for Rey to become Jedi. Also includes side plot to keep Finn busy because they wouldn't have anything for him to do or a way to get him face to face with Phasma because fans. So let me give a brief layout of the characters:\\n\\nFinn) is a useless fool used for comedic relief. Poe) is a stupid jock that gets 90% of the fleet killed and must be taken down a few notches as a lesson. R2) is a projector - that is literally all he has done for the entirety of these two films. Phasma) Boba Fetted again. Snoke) super over powered DEAD nobody. C-3PO) is a statue. Kylo) same conflicted emo kid. Hux) Cartoon Nazi and the endless butt of jokes. Leia) Meh - unconscious for most of the film. Maz Kanata) is a video game clip. DJ) is intriguing but completely wasted. Rose) uninteresting and completely wasted. Chewbacca) is a doormat until Rey needs lift on Falcon to be dropped off at Snoke's. General Holdo) she is a stupid leader that gets almost everyone else killed that Poe didn't. Yoda) is a joke. Luke) is a dirty old fart dickhead who wanted to kill a student asleep in his bed. Rey) is an unredeemable Mary Sue.\\n\\nI defended Rey when people called her a Mary Sue in previous film. Force Awakens may have followed New Hope themes\\, but did a lot of leg work in setting up interesting new characters with several plot lines and story arcs for those characters to journey along. However\\, a big issue for many people was Rey as a Mary Sue. However\\, Force Awakens provided a number of hints that she could have training in her past and even a relation to powerful Jedi bloodline. \\n\\nRian Johnson says screw that and she is just nobody. Ok\\, fine if she is nobody\\, but you have to address the Force Awakens plots and stories. And this is a big flaw of Johnsons. He totally ignores everything that has ever happened in the previous films and just makes garbage up out of thin air. Rey as nobody is an easy fix. When Rey hands lightsaber to Luke\\, Luke says \\\"Rey... how are you alive? And where did you get this?\\\" Then Rey says \\\"You know who I am.\\\" Luke responds \\\"Of course I know. Your parents brought you to my school\\, to learn control of your power. But I though Ben killed you\\, along with the others.\\\"  The actual dialog can be better written by a pro\\, but boom\\, issue addressed. You address why everyone in Force awakens seems to know who she is but never says anything - Rey was really young when last seen and they aren't entirely certain. You address some of the Mary Sue issues - she has had some training. You solve the \\\"who is Rey\\\" without her being related to anyone - Rey is not a Skywalker\\, not a Kenobi\\, not a Solo\\, just a former student of Luke. Now you also have a much more dynamic training series as she will remember things taught originally that contradict with his current state of mind and teachings.\\n\\nSorry this has become very long\\, so I will just gloss over a little of the endless number of plot issues:\\n Rey Mar Sue is major plot problem. These two films have taken place in about 5-7 days. In that time\\, Rey has received ZERO training but is already a Jedi Master (no\\, Luke did not give her a single lesson). Even powerful prodigies required actual training. This is completely unfixable and destroys the fabric of the series as the main character has no consequences\\, no growth\\, no danger\\, and no reason for anyone to care. She is a demigod among mortal bugs.\\n Never address Han death. Nothing from Luke. He asks \\\"Where is Han\\\" and it literally cuts away to the other character story lines. Never ever touched upon again. Luke never talks to Chewie after that one line. After being ignored by Leia in Force Awakens.... makes no sense. Chewbacca just got F***** over by Rian Johnson and JJ. He never gets sympathy from anybody. Lifelong friend who new Han longer than anyone else and he is just shat on. And Luke also lifelong friend just blows it off. What? I find it hard to believe Rian Johnson and Kathleen Kennedy have ever watched the original Star Wars films.\\n Hyperspace ship assault. Using the rebel cruiser to ram into enemy ships with hyperspace means now every little fighter can just be used to destroy any larger ship. First Order has unlimited supply and rebel resistance has one spacecraft left? Serious issue.\\n Casino planet was useless to the story and the characters. It dwells on rich vs poor. Shows tortured slave kids and cruelty to animals. It also has some of the worst lines. After releasing space horses and wrecking the casino in attempt to escape\\, Finn and Rose realize they are about to be captured. Finn says it was worth it to hurt the (evil rich people). Really? You are about to fail with fate of rebel resistance on the line and it was worth it? But no\\, it gets better. Rose says \\\"No\\\"\\, removes a saddle and sets last space horse free and then says \\\"Now it's worth it.\\\" What? Those space horses will be back in their pens in the morning. The slave kids are still slave cause you didn't want to free them and who do you think is going to be cleaning up your mess. Yes the slave kids\\, being whipped\\, and hurt because they aren't working fast enough. After all of this casino nonsense\\, it ends up meaning absolutely nothing to the story. But we get to see janitor Finn beat badass(?) Phasma in 30 seconds. Is this a video game?\\n Knights of Ren are never addressed. They were brought up in Awakens and had a strong vision scene where they join Kylo in destroying Luke's Jedi School and students. How did they do this when in Last Jedi Luke almost killed Ben\/Kylo in his sleep at that moment? He wasn't Kylo yet; just a young kid who maybe had a dark tendency. Then an hour later he is Kylo with new outfit and team of knights to destroy everything. Doesn't make sense\\, which means the story Rian Johnson told doesn't make sense. Which means Rian Johnson doesn't give a damn about any plot lines or story arcs and is why everything in Jedi is disconnected from Force Awakens and has demolished this trilogy.\\nThe biggest - Where do you go from here? The entire rebel resistance fits on the Falcon while the First Order rules the whole galaxy with endless resources. That's right. The resistance is 12 rebels and the Falcon. No resources\\, no personnel\\, no equipment\\, no funds\\, no vehicles\\, no space craft other than the Falco. Oh wait\\, I forgot\\, you can just drop Demigod Rey onto the board and Instant Win. Yeah Rebels.\\n\\nThere is just too much ridiculous idiocy to put in here. My writing would go on a dozen times longer than it already has if I covered everything. Rian Johnson cannot write and does not understand Star Wars at all. In addition\\, I will have to say that Kathleen Kennedy is just as bad for thinking this garbage was good story telling. Maybe she is why ever Star Wars film has production issues\\, director changes\\, and such. There was nothing new or bold. Just stupid rehashing of previous Star Wars events that make no sense\\, while completely ignoring everything that is Star Wars and never addresses anything from Force Awakens. I might have to start reading this expanded universe everyone is talking about\\, because Disney-Lucisfilm is a disaster.","true":true}