{"101487":127242,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Haters gonna hate. but: No spoilers\\, just that it EXCEEDED even my own high as fuck expectations. I didn't think a Star Wars COULD do that for me. I was like\\, \\\"Kyle\\, don't fall into the trailer trap. Remember\\, The Phantom Menace had a GREAT trailer and generally sucked balls.\\\" or thinking \\\"The trailer probably had the best scenes of the movie in it so\\, be careful.\\\" But with Star Wars I can't help but be an over the top optimist.\\n\\nThe trailer for The Last Jedi was great\\, but it doesn't even sniff the full movie's jock strap. Great scenes were in the trailer\\, but nothing was spoiled by watching it and even BETTER scenes were completely new for me.\\n\\nIt was like the final five minutes of Darth Vader being a badass in Rogue One\\, but a whole movie of goddamned\\, amazing\\, mind blowing stuff.\\n\\nI laughed. I cried. My heart raced. I was shocked! I was relieved. And even though this was a 2 and a half hour movie of ridiculous greatness\\, I was sad to see it end. I cheered when it happened. I NEVER do that in movies. EVER. I don't even clap. I did both! I haven't been so elated since the Beastquake in Seattle. It just built and built and built into such a high crescendo and then sweetly let us drift off into the end with a touching final scene.\\n\\nAll that was left to even think was *mic drop*\\, roll credits.\\n\\nOnly people that hate this are the same Alt-Right cucks who didn't like Rogue One or The Force Awakens because \\\"girls are the lead and they make Nazi's look bad and like me!\\\". Whole audience cheered where I was. Ignore the 57% audience score. The Nazi-Right are morons.","true":true}