{"101487":153369,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Maybe the biggest letdown experiences I've ever had in a theater or even at home.  The film had some positive qualities typical of a Star Wars movie which I want to believe is why it received some good reviews from the critics and some fans.  (Effects\\, sound\\, music etc)\\n  I had high hopes because I thought Looper (from Rian Johnson) was a pretty good movie. As many other reviewers have said the overall premise\\, plot and story are awful which can't save its positive aspects.  The Force Awakens wasn't terrific but was done well as a first installment to a new trilogy. The Last Jedi seems to set out to destroy the foundation from Awakens. Its hard to believe Lucasfilm didn't have a concise story set in stone for Ep7-9 beforehand. Seems like maybe they wrote a few sentences for each Episode. Probably explains why they've fired directors midstream on many of their Star Wars movies. \\nCould go on and on about the terrible story aspects but don't want to give this movie any more time than I have to. The lowlights: \\nExciting movies can't be about slow chases and the threat of running out of gas.  The Rebels should've gone straight to Crait and the First Order tracked them there.  Then there could've been a standoff there with a huge space\/land battle there. \\nThe ENTIRE Luke and Rey story. So much potential if the movie had spanned a few months.  Rey being so force intuitive and Yoda saying she knows everything she needs to know was way out of character for Yoda and the entire prequel trilogy. \\nThe ENTIRE Luke and Kylo backstory.  No way Luke would even consider killing him(anyone) in their sleep.  Kylo was supposed to go train with Snoke. How much better to have parallel stories with light\/dark training scenes going on to give contrast. Gives much more character development for all involved.\\nThe Red Guard fight: The guards weren't force users. Kylo should've been able to easily take them all but he struggled. Instead Rey showed much more fighting skill here. Totally unbelievable. \\nLeia flying in space. Absolutely laughable. Even Spaceballs wouldn't try to pass that off. \\nFinn and Rose story. If going to do a side plot make it about Finn and Poe to build a Han\/Chewie type friendship and to build on Ep7. Just make their story have a purpose. \\nThe movie is a result of no leadership. The actors and crew (minus director) made the best movie they could given what they had to work with. \\nI went in spoiler free so I didn't read what Mark Hammill said about Luke's direction until after. He was 100% right. Maybe Lucasfilm should've listened to him since he's probably the one person who understands the characters of Star Wars AND the FANS more than anyone.  Since he's a professional he wasn't going to cause too much of an uproar over it. They should've listened though. \\nThe movie reminds me of how I felt after seeing Indiana Jones and the Kingdom of the Crystal Skull.  All the effort spent and a great cast (mostly) and that's what they came up with!? The story was awful and a total waste. Even Lucas\/Spielberg can't make a movie good if the story is garbage.  Does not make me look forward to Episode 9 although it can't get much worse. (Let's hope not)","true":true}