{"101487":136470,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm conflicted on this film. On one hand it did a lot of interesting things and had a character focused story--a great step up from the first film in this trilogy (which had a bit too much copy-paste for my liking)! But it also had a long and boring side plot that really had no effect on anything and seemed to exist solely so characters who weren't included in the main plot could still make an appearance. \\n\\nThere are also two new characters: one\\, a very interesting general with purple hair who seemed to have a lot of promise as a character and taught important lessons to our existing cast. The other new character\\, Rosie\\, seemed... out of place somehow? Like either the actor wasn't so great or they didn't give her anything good to work with? Anyway\\, I would have cut her character entirely and focused more on the purple general. Unfortunately\\, the movie seems to have decided the opposite for future installments. =\/\\n\\nThen the other problem with the film is that it had an amazing visual and a touching (and quiet!) moment of sacrifice. This is a problem because the film felt like it was OVER. It was all nicely wrapped up\\, all recent fights ended and a very striking but somewhat hopeful place to roll the credits--and then instead of doing so they start ramping up another standoff. ...what? Now that standoff actually ended up being a bit interesting and having some good moments\\, but it felt like an extension of a movie that had already ended.\\n\\nSo all in all I did enjoy it because it did new and interesting things with the characters and series--but it also dipped its toesies into side plot and prequel territory with some scenes (which were utterly boring). I'd watch the second half again any time for what it did there but I'd probably skip the first half entirely.","true":true}