{"101487":159029,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok. Here goes my first ever review. I am a massive star wars fan\\, being very lucky in watching the original trilogy without knowing too much about star wars. Star Wars is at it's heart a story of hope. \\n\\nI was very nervous when i read of new Star Wars movies in the pipeline but in truth the Force awakens was a very good movie - it manages to have something for old and new fans and successfully bring star wars to a new generation. It was this triumph that made me believe that Star Wars can expand past the classic trilogy. That is until I watched the Last Jedi - my biggest fears were realised.  It is a movie that obviously does not understand star wars or it's characters. \\n\\nMy biggest problem with the last jedi is it's insistence to kill the past (in it's owns words). It is this notion and desire of the movie that really doesn't sit right at all with me\\, let alone a star wars movie which celebrates an amazing past and culture.  The promise of watching Luke Skywalker again after 34 years was a once in a lifetime opportunity and I feel they totally blew it; let's not forget that Luke is the main character of star wars afterall. The Luke in the last jedi does not resemble the character of star wars nor does it pay him homage. The character of this movie completely ignores the character of the original. I walked away feeling that Luke was completely disrespected in almost every way. \\n\\nWhereas the Force awakens pays homage to the old star wars and even successfully passes the torch in a very measured and respectful manner\\, this movie smears the old and does so with with little regard.\\n\\nBut lets not get bogged down with the mishandling of the most important character of Star Wars. The movie itself felt long; something that is never wanted when watching a movie. I know if I had my way I could easily cut out 30mins without affecting the story at all- in fact it would be a better movie for it. The whole casino story arc is boring\\, pointless and frankly disjointed. The resistance's final stand was drawn out. The final scene was cringe worthy - do we really need a over bearing message of humanity?  \\n\\nThe last jedi felt like a movie that was halfway there with some very obvious problems in plot\\, characters and progression. Such a shame to be honest. It can be very easy to rectify the problems if Disney wanted to in editing. Honest if Luke wasn't just moping for the whole movie\\, if Rie actually had proper training (yes she still has had no lessons but still manages to know how to fight?)\\, if the casino scene (and the whole class war struggle crap) was scrapped this could have been a good star wars movie. \\n\\nInstead we get a movie that in my opinion has no business even calling itself star wars - because lets face it\\, it simply doesn't understand star wars. Anyone that watches this will see a version of Luke that is incompatible with Star Wars\\, which is the core of the problem. Sure make Luke embittered\\, make him even regretful but to make him the inhuman\\, cold and lazy character is just plain wrong. \\n\\nWhen I read Mark Hamill's comments about the mistreatment of Luke I was hoping it wasn't too bad\\, but he is 100% correct. I am not sure how Disney could let such a character be disgraced. The director obviously does not understand star wars at all or wanted to make a movie to shock.\\n\\nIt does really upset me to think that these eternal characters  can be so mistreated and misunderstood. I guess Disney just want a new generation of characters to sell\\, not matter at what cost. I just hope J.J. Abrams can fix this mess that he will inherit. Maybe he should just brush aside what the Last Jedi does just like it so carelessly did for the events of the force awakens. But ultimately I just hope that he can make another good Star War movie - It's secret has always been it's simplicity\\, fun and pure naivety. As George said you watch it and feel like a kid again. \\n\\nI may choose to rewatch the last Jedi and hopefully it would be better a 2nd time but I doubt the Luke of the movie would ever be accepted. Honestly I do think this movie should be remade as harsh as that may sound.","true":true}