{"101487":132055,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I finally know what it is like to have your favorite childhood series slaughtered before your eyes\\, and it is a horrible experience.\\n\\nThe Last Jedi is the biggest disgrace to Star Wars so far. Yes\\, even the prequels SOMEHOW manage to be more bearable than this. At least Lucas felt like he was trying but failing. So you may be asking what is wrong with The Last Jedi? Let me give some examples.\\n\\n-The greatest tragedy of all. Luke Skywalker has been murdered\\, literally and figuratively. In The Force Awakens he made the map to him in case the galaxy needed him\\, but states in this movie that he came to the planet to die. Then why did he bother making the map? And when he is told Han Solo\\, his best friend was killed he could not look more uninterested. He also says how the Jedi need to end and gives some vague reasons why. He also revels he was the reason Kylo Ren went to the dark side. Why? He sensed Kylo was conflicted so he went into his tent one night\\, turned on his lightsaber\\, then decided against it. But Kylo woke up\\, seasonably assumed Luke was going to kill him\\, then attacked. This is the same Luke Skywalker who in the original trilogy went to the second Death Star to try and save Darth Vader\\, the second most evil man in the galaxy\\, because he can still sense the good in him. But his nephew is having conflicted feelings? Better kill him.\\n-Kylo Ren remains as dull and un-intimidating as always. Moody\\, pathetic\\, and boring. He can't seem to determine what he wants to do\\, and when he does decide on what to do he usually fails. It's hard to be scared of someone that constantly fucks up and gets overly emotional. I was hoping Rey would give into the Dark Side and cut his head off.\\n-And then there's Rey\\, as much as a Mary Sue as before. Unbelievable skilled in everything with no training. But you may be saying what about her parents? Ah yes\\, the question we have been theorizing for two years\\, many desperately trying to excuse why Rey is not a Mary Sue. And the answer? Her parents were drunks that sold her off. One of the biggest questions posed in Force Awakens is thrown away in a few lines and treated as unimportant. So Rey is undoubtedly a Mary Sue. She never has to struggle or train to become strong. SHE BEATS LUKE SKYWALKER IN A FIGHT FOR HEAVENS SAKE! A man who was trained by two Jedi Masters\\, fought Darth Vader\\, and led a Jedi Academy is bested by a girl who at most a few weeks earlier didn't even believe the force existed. \\n-Snoke is woefully mismanaged. He is set up as possibly the strongestforce user we have seen in Star Wars. He flings around Kylo and Rey like their nothing without even moving. He can communicate with people across the galaxy. But he can't notice a lightsaber rattling next to him which Kylo uses to slice him in half. He is killed like he is nothing and is given no background whatsoever.\\n-Captain Phasma might as well not exist. She does nothing but look cool for about two minutes before she gets killed in a boring fight. \\n-Finn and Rose easily have the worst part in this movie. They spend about half an hour on a casino planet doing absolutely nothing. It was the most bored I have been watching a movie since seeing the last Fast and Furious movie.\\nI could go on but it would just be a long list of how this movie fails at every facet of storytelling it attempts. Just look up a video review to see a more in depth analysis. This is one instance where the Critic score is outrageously wrong\\, and the audience score is right\\,","true":true}