{"101487":106690,"Last Jedi":"Last Jedi","2017-12-15":"2019-10-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A very bad movie compared to the franchise's potential and the resources Rian Johnson had at his disposal.  Many choices in the film seem to deviate from good storytelling\\, and instead seem to originate from a desire to subvert or push a very clumsy message of socioeconomic justice.  As a very liberal person\\, it came off as exploitative.  To put this way\\, I could tell Disney mandated some key issues to be centerpieces of the plot and Rian Johnson had to find a way to shoehorn it in.  Also any good director can tell you to shut out the voices and just tell your story for big blockbusters with lots of hype.\\n\\nRian Johnson had a lot of heavy expectations put on him and a lot of people had a lot to lose if the movie was perceived as bad.  So I understand the pressure he was under and the uniformly positive critic reviews.  But it seems obvious that Rian Johnson just wasn't the right fit for this massive undertaking.  The humor was definitely out of place\\, settings were bland and practically carbon copies of original trilogy planets.  Plot was uninspired\\, seriously a chase based on lack of fuel?  That's your star wars story?  Leia suddenly has force powers and only decided to use them once her own life was in danger?  A ship with a hyper drive is apparently a weapon of mass destruction?  \\n\\nProblem with the Last Jedi is that I am a huge fan of Star Wars and yet have no desire to watch what happens next...","true":true}