{"101487":140869,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I thoroughly enjoyed the Rey and Kylo storyline. I feel that the theme of killing the past was good for series progression and I like how both characters ended up in the film. I think the death of Snoke and unimportant lineage of Rey add some realism to the series. \\n\\nThat being said....\\n\\nRose. I've been trying to determine if I didn't like her because she was poorly written or didn't add value to the story. I decided I don't like her because she's just not a good actress.\\n\\nFinn was a bit wasted. In TFA it's implied he's well trained and in this one they reinforce the whole janitor vibe and send him on some useless story. Imagine the CGI time and money they could have saved. \\n\\nAdmittedly the movie does have a political vibe. It felt like Rian Johnson is preparing to run for office next year. \\n\\nThe slow-motion cat and mouse game was especially boring. It only provided reasons for Poe to be wrong about things. Holdo was a boring and frustrating character \\n\\nI did like Leia's role (with the exception of her trip through space)\\, her theme of passing the baton felt right. \\n\\nI liked Luke but I think we needed to see more of him teaching Rey. We didn't get a chance to see his light come back. He also lacked emotion facing Kylo Ren which was weird. \\n\\nThe jokes. I'd say 30% of them landed. The rest just really killed the mood of serious scenes that would have otherwise been impactful. \\n\\nLast thing. I wanted more phasma. It's ridiculous that Finn defeats phasma again with his comical antics. Rian has a powerful woman already written into the story but decides to make her a joke and write four more. Phasma\\, IMO\\, was the biggest opportunity to show female empowerment and she just gets thrown into a joke-style death.","true":true}