{"101487":124249,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"great acting from lead actors. I saw a lot of potential in what Kylo Ren could be\\, but of course he gets predictably shoved back to the dark side. What about forgetting the past? I will be interested in seeing how his character develops in the next movie. Daisy Ridley as Rey is awesome\\, but again very predictable in how her role in the movie concludes. It would have been awesome to see something where the dark and the light side become a little convoluted\\, and with the Resistance depleted and the First Order without their supreme leader\\, it would have been cool to see how the two would struggle to rebuild their identities. But I'm pretty sure the next movie is the Resistance rebuilding its self (via prepubescent jedi?) while the First Order frantically try to snuff them out and ultimately fail. \\n\\nI felt this movie had two parts: Rey\/Kylo\/Luke story and then the Resistance story. The Rey\/Kylo\/Luke story line was pretty great\\, and I thought it was intriguing. However\\, the whole Resistance story line was completely useless other than to show how depleted and desperate they had become. Basically if Admiral Holdo just told everyone her plan\\, then it would have saved Finn from all of the hassle of disabling the tracking device and saved us from being introduced to Rose (really didn't like her as a character). The Resistance would have never been ratted out\\, and they would have hid out on the base until Rey showed up again to wreck everybody. Also Luke's death? Very anti-climatic. It would have been interested to see how his relationship with Kylo developed in the next movie.\\n\\nIn the end\\, there were some definite positive notes like the acting\\, but the movie left me feeling mostly disappointed. For \\\"the most anticipated movie of the year\\\"\\, I expected it to be better than Ragnarok but it simply wasn't. Kudos to Taika Waititi","true":true}