{"101487":114949,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-10","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Definitely one of the worst star wars films. awful script\\, ignoring most of the ideas that had been developed in the original and prequel trilogies. worst of all this was just a mix up of scenes and story lines from empire and a few from return of the jedi. we start with the rebels evacuating a planet from an attack by the first order - oh thats sounds like a story line from empire!! later rey believes that kylo can be redeemed - just as luke originally thought darth vader could be redeemed in jedi. the scene with snoke in his throne room is also a bad version of the EMPERORS plan in jedi\\, only this time is seems that it was a lucky COINCIDENCE as opposed to the well set up plan of the emprorer to fool the rebels into a false attack. finally we see atats attacking a rebel base - oh yes thats the BEGINNING of empire again. \\n\\nthere is also the strange timeline\\, the rey\/luke story seems to take days but the rebels being chased by the first order seems to be only a day!\\nand the mystery of reys parents - oh thats a bit like empire when we find out that darth vader is actually lukes father. no real need for this story line in force awakens or this one. \\nas others have said this has destroyed the trilogy for me\\, the way the force is now just for anyone to pick up when until now it took years of training to become a jedi\\, now for no good reason it takes a few minutes of wanting to be able to use it to become a jedi!!! \\ntoo much political correctness in this film. \\n\\nit is very sad that the same organisation that brought us the brilliant rogue one - the best star wars film since jedi - could also produce such rubbish.","true":true}