{"101487":169522,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"spoilers*\\nUmmm... \\nOk\\, first thing first. I actually enjoyed this movie somewhat. In a crazy stupid way it tried to be a Star Wars flick and compared to VII it is at least entertaining. \\nHowever\\, films should in some way reflect reality just a touch. For instance\\, Mark Hamil got into a motor accident before filming Empire. So George Lucas had to write in the Hoth monster scene. To explain the scar on his face. \\nSo um... Carie fisher is dead... and Mark Hamil is alive. So why kill Luke and leave Leiah alive? There was a reasonable time for a reshoot\\, edit\\, and cut. Don't kill off the purple haired broad let her take the rains which would made since in the first place. Just seems a bit odd. I mean ok\\, maybe not\\, film is in the can. \\nHowever\\, if they could just turn the ships into light speed missiles\\, why not have done it with the medical frigate or that other ship they evacuated? Also Does Laura Derns character really need to pilot the ship. There are really no means of automation? A droid can't do it? Shit bb8 can drive a mini walker... And if they can just lightspeed kamikaze why couldn't they use this strategy before? Seems really effective. Like it cut the flagship in half!\\nIs there a point to Bencio Del Toro's character? Other than getting del toro another check.  \\nAlso who is this Snoke or snote or soap fool. Like seriously he is a total throw away charecter billed as the big bad. Interesting surprise but sort of made his previous posturing comical. \\nBen\\, excuse men\\, kylo is as whiney as ever but some how improved a bit. I didn't see the romantic angle coming. \\nWith more tweeks and couple better plot choices this could have been really good. \\nAs it stands...\\\"mediocre!!\\\"","true":true}