{"101487":179598,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The world must know the truth. Star Wars: The Last Jedi is absolute garbage. Since critics seem to be unable to grow some balls and admit that this movie is an unredeemable mess\\, it looks like the fans will have to be the ones that are actually in touch with reality. The movie fails on so many fronts.\\n\\nThe first major problem with the movie is its characters: \\n\\nRey: She was a likable heroine in 7. I looked forward to seeing where the plot would take her. In 8 she's simply a flat character. The only change in her from the beginning was that she got a little bit better with the force. She was blandly written\\, and uninteresting. If you had never seen 7\\, you would walk away from 8 thinking Rey had no definable character traits other than she is a good guy.\\n\\nFinn: In 7\\, he was the epitome of a lovable goof ball. He was very funny and due to his good-natured disposition\\, you couldn't help but like him. In 8\\, he was just boring. He had no distinct personality. He was just a pawn to advance the plot. He had absolutely no character arc. His character had no progression\\, he just regressed into a character you did not care about.\\n\\nRose: In case you understandably forgot her name\\, she was the Asian chick. Just another flat and just plainly bad character.\\nBy the way\\, everything that happened with Finn and Rose was so boring. The part where they ride that animal is just like that part with Obi Wan Kenobi in Episode III where he rides this stupid CGI lizard. How cringe worthy it was to see that. You'd think Rian Johnson would strive to make a Star Wars film that was as different from the prequels as possible.  \\n\\nLuke Skywalker: Was given nothing to do. When he's introduced he just tosses the light saber over his shoulder... WHAT?! We've been waiting two years to see what would happen after the ending scene in 7 and it just built up to a throw away gag. Anyways\\, he doesn't do anything on the island really\\, he kind of teaches Rey. Then Rey leaves. Luke talks to Yoda for no reason and then TAH DAH saves the day as a ghost. Then dies\\, which was so predictable\\, but his character was so useless in this movie I didn't feel remotely sad. What I feel sad about is how poorly they treated the character. \\n\\nPoe: The definition of a static character. At the beginning of 7 he's introduced as just a charismatic pilot\\, by the end of 8 he is still just simply a charismatic pilot. How does a character have no growth over the course of two movies? He has absolutely no character depth. It's really depressing that this new cast of characters are so uninteresting. Are you really going to think of Rey\\, Poe\\, and Finn the same way you think of Luke\\, Han\\, and Leia? Of course not!\\n\\nLeia: Doesn't really serve a purpose. The part where she pulls herself from space onto the ship was unintentionally hilarious. And the fact that even happened in the first place was pointless. Leia going into a coma served absolutely no purpose as well. \\n\\nKylo Ren: In 7 he was awesome. He stole every scene he was in. It was clever that they made him a villain who was inexperienced and was on his journey to become a better villain. It was interesting that he was insecure in his abilities. I was very interested to see where the character would go next; but in 8\\, nothing really happens with him. When he killed Snoke\\, I was like \\\"he's turning good\\, well that was kinda predictable.\\\" Then he makes this nonsensical decision to destroy the Resistance and the First Order... but then immediately becomes the leader of the First Order. I suppose he's using this position as a means to achieve his goal\\, but it makes absolutely no sense. Why does he want to destroy both the good and the bad guys? You're guess is as good as mine. \\n\\nSnoke: He was really cool. The two scenes with him were the best. And then they killed him. If Snoke can see everything that Kylo does in the future\\, then why does he not see Kylo trying to kill him. This is especially awkward because he says\\, \\\"I know everything Kylo will do before he does it\\\" right before Kylo cuts him in half. \\n\\nBB-8: He was such a cute\\, charming\\, and expressive droid in 7. That's all gone in 8\\, he has no expressive personality. \\n\\nChewbacca: You barely see him in the movie\\, he was pretty useless. Why would a director or writer underutilize Chewbacca?!\\n\\nC3PO: He's probably the funniest character in the series. Says just a few sentences in 8. \\n\\nR2D2: HE WAS JUST IN ONE SCENE. HE'S ON THE MILLENNIUM FALCON THE WHOLE TIME BUT YOU NEVER SEE HIM. WHAT WERE THEY THINKING?!\\n\\nPorgs: They were cute.\\n\\n\\n\\nThere were a few Positives:\\n\\n\\nThe part where Rey and Kylo fought the guards was cool. \\n\\nWhen Finn fought Phasma it was pretty cool. It should have been a great character moment for Finn\\, but because he was so terribly written there was no reason to care.\\n\\nThe part where the space ship shot through the other space ships looked pretty cool. \\n\\nThere may have been a few other good parts\\, but why would I care any about them when the movie as a whole was so bad and uninteresting.\\n\\n\\n\\n\\nThe second flaw with this movie is the plot. \\n\\nHere is how the plot went:\\n\\nFirst Order tracks down Resistance and try to kill them. Resistance gets away.\\n\\nRey walks around and talks to Luke on the island. \\n\\nFirst Order tracks down Resistance and try to kill them. They do significant damage. \\n\\nFinn must do something about it. \\n\\nFinn and Rose leave.\\n\\nRey walks around and talks to Luke on the island.\\n\\nFinn and Rose do stuff on a planet. Get captured.\\n\\nRey talks to Kylo. Rey trains with Luke.\\n\\nFinn and Rose escaped\\n\\nRey talks to Kylo. Rey trains with Luke.\\n\\nFinn and Rose go to the bad space ship.\\n\\nRey and Kylo talk. Rey and Luke talk. Rey leaves. Luke talks to Yoda. Yoda destroys ancient Jedi text for no reason.\\n\\nRey goes to the bad space ship. Talks to Kylo. Talks to Snoke.\\n\\nFinn and Rose get captured.\\n\\nKylo kills Snoke. Kylo and Rey fight bad guys. Thank goodness! Something is finally happening. \\n\\nRemember when the First Order was attacking the Resistance? Well that's still going on. But the Resistance eventually gets away. \\n\\nKylo is still evil? Rey disappears.\\n\\nResistance didn't get away for too long. First Order attacks yet again. But good ship slams into bad ships. \\n\\nFinn and Rose are saved. They escape. \\n\\nThe First Order finds the Resistance. Attacks them again. \\n\\nLuke saves the day. Luke dies. \\n\\nThe Resistance is reduced to like 14 people.\\n\\n\\nThe plot is so repetitive\\, boring\\, and inconsequential it is pathetic. With the exception of the death of Luke and Snoke\\, you could go from episode 7 to 9 and completely bypass 8. The Last Jedi was a terrible sequel. A good sequel should advance both the characters and the plot\\, which The Last Jedi tremendously failed at both. This is very disappointing\\, especially in light of the successes\\, in my opinion\\, of The Force Awakens. I was interested in this upcoming trilogy created by Rian Johnson; however\\, after the Last Jedi\\, I have very little desire to see it. \\n\\nPS: I think it's worth noting the abundance of cringe worthy social justice moments in this movie. When I'm watching Star Wars and there is a scene where X-Wing Starfighters are swooping into action\\, it is very jarring when you see that most of the pilots are petite women trying as hard as they can to look tough. I know a lot of losers are going to say I'm sexist for saying this\\, but no matter how much of an inclusionary you are\\, you must admit that none of the female soldiers in The Last Jedi look like actual soldiers. The same criticism can go for male actors in Star Wars too. In Episode 4\\, like half of the X-Wing Pilots looked like dorks they casted at the nearest Science Fiction convention. The bottom line is that the casting directors should hire people that fit their part. So\\, if they're still obsessed with lobbing as many female soldiers into a Star Wars movie as possible\\, then they need to cast some sort of butch in the role\\, not a perfectly attractive young lady that would be better casted in Clueless or something. It isn't that big of a deal and were it not present in the movie\\, my opinion of the movie would still remain the same\\, but it is very annoying and needs to stop before it gets out of hand.","true":true}