{"101487":148320,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Just for every one out there to know where I am coming from.  I'm 46\\, grew up with the OT and LIKED the PT.  I watched LTJ without watching any of the spoiler videos and kept away from ANYTHING that would spoil TLJ.  So I watch TLJ and after the first scene with Luke and Rey (Luke receives his father's lightsaber) where Luke takes the Lightsaber and tosses it over his shoulder I thought immediately\\,  \\\"WTF?!?!?!  Luke Would NOT do that without the obvious question.  Where did you find this?\\\"  Then Luke saying\\, \\\"It's time for the Jedi to DIE.\\\"  WITHOUT any story build up was just disappointing.   Then talking Poe and making him out to be a typical male chauvinistic pig was a little much.  \\\"The best pilot in the galaxy\\\" should be brash and should be a bit bold\\, but to then tell him no matter your rank or accomplishments we will keep our most decorated and accomplished pilots in the dark is just absurd.  Then there's the total and utter incompetence that is the First Order.  WTF?!?!?  Are we to believe they are too stupid to Hyperspace jump in front of the resistance and cut them off instead\\n of STUPIDLY following the resistance at speed until they run out of fuel.  ANY commander with an OUNCE of brain power would have figured out that \\\" we have multiple ships... lets jump in front of the resistance and surround them\\, then destroy them. \\\"  HOLY CRAP.\\n  Then Leia...just PLEASE let her die without becoming Superman\/Mary Poppins!  Carrie Fisher would NOT have approved of this.  C'Mon man.  Let her go out with Admiral Ackbar and be a Hero to the last.\\n  SIGH....Luke Skywalker.  I'm SOOOOO tired of people telling me to watch the movie again or to let go of me \\\"fan theories\\\".  Luke Skywalker WOULD NEVER consider MURDER of his own nephew because he sensed the darkside rising in Ben Solo (Kylo Ren).  Rian Johnson must be the LAZIEST writer in history to take a VERY WELL established character and totally miss what the character is about.  IN NO UNIVERSE WOULD LUKE CONSIDERED MURDER!!!!!  I'm sorry Rian Johnson\\, but you are an idiot and not a fan of Star Wars.  Luke Skywalker risked EVERYTHING to turn his father to the light.  Now you want me to believe in a \\\"moment of weakness: Luke choose MURDER instead of anything else to turn Ben away from the dark?  Stop Pissing on us fans and stick to the character already established PLEASE.  You are not edgy\\, your are not nuanced\\, and you most certainly are not a gifted story teller.  What you did was push your feminist\\, SJW\\, BS on a generation of fans who wanted you to simply show Luke as the true hero he always has been.  Please keep your politics OUT OF STAR WARS!!!!   This movie was visually stunning and a mindless for of entertainment\\, it was NOT a STAR WARS film.  cant believe I give it 1 star...but it was visually pleasing.   SIGH...Help me JJ Abrams...Your my only hope.\\\"...of episode 9.","true":true}