{"101487":180844,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This film didn't seem to have time (in its two and a half hours on screen) to tell a coherent story or to provide engaging characters.  Everything was aesthetically pleasing but there was less content here than in the prequel movies.  The plot holes arrived early and often.  The action is delivered with fantastic effects but without plausible reasons for the action it falls flat.\\n\\n  This movie fails on its own but fails doubly in the context of the other star wars films.  This movie seems to focus most of its effort stripping away relevance of the previous films - presumably to clean the slate for new story elements.   This is handled very clumsily and with no evidence there is a worthwhile new story to tell.  \\n\\n  I was not especially impressed with episode 7 and in some ways it seemed like the director of episode 8 was not either as none of the plot hooks set up in 7 were given any reverence in 8. This contributed to the feeling I had that episode 8 was rushing past any story that might be worth telling.  Part of the blame for this probably rests on 7 which really should left us with an attachment to the characters 8 would focus on.\\n\\nI can understand writers and directors wanting to tell new stories using new characters and new back drops but both episodes 7 and 8 spend too much time trying ride the coat tails of the original trilogy to cop that story. These new films seem to want all the name recognition of the old brand without wanting to properly deal with its baggage or the willingness to set it all aside and to invest screen time to establish a new compelling storyline.\\n\\n  I felt Rogue One was a \\\"new\\\" movie that has its own story to tell and fit in with the original movies reasonably well.  In the future I'd like to see more of that kind of treatment and I hope we can forget about 7 and 8.","true":true}