{"101487":183778,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie doesn't even deserve a well written review seeing as the writers of the Last Jedi apparently Just decided to say fuck it. So I'll be short and sweet and Just hit the biggest disappointments. The rest is so tedious its sad. Rey has no heritage whatsoever\\, which is fine but at least give some kind of backstory. It's like they laid he foundation of a great mystery and because the writers knew everyone was expecting something along those lines they just decided tothe opposite way and do nothing with like a ha ha we gotcha moment. Dumb. Smoke gets killed like nothing even though he clearly displays a mastery of the force not yet seen. So there's that whole wealth of knowledge and story gone. Han Solos son doesn't get ny redemption and the reason he turns bad isn't even really delved nto at all. Luke brushes his shoulder off like some douche. Didn't you try to kill that kid? Your nephew . So maybe take his understandable hatred and rage seriously? I'm just spitballing here. They basically took Lukes long sought after wisdom and understanding and shit on it. Then killed him off in the worst derivative way and th entire plot of the movie is a slow machine chase scene in space?! Like what the fuck? There were so many different ways that whole thing could have been destroyed that it's amazing not a single person caught it. Or maybe they did and we're just like oh shit\\, well can't turn back now. The only good parts were the robots\\, yoda spitting knowledge and still making it light and funny\\, which not a single part of the rest of the movies comedic parts accomplished. It's all forced. The best part is the light speed jump through the first order ship. A masterpiece of film. Truly awesome to watch\\, but then again that should have either happened before All those other ships were destroyed\\, or should have never even been a part of the plot to begin with. The Rei and kylo parts were good but they ruined that with what they did with kylos character. Honestly\\, it just felt like they didn't even triy","true":true}