{"101487":167932,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So it feels like there was some kind of burning platform moment during production. Things felt completely rushed and it was like \\\"what do we do?\\\" \\n\\nFeels like hasty decisions were made. I think a \\\"pause\\\" would have been in order. Corporations frequently get themselves into trouble this way - driving towards a deadline and sacrificing quality along the way. I would have been completely fine if Disney\\, for one reason or another said \\\"look\\, we want to get this right and are pushing back the date 6 months\\, 1 year\\, 2 years whatever.\\\" Kathleen has said this before - the need to get it right.\\n\\nThere are things that were good about the movie and things that were not so good. I completely understand that Disney needs to build a bridge to the newer generation. The problem here is that it seems like the younger generation was looked at in a vacuum. We are the parents of the newer generation\\, the ones \\\"building the magic\\\" at home for these movies\\, the ones taking them to the movies\\, the ones buying them presents and memorabilia for these movies. \\n\\nI think this may have been missed. Now we have a situation where many parents have a bitter taste in their mouths and sure we will take the kids to the next one\\, but we are not going to help build the brand anymore. \\n\\nNow Disney may respond \\\"we don't need your help building a brand\\, we are doing just fine thank you.\\\" \\n\\nNot true - brand building taps the deeper and emotionally levels of individuals. Think about it - how many of us still have the hair on the back of our neck stand up when Binary Sunset plays? That was not just the movies - it was everything\\, our parents discussing the movies with us\\, our parents setting up scenes and playing with us\\, playing the music in the background\\, the toys under the tree. \\n\\nThat is what many parents were building with their children through the Force Awakens. We were recreating that magical experience in our households (My daughter would stop what she was doing when Rey's Theme would play in our house). It was organic - not \\\"forced\\\".\\n\\nI am sad for ourselves and our children - as after this many of us will view Star Wars as just another movie. And I am sad for Disney as well; hopefully this was not a future business school case study on how to kill a brand- time will tell.","true":true}