{"101487":130501,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I didn't enjoy the film. I really wanted to and I kept waiting for it to start hitting the mark but one of my first instincts was \\\"less is more\\\" (the casino sequence). I didn't understand why Holdo withheld her plan from Poe and I just assumed I'd missed something. But it turns out everyone else felt the same about that part. In fact\\, where was Holdo in The Force Awakens? We didn't see her earn her leadership. Why didn't Ackbar take over instead? Strange writing. The character of Rose also felt forced\\, pardon the pun. Why do I get the feeling there's a bit of box ticking going on here? A lot of the female characters were off their heads\\, physically attacking characters on the same side as them\\, several times\\, for no good reason. Where's the charm of star wars gone? I was looking forward to seeing Rey being developed and having a few more flaws this time. But she didn't get any proper training and is already practically a Jedi ? I don't buy that. Isn't this basic stuff that they're getting wrong here? Remember what Luke had to go through to get Yoda's approval in The Empire Strikes Back. Daisy Ridley should've been given more to work with\\, I think she's good and has a lot of spirit. But I can't enjoy her character because of the bad writing. It's strange how Lucasfilm began this new trilogy without mapping out the general storyline over three films. I enjoyed The Force Awakens. But where were the Knights of Ren in this one? Did Snoke know Palpatine from the OT? Why was Finn not a bit more self-assured after the events of TFA? The biggest missed opportunity was the character of Luke. I don't mind him being broken or having some sort of crises - but let's have him deal with it in a way that makes sense. Why does he wanna die on the island and not help Leia\\, his sister\\, when the dark side is on the verge of ruling the galaxy again? Isn't that what he's opposed to - the dark side? And by help I mean physically. I enjoyed his showdown with Kylo Ren before he disappeared and became one with the force. He'd want to stick around to help. His character could've been much more compelling. It like they just wanted rid of Luke for no good reason. Plus his character could've really helped strengthen Rey's character throughout the trilogy. The music was one of the few good things about the film\\, Kylo Ren's theme sounded great. But I'm disappointed Lucasfilm \/ Disney don't have the bottle to step up and just make an honest\\, genuine Star Wars film with filmmakers who don't just succumb to what seems to be misguided mainstream trends and attitudes.","true":true}