{"101487":161638,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Painful to watch!  \\n\\nI'm a fan\\, but found myself bored within the first 5 minutes.  How can you introduce us to a \\\"space battle\\\" in the opening scene that would be more fitting to a World War II movie?  Come on!  Bombers...in space...?  We don't really even (hardly) use bombers in our primative wars anymore....you're telling me that a civilization that has mastered interstellar faster than light travel...drops explosives from a spacecraft...with doors on the underside...and the bombs fall out?  In space?  Where there is no gravity?  Oh and the method of releasing the bombs looks like a tv remote from the 1970s?  Ha!  \\n\\nAnd then the slow speed chase!  God forbid they split up the fleet and create a real chase...And they're all running out of fuel?  At the same time?  When have we ever even considered fuel in any of the previous Star Wars movies?\\n\\nSo much could have been edited out.  Rerelease this as a hour and twenty minute movie and it might be watchable.  Cut out Rose\\, the trip to get the hacker\\, the casino\\, the hacker plot & related scenes\\, the slow speed chase\\, the opening dread naught attack\\, Luke and Yoda burning the tree....that would be a good start\\, but actually might not be enough (I once saw a fan edit that reduced all 6 hours of the prequels into a 1.5 hour movie and it still stunk...just saying).\\n\\nAnd then there is the failure of originality!  The last stand is a complete rip off from Empire Strikes Back!  Trenches and tower guns trying to defend a base on a white world from an attack of AT-ATs?  With crappy little ships coming out to meet them?  It was a plot redo and a visual redo...and a poor copy at that!  Complete with Darth Vader (wannabe) bursting through only to discover that everyone escaped on the Millennium Falcon just moments earlier!\\n\\nWhile there are things that I enjoyed in the Last Jedi\\, the failings are on such a grand scale (think Jar Jar and the prequels) that they kept me from enjoying the film as a whole.  Definitely couldn't sit through that again!","true":true}