{"101487":193400,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Was basically garbage with a pointless plot that didn't move the trilogy at all.\\nI'm ok with diversity and making strong female leads.  But\\, not at the expense of having the men being bumbling fools.  \\nPoe is a jock.  Not a leader - just impulsive.  No role model to look up to and be taught.\\nFinn is the class clown.  He also has no one to look up to.  Sadly\\, after all his time in the F.O.\\, he acts like he's 10.\\nKylo - well\\, I'm actually ok with him being immature.  He's the perfect snowflake millennial.\\nLuke - Poor Luke.  Something went wrong and he just went off to die.  Qui-Gon or Obi-Wan needed to talk to him years earlier and tell him to get over it and move on.  At least Yoda showed up and set him straight.\\nNow\\, aside for that (as we know Disney has always been making guys stupid for the past 20 years in all shows they produce)\\, the only other two things that really drove me crazy.\\nCanto Bight - what was the point?  It was as though they knew they wanted to get some more PC\/social justice\/hot topics in the movie so to get the whole animal cruelty in there they created a 30 minute plotless place so they could set it up to let the abused animals go free.\\nI get that Star Trek loves to play on current events\\, but this is Star Wars.  Can we just have one franchise that is just about a fantasy story\\, and not feeling the need to share their 'gospel?'\\nSecond\\, we must all be vegan\\, right?  Cause eating meat \/ Porgs is bad.  That was just stupid.\\nThis is purely my opinion.  Seems that I'm told everyone is allowed to have one\\, but if it's not what the community likes\\, then I'm told I'm wrong.  Funny how that works.","true":true}