{"101487":98502,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Absolutely Terrible. Yes it's that bad. I've seen every Star Wars movie since Empire Strikes Back in the theater and after seeing this on opening day I sat in my seat absolutely STUNNED. My wife asked me \\\"what did you think\\\"? I said \\\"Star Wars is dead\\\"\\, \\\"it's over\\\". Aside from being a bad Star Wars movie it's a bad movie all around in the most general sense. The community who built this franchise up deserves much better than what we are getting.\\nYes is looks good as the people behind the scenes who never get the glory did a great job with the effects but that can't and never has sustained bad writing and story. Disney is selling you a well wrapped stinking pile of *&%$! This movie was a Disney cash grab.\\nThe writing and the overall planning in the direction of this new trilogy is nothing but pure incompetence and laziness. The plot holes are glaring and obvious to the point that they sink the entire movie and any hopes that you have for the next installment. \\nFor example if Luke is hiding on this island waiting to die with all hope lost for the jedi\\, wanting he burn the tree and jedi text etc..\\, than why is Luke in his Jedi robes when Rey shows up at the end of Force Awakens picking up where Last Jedi begins? It makes zero sense and it's absolutely stupid. Fine you want to take it in a different direction than DO IT INTELLIGENTLY. The reason for this is obvious that this is not what JJ Abrams had in mind. When Ruin Johnson took the reins he just sloppily forgets all established plot and incompetently does what he wants with his arrogance trying to prove how bold of a director he is and Lucasfilm allowed this.\\nThere is no motivation or back story to this big bad leader Snoke. They just toss him in there with imagery reminiscent of the Emperor for you to just assume and put the pieces together based on the Emperor from the original trilogy. Absolutely LAZY and sloppy.\\nLucasfilm needs new direction as Kathleen Kennedy's leadership isn't cutting it. There should be ONE writer\\, writing and planning ALL three installments before any shooting starts on the first film. Lucasfilm should Not just be thinking only as far as 3 installments they should have a team deciding on an overall narrative as to where they want to take this and build trilogy installments off of that.\\nYes Rey is a Mary Sue which is ashame because I like Daisy Ridley. She's well cast.  I know the filmmakers are trying to silence those criticisms by calling the people who say this sexist but they know better. Trust me they know what a Mary Sue is just as there can also be Gary Sue's in story telling. Before you say this is sexist google what a Gary and a Mary Sue are. Mary & Gary Sue's are CASH GRABS because they are just lazily injected as undeserved heroes to lazily entertain you for 2 hours. The definition of a  Mary Sue is an idealized and seemingly perfect fictional character. Often\\, this character is recognized as an author insert or wish fulfillment. They can usually perform better at tasks than should be possible given the amount of training or experience.\\nRey is not developed properly. They establish her as a homeless scavenger but yet can fly ships\\, escape from Starkiller base\\, defeat Kylo Ren with NO training\\, power in the force to knock Luke a jedi master down on the island and etc...\\nGo back and watch the character development of Luke in the original trilogy and watch him grow by Return of the Jedi. Luke is not a Gary Sue.\\nWhen you are injecting Mary or Gary Sue's into your franchise it's over. RIP Star Wars 1977-2017.","true":true}