{"101487":133780,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have never been this disappointed in a Star Wars movie. Not even The Phantom Menace left me feeling this upset. As a fan who has had Star Wars tattoos on my body since the 90s\\, I can't believe what I witnessed in the theater on Friday. Let's start with Snoke. In The Force Awakens and surrounding hype in fan culture\\, there was intrigue about his origins and identity. Seemingly countless sites were devoted to uncovering his mystery. In The Last Jedi\\, he is suddenly and unceremoniously killed. No explanation of his back story or his true identity. Nothing. Just Johnson's middle finger to we the true Star Wars fans. \\n\\nThen there is the completely disrespectful treatment of Carrie Fisher. No appropriate sendoff other than a message in the credits. No resolution to her character. Rey's training? It barely exists other than a few brief moments. Don't even get me started on the forced Marvel humor of the opening scene with Poe and Hux or the other failed attempts at humor throughout the film. The atmosphere does not even feel like that of a Star Wars film in places. The casino scenes are an excellent example. It felt like we left the Star Wars universe entirely.\\n\\nThe actors do well in this movie. They're just not given the proper material. The Force Awakens was so full of promise. I don't know how Episode Nine can possibly work in the aftermath of this abomination. I guess the only potential we have left is with the anthology movies\\, unless someone wisely decides to scrap this version of Episode VIII and do it over.\\n\\nAs of the writing of this review\\, critics gave this insult to Star Wars fans a 93% fresh rating. How many of those critics are actually Star Wars fans? My guess is very few. Note also the reviews of apologists here who try to dismiss the reviews of disappointed fans like me as incoherent or vitriolic. How many of these people have Star Wars ink on their bodies? How many have tirelessly defended the unjust critiques over the years? One particularly inane poster said something about reviewing the movie you are seeing not the movie you want to see. Believe me\\, we are reviewing precisely the awful movie that is on the screen in front of us.","true":true}