{"101487":98839,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A complete plot hole disaster\\, wasted characters\\, force agendas\\, supreme leader who? Completely kill off snoke who was built up for NO REASON and you have Rey fighting guards as if she has been training For YEARS. My goodness what did you guys do to luke!? I just don't see how any director\/producer could agree to anything including this movie. There's no character development\\, there's no time skip for Rey's experience with a lightsaber. You guys are just like f**** logic. Why is Star Wars struggling  so bad to have good villains?\\, kylo rens confusion is so annoying. How can he have already killed hundreds\\,jedis\\,people. But still have remorse for anything or anyone?\\,  how the F does he lose to rey who has never picked up a lightsaber. Rose confession of love for Finn who she just met. Don't blame this on \\\"white male supremacy\\\" I have Spanish\\,black\\,Asian friends no one liked this film. Let me guess episode 9 Rey fights kylo kills him beats him?\\, wasting a quarter of the movie for a pointless part with Finn and rose?\\, killed off captain phasma when she had no screen time?  What is there to look forward to?. Rose\\,Finn\\,Rey rebellion vs a cliche kylo ren and his final army and finally getting shitty cliche lightsaber battle which Rey will kill kylo?\\, it's too late to try to make kylo be a badass in episode 9. Star Wars fatigue?\\, marvel comes out with 3 films a year raking millions. FIX YOUR AGENDAS.","true":true}