{"101487":164936,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rey in Ach-To hands Luke Skywalker that legendary lightsaber and Luke throws it away to drink alien cow\/seal milk. But this also says that The Last Jedi is right after The Force Awakens. Not even a day apart\\, its just right after Ep7. \\n\\nSo in EP7 the rebels\/resistance (potahto\/potato) destroyed the star killer base and immediately they are reduced to the number of 400 people maybe. How?\\n\\nWhen did Kylo Ren heal? wasn't he injured just few hour ago (in ep7) If Finn was bed ridden from the injury\\, how come kylo got healed perfectly? (we did saw him 'topless' in one scene)\\n\\nWho fixed C3PO's red hand? \\nWhy is Rey so powerful?\\nHow come snoke's ship is slower\\, ok fine let it be slow\\, but why cant he\/they send some smaller ships in front of resistance ships using hyperspace jump?\\nWhy dont resistance do the lightspeed jump thing to all different direction if it is only one ship that snoke can follow?\\nWhy cant holdo share her plan?\\nhow come poe doesn't know who vice admiral Holdo is?\\nHow can Leia use the force like that?\\nWhy does spaceships need fuel now? What is the mileage then? \\nHow come lightspeed jump is a weapon now? If this can be used as a weapon then to destroy death star\\, rebels needed a droid and a plane.\\nFinn\\, Rose\\, Phasma\\, DJ --why are they even in the movie?\\nHow come Luke is a whiny idiotic old guy now?\\nHow can finn drag rose all the way from enemies mouth to the base? \\nHow can the falcon come in and go out ? First order was not guarding the sky?\\nWhat happened to the knights of Ren?\\n\\nMan... this movie makes Episode 2 look like Godfather-1. Sigh.","true":true}