{"101487":100098,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-11","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"After watching the trailers for The Last Jedi\\, I was excited because they made the film look like it was going to be the greatest film in the series. Needless to say\\, I went into the theater with high hopes. Sadly\\, I left with holes where my eyes should've been. I was stunned by how trite and banal Johnson made the plot. Everything seemed way too inconsequential. How does a starship get low on fuel after one jump to light speed? In the originals and in the prequels\\, ships jump multiple times whether they are big or small. Wouldn't the rebels have had their fleet fully fueled in case they needed to escape? What kind of fuel do these star ships need and why don't they have reserves? \\n\\nAnd why are people commending the series for a commitment to \\\"diversity\\\"? There are far less alien species in these new films than there were in either of the previous two trilogies...  On top of the lack of diversity\\, how Disney uses aliens is pathetic. Why are Aliens placeholders rather than detailed characters? Yeah\\, we hate Jar Jar but at least he had a story. Chewy had a story. The Jawas killed by stormtroopers in A New Hope had a story. Jabba the Hut had a story. His Tw'lek helper\/translator had a story. So\\, where are the alien characters? Diversity? In a galaxy with more than just humans\\, there is an awful lot of screen time without any aliens except when they nod\\, say a single comment\\, or die (RIP Admiral Akbar). \\n\\nAnd then there is Luke. Luke seems to have taken the situation with Kylo out of proportion... Even after understanding his sister is in critical condition\\, he would rather die alone than go and fight Snoke or Kylo? Give me a break... That isn't the Luke we remember. Luke stuck his neck out for his friends and family before himself. It was in his bones. He was like that when he was a young cynic hoping to join the Imperial academy to when he began training in the ways of the force and beyond. One event\\, in my opinion\\, even if it is his nephew\\, would not change a fundamental characteristic of who he is. He would be willing to protect leia. It is as if all the trials he went through during the original trilogy do not matter anymore.  \\nThey don't exist. He learned nothing about hope\\, trust\\, and loyalty even after taking lightning for his father? Yeah... I don't know about that...\\n\\nThere is much more I could say.\\nTBA.","true":true}