{"101487":118863,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Everyone here doesn’t work in the industry or understand decent writing. Episode 7 dangled carrots in front of your face only to have the writers flip you off at every turn. Why did Raz have Luke’s lightsaber?! THAT WAS NEVER ANSWERED. Rey\\, Finn\\, or Po’s origins... never answered. And that film broke every rule we’ve been taught about Star Wars. There’s no debate that he lightsaber is the most precious artifact in all of Star Wars. Not just anyone can pickup and use a lightsaber is what we’ve been taught after watching the original saga over and over. Then episode 7 comes along and tells us... ANYONE CAN FIGHT WITH A LIGHTSABER. Anyone who enjoyed episode 7 should really think about what an executive producer does and realize they got screwed over. Episode 8 although filled with plot holes this was way more bearable than its predecessor. We had space battles\\, the characters weren’t put into situations that they weren’t supposed to be in... aka them even being at Raz’s planet in the last one. They just show up there?! Y’all didn’t catch that?! The things that were ruined were in Snoke\\, Rey\\, and Luke’s character development. Snoke is supposed to be the most powerful sith and yet he does nothing and then dies before we know anything about him. Did they really have to kill him off? It’s funny because you can see how hard this franchise is trying to please us but they keep falling flat. Rogue One was the best of the three but the reason why is because when a film is inserted in between two others... there’s not much they can do to ruin it. This film was enjoyable enough to watch but it was like eating pumpkin pie without whipped cream. ","true":true}