{"101487":190414,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Two stars for Reylo and that's it.  Also not a bot. I'm a person and my name is Ryan.\\n\\nOne thing that prompted me to write this review was the coordinated attack on the fans from Disney's allies in the media\\, calling them bots or alt-right or Russia (boy this sounds dismissive and familiar). It a great insult to our intelligence and rather then let time and debate sort everything out they launch a smear campaign to bully people into liking the movie. They say the movie isn't political while righting articles about mensplaining and angry white men. They bait people to see the movie with the hope it will add to the Star Wars legacy\\, but instead trash and tarnish the Skywalker line and the legacy of the Jedi\\, fitting with the progressive theme that the past must be erased in order for \\\"progress\\\" to take effect. And that is the theme of this movie. Forget the old\\, embrace the new like nothing that came before even mattered. But what if I told Rian that you can have your cake and eat it too. You want feminism and diversity more power too you\\, but don't attack the very heart of the franchise or the original audience. This is why Trump won the election. Life and history are not without meaning. The events of the last two trilogies were supposed to mean something\\, but this movie undercut them both. Star Wars is now the story of dashed dreams and failures\\, and the erosion of society. The Jedi\\, The Republic\\, and now the Skywalkers and the Solos are gone unless Rey can redeem Kylo and mother the next gen of Sk walkers. Overall the Rey and Kylo stuff was the best and I do hope they end up together assuming Disney doesn't outright ignore the fans.  They are one fan disappointment away from killing the franchise. I believe it can be save but only if they listen to the fans and not there Marvel and Tumblur focus groups.","true":true}