{"101487":130757,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I do not understand how some people are saying this is the worst Star Wars movie. But then again ALOT of things have happened this year that I don't understand. I think people are just salty because their fan theories didn't come to fruition.  This film would be 5 stars if they cut the casino scene and rewrote the relationship development of Finn and Rose. Addressing some of the scenes other viewers have had problems with.  At first I wasn't sure how I felt about the Leia scene but now I stand behind it.  Throughout the entire series\\, Leia has exhibited that she is force sensitive. This is finally the physical manifestation of the force we have long waited for her to exhibit.  Hello she is supposed to be as with the force strong as Luke\\, and finally this is our evidence.  And if you try to argue she is not a trained Jedi no way should she be able to use the force this way. Then you need to recount the whole last movie too where Rey displayed some pretty BA displays of the force with no training and well frankly working off of rumors and myths she knew of Jedi power.  Leia has had plenty of time and knowledge of the force to used it in this manner.  Also as frustrating as it was to see Poe attempt to Mansplian his superior\\, throw a mutiny\\, and be the solo cause for the deaths of a shit ton Rebels.  Any woman who has ever been in a position of authority can tell you this is entirely plausible. Holdo should not \\\"have just explained to Poe what was going on\\\". Poe should have respected her as a superior and you know maybe not declare across open coms the entire plan of the fleeing Rebels. Any now to the best parts.  Adam Drivers acting.  Luke just chucking the Light Saber lol.  The fight scene with Snokes Guards.  The visual of Holdo's kamikaze.","true":true}