{"101487":169263,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"***SPOILER ALERT***\r\\nThe latest episode in the Star Wars saga had many things that I truly loved and a few things that I have to really question. \r\\n\r\\nThe character arc of Kylo Ren\\, Rey and Poe Dameron were spot on and they were the very thing driving the movie. Some fantastic set pieces\\, including the destruction of The Supremacy using The Raddus as what can only be described as a hyperspace torpedo. The Snoke\\, REY and Kylo scenes in the throne room  were incredible\\, from Kylo's turn on Snoke to Rey AND Kylo team up and Rey's realisation that Ben Solo is truly gone.\r\\n\r\\nHowever\\, Rian Johnson seems to have purposfully ignored every thing that JJ Abrams set up in The Force Awakens. All the question we expected to be answered were simply dismissed as having no real importance. \r\\n\r\\nLord and Miller were sacked from Solo for being to \\\"jokey\\\" yet there were times when the jokes in the Last Jedi were unnecessary and down right childish.\r\\n\r\\nI also have to say the whole Finn and Rose sub plot was a waste of screen time and added absolutely nothing to the plot of the movie.\r\\n\r\\nNow the third act\\, in most part it was a great spectacle. I particularly enjoyed the resistance heading off to meet the first order and the subsequent intervention from The Millenium Falcon. However I do question the way in which Luke Skywalker was used. Not so much the way it ended but in the way he was portrayed in his face off against Kylo Ren. I believe it would have served the scene better if the force projection wasn't that of a younger Luke and was of the same grizzled\\, wise old man that he had become on his island.\r\\n\r\\nOverall a good movie but not necessarily the movie we wanted!","true":true}