{"101487":196283,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Where The Force Awakens was a love letter to Star Wars fans (yes everyone knows that it essentially copied ANH)\\, TLJ is basically hatemail to Star Wars. You could write a book on it. Rian Johnson and the \\\"Lucasfilm Story Group\\\" (have nothing to do with Lucas) are nihilists who methodically deconstructed and attempted to destroy everything about Star Wars. It's painfully obvious that the people now in charge of writing Star Wars films\\, books and shows HATE everything about Star Wars and that goes for Kathleen Kennedy who signed Rian on for more films.\\n\\nThey hate the stark difference in morality\\, they hate the hero's journey\\, they hate the original characters and what they stood for and all the underlying themes of the original movies. They want to push grey. They treat everything from the original films as garbage (example old lightsaber) and the film even has subtle things in it to make you look at the old trilogy in revulsion (blue milk). Nothing about this is creative or bold. This is simply taking a huge dump on all things Star Wars. Everything about this film is purposely designed to make you hate the old trilogy and it's characters. The only character treated with reverence is Leia and that is done with the intent to leave the impression she should have been the Jedi and not Luke. Disney has also put that Yoda wanted to teach Leia instead of Luke in recent Star Wars literature. Luke went from being the hero in the hero's journey that Lucas based the work on\\, to being part of the problem.\\n\\nWhile you can argue that you like these new themes or you hate Star Wars and like this\\, you can't argue that this should be done in Episode 8. Star Wars is now simply a dead franchise going forward. The people who own it\\, hate it and throw what little logic Star Wars had\\, to keep it grounded enough to be believable in a movie setting. Where the OT was about the triumph of the human spirit\\, TLJ is a work from someone who simply hates the human race and values or believes in nothing. The misanthropy is evident with animals being valued over children. Disney Star Wars is only Star Wars in name. If you are interested in a much better episode 7\\,8\\,9 read the Thrawn trilogy by Timothy Zahn. If you hate to read people have voiced the book with the comics on youtube. Audiobook is also an option. No one should be giving Disney another dime for new works though. \\\"It's time for Disney Star Wars to end.\\\"","true":true}