{"101487":174720,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"the greatest fictional character of our time was poorly handled it it was hard to watch. this movie starts out great and falls flat on its back by the first time you see luke back with rey. If you grew up loving luke as a kid you will be utterly disappointed by his character in TLJ. at no point does mark hamil act as if he is luke skywalker which blows my mind critics say this his best performace. what i seen was an imposter luke who was weird and added nothing to the plot of the story. neither did snoke at all. Then we get to reys origin which is a let down. i believe you can tell this movie was directed by someone else and it doesnt feel like star wars film. Luke in the final moments character is so cheezy and laughable \\, its a crime what rian johnson did to luke skywalker that it completely ruined any positive parts of the movie. getting rid of old characters just to make way for the new is excatly what you see so forcefully and heavy handed on screen. what made luke and anakin so special was because they were phrofits that were supose to bring balance to the force created by the force. not just some random person like rey or these kids who are force sensitive. star wars isnt harry potter where everyone can be a wizard\/ jedi. overall i believe this film is throwing people for a loop by burying your head in the sand with intense action distracting you away from the aweful storytelling then leaving you with the same questions you had before","true":true}