{"101487":177721,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The only thing i liked about this movie was how it tried to tell anew story unlike TFA which was mostly just a retelling of ep IV. However this new story was far from entertaining and very poorly written. All the dialogue Luke had was extremely cringe worthy. This movie did have some cool moments specifically the Kamikaze into the first order ship\\, and the Throne room fight scene. However his movie was full of dumb and disappointing moments. First princess Leai somehow Mary Poppins her way back into a ship after being blasted into space and somehow lives through it. Finn and rose have a completely useless subplot that takes up an hour of the movie and contributes nothing to the story\\, and this subplot was very uninteresting and didn't fit in at all in a star wars movie\\, this movie would've been decent if it was just cut from the movie. Another huge complaint is that they built up so much hype around a few characters and then killed the without ever getting to see them do anything\\, specifically Luke and Snoke. Literally Luke just dies of exhaustion. \\nBiggest complaint was just how this movie didn't feel like a star wars movie. This Movie had several things that had never existed before in a star wars film and it just doesn't fit in with the franchise. It has a montage of stock footage\\, flashbacks\\, slow motion matrix style fight scenes\\, plenty of new force powers that are extremely far fetched\\, and retroactively create several plot holes in the previous films\\, as well as segments that are narrated by characters in the movie. This movie did have a few good moments but these were heavily outweighed by its flaws resulting in a movie that just ends up being frustrating to watch.","true":true}