{"101487":196433,"Last Jedi":"Last Jedi","2017-12-15":"2018-08-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While I did see this movie with family they were rather sanguine after seeing it though I was not. I will admit that alittle contrarianism was building in me towards the new films\\, how could people love them so much? I for one found a weird nostalgic buzz prom the hated prequels that merited them above these films but that is besides the point. The biggest reson for this rating is the honest experience of the film which was bad. The amount of plot for how long the film goes is the killer here I feel like this whole movie could be a 45 minute arc on some weird amc series. The characters are not lovable albeit most western movies fail to deliver in those regards. I twas also painfull to see so many built up plot points ad ques lead no where. That made me start to consider wether this was a deconstruction of star wars which would be cool but if that is what they where going far they did not do it hard enough. A true deconstruction would not just burn the tree but the books too\\, why not throw yoda in the fire awsell? It would be a horrific spectacle that i would not be able to stop re watching\\, nostalgic childhood memories lobotomized into bloody into meaningless purgatory. \\nThat being said my actual main problem is the aesthetic. I have been pholosophising over the power of aesthetic for many years now and have often gone in pursuit of the ultimate\\, dare I say \\\"divine aesthetic. A combination of light and sound and other cacophony to win the mind of man.In the end  I feel as if some media achieve this more then others. I feel as though the aesthetic of this film is very poor and jumbled. The composition of scenes harks nothing to the resplendence of art and form. Instead I see only hard colors that might aswell be from the crude edges of a 3d modeled video game. The soundtrack did not stick. Alass i feel as if this is a wider symptom of a large universe. Starwars is so much and it is no wonder that this movie cannot contain its vast spaces in a trite aesthetic. Luckily this film will age and in no time it will become nostalgic and representative of a time and art and people. Then I will watch it again.","true":true}