{"101487":193247,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Warning:  Spoilers below.\\n\\n1.\tLuke Skywalker milking a lactating alien\\n2.\tLuke Skywalker going spear fishing with a 200m long pole vault\\n3.\tPrincess Leia drifting to a peaceful death in a galaxy far far away.   Only to remember she can actually SPACE FLY back to her ship.\\n4.\tLaura Dern's purple rinse hair-do just like my old nan's.   RIP Nan.  RIP Laura.  I'll miss you both.  Apart from you Laura.\\n5.\tChewbacca (the one that rips peoples arm's out of their sockets when he loses) spit roasting a flying bird hamster then regretting it and adopting one as a f****** pet\\n6.\tThe burning of the mythical Jedi texts.   Who knew about them?  Or cared.  certainly not rubbish CGI Yoda that's for sure.  \\n7.\tThe Master Code breaker (or was it Code breaker\\, don't remember\\, never mind\\, all utterly irrelevant)\\n8.\tThe all powerful Imperial star fleet cunningly seeking to defeat one rebel cruiser that did the Kessell run in a little over 112 parsecs by .... waiting for it to run out of gas.  \\n9.\tThe stuff that happened in the 15 minutes when I left my family and went to wander round the cinema foyer to just do literally anything else for a while.\\n10.\tRay clambering in a hole to explore her dark side and finding it is .... a hall of mirrors with a lot of finger clicking Rays.   Deep.\\n11.\tRose denying Finn a honorable kamikaze death (one which would spare him more interminable hours listening to her tedious PC prattling) only for Rose to skewer herself.  Prompting...yep\\, more tedious PC prattling.\\n12.\tRay and Kylo Ren's mental Whatsapp chat group.   Even they seemed bored witless.  LOL!!   \\n13.\tGiant goat racing Monte Carlo.  What?\\n14.\tLuke Skywalker becoming the biggest milk-guzzling surrender monkey in the galaxy (...converted to the wet side by fish nuns?)\\n15.\tLuke Skywalker saving the day by literally yoga-ing himself to DEATH.  Na-maste!!\\n16.\tChewbacca\\, C-3PO\\, R2D2.  Why don't you cinematic legends turn up and do literally nothing at all.   It will be so genre-breaking. \\n17.\tRay presenting a grieving Leia with the never seen before gold dice ignition key ring from the Millenium Falcon.  Classy.  \\n18.\tThe jangling Swarovski snow foxes.\\n\\nAll the above spoiled The Last Jedi for me.  And they will spoil it for you too unless (i) you have never seen a star wars movie or (ii) you are one of the 93% of movie critics who allegedly adored it and who might consider taking a long hard look at themselves in the mirror.","true":true}