{"101487":190923,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Unfortunately Star Wars The Last Jedi is the most disappointing movie of 2017. I could tell there were going to be problems with this film. I could tell Mark Hamill was very unhappy with it. I hoped for the best and really got the worst here. The death of Snoke was disastrous moment. They built him up to be the most powerful Dark Jedi ever. Possibly more powerful than Darth Sideous then suddenly kill him. No explanation of who he was or where he came from nothing. The whole Casino scene was awful. The Finn and Rose side story was weird. The Kiss shared by Finn and Rose was one of the worst kisses in cinematic history. Princess Leia flies around in the vacuum of space like a Kryptonian Superman. The final and most important reason Last Jedi Fails is it's treatment of Luke and Yoda. Luke Skywalker is a hero. I can think of few protagonists with a presence that equals him. Well\\, forget the hero that was brave enough to stand up to the Empire\\, Darth Vader\\, and Emperor Palpatine. Rian Johnson's Luke SkyWalker is a cringing coward. A spineless wimp that lost faith in the Jedi order and religion. A man who quit on life and seems to be afraid of everything. The Luke Skywalker I grew up looking up looking up to isn't even present in this film. Mark Hamill himself stated that this isn't his Luke SkyWalker  George Lucas never would have written him this way. The only thing this look seems to be good at is being mean to poor Rey for no reason and creeping people out by chugging green milk from a freaky aliens nipple. Then there is Yoda. WTF was up with Yoda?! When Yoda appears he cackles like a demented lunatic while burning the Jedi Orders most holy texts. I'm sorry but Yoda is obviously a wise holy being and would never destroy precious knowledge so foolishly. Finally there was no climatic Jedi battle. Did anyone honestly think a few Praetorian guards would defeat two Jedi? lol! All we can do is pray Rian Johnson is removed from all future Star Wars projects because Last Jedi is the worst Star Wars film ever made.","true":true}