{"101487":185881,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie... This movie was an utter abomination. \\n\\nThe destruction of Luke Skywalker begins the moment he tosses the light saber away in the first interaction with Rey. \\n\\nFor a movie about supernatural \\\"forces\\\" in space with laser swords and laser blasters I found myself scoffing constantly at the sloppy writing and \\\"shark jumping\\\" that occurs within this travesty. \\n\\nLeia using the force to fly back into a space ship from deeps space after being blown out of a ship. \\n\\nLuke Astral Force Projecting himself across the universe to battle Ben\\, then dying. \\n\\nThe \\\"18 hours until the death of the rebellion\\\" shuttle battle. So we travel to a planet try and find this guy to pull the hack to save our slow moving ships... Sloppy\\, Lazy\\, Awful. \\n\\nDel Toro's hackers betrayal had no relevance to the story. Nor was there even a moment of development in the story that he would do such a thing. The character was so poorly developed that no one was invested in him. \\n \\nRose\\, slamming into Finn to \\\"save\\\" him from sacrificing himself to save hundreds if not thousands of people. Yet after she does that\\, there is no mention or representation of the death toll her actions incurred. \\n\\nSupreme Leader Snoke... or should we call him \\\"Generic Overlord with no backstory.\\\" This character had potential\\, so much potential\\, yet was wiped out in a poorly developed scene where no resolution nor logical antagonist was developed. At that point I was hoping the movie would end with a stand off between Ben and Rey but alas it wrapped up in a cute little Disney ending. \\n\\nPhasma... A character that could have and should have been amazing for the franchise\\, wasted\\, utterly wasted in a 10 minute scene. Again\\, suffering from the same development issues and Snoke and Del Toro's characters. Under-developed\\, then wiped out without audience investment. \\n\\nFinally\\, look\\, we all know Carrie passed away and she was a wonderful actress and will be missed. That being said\\, how many ways and times can you play to killing Leia off in a movie? It was almost exploitative of the real life circumstances.","true":true}