{"101487":182954,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the first time I’ve been bored while watching a Star Wars movie. First off\\, the space chase premise was lifted straight from Battlestar Galactica\\, but not done anywhere near as well. Leia surviving the vacuum of space because she’s a Force wielder was ridiculous. If they had added an SFX shot showing a Force bubble around her when she was blown out of the ship I wouldn’t have had a problem with the scene. Instead\\, what we got was a cringeworthy Mary Poppins moment that looked ridiculous. Speaking of ridiculous\\, the fact that a ship can be really close to another one and somehow be out of range of its weapons fails the logic test. Even if that did make sense\\, why not call in reinforcements that have faster engines? Everything to do with Canto Bight was useless and ultimately served no purpose. Our “heroes” have to go there to get a codebreaker\\, but they get arrested by space cops for parking their ship on a private beach (no really\\, that happened). But it’s ok\\, because they just happen to be thrown into a cell with a different codebreaker who helps them escape before going his own way. Then Finn and random rebellion character free some space horses from a race track (because apparently they’re members of PETA) and head back to their ship\\, which gets blown up when they’re a hundred yards away from it. But that’s ok too\\, because the 2nd codebreaker and BB8 rescue them in a stolen ship and they leave the planet. They make it to Snoke’s ship and are confronted by Captain Phasma (because 2nd codebreaker guy betrayed them). Ready for an exciting Finn\/Phasma fight? Too bad\\, she’s on screen for like a minute before falling into fire. Meanwhile\\, back at the fleet\\, Poe commits mutiny because Laura Dern’s Vice Admiral Holdo (who is has pretty much no backstory aside from being friends with Leia) insists on keeping him out of the loop when it comes to her plans on saving the fleet. Instead she tells him to have hope. Poe successfully takes control of the ship for about ten minutes until Leia wakes up and stuns him with a blaster\\, and retakes the ship. Everything done with Luke is completely out of character for him. It seems Rian Johnson thought that Mark Hamill was Hayden Christensen and wrote him to be a whiny little emo bitch. Plot threads started in The Force Awakens were handled poorly. Rey’s parents\\, who are they? Oh they’re nobody. Who is Snoke? What’s his backstory? Oh it doesn’t matter. How can he be so powerful with the Force and not see a lightsaber right next to him turning toward him to kill him? Who cares? But hey if you want forced shoehorned humor\\, RJ has you covered. There were a couple good scenes\\, though: Rey and Ren fighting Snoke’s Praetorian guards and the Hyperspace kamikaze run looked pretty cool. Everything else about this movie was terrible. It’s fitting that the movie’s theme was failure\\, because that’s exactly what it did. Rian Johnson really shit the bed with this movie. Dear Disney\\, do not let him touch another Star Wars film ever again. Here’s hoping JJ Abrams retcons this entire mess to be a Force vision of Luke (a potential future) that he is able to change it and erase this garbage from existence. ","true":true}