{"101487":174431,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The First Order is in nearly full control. Didn't they have a planet\/massive weapon explode taking out a good portion of their leadership?\\n\\nFinn and Rey - best of buds. When do they ever really see each other to keep the relationship alive? Long distance\\, I guess. In fact\\, why do any of the main characters really care about each other. They rarely hang out and they never write. But here are a bunch of new characters that you don't really know or care about!\\n\\nPurple hair does not an alien make. Where are the aliens??? And who is this woman? How did she come to be? Why should I care about her? Why isn't Admiral Akbar (alien!) given the cool hero's death rather than just an incidental \\\"Leia was the only one that survived\\\" end? \\nIt's a crap!\\n\\nLeia uses the force (yay!) and looks like Mary Poppins. (boo!)\\n\\nWho is Snoke? He looks old and powerful. Older than Han\\, Luke\\, or Leia. Where did he come from and how did he rise to power? Dead now. Guess it doesn't matter.\\n\\nSalt planet. No goggles while speeding along? My eyes have sympathy stings.\\n\\nSpace battle! Um. It's gonna go on a while. Wanna hop down to some planet\\, find a guy who's not the guy we were told was the only guy who could help and come back in a bit? Maybe ride some space-horses on the way? Keen!\\n\\nPhasma is back - yay! How did she survive? Dunno. And she's dead again. Erm. Never mind.\\n\\nSo we have this original trilogy\\, see? And they never did flashbacks in any of those\\, see? Let's do some here! They won't be jarring or out of place or rush the pacing of the story at all.\\n\\nSpeaking of pacing\\, Luke and Rey have how long together? 18 hours of fuel left. Not much\\, I guess. Odd timeline that at the very least is not explained well.\\n\\nHow did Luke die? I have no idea. He did something other force wielders seemingly do all the time\\, or maybe it's something totally new that we've never seen and it tuckered him out to the point of death. Poor little feller.\\n\\nI enjoyed Luke and Yoda. I enjoyed the twist between Kylo Ren and Luke that led to Kylo Ren's turn to the dark side. I really liked the interaction leading up to Snoke's death. Overall I didn't like the style of storytelling\\, the pacing\\, the editing\\, and the CGI. For me to notice anything negative during a film\\, it's got to be glaring. I love my stories and am usually very forgiving\\, but this one just didn't work well for me. I'm also not nearly as intrigued or engaged about what comes in the next film\\, which is disappointing.\\nNot how I want to leave a Star Wars film.","true":true}