{"101487":130608,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"i didn't mind the story and acting but felt lackluster after wards like key parts missing.  script and acting and story are definitely better than proly what lucas would give us but when half the audience of over 100k don't like it\\, the movie isn't touch with not enough of the fan base. for me i felt there wasn't enough cool lightsaber action. thats half of why i luv star wars. martial arts samurai esque movie. love Episode 3 obviously. but this film had one \\, really awesome\\, lightsaber martial arts intense action sequence. but in 2.5hour movie and several characters capable of Episode3 style action... i feel they should've given us more. Also some of us luv luke because comics and books said he became strong and was arguably one of strongest force users and jedi ever. and i was expecting to see episode 3 esque lighstaber style action from Luke and never got it but he did have frikkin awesome moment showcasing his force powers. but because of the story we'll never have anything else from luke and that was absolutely the wrong storyline direction to go. just not sitting well and therefore i feel the movie lacked stuff and i'm less interested despite having good acting and story. like i can see myself waiting to download or watch episode 9 for free and not paying for it.... but somehow in the prequels with horrible script and directing i went to every one like twice. i dunno so i giv 3 stars it got an D+ maybe D- in my boook. A+ acting i'm ok with the rest of the story so far but that lackluster feeling\\, what happens with luke overall\\, and lack of lightsaber action doesn't feel like a well rounded star wars movie for everyone therefore i'm harsher on this movie critic-wise and rating a D","true":true}