{"101487":147602,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I won't spend too much time talking about what's wrong with this movie\\, because there is plenty wrong with it\\, instead I will give a quick summary of why I gave it the score I did. Firstly the story is one big pointless mess. Nothing is achieved within this movie. Watching the rebels flee from the first order in space for 2 hours does not make this a compelling or interesting movie. A lot of the character development is incredibly underwhelming. This next part contains spoilers\\, you were warned. Supreme leader Snoke is simply a plot device to bring rey and Kylo ren together. He adds nothing else to the movie. They  purposely make him so mysterious and ominous for no reason. I was incredibly interested in seeing where he was from\\, how he it to be where he was and what he wants to accomplish but Disney obviously didn't feel it was important and killed him of two thirds into the movie. Reys parents are nobody's and Disney decide to balance everything on the rey to be compelling by herself instead of adding something else into the mix. The first order are pantomime villians where you are suppose to laugh at them and never feel scared or threatened because jokes are shoved in your face every chance they got. Just when you think you could get a serious scene a home comes out of nowhere to break the tension. Kylo Ren is still incredibly weak but that doesn't affect his character on a movie level. The whole reason he wants to turn to the dark side is thrown out the window in this movie and replaced with Kylo ren wanting to get away from everything and start again as an evil tyrant. Leia should be dead yet the force is used as plot armour to save her when there is no way she could have lived through the lack of oxygen\\, flames and explosion blast of the rockets fired at her. Luke skywalker is completely rewritten and has become like he was in a new hope a whiny boy who doesn't want to try again for the fear of what happened even though he lost to darth Vader and nearly died but he still tried again for his friends and the Galaxy. His character makes no sense in the way he has gone in this movie. Even Mark hamill hated his part in the movie. Captai phasma is once again wasted. Finn is just comical relief as his entire side story is pointless and makes no impact on the overall story. The only thing that changes is he is no longer a coward. So some character development there. A lot of subplots are thrown out of the window form force awakens and the whole thing is an incoherent mess. The only thing this movie has going for it is that it looks nice and has some nice cgi in places. That is it. Please god don't make the same mistake I did and watch this movie","true":true}