{"101487":165066,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson....destroyed Star Wars. I have never written a review. I was going to see the movie again to make sure I didn't like it.......nope not going to. If Johnson can ruin Luke\\, Leia\\, Snoke\\, Kylo\\, Rey and still have a job because it's making money just think what it could have done if it would have not sucked and ruined everything true to Star Wars! Force Awakens set it up nicely and Johnson had to be one of those guys and do the opposite to shock instead of building beautiful emotional action scenes with warmth meaning and yes giving fans and new ones what they wanted but with rational twists that have meaning and true power. How can there be Star Wars with no light saber duals? There can't. That's just one micro reason why I refuse to see it again. Johnson destroyed a legendary story and sold out. The next movie should be called NO HOPE!!! See what I did there.....I played off the old movie NEW HOPE!! That's what Johnson should have done off every Star Wars original 3 and had a chance to do with Force Awakens setting him up to win. Instead he replys like a weak person to fans and says you can't make everyone happy.... no kidding Johnson you can't. However you managed to get every real fan to puke and left us with no guessing how the next movie is going to suck. If Disney should remake this film and flex it's real muscles instead of selling out for effects it would be a genius move. I know it's not a financial loss but by a remake it would make Disney loved again by real fans and make even more money because it doesn't suck. When I say it doesn't suck I mean even if it was 50 percent just okay that is a suck for Star Wars and its potential. Please see the genius in saying oh poop this sucks but we made money and let's take that money reinvest it and tell the world this sucks and our egos suck and we are doing this over and what you watched from Johnson just ignore it because it didn't really happen. I don't believe that has ever happened but if Disney would do this that would be epic! ","true":true}