{"101487":190527,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ugh.....where I do I even begin here? I'm a huge Star Wars fan. I LOVED the originals. I enjoyed the prequels. I enjoyed The Force Awakens and I LOVED Rogue One. This is the first Star Wars movie I didn't like at all\\, no matter how much I tried too. I kept telling myself in the theater that'll it better but that moment never came. So my first complaint of many- we were given an emotional scene at the end of the Force Awakens with Rey finding Luke. We assume that Luke will train Rey to become a Jedi-no. Luke just tosses the freakin lightsaber behind him like its nothing. No training for Rey takes place at all besides a two minute talk with Luke later on in the film. Snoke dies halfway through the film like he's a nobody\\, and we're told Rey's parents are nobody's. So after 2 years of hearing hundreds of fan theories about Snoke and Rey's parents\\, and Rian Johnson decides to give the audience a fat middle finger. Nice. And don't even get me started on Rose and Admiral Holdo\\, and no\\, its not because I'm sexist. I didn't like Jar Jar\\, does that mean I hate males? Leia and Rey were great characters\\, and Jyn from Rogue One was incredible. Sex and race aside\\, they were just terrible characters. Rose literally has little to no effect on the plot\\, and she says the dumbest thing ever to Finn at the end of the film. Its so stupid\\, I'm not even going to repeat it. Sure\\, Admiral Holdo had that cool kamikaze scene\\, however\\, she's such a b!tch character that someone else should've done it in her place. Maybe Leia\\, how how will we explain her death in the next film? Even admiral ackbar wouldv'e been better suited instead of him getting killed off right away like he was nothing. And then to top everything off\\, theres not a single lightsaber battle. Not one. We see Luke and Kylo Ren about to face off\\, and the audience thinks wow\\, about to have an epic fight scene-nope. Turns out Luke isn't even freakin there. And that's that. Terrible plot. Terrible film. Not putrid\\, but still pretty bad. JJ Abrams sure has a mess to attend to. Hopefully he comes through for us next year\\, but I probably should't get my hopes up.","true":true}