{"101487":184976,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is one of those movies that you need to see twice to appreciate it. I see where the gate is coming from\\, but it didn’t “ruin Star War” in fact it set up a lot of things. People were complaining about the Force Awakens saying that it was too much like the originals and that it wasn’t new. The Last Jedi is new and original and completely shakes up what we thought we knew. For all you complaining you got a new original idea. Now I’m not saying the movie was perfect. The movie definitely had some major flaws that I think they could have done better. However\\, these flaws are not irreversible. The next movie could fix these things. (SPOILERS AHEAD IF YOU HAVE NOT SEEN THE LAST JEDI DO NOT READ BEYOND THIS POINT I REPEAT DO NOT READ BEYOND THIS POINT) Snoke was shown to die in this movie\\, but from comics and lore he could just use his spirit to posses another life form. Snoke’s story is not over yet\\, and don’t expect it to be. Also the comedy in this movie is because Star Was was originally and still is aimed for kids. While the movie is PG-13 I still saw many 7-9 year olds in the theater. Kids like to laugh. The main reason people don’t like this movie is because people were expecting it to be a dark story that is more for adults. You forget that you have grown sine you last saw Star Wars. Another thing I have seen is that “the movie is too long” but in my opinion it should have been longer. I would have liked to see more of Luke or Snoke. “The characters were disappointing” Well the saga isn’t done yet we still might see more of them. I think the movie was over hyped and that is why people are disappointed. I think that J J Abrams is going to do good on this next one and has a lot to work out. Kylo still has his arc\\, and Rey still has hers. Her parents may not be important\\, but she is. This movie did not ruin Star Wars\\, it changed it. People don’t like change\\, but sometimes change can be good in the end. And that is what I think will happen with The Last Jedi. Can’t wait for the next movie. May the Force be with you all.","true":true}