{"101487":178349,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"There is a certain type of person that goes to the movies.  This person sits on the edge of his seat\\, places his chin firmly atop his clenched fist and stares intently at the screen as if they have every minute of their existence invested in the actions of the characters or events that happen in the movie.  When William Shatner told the \\\"trekkies\\\" to get a life on the SNL skit\\, he was talking about \\\"fans\\\" in general.  I was five when the first Star Wars came out and have been a fan ever since.  Over the years I've been known to know my share of Star Wars facts....movie related (I never got into expanded universes).  But I have never believed that the Force was real.  I have never believed that the Jedi and the Sith are real.  I have never thought that the motivations or actions of fictional characters have any bearing on my life whatsoever\\, because they do not.  I don't that a fictional characters actions or beliefs affect me at all.\\nThe new Star Wars movie in my opinion was a great movie and a great Star Wars movie.  These people that argue characters would or would not act a certain way really need...well\\, help.  Petitioning to have the movie remade??  Idiots.   Was it a perfect movie?  But to say you didn't like it because it didn't go the way you wanted it to???  Who the hell are you?  People were pissed off that The Force Awakens was essentially a remake of the first movie.  Now they are pissed off that The Last Jedi wasn't.  Idiots.\\nThe movie didn't answer some questions...like who is Snoke?  Rey parental lineage??   Why did it have to be someone special????   Star Wars cannot be about Luke\\, Han and Leia if it to continue...and Disney didn't spend 4 billion for it not to continue.   Fans need to accept this or go live in the past.","true":true}