{"101487":175714,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi (TLJ) is bad enough I just opened a RT account to add my voice to the chorus. Nope\\, I'm not a bot. Yup\\, this movie is broken on many levels.\\n\\nJust to prove it isn't all hate: I liked most of the humor others are criticizing. I didn't mind the Princess Leia 'aerial' scene some are hating on. I was also a fan of the CGI. I like seeing a couple of the strong women leads and feel they are believable enough to be solid role models.\\n\\nNow on to the bad. There's plenty of it.\\n\\nFirst: TLJ strings us along without answering much of anything. I'm not even talking about discarding much of the 'canon'. The Force Awakens wrote checks this movie just can't cash. Who is Snoke? How can Rey - who discovered she's Force sensitive just days ago - instantly rival two Force experts who have trained for years? What's the back story with Phasma and Finn they keep pulling from but not explaining on-screen? On and on. Prepare for disappointment. You ain't gettin' answers.\\n\\nSecond: Part of the reason the movie run time is so long is to give enough time for each female lead to set up their punchline. The punchline invariably is: Each woman gets a chance to belittle each male lead. Some of it makes sense. Other times... it is contrived and (if you're not an idiot) it should distract you from the story because it is so artificial and nonsensical. You are left asking\\, \\\"What? Why the heck did THAT happen?\\\" It happened so someone could continue preaching values at you. Again. And again.\\n\\nThird: We get ANOTHER movie with this 'you do not have to work for it in life' myth. We have Rey. She's not just a side-character. She's a MAIN character. Somehow\\, to meet some agenda or to simply 'insert new exciting powerful lead here'\\, she can go from a junk scavenger to rivaling Jedi masters within days. It is clear even from every other character in the current movies... this Force stuff takes time and discipline. Also\\, power corrupts and this is loads of power. So you have to ease into it. But here? Noooo. Instant gratification. It is like so many other movies lately. Isn't part of the point of this to be a model for kids picking up on the new characters? Why not show success takes at least a LITTLE work\\, care and discipline? They had 2.5 hours to paint that. Instead we get... this.\\n\\nFourth: Everything has become so small. Part of the beauty of Star Wars is the epic back drop and sense of cosmic struggle. Then\\, you weave the story of the characters into that tapestry. Here everything feels so small and petty. It is as though all the motivations and politics for why people do what they do are cast aside. It makes for weak story telling. I'm convinced it is one of the reasons the movie feels so shallow to so many people. There's no \\\"why\\\"\\, here. Even the one time they try with the Casino planet\\, it feels like they missed the mark.\\n\\nFifth: Racist\\, much? Every face of a major bad guy we see is that... a bad GUY\\, and white. The only major female baddie is behind a mask. But of course\\, she's also white. The good guys are well rounded and multi-cultural. Again... it so blatant it distracts from the story if you're paying any attention. (Anecdote: My father saw the movie. And my grandmother. And my uncle. Like others who don't know the back story\\, they all had no idea the masked Phasma was female. Even when they showed the tiny crack in the mask they didn't get it. I'm pretty sure that is by design. So I don't count her as \\\"a depicted female.\\\" But of course... she's still white).\\n\\nFinally: Everything feels temporary. It feels as though the only permission the director got to significantly progress the plot or alter this huge universe was to get rid of Snoke. And Luke Skywalker\\, maybe sorta. Even a couple of the moments that LOOK like they decide or end something  really don't. The director gives outs like showing such-and-such really didn't get destroyed because it is kinda-sorta shown later\\, sitting in a drawer in a later shot. Maybe. It makes me think NOTHING else is really final\\, even if they are trying to somehow signal it is. It sows too much doubt. I now don't trust the movie or the story. I feel lack of resolution about everything. And not in a \\\"well I'll come back to see another movie to get answers\\\" way. That's what I just did after The Force Awakens by coming to see THIS movie\\, and it didn't help.\\n\\nSo\\, no. I don't think I'll sign on for another round. After watching 8 of these movies\\, I think I'm done with Star Wars.","true":true}