{"101487":139600,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-14","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I saw the movie twice and must say I liked it less the second time. The good for me was in the Jedi\/Sith storyline. The conflict between Rey and Kylo Ren was the most compelling and interesting part of the movie by far and I'm interested to see how it will end\\, although Rey's strength despite still having had no training whatsoever is still a bit of a mystery and frustrating considering it flys in the face of all the other Star Wars movies. The bad is a much longer list. My biggest complaint is that I still see no reason whatsoever why Laura Dern's character could not have made Poe aware of what her plan was. There's plot holes in almost every movie but I can't remember a bigger one in my entire life to be honest. It made the Finn storyline absolutely pointless. I actually liked his character in The force Awakens\\, but the detour down to the casino planet felt very episode 1-3 which is not a good thing and it also felt like that storyline was politically motivated. The humor was not Star Wars humor is the best way to put it. The dialogue between Poe and Hux at the beginning of the movie felt very Marvel universe to me and it really took me out of the movie early on. Along with the sea cows that Luke milks\\, weird\\, just weird. Simple jokes here and there is all we need. The Force Awakens and Rogue one did this quite well. The faux death of Leia was another strange choice. She's never been a strong force user other than a little telepathy here and there and now she saves herself from death in outer space? Not to mention we know she's not gonna be In episode 9 so why not just her die in that scene. All in all its not a catastrophe but it took the series in a bad direction for the most part. ","true":true}