{"101487":185364,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie left me feeling such an overwhelming feeling of anger and sorrow\\, not the excitement that I usually feel when leaving a Star Wars movie.\\n\\nAt first I felt sorry for the fans.  Some of us have waited decades to see how our heroes from the OT fared and it was disappointing to put it mildly to see how this director portrayed Luke and Leia.  Chewbacca and the droids were merely props and even the Force itself was misused.\\n\\nThen\\, I felt sorry for the characters from The Force Awakens that I grew to really like.  I felt that Rey\\, Kylo\\, Finn and Poe (even BB8) were grossly neglected in this film.  Their characters are still largely underdeveloped and a golden opportunity to advance them was ignored and instead we had to sit through ROSE ROSE BINKS pouting and preaching throughout The Last Jedi.  Could have really done without her.\\n\\nBut\\, I think now I feel most sorry for JJ Abrams.  He was somebody who understood\\, not only these movies and characters\\, but the legacy that comes with them.  He knew exactly how to present new ideas and characters yet stayed true to the lore that the Star Wars universe is so rich with.  He respected the material given to him and the fans enough to create a masterpiece that was the right mix of old and new.  Rian Johnson took this gift\\, threw it in a dumpster and set fire to it.  \\n\\nThe possibilities were right there to make this movie incredible.  That is what is so disappointing.","true":true}