{"101487":182390,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"\\\"This is not going to go the way you think!\\\"\\, these words uttered by the infamous Luke Skywalker are appropriate to what this movie is. Luke warned you in the trailer\\, this is not what you think you're going to get. Under the magnificent direction of Rian Johnson\\, we have been given the most surprising and bold Star Wars movie to date. Light Spoilers incoming so please do not read unless you have seen the movie.\\n\\nTo begin with this is the most beautifully shot Star Wars film yet\\, every single scene is artfully crafted. The cinematography alone is some of the best I have seen this year let alone in a Star Wars movie. Rian Johnson and Steve Yedlin have outdone themselves\\, from the opening shot to the last every single shot is stunningly beautiful. Every scene in this movie is wonderfully shot and looks stunning.\\n\\nThe movie opens are broken up into 3 distinct stories\\, but to say they are unrelatable is not fair. As each plot has repercussions on the others. What this movie des exceptionally well is integration the old and new characters giving everyone their fair share of screen time. While JJ Abrams had to introduce us to these new characters\\, Rian Johnson gets the joy of being able to run with them and craft a fantastic story around them. Each character grows and changes during this movie becoming more of what you would expect of them. Rian Johnson has written these characters with Heart and substance each having their own weaknesses and strengths. Poe and Leia's Story\\, Finn and New comer Rose\\, and Rey and Luke.\\n\\nPoe and Leia's story are interesting and the backbone to the entire movie. Carrie Fisher turns in a performance worthy of an award. She was undoubtedly at the top of her game here. Her Leia comes through as Strong yet compassionate and hopeful. She is a Teacher but is not afraid to be strong with her lessons. Poe is her opposite as Hot-headed and impulsive the two plays off each other nicely and Oscar Isaac's Poe is much more fleshed out in this movie compared to The Force Awakens. He has much more to do here and it shows that he is a great addition to the world. He brings a lot of humor and attitude to the role along with a ton of emotion and uncertainty.\\n\\nMeanwhile Finn (John Boyega) and Newcomer Rose (Kelly Marie Tran) are paired together in one of the most unique and prequel esque planets we have seen since Disney bought Lucasfilm. While their story slows a bit when they reach Canto Bight it doesn't stay slow for long as the introduction of Benicio del Toro brings their story back into the fast-paced storytelling that this movie thrives on. Finn's journey is one of self-discovery and reflection\\, and John Boyega plays him perfectly with a cocky attitude and the brains to match Finn steals most of the scenes he is in. Him and Kelly Marie play well off each other as they are both loners and have this connection to each other. Their secureness plays through as you have a true connection to these characters. Rose especially is an excellent addition to this universe.\\n\\nThe Stars of this picture are undoubtedly Luke and Rey\\, Daisy and Mark play them to an absolute perfection. Daisy being strong yet unsure of herself and Mark playing Luke as a broken and beaten man. Mark Hamill plays Luke Skywalker with a refreshing and real take. Daisy and Mark are so great together each needing something from the other but unwilling to give or ask for it. The struggle of Luke Skywalker shows how much every day you must fight back your darkness. Even the most good and light side still has darkness inside them. This was a theme prevalent in the Star Wars Clone Wars TV Show. The learning and fight is never done\\, you must always fight for what you love and believe. Ridley who was great in the force awakens has added subtleties and nuances to the character. Frustration\\, loneliness\\, and kindness play big roles in her arc.\\n\\nKylo Ren deserves his own movie by this point\\, as he has become one of the most interesting villains Star Wars has ever had. Adam Driver plays him with the anger and fear\\, while showing vulnerability and heart. Driver is what makes most of what happens work so well\\, as his interactions with Ridley and Hamill and heartfelt and sincere. You feel for him as he is lovable and detestable all at once. You hate him for what he did to Han but feel for him as you realize he is in pain himself.\\n\\nThe story itself is Bold\\, Emotional and Engrossing\\, yet funny and lighthearted. I myself become emotional over a few scenes and things that happened. The Blend of humor and Drama here is expert level as there is something here for everyone. The story takes the Star Wars universe itself to new places. While the biggest complaint from The Force Awakens is that it was basically a remake of a New Hope. This does not suffer from that problem\\, sure it shares beats and familiarity with Empire. But it also shares beats with Return and goes into completely new and welcomed territory. This feels like a Star Wars story for the new generation\\, everything that has come before is wonderful\\, but the target is now moved to new Uncharted Regions of this universe.\\n\\nStar Wars: The Last Jedi is an exhilarating good time\\, with genuinely fun and fast paced escapism. It also looks inwards and challenges its viewers to look for new ideas and places to go. This movie will not be for everyone\\, change in things you love are hard to accept but the way this movie moves and explores new ideas and pushes the boundary of the Star Wars formula the more I am excited to see what comes next. Themes of loneliness\\, finding your place\\, idol worship\\, hubris\\, and ego. Rian Johnson explores it all with themes that run deep through the Saga as well. The idea that even the saintliest person is not infallible is an intriguing thought along with the question what could being a legend do to a man?\\n\\nThis has some of the best twist and turns in a Star Wars movie\\, Rian Johnson proves why he earned a whole trilogy for himself. The mastery in which this was pulled off is astonishing\\, he crafted a multilayer and unexpected film. But kept the heart of Star Wars intact\\, Rian Johnson fully understands what the Force and the Jedi are about\\, and he shows you through wonderful imagery and storytelling. The World of Star Wars is big and never ending there will always be stories to tell and mysteries to uncover we can only hope that's than can be half as good as Rian Johnson's Take on this Universe. I personally cannot wait for Episode IX and Solo: A Star Wars Story. Star Wars the Last Jedi is one of the Best the Franchise has to offer and a fresh Take on the series.","true":true}