{"101487":169772,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars Ep. VIII The Last Jedi    4\/5  Stars.\\n\\n i had a blast at Episode 8.  The cast was great.  The action and drama kept me entertained AND excited.  i was smiling or getting feels throughout.  Suffice to say i am delighted to report that The Last Jedi is probably the best Star Wars we have gotten since Revenge of the Sith. \\n\\nIt is not a perfect film.  It is certainly too long.  Personally i loved that it lasted what felt like 3 hours but the edit could've been much more crisp and still have told a full story.  Like every other Star Wars tale since the original\\, it is derivative and somewhat dependent on the audience already having  some minimal vested interest in the previously built universe (or galaxy far far away if you like). \\nThere is some silliness in here just for the kids\\, but i feel the humor was spot on and timed perfectly.  Some of the cultural\/political themes were a little heavy handed.  There are probably too many characters to keep up with or stay invested in. \\nThis is also not a stand alone film. Not even close. If you haven't seen the Force Awakens or even most of the other Star Wars movies\\, you could still be entertained but i think you will miss out on most of the subtleties and callbacks.  Some questions are left about the widening of possibilities in this galaxy that might seem to contradict what we've learned before\\, but i think they are good questions and serve the magic that had been somewhat lost to me.\\nIn short\\, there is no shortage of epic scenes\\, stuff to laugh at\\, and joy  to fill the heart of the Star Wars fan.  Some brutality included\\, and to be expected in a movie where the central conflict is a battle for the Galaxy.  Safe enough for kids\\, but it may be scary\\, intense or confusing as some of the characters are adult level complex.\\n\\nEdit- Standout performances from  Mark Hamill\\, Daisy Ridley\\, and Adam Driver.  With a good number of mentionable support players that i will not spoil.","true":true}