{"101487":128694,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"How has no one noticed not only is the movie getting horrible backlash but so is the latest game!!?? Really nobody looks at this and goes \\\"maybe Disney shouldn't have star wars.\\\" Bother directions went horribly wrong and people are still trying to find excuses for the \\\"new star wars.\\\" Why it that everyone confused on why people are hating star wars forget about the huge plot holes and insane direction they went with the movie? Yes the fan base is going to get upset no matter what\\, but that doesn't mean the excuses for why it's \\\"so amazing\\\" are more valid. Yeah fans expected it to go one direction and it went another. That in itself is not such a bad thing. However when you take a character such as Luke and completely curve ball his story even though previous history shows he would never do a single thing in the film that can make people upset. Was the movie in itself good aside from being a star wars movie? Maybe? If you like plot holes and constant twists then this is the film for you.  The idea is that should some of the fans expectations be met? At least a little. None of the character even reach the magnitude of importance or power the characters of previous films posses. If you want to break down why it's bad that can easily be done. How is the fate of the universe going to rely on a character that possess a fraction of the strength of an actual Jedi knight(Rey). Kylo? Really? I could fight him in my sleep. Give us a better reason to come back not bullshit excuses for an improvised star wars movie. Clearly this is a useless rant from a useless star wars fan. By the way the prequals we're great. Screw you HARDCORE fans. At least they tried to send to what fans wanted. (They messed that up.)","true":true}