{"101487":129509,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am no hardcore Star Wars fan but I have a great appreciation for the universe that it has built and the original trilogy as a story.\\n1. Rey has not earned anything she achieves in TFA and TLJ. They could have given a justifiable explanation if she were a child of the force.\\n\\n2. Snoke was the only character that piqued my interest\\, and they dispose of him in a pathetic way.\\n\\n3. They introduce so many new force powers without even the slightest explanation of their nature. This along with how they have characters that don't have to earn their mastery make a gimmicky tool that the writers can use to do whatever they want. If you have a unique system of power make it understandable and have its limits or everything can be explained away with \\\"cause da force\\\" and that is boring.\\n\\n4. This movie makes some political statements which is not a problem in and of its self. But if you are going to do it don't just make it part of a pointless addon on to the plot like they did here. Yes we know animal cruelty is bad\\, yes we know slavery is bad. What does it have to do with the urgent mission of preventing the complete destruction of the rebels?\\n\\n5.Luke is a mixed bag for me in this one. I am find with a perspective shift in the long period of time between the 2 trilogies\\, but you should not change his core character as you did. Luke was willing to walk into death itself if it meant a chance to save his father from the dark side. So why was he so willing to consider killing his nephew when he was just sensing hints of the dark side from him? I rather liked his view of the Jedi order in this movie and how it is not something the galaxy needs but that does not justify the complete character change.\\n\\n6. Kylo Ren is such a bad villain. I can't tale him seriously with how unstable he seems to be. Ya the dark side is powered by emotion\\, but its focused and refined anger and passion. Kylo just feels like a mopey teen throwing a temper tantrum most of the time. Rey kicked his ass in the first movie and he is the only real \\\"leader\\\" the first order has left. So even though the rebels were completely wrecked in this movie\\, as stupidly overpowered as Rey is\\, as long as she gets into a 1v1 she should win and yay first order should end.\\n\\nThere is much more that I could say but I will end with this. While this is probably the best visual masterpiece of a movie I have seen\\, I care more for the quality of the characters and story\\, than the visual flare that goes with it.","true":true}