{"101487":145820,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've been a Star Wars fan my entire life.\\nI did not like \\\"The Force Awakens\\\" to begin with. It had it's moments but JJ Abrams just didn't seem to be a real fan of the saga. \\nThings like: Stormtrooper now almost equals Sith in fighting skills. Rei more powerful than the villain without zero training. It's not some small things. It just breaks up everything of what made episode 1-6. It doesn't follow how the force works.\\nJJ Abrams\\, watch \\\"Rogue One\\\" Vader fighting scene. Thats how it works in Star Wars universe. I know Kylo isn't fully trained by that moment but it doesn't matter.\\n\\nThe things that was good with TFA was that it opened up for an exciting follow up. Now a year later\\, it came. \\\"The Last Jedi\\\".\\n\\nInstead of using the exciting threads TFA threw up in the air for some smashes for the sequel. The new scriptwriters didn't seem to like them. They put them to the ground and threw them out of the window. For what? Nothing.\\n\\n\\\"The Last Jedi\\\" is a mess that kills of cool classic characters and replaces them with nothing. It's a shallow story. Why would I like to see episode 9?\\n\\nWithout writing an essay on how bad this was. I hated that:\\n-The strong part of Star Wars has always been the dark threat\\, where is it now? Weak Kylo?\\n-Who was\/is Phasma? (I'm sure she makes a pointless return.)\\n-Who was Snoke? All that CGI for what?\\n-Luke talks about \\\"lasers swords\\\" instead of light sabers.\\n-Mary Poppins. (Carrie Fisher as Leia did an excellent job though.)\\n-Las Vegas in space. Why this subplot? To make a point for the end? Cut it out.\\n-\\\"The Return of the Jedi\\\" scene that almost ends like in \\\"The return of the Jedi\\\".\\n-\\\"Space Balls\\\" scenes. (That beginning. No one laughed in the theatre.)\\n-Luke tosses his fathers old lightsaber over his shoulder like a joke\\, the one he held when he once lost his hand. OMG scriptwriters!\\n-Kylo is joking with Rei about her parents right? All that build up in TFA for this?\\n-Every guy is a douche apparently.\\n-Rose.\\n\\nI liked that:\\n-Finn feels more chilled and natural as a character in this one. (He was just out of breath in TFA.)\\n-Purple hair was right and not Poe. (The only working twist in this movie.)\\n\\nJust a thought...\\n\\nHow cool had it been if Snoke discovers that he took the wrong apprentice in Kylo\\, learning that Rei is of possession of larger dark side of the force. He uses Kylo to get to Rei and get her to kill Kylo cause he is the lighter and weak one. Now we have a crazy strong villain in Rei. Now that would have been something for episode 9 to continue... I would have seen that movie.\\n\\nI'm sad to say that \\\"The Last Jedi\\\" was bad for Star Wars franchise. It hurts the saga badly and forever.\\nI wish someone else made this movie.","true":true}