{"101487":111752,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"By far the worst star wars movie of all time. It took everything that Force Awakens set up and just threw it away. It has terrible writing and is riddled with plot holes.\\nLike many\\, I have been a die hard Star Wars fan for as long as I can remember. I have watched every one of the original 6 countless times. The seriousness of my fan hood is what makes me so deeply offended at this film. It is filled with inconsistencies with the rest of the Star Wars Universe. For example\\, how did Rey become so powerful so quickly? The only canon example we have of an adult being trained as a Jedi is Luke Skywalker. Luke is literally the grandson of pure\\, raw force power. He\\, therefore\\, must have the second highest midichlorian count of any person in the universe\\, behind his father Anakin. After approximately 5 months of full time training with Yoda\\, probably the greatest Jedi teacher of all time\\, he could not lift an X-Wing. Rey\\, whose parents are apparently nobody\\, can lift 50 tons of rocks after training for 3 afternoons with a master who has cut himself off from the force? And Rian Johnson's poor attempt at an explanation is just insulting to me as a fan. Snoke says that because Kylo was so powerful\\, his light side equal must rise? In episodes 5 and 6\\, Luke is the only one practicing the light side of the force. Meanwhile\\, the dark side has both Emperor Palpatine and Darth Vader\\, the two most powerful Sith in a millenia\\, and still Luke is less powerful than Rey? Ridiculous. Rey has a hero's story with all of the middle cut out. She has a rise from ordinary to powerful without much effort or struggle\\, compared to the other heroes of the Star Wars Universe. \\nAlso where did Snoke come from? If he's supposedly so powerful\\, where has he been for the last couple hundred years? Why didn't we see him in any other films? He just drops in out of nowhere\\, with no explanation provided by this film\\, and then dies after 15 minutes of screen time? \\nMy final point of inconsistencies with the other Star Wars universe is that the fall of Luke is completely unbelievable. In the original trilogy\\, Luke's belief that Darth Vader was never beyond redemption was unwavering. Even though Vader was his own father and hurt him more than anyone else could\\, he always believed in the good in him. Now he has one student go rogue and totally gives up the force? It completely weakens his character and ruins his story.\\nI could go on and on and on about all of the horrible parts of this movie. Rose is the worst. Her \\\"romance\\\" with Finn is awful. Everything on the stupid gambling planet was boring and unnecessary. Terrible purple haired lady and her forcing Po to rebel through her lack of communication was awful. The entire slow motion space chase was just boring. Don't even get me started on Leia flying through space like Marry Poppins. Terrible.\\n\\nThe only redeeming factor of this terrible movie were the scenes between Kylo and Rey. These alone were well done. This is the sole reason I have rated this film as high as one star.","true":true}