{"101487":140826,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-08","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I think this was a bad movie because it is hard to find something to complement & left you asking a lot of questions of why did they make these movie choices. You could not just watch the film and enjoy it without questioning the logic of the director.\\n\\nThe visiuals -- were okay\\nThey were not awe inspiring as previous star wars etries to me. dispite getting to see a casino & a rebel bunker with white powder land terran over red earth\\, there was no  new worlds visualy explored. There were space ship battles but none that fans would revere in strategic star wars battle lore as purposeful ( mostly just the Millennium Falcon giving support). Yoda as a puppet failed. Space flying Princess Leia was cringy. Failed Jedi Master now hermit Luke Skywalker's cowardice & alien milk drinking was so nasty and so sad. What was with multiple mirror reflections of Ray in a dark hole signifying the game of nothing.\\n\\nThe plot execution -- was abismal\\nPlot holes everywhere & story archs that served no purpose the story telling was realy poor dispite the actors being likeable and doing a good job. I get the Star Wars Universe has loose logic at times but not taping disregard for coherence.  The low fuel speed chase made no sense because the first order wasn't low on fuel\\, had more ships & should have been able to surround them or attack them with smaller ships or utterly decimate them if the Rebels had no way of speeding away. poe such an unexperienced military Rebel Flight pilot this far into the Star Wars lore\\, they have had time to train their people. Why was Poe not told the rebel plan causing half the Rebels to die & wasted screen time hours on a mission that didn't work at all. Why did Rey go find Luke just to leave him where he was now with no need for him or the erased jedi order. Why did Luke need a harpoon to fish when he could have just lifted it up with the force. Why did the new Asian girl save finn over all the rebels in a random love confession. Why did they go for a specific code breaker and get a random one. Why was the hyperdrive an effective attack weapon. Why was no new intelligent alien race introduced\\, so what if porch cute & not food. Princess Leia should not have survived being blasted into space. The jokes didn't fit\\, I don't mind going for a new Star Wars feel but they missed the mark.\\n\\nThe actors - did good\\nThe actors did very well that's where the half-assed are just comes from. But why did none of the characters have very much story development it seems like a waste raise and nobody okay kind of boring. Snoke is just some guy that died very easily. Everyone seems to be unimportant in Star Wars now like a story with no main character.\\n\\nNew franchise direction promoted -- I dont like\\nAll powerful Rey seems to establish the force is now cheapened into a cheap magic trick that is no longer that special. Hyperspace tracking was distasteful to me in the way they presented it. They couldn't make a single new ship to add to the last of the rebels & they could only showcase the Millennium Falcon giving support. The Jedi orders temples are completely wiped out. Kathleen Kennedy herself stated character development come second to the message they're trying to tell and it's not showing very well in my opinion for this movie\\n\\nThis movie makes you really appreciate George Lucas his first three movies and the next three prequels much more I wish you can come back with all forgiven. Are we done expanding on storytelling drama of the Star Wars universe and only showing Petty star ship battles and lightsaber battles a Time\\, what about the story\\n\\nThere way more discrepancies the list like Finns ability to Pilot out of a coma winning the PBS video clip fly anything but I think ive got my fair point across. This movie was legendary crap.","true":true}