{"101487":194400,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Welcome to the latest Diatribe about The Last Jedi!!!  I have been so disturbed by this movie I decided to make sure I was not alone.  So rather than coming out straight away and blasting at it\\, I did a cool down period of 4 weeks just reading up to see that I was not alone.  This 2.5 hour debacle of a movie torments me.  I went to the bathroom 2 times during the movie and I have never taken a bathroom break in my life while watching a movie in a theater (I watched Buck Rogers in the 25th century without a bathroom break GO TWIGGY).  I needed a break from the epic destruction going on.  I am a massive but easily pleased Star Wars fan.  I have loved every movie including Force Awakens and Rogue One which I would rank them among the middle to best in the series (both by Disney).  I have watched them both over and over with my children.  I love Space Balls as well.  I have to pile it on to the 27 plot holes article I read online.  Message to Disney is: Why?  The world is in bad enough shape. Why destroy Star Wars over the Holidays?\\n-Force 'FACE TIME' now that we have that and everyone can use the force.  Future movies need split screen so we all can just FACE TIME each other magically just like 'Days of our Lives'.  In FACE TIME you get to look into the other person's future and past.  Is this a Soap Opera that Rey can teach (oh wait it takes a minute to learn no training nor teaching it can just happen) everyone to use\\, that will solve the problem for everyone.  \\\"Can you have a force group FACE TIME?  Once they figure out how to see backgrounds and GPS location of the force FACE TIME then no one can hide or block you Gotcha.  Great idea for parents keeping an eye on the kids.\\n-Force 'Light Sabre remote control' why do you have fencing fight battles where your body is exposed to being injured.  Just manipulate the light saber at a distance and attack that way like you did against Snoke.  I mean maybe hide in the corner and manipulate light sabers and blasters to kill off the enemies remotely floating through the air.  Wield everything remotely that is the way to go.  Ok no more need for Light Sabers little prisoner boy throw some lightning.  So Snoke is 1000 years old and all powerful sensing everything across the entire galaxy but not 6 inches away from him.  So this was his final day hmm...He could not see that coming on 365\\,000th day of his life\\, Supreme Leader Lebowski (Snoke) is dead.  That's a bummer dude that is a bummer dude.  Do not know who he was so who cares.\\n-Force 'Bubbles' Apparently Leia has the same SpongeBob fascination with Bubbles.  She can create a bubble and fly through space.  Hope everyone learns that one.  Since everyone can use force now of course.  Just have everyone on fleeing Resistance ship go into their space bubbles and fly to the planet.  Enemy might think you are dead and not shoot at you.  No ships in future movies we attack by force bubble.\\n-Force 'Apparitions' So I guess you tele-project yourself to anywhere at any time.  You can physically touch your sister's hand (leia & luke) and she feels you.  You can physically touch Rey and Kylo hands.  Is this Ghost with Patrick Swayze & Demi Moore?  I was waiting for some clay and Unchained Melody to be played...Oops Daddy Luke is home break link.  Ok now IMPORTANT SAFETY TIP we need to switch it off apparitions before a light saber strikes you.  Oh but wait suddenly after shutting it down you feel sort of ill and evaporate?  Change title to Ghost Wars but War is bad so maybe find a replacement for Wars.  Love Yoda but as a ghost\\, he can interact with reality and cause damage in the real world.  Ok add back that to anyone who has died so they can do this: Luke\\, Obi Wan\\, Qui Gon\\, Han Solo\\, Darth Vader\\, Anakin Skywalker\\, the emperor\\, Snoke and Yoda will all appear and fight in the next movie. \\\"I'll Be Back!!!\\\"  Oops wrong movie.    \\n-Hyperspace tracking\/Cloaking decryption- The First Order can track everything now.  Then why run anywhere why try to hide at any time in the future.  They know where everyone is so there is no secret place anywhere for anyone.  Going to be interesting films ahead so now Big brother is now always watching.\\n-'Kamikaze & Suicide Bombing' is the answer- Rian you wanted to open the Star Wars fan base to everyone as you quoted.  Maybe offer free tickets to ISIS & Islamic radicals who blew up the World Trade Centers and give them awards.  In some religions suicide is a sin.  But not the Last Jedi in which it is praised and glorified for Holdo.   The second Finn attempt is thwarted because you wanted to stop the death of your lover but allow the Big Gun to kill everyone else.  This weapon was supposed to blow up all your friends but just drilled a hole in a wall.   Lucky move great job Rose!!!   Give Rose (Kate Blanchet) an axe and change Finn's name to Jack (Leonardo) my heart goes on\\, Titanic\\, Yippee!!!  \\n-The Very Big Gun on Craite- Hmm they have this & all the walkers to fight the resistance\\, and transported it to the planet to use.  Looks like a lot of trouble moving it on land with the wheels and the hooks on the side of the gun to stabilize the projectile.  But in space on one of the ships it could easily be turned and aimed at the Raddeus or the base on Crait.  It would have crushed the resistance and obliterated the shield having more power being compared to the Death Star gun.  But instead they must have made First Order FACE TIME phone call to someone and say hey we need to get a planet destroying weapon to a planet in order to kill off the last 14 people on Craite.  Wait we are using a death star weapon to kill 50 odd people.  Dr. Evil would bring sharks with laser beams and say\\, Right?  Big Gun could have been shot from a ship above in space during the 18 hour gas reeling experience\\, but it gets brought to planet to kill 14 people.  At least in Attack of the Clones troop transports are being used effectively getting people to the front lines.  And yes Attack of the Clones is a way better than this movie. \\n-Arms Dealers Rich?  Maybe Rose is ticked off she is not getting paid enough in her current job?  Because the arms dealers charge the resistance too much margin for weapons.  Empire and First Order have enough domination to just take what they want.  Nazis & Soviets do not over pay for weapons they own everything and make it themselves.  Did Disney make Rogue One?  Was the story not about enslaving scientists?  Oops that is a movie that had a plot.  Now it is just getting insulting.  Rose loves the animals\\, hates weapons development & war\\, and is a pacifist.  But she works for the Rebellion\\, & never would let anyone defect ever because you need to stay in the war\\, and her sister is a navigator bombardier HERO!!!  What?  Are you serious?  OMG!!!  Maybe the Canto Blight (should be bight) thing could be drug dealers where the margins are larger.  Weapons have high costs for testing\\, manufacturing\\, materials\\, performance demands\\, and development that can be expensive with over run budgets.  Oops can't do drugs which kill and hurt millions of people because Leia died from drugs in real life. \\nRian Johnson's new famous quotes are subliminally: 'let Star Wars Die. Kill it'\\, and 'it is time for Star Wars to end'.  Kennedy is a lunatic for having Rian Johnson direct a sci-fi space movie when he has no clue about science.  I have lost interest in star wars and am sure that I am not part of intentional dissolution of the traditional Star Wars fanbase.   Because of this movie the Star Wars franchise will take a massive body blow.  I cannot decide which one or if all of the following are motifs for this movie: Comedy? \\, Love Story? \\, Politics?\\, Social Justice?  I was not fulfilled by the traditional Star Wars motifs.  Fantasy: No real fantasy (force religion Jedi or Sith discarded) It was just like a strange war movie.  Science Fiction: Not really because it always seemed like they were not in space but\\, if we drop the word Science then the movie definitely is Fiction. Action: Racing animals\\, ships flying\\, and some light Zorro like hand to hand combat no one ever in real danger so not enough and too slow to call this action.   Thriller: I never felt a threat plot was so flawed\\, no cliff hangers meaningful cliff hangers\\, never got a sense of danger.  Only Cliff Hangers left to answer are: Who does Rey falls in love with?  Seeing how the feminine spin place a bet the house Rose.  JJ could do something like that and grow an audience.  Next Does Kylo take his pants off in next movie?  Could be interesting for JJ.  All moments hyped implode into nothing\\, Rey in the underwater cave nothing just a bunch of mirrors and finger snapping.  If you got high before the movie you might have liked this.  Rey meets Luke whooped dee do their goes the saber\\, Snoke loved seeing his tongue out on floor body chopped in half (Monte Python like)\\, Luke nothing milk in the beard yeah\\, Phasma will be back a woman cannot die in the Last Jedi impossible\\, and then pretty nobody did much of anything memorable.  Solo will be the first bust.  Disney is doubling down by giving Rian (Holy Ouch Batman) the entire next triology?  In Rian's next series\\, I imagine 3 billion force user mutants Face Timing each other\\, looking into future & past like Looper\\, then traveling in force bubbles not using ships\\, remotely operating weapons\\, and then when convenient they just become force apparitions and electrocute people.  \\nRotten Tomatoes all 4 star or better reviews are like 40 or less words with complaints contained in them.  I personally read about 1200.  So bots dragged the scores down?  Why is my first review ever this long?  Why are so many of the bad reviews lengthy?  I have a theory\\, RT audience score should be at 20% liked it so it is being propped up.  The bots army were deployed to prop up the positive reviews.  I was glad Force Awakens brought in women\\, Hispanic\\, blacks\\, and now Asians to Star Wars.  I seriously and honestly have no problem beating up the dumb old white guys either in last Jedi\\, it made me laugh after a while.  Animals are great and should not be disrespected\\, be a vegan it is healthier\\, failure is ok get back on your feet (great message)\\, SJW(In Star Wars?)\\, Mary Sue(no issue liked the Star Trek Mary Sue better)\\, milk does the body good\\, jedi\/sith or religion in general is bad (disagree with that)\\, women can be all powerful (ok)\\, killing a family member is bad\\, suicide bombings are good (disagree)\\, old people & Luke are grumpy and misguided (wrong)\\, and orphans are people too (great).  However\\, the story is so unfathomably an abomination.  I laugh when people complain Poe was not allowed to know the plan because there is no plot\\, plan\\, editing\\, story\\, or characters to like or left to ruin!!!  If I align the ending of Empire Strikes Back with The Last Jedi and it looks like the following.  In Empire Strikes Back it was so powerful and you left angry that the bad guys won and just so emotional about everyone you saw at the end of it.  The heros and the villians were together reflecting on what had just happened and every characters story meant everything to audience.  I could not wait for next movie to see our hero's back in action.  In the Last Jedi: Leia at the end proudly says on the Falcon. \\\"We have everything we need.\\\" A 50 year old ship\\, a broken light saber\\, a super old general\\, a garbage man\\, a mechanic\\, a very old Chewy\\, a couple of pilots\\, some droids\\, and a grand total of about 14 resistance people.  Leia what is needed immediately is to turn around because the audience no longer cares about anyone on the Falcon (except for Chewbacca put him and droids in an escape pod) then hyperspace\/kamikaze into any first order ship you could find and we call it a day.  HURRAY!!! GREAT TWIST!!! SHOCKING!!! THE END!!! ROLL THE CREDITS!!! THANK YOU!!! \\nFinal Quote to Disney executives and their Star Wars Franchise:  \\\"I have a really bad feeling about this.\\\"\\n\\nStar Wars the Last Jedi- So sad that the critics are paid off by Disney.  THIS REVIEW IS AIMED DIRECTLY AT RIAN JOHNSON BEING INEPT.  Somehow it is critically acclaimed a good movie by top critics.  I will give you the 50 things that are so very wrong in this movie.  I will not reference any SJW\\, Mary Sue\\, or political angst in this review.  That is what Hollywood is using as its defense weapon calling on people.  Apparently\\, Disney is trying to widen the Star Wars audience\\, and I will not play into it as the audience is massively shrinking now.  The story is so pitifully bad.  The character development is pretty much ruining every character in this film.  All characters pretty much went full speed backwards towards unlikeable.  Best Actor in the film is R2D2!!!  All people we be referred as 'person' as I have not attachment to them anymore.\\n1.\tLuke person - He wants to be a hermit and left alone.  No sense of ruining him.  Just leave him with the books.  If there is intent for him to rise up one more time\\, then do it properly.  Send him off like a real hero.  Luke looked to the stars as Yoda said once.  Now a total reversal hiding in a hut.  Luke is a loser now and no longer a hero.  Rian you blew it.\\n2.\tRey person - Just take the books and move on.  She has a great voice and acts well\\, but directed into nothing.  Terribly utilized...I brought a girl to Force Awakens for Girl power\\, now it is just a disaster and waste of talent.  Terrible job Rian.\\n3.\tChewie person - Han just died.  His lifelong companion gone no anguish\\, he seems to be doing just fine.  Chewie is one of the best character in Star Wars the Last Joke.  Rian eating a Porg in front of Children you blew it!  It is Star Wars who cares when they eat or drink.\\n4.\tFinn person- Walking around in silly suit but totally healed and ready to go.  Can't wait for Pacific Rim he will do great.  But this Jedi Joke movie is debacle which cast him being a loser\\, just a deserter with no courage unless cornered.  You blew it Rian.\\n5.\tPo person- Glad Po had Hux person phone on his speed dial in his X wing.  I come from a military family.  Once you have an enemy fighter which has invaded your space.  You blow it away.  All gunners would be at their posts none in the lunch room because you are actively engaging enemy.  Boom Po dead.  Guns Missiles would have radar lock.  Instead Po does several moves to take down the Dreadnaught.  This was so unbelievable and I laughed at what was going on.  This action wreaks with bad jokes as 1 guy faces an entire fleet and he should have no chance.  Rian you blew it.\\n6.\tBomber person-  Bay doors are open she is struggling with the switch.  She should be dead and sucked outside.  Now bombs with doors open she releases the trigger bombs would not fall.  The vacuum had already neutralized in the Bomb bay a couple minutes before.  Bombs decoupled would float in the bay.  Dumbest scene to ever grace the screens.  Mini Me survives when Austin poops him out to space.... that is something for Leia later in the story.  Rian you blew it.\\n7.\tLeia person- The sheer concussion from the strike to the bridge of the command ship should have killed them or knocked them unconscious\\, cold and the lack of oxygen would instantly debilitate some to perform any action.  I did figure this one out.....Ok back story on female Skywalkers..... Once upon a time in a galaxy far far away\\, it all began with Good Witch of the North Glinda SKYWALKER.  Glinda mother of Amidala mother of Leia..... The grandmother of the Skywalkers....She has the bubble thing down well it was passed to Leia.  So\\, it was instinct for Leia to use the bubble fly powers.  OMG Rian you blew it again.\\n8.\tLeia person- Flying back to ship in 0 Kelvins....-373 Fahrenheit.  Then there is no compression vestibule chamber upon re-entry.  They just open an external door to space and bring her in.  Why are people watching out the window for Leia???  You just got hit\\, get to your battle stations\\, fighter jets\\, or guns to take down the enemy outside.  NOT TODAY WE ARE GOING TO STAND AROUND THE WINDOW AND LOOK FOR MARY POPPINS TO FLY BACK.  CMON WHY WOULD THEY BE WATCHING HER COME BACK.  So stupid!!!\\n9.\tHux person- Always yelling.  Storming around like a big baby.  Not sure that you have a character that is constantly angry or annoyed.  Never heard the Hux plan other than wait to let them run out of gas.  A huge military command of hundreds or thousands of officers and they do not sit down and discuss what to do next.  So sad.  Rian the First Order is so useless it makes Space Balls look better.  You blew it Rian.  \\n10.\tAkbar alien- Discarded.  You blew it.  A fan favorite flew out the window.  I know you forgot about this and the fans picked up on it.  You blew it Rian.\\n11.\tPo person-  Plan to get a code breaker.  Sorry all military wars have intelligence agencies people working nonstop to create preventive weapons to avert the hyper drive tracker.  Why do you have to go find some criminal?  Old Star Wars movies had old codes and Botham's finding out the emperor was overseeing construction.  Just so you know in the United States of the 24 million Federal employees 900k work in intelligence.  What a joke Rian do some homework!!!\\n12.\tMaz alien - waste of time.  How does this alien form film herself while she jumps around like Kermit the frog?  Rian you blew it again.\\n13.\tFinn & Rose people - Parking ticket on the beach enough said.  Right out of the Jersey Shore.  Seriously you want the movie to teach people to park appropriately or go to the dungeon.  Rian really weak.\\n14.\tFinn & Rose people - Ride a couple of racing donkeys without a harness and never fall off.  I dated a horse lover you would fall off on those turns.  You can't ride things like that I have been there.  Again another debacle in your story.  Rian Canto Bight was a joke.  Rian please face the facts your movie was terrible it has no purpose.\\n15.\tFinn & Rose people - Leave child slaves behind.  That can't be good.  Wow this was a chance to do the right thing.  But you decide let's leave the kids as slaves behind.  So stupid so useless.  Rian you are the worst story teller ever.\\n16.\tDJ - breaks code gets onto command ship.  Why pay him and release him?  If someone breaks into my house he should be arrested and considered very dangerous.  You paid him Wow!  Cause he turned them in?  Rian this is pathetic.\\n17.\tOuter space chase scene- Ok Big ships slower than little ships.  Fighters did penetrate and strike target.  Why not keep sending the fighters?  Running out of gas?  Still using fossil fuels on mega ships not sure how that works?  Fighters use fuel because I saw them tanking up on A New Hope.  When ships run out of gas they fade backwards why space projectiles should continue in motion.  The entire bit is just stupid screen shots.  You have 18 hours until they run out of fuel.  You could have ended it earlier.  Snoke has a Giant Looking glass in throne room.  The room is a throne room and have a looking glass.  Come on what a joke there is so much more that should be in a throne room.  Is this the wizard of Oz with the crystal ball?  Rian all a joke.\\n18.\tRey person- She goes for a swim in a hole to a lagoon.  Lived all her live on a desert planet but a perfect dive and recovery.  Instantly Michael Phelps with a perfect dive and no fear.  You cannot make this up Rian.  You blew it again and can never explain.  Rian you missed that one.\\n19.\tRey person- Big line of Rey persons snapping their fingers.  Makes no sense.  She goes to find something instead we have a bizarre matrix scene with no answers.  Call me shallow but it was totally useless.  Unless that is a setup for JJ Abrams to have Rey be the next clone in army in episode 9 just like Jango Fett that is why there is so many of her.  Rian waste of time suspense was building then died immediately.\\n20.\tRey person- goes to supreme leader chamber to taunt rey to see her friends suffering even worse remake seen this before.  What is the catch? If she turns to dark side he will let the friends go?  Entire thing makes no sense no motive for her to go to the Supreme Leader.  Room is totally full of people that can wipe her out.  Why wait and not just kill her.  Does she have a back story some value is there something that combining Rey and Kylo that dominates and threatens the galaxy.  Not sure I get this scene at all.  Rian you cannot tell a story.\\n21.\tKylo person- Kills supreme leader with no back story.  Threat is now gone\\, ding dong the witch is dead.  So now there is no army being assembled\\, no big bad threatening weapon\\, no menace to humanity.  Just Kylo person in love with Rey person.  Kylo person is new #1 bad guy but Hux person almost kills him.  I wish he got the shots off and killed Klyo then we would be out of the mess.  Hux kills kylo and keeps Po on speed dial to tell him about it.  Rian\\, you missed another opportunity to do something.\\n22.\tKylo person- Pleads for Rey person to switch to evil.  It really doesn't matter what difference if she does turn.  Everyone in the entire galaxy can acquire force skills.  Not a Star Wars story but a love story.  If they combine forces does something magical happen could they destroy planets with the force?  I came to see Star Wars and I watching Ghost(Demi & Patrick)!!!!\\n23.\tKylo \/ Rey Facetime- Ugh really so uneventful\\, reminds me of a soap opera.  Luke reacts to it like a sex scene and wants to scream this has no business in Star Wars Rian.  Oops he did it again.   Demi Moore and Patrick Swayze in Ghost was not looking for that big joke Rian.\\n24.\tPo person- Not knowing the plan starts a mutiny.  Since no plan announced I am waiting for the explanation that there is secret imposter spy onboard or the room is bugged.  So the leadership keeps quiet....nope it is some stupid writing.  That could have been interesting to have an imposter.  Instead it is just another day\\, one person calls the shots not sure why?  You blew it Rian.\\n25.\tHoldo person- Not wanting to tell plan to anyone.  Most everyone gets killed anyway so whatever plan it was useless.  Both plans were stupid and flawed and just bought time for the movie to showcase cinematography and imagery.  I mean here is where Luke could have come in and saw the 2 futile plans and save the day.  Instead he is drinking milk\\, fishing\\, and sleeping or whatever he does in the hut.  Rian why?  Rian such a joke\\, another chance to salvage the movie.\\n26.\tHoldo person - Kamikaze strike.  Somehow it is perfectly angled to knock out bad people and good people escape.  So Finn and Rey survive and escape where the bad guys suffer.....so stupid and unplanned crap.  I mean Holdo knew exactly where bad guys were to disorient them and let good guys get away free.  Not buying it.  Now that we have Kamikaze\\, we just need to pin a location beacon on Kylo or Rey and then kamikaze Imperial Destroyers into them.  You failed again Rian as the story is no longer interesting.  In some cultures\\, suicide is a bad thing.\\n27.\tBB8 Droid- He is operating and AT- ST.  Ok I have battlefront and know the cockpit.  There is no way a droid could do that.  He climbs up into AT-ST.  Rian this is insulting so bad.\\n28.\tCaptain Phasma person-  She loses again.  Must need to up the game there.  Why fight hand to hand you have the troopers all around Finn & Rose just shoot them.  Nope just like Austin Powers with the Lame guard in the jail cell.  You lose again Rian.\\n29.\tC3PO- Red arm last week.  Gold arm this week.  Not sure what that is all about.  Rian you are lost in space....does not compute.  No detail orientated Rian at the helm.  You blew it Rian.\\n30.\tLandspeeder attack- Oh my.  Those junk things were just to draw a bunch of cool lines on the red planet against Walkers.  I mean that is suicidal to think they would stand a chance.  No tow cables nothing to take down walkers.  Helpless assault with no real chance of survival.  Just play the Mega Millions or Power Ball or same odds attacking with a water pistol.  So stupid Rian.\\n31.\tFinn Person- Attempt to kamikaze big gun save the resistance door and give them refuge and buy a lot of time.  Would have been great to see him go out in glory.  Instead we allow the gun to fire and somehow it all works out.  Rian what a joke movie.\\n32.\tRose Person- Wipes out Finn person on his speeder.  Makes a crazy statement wants a kiss right in the middle of the battle field.  They are now at the feet of the walkers several miles from the base with no known cover.  Walkers steps are like them running again this makes no sense.  They should have no chance of survival but they do.  Big gun then blows open the gate. The plot hole is as big as the sun.  Ryan the scene was just imagery\\, storyline out the door.\\n33.\tLuke Person- Shows up as an apparition.  Why all of sudden does he care at the moment of peril.  Does he just want to see his sister?  Han dies he did not know.  Luke is now a washed up sadistic\\, loser. This little twist apparition buying time at the end of his life does nothing to help you.  RIAN YOU ALONE KILLED LUKE AND TURNED HIM INTO COLD BLOODED KILLER\\, THEN BURIED HIM IN DISGRACE. THIS NOT A FORGIVEABLE THING.\\n34.\tKylo Person- Has a series of temper tantrums throughout movie.  Crushes a pretty cool mask.  Without mask he doesn't seem evil at all.  Kylo seems like an ordinary Joe with good hair.  Not scary not evil just a guy with an anger management issue.  Switch him out with Adam Sandler.  Rian failed again.\\n35.\tYoda person- He comes as a force ghost interacts with reality to strike lightning on the Jedi Library.   Rian introduces interactions that change everything.  YODA NOT RUINED AS A LIBRARY BURNING MENACE.  Luke should do the same as the apparition on Crait and interact with reality.  This ability makes life and death negligible.  Everyone can come back and do whatever they want.  You opened a terrible doorway here.   Rian you failed again.\\n36.\tYoda person - Calls legendary books a boring read.  That is a downer.  Rian you killed another character.  Now Yoda sucks too.  Rian I now hate Yoda for turning his back on Jedi temple and text.  Thank you great job.\\n37.\tLuke person - promises 3 lessons and gives only 2.  Missed that one Rian.  I could give you a lesson Rian.  It would be to find a new career.\\n38.\tChewie person - You got to eat sometime.  Not exactly and vegetarian\/agrarian island to farm.  Why did Luke not share that Giant fish he carried over his shoulders.\\n39.\tLuke person- He fades away\\, even with the mechanical arm.  I would have thought the arm would stay behind when he enters the after world.\\n40.\tLuke person- Attacking Kylo.  When house is brought down lightsabers are locked in battle between the 2 of them.  Would they not strike and hurt one another\\, lying atop one another in the collapsed hut?  Rian you have to be the worst story teller of all time.\\n41.\tLuke person - Why is killing Kylo the option?  You have a bunch of Jedi training in a school.  You are the head master setting the standards and you just barge in at night to kill.  How do you explain that Leia or Han. Does any teacher do such a thing?  Great Job Rian maybe your movie inspired people to kill their students at school. \\n42.\tLuke person- Why did skin fall off mechanical arm.  Any reason?  He apparently becomes one with the force and disappears with him.  The arm is steel and should not expire with human flesh.  Now you stuck on endless round tables trying to explain what happened in the movie.  You cannot explain it Rian.  You blew it Rian.\\n43.\tKylo Person- why does he not recognize that Luke has the light saber of his father Vader which Rey had in the fight they just had on command ship.  So he fights the apparition Luke.  So stupid again.  Rian you missed it.  Rian Rian Rian please stop making excuses for this terrible movie.\\n44.\tKylo person - enters base and has a flash back about the dice.  No story on what the dice signifying as bad or good old days to young Ben Solo flying with dad on the Falcon.  Not sure at all.  The story just dies with a relic where people don't really care.  You are playing games to show you know about Star Wars but truth be told the moment was immediately lost.\t\\n45.\tRey person - exhibits super Jedi powers and rescues everyone.  Did see that one coming....\\n46.\tRey person- Stole the ancient books.  I sure they are written in plain English so she will not have a problem understanding what it means\\n47.\tLeia person- We have all that we need at the end.  Luke is dead\\, 98% of the resistance is now destroyed and you are satisfied with the result.\\n48.\tKylo vs Luke fight- Stupid he sticks light saber through him and says something like you will regret this.  Total silliness.  Again makes no sense.  So\\, he hurts Luke somehow as an apparition.  Now the force is just taken a severely bizarre turn.\\n49.\tMillennium leaving at the end -  None of the ships above Crait spot them or chase them.  How is the Millennium Falcon just flying around and owning the skies?  They should be sending 1000's of Tie Fighters to take it out.  Then they land at the back door pick up their friends\\, just get up and fly away.  Meanwhile the entire planet should have been blockaded by the first order.  Just 3 fighter chased it.  It is clear Rian forgets there are Armies or people support the leadership.  If they are not really part of this get rid of the props!!!\\n50.\tPostlude- There is nothing left to speak to.  The threat is the first order is unscathed in the movie.  Everyone can use force so who cares if you turn to one side of the other.  No balance anymore required.  So\\, if Rey turns bad just get a GPS tracking device on her & Kylo and then hyperspace kamikaze them.  Really this episode is a total failure.\\nThe Force Awakens was a great reboot.  JJ Abrams\\, Mission impossible III\\, Star Trek\\, and Star Trek into darkness loved every one of them.  He knows science fiction\/space fantasy well.  I sincerely hope JJ can fix it.  \\nNEWS FLASH: Rian Johnson next Director of the next 'Rocky VIII'- Storyline\\, Rocky turns to Ballet and wears a pink Tootoo and is competitively trying to win the ballet championship.  Lesson is how to destroy characters.   \\nI WILL NEVER WATCH A RIAN JOHNSON MOVIE AGAIN AND AM JUST TRYING TO RID MYSELF OF THE LAST JEDI NIGHTMARE.  UNLIKE RYAN RECENTLY PLEADING TO WATCH IT AGAIN AND UNDERSTAND IT.  IF I WATCH IT AGAIN I WILL LOSE MY MIND.  RYAN JOHNSON SHOULD RETIRE FROM THIS NOT SURE HOW HE STILL HAS A JOB.  \\nJJ ABRAMS TO THE RESCUE.\\nMy Movie Rankings 10 being best 1 being worst\\n\t10 - ET \\, SAVING PRIVATE RYAN\\, LORD OF THE RINGS SERIES\\n\t9 - INFINITY WAR\\, BLACK PANTHER\\, STAR WARS 4\\,5\\,6\\n\t8 - ROCKY\\, JASON BOURE SERIES\\, STAR WARS 7 & ROGUE ONE\\n\t7 - STAR WARS 1\\,2\\,3 WONDER WOMAN \\n\t6 -TBD\\n\t5-TBD\\n\t4-TBD\\n\t3- THE LAST ACTION HERO\\n\t2-EMOJI\\n\t1-STAR WARS THE LAST JEDI\\nI feel fulfilled.  I have only written one other review in my life time but this take the load off my chest.  I am going to do everything I can to rid the memory of ever seeing this movie.   It was opening night so this is painful circumstance that still hangs in my head some 4.5 months afterwards.  I am pretending it never happened.","true":true}