{"101487":146385,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-14","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I want to say that I never experienced this horrible feeling I had in the theater. It was crowded and it appears as if the air was sucked up\\, in a bad way off course. Very hard to explain but the tension in the air really showed that was not me really having a hard time with what we are seeing. No laughs\\, no excitement\\, only the terrible silence of people trying to hide themselves in the chairs.\\n\\nI will say very briefly that not only it was not what fans expected\\, but rather is an important sign that we are tired of Hollywood and Media pushing modern agendas and dramas into what was supposed to be a Classic fantasy adventure\\, with heroes and villains that for generations populated our imaginations and inspired us. Instead they are forcing more 'modern' narratives\\, where things are not light or dark  but in between (grey). The problem here is that Star Wars was never that place and even if was the case could be better done\\, not going so far from its roots.\\n\\nThe future of Star Wars is very uncertain now that Disney really showed its cards and what to expect in the future. They are getting rid of the 'old stuff' to have more room to expand\\, and doing so killing all the adventure that made the franchise so appealing. \\n\\nThis trilogy is pointless and will ruin the future of the Saga. It does not have heart\\, its root is not good enough to grow something worth. At this point I am afraid I am not interested anymore and many will feel the same. A shame in a so rich world.","true":true}