{"101487":157726,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not my Star Wars\\, not anything any fan would like.  The Force Awakens (which I loved) left us with many questions....Who is Snoke?  Who are Rey's parents?  What happened to Kylo Ren?  Why is Luke in hiding?  Why did Luke's lightsaber call to Rey?  Why did C3PO have a red arm?  \\n\\nTFA posed these questions\\, and that was ok that it left us hanging. It was part 1 of a trilogy and a viewer would expect that some of these questions would be answered or at least addressed in part 2.  Sadly\\, this movie either flat out ignores these things\\, gives lame answers or changes them completely (C3PO's arm in now gold with no explanation given).  Some of these are minor issues\\, but most of them are major plot points that are so weakly addressed that I think that is the biggest failure of this movie.\\n\\nThe script and development of characters is another major issue.  If you were hoping to see more growth from the people we were introduced to in The Force Awakens\\, keep hoping.  That does not happen in this movie.  This movie leaves Rey\\, Ren\\, Poe and Finn still largely underdeveloped and instead gives us Rose and Admiral Holdo.  These characters are very weak as well and I believe serve 2 purposes and neither is to tell a good story. \\n\\nRose is there to further this movie's obvious leftist agenda.  She spews lines that are pro-animal rights and anti-wealth and capitalism.  Why is this a focal point of the movie?  It doesn't have any place in Star Wars.  And\\, neither should Rose.  She is an awful character that I found to be very irritating.  She just does not appeal to me at all.  Maybe because of her lines\\, terrible scenes\\, or maybe because she is just a bad character that was badly played by the actress.\\n\\nAdmiral Holdo is there to put the men in place.  Every idea that Poe had\\, she shot down.  I really believe that her role was to empower women and nothing else.  I have no problem with strong women in a sci-fi or action movie (I am a woman)\\, but it shouldn't be there as just gratuitous feminism just for the sake of it.  Give her something to work with\\, not just to show the men up every chance she can.\\n\\nLastly\\, can we talk about the cheesiness of this film?  It starts with a prank holding call that evolves into a your mama joke.  I always thought that the subtle humor in Star Wars films was part of their charm.  The humor shouldn't be forced and gimmicky\\, it also shouldn't be humor that is already a dated \\\"joke\\\" from our society.   Then there is the Superman Leia scene.  I found this to be the dumbest scene in any movie I've ever seen.  Nothing about this storyline makes sense.  I actually wonder how it made it past editing.  Didn't anyone say \\\"you know\\, maybe we shouldn't have Leia fly through the vacuum of space like Mary freaking Poppins\\\"?  How did this possibly wind up in a billion dollar movie.  \\n\\nHow could so many questions remain when we see a very bloated film?  This movie was long in time but short on content.  Weak storyline and useless scenes that do not progress the story at all.  Take Rose and the casino scene out and devote that time to Rey's training.\\n\\nI cannot in good conscience recommend this movie.  That gives me incredible sadness to say.  I cannot believe that I am giving a Star Wars movie a bad score\\, but then again\\, I cannot believe that this movie should be walking around calling itself \\\"Star Wars\\\".  It's not.","true":true}