{"101487":149733,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Let me start off by saying that I made an account just to give this movie a rating. The Last Jedi was one of the worst movies I have ever seen in a theater with such high expectations. I really liked The Force Awakens and I thought that JJ Abrams brought many new ideas that made the \\\"Disney Star Wars\\\" interesting. Rian Johnson took everything good with The Force Awakens and its plot lines and threw it out the window. Overly comical and forced\\, terribly corny jokes. I find that most people who rate this movie above three stars either have not seen or do not appreciate the original trilogy. This movie does not feel at all like Star Wars and obviously has a social justice motive that is too obvious and blatant to disregard. So many terrible scenes in this movie as I'm sure you have heard. The casino scene\\, Leia flying herself in space\\, bombs in zero gravity\\, and Rey becoming a powerful amazing Jedi with about no training. Worst of all\\, they made Luke into a pathetic\\, scared and hermit old man. Luke's character was totally different from the previous episodes. I encourage everyone to look up on YouTube videos of what Mark Hamill said about Luke in The Last Jedi. Rian Johnson completely wasted Episode 7\\, and destroyed a lot of potential for Episode 9. Any questions you had from Episode 7 coming into The Last Jedi are not answered. Not a single one. This movie was atrocious and makes Episodes 1-3 look like classics.","true":true}