{"101487":200067,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"You know that point in your life when you know youve grown up completely and can firmly say that you are not interested in the ridiculousness that is the youngsters world?  \\ni am 42\\, grew up with starwars when it was considered nerdy but i played football and had a non nerdy life..........soooooo....where do i start? the First order military was like a highschool musical. Hux was over the top\\, admiral piet from the OT would have fired him and General Veers would have killed him. there is literally no way that an organization like the first order could take over a galaxy\\, its a joke. where lucas grew up watching  REAL war movies like classic WW2 movies Rian Johnson must have been watching cartoons. \\n\\neveryone wanted a pure and simple starwars movie\\, not a graphical spectacle. Rian did not follow the simple star wars story that lucas started with the OT.  too much going on\\, too many locations\\, too many bad actors\\, too many bad plot points\\, too many politically correct inventions. \\n\\nanother thing was\\, the original fans dont get what we wanted for 30 years....LUKE KICKING ASS. making luke a grumpy old man and no baddassery is a stab in the heart for us. \\n\\nacting? the asian girl could not act to save her life. \\\"I.....saved....you\\\" wsa such a bad line i laughed outloud. please\\, leia floating in from space!!!! was that a bad joke? i felt like i was watching the floating nun.\\n\\nthis movie was a plot and script disappointment too.  Please why did Holdo need to pilot the ship? couldnt a droid have done it? and tell me how those bombs in the beginning just fell out of the bottom of the ship when there is no gravity? Holdo turns the ship around and goes into lightspeed right tinto snokes ship.....then how come people have been carrying huge asteroids around with hyperdrives to use as weapons?","true":true}