{"101487":108593,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Before I start this I just want to say this will be spoiler free and everybody is entitled to there own opinion. I love Star Wars and am very fortunate to have an uncle who raised me around every aspect of it. Every movie in the saga even with there flaws are classics in there own way. Contrary to what many people will say I really liked The Force Awakens and was instantly drawn to the characters stories. I yearned to know what happened to Rey's parents\\, the identity of Snoke\\, so many questions leading up to the ultimate hype of this film. I guess this is more of a warning than a review\\, but if you go into this film like I did with all the hype all the great reviews you will be sadly disappointed. This film takes all the charm all the epic lore all the wonder from Star Wars and guts it into generic bullshit. The film is full of unnecessary comedic relief to the point where it was almost cringe worthy. The characters we have known and loved for years basically take a backseat in this movie and the new characters that had such outstanding roles in The Force Awakens are plagued by bad writing\\, rushed plot twists and forced drama. I will end with this I believe this movie was designed to attract a new type of fan base as it feels almost like your a typical super hero movie rather than a true Star Wars movie. Just like a quote in the movie it's time to let the past die and for me Star Wars legacy has been murdered by this film.","true":true}