{"101487":159173,"Last Jedi":"Last Jedi","2017-12-15":"2017-03-23","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ok this is my third attempt at writing this review because I want to respect the people who still have yet to see this movie. So I think I’m going to say SPOILERS just to make talking about this movie easier. On with the review\\, this movie I was looking forward to. I enjoyed some of the humor. Though drinking straight from the alien utter was a bit to far. The chase scene that last most of the movie seemed ridiculous. Their was funny parts but like mark Hamilton I wished a lot of things about Luke would have been done differently. Yoda says to him not to lose Rey and then he goes and sits on a rock and dies. I thought the show of sheer power was awesome but there are other ways to show sheer power. Luke was once able to crash a star destroyer he is the most powerful Jedi to ever live and yet they didn’t take advantage of him at all. The connection between Rey and Ben was odd and they tried to use it to also answer the question of who’s Rey’s parents are but if snoke linked them and gave them those visions does that make them true. The casino planet was as well awesome to look at but didn’t really give us anything knew dj was a stuttering hobo who really only purpose was to betray them. On top of that Rey is not a Jedi she had two lesson. Great action loads of fun I think I gave it such a high rating because I couldn’t figure out what would happen next. They were creative where it counted","true":true}