{"101487":129547,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-14","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am not going to give this movie a half a star like so many other people are\\, but let me first just say that this is the worst SW film of all time. It's even worse than Attack of the Clones. Yes\\, really. \\n\\nThe movie itself is shot well and is visually fantastic. The sound effects and soundtrack are on point. That's basically all this movie has going for it. I literally only signed up for Rotten Tomatoes so I could review this movie. I am a life-long SW fan and own all of the movies\\, played basically all of the video games\\, and I have also read dozens of the books. I am a bit of a super fan you could say. \\n\\nTLJ suffers from a number of problems. There are serious plot holes\\, plot elements which simply do not make sense\\, failed attempts at humor that come off as immersion-breaking rather than genuinely funny\\, and oh so much social\/political pandering. Every woman in the movie is a strong\\, brave badass leader type and pretty much all of the men are bumbling idiots or totally evil. I don't care that the movie ran long\\, but what I do care about is that a lot of what is in the movie is utterly pointless and doesn't serve to further the plot. The character development in this film is basically non-existent. You learn absolutely nothing whatsoever about Snoke before he is killed. NOTHING! You learn nothing about Rey aside from the fact that her parents were poor nobodies\\, yet she is able to knock Jedi Master Luke Skywalker to the ground in a duel and master basically everything she attempts to do with virtually no training whatsoever. The existing Star Wars storyline before Disney bought Lucas out was fantastic and could have provided material for dozens of movies taking place after the original trilogy and even thousands of years before and everywhere inbetween. Disney rendered almost all of it non-canon and now we are left with a lukewarm bowl of poop soup. \\n\\nI could go on and on and on detailing every stupid thing wrong with this movie but I am sure those points have been mentioned countless times by other reviewers. I'll sum it up like this:\\n\\n\\nPROS:\\n-great visuals\\n-great sound\/soundtrack\\n-old school puppet Yoda\\n-some good battle scenes both in space and lightsaber duels\\n\\n\\nCONS:\\n-terrible character decisions make by Disney \/ Johnson\\n-weak dialogue\\n-no character development at all\\n-numerous inane plot holes\\n-pointless quests that people go on that just waste screen time\\n-sociopolitical pandering \\n-feminist agenda b.s. \\n-new uses of the Force never seen before that simply do not make sense\\n-some parts were very confusing and didn't make sense \\n-classic characters like R2D2\\, Chewbacca\\, C3PO\\, and others under-utilized\\n-unlikeable and\/or annoying new characters (Rose in particular)","true":true}