{"101487":147544,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wish it were as simple as \\\"We are all whiny\\, crybaby fanboys\\\".  I have loved and defended these movies for decades\\, but I thought we were promised top notch storytelling when Disney took over.  So far\\, I have see a lot of flash and very little payoff.  If we are willing to accept mediocre narratives with a lot of spectacle\\, then that's all we'll get.  The Marvel movies are a great example of this.  There are many Marvel movies that are good on their own\\, but keeping the overarching series compelling has been difficult.  I don't want to see the same thing happen with Star Wars.  \\n\\nThe Last Jedi has some good moments.  A couple of great ones too.  But most of our time is wasted on side plots that do nothing to advance the overall narrative.  I love these characters.  I love Finn and Poe\\, and I want to love Rose.  They deserve stories that are as compelling and meaningful as Rey and Kylo's.  But we're not getting that.  You can write stories about heroes failing without making those heroes look completely incompetent.  \\n\\nAnd\\, worst of all\\, some story decisions in TLJ retroactively make TFA a weaker movie.  Why does Luke leave a map behind of where he is going if he just wants to die alone?  Why does said map end up on Jakku along with the Millenium Falcon?  Now we know it was all because of...the Force?!?  You can get away with that type of explanation every once in awhile\\, but do it too often and it becomes obvious for the hand wave that it is.  \\n\\nAnd I could go on for paragraphs about what I liked and hated about Luke's character in TLJ.  If you just want to die alone\\, there are a lot of places in the Star Wars galaxy to do it which would have served just as well as Ahch-To.  Why go to the first Jedi temple to die alone from angst!?  Even now\\, I want to bargain and overthink and make it work somehow!   Did he go to Ahch-To looking for answers\\, for help to fix his mistake with Ben?  Finding that not even the wisdom of the Jedi could help him\\, Luke fell into despair?!?  No.  Instead Luke just abandons the galaxy to the rising First Order\\, leaving his sister to do all the heavy lifting because he feels bad.  Sigh.\\n\\nIt didn't have to be this way.  If J.J. Abrams and Rian Johnson had no interest in backstories\\, why did Disney tie the hands of the authors who wrote Bloodlines and Aftermath so much?  Why couldn't the rise of the First Order and Snoke's backstory have been explored in greater detail there if that is truly information that only we \\\"fanboys\\\" would be interested in?  The answer is money.  They wanted the frenzy and hype those mysteries created.  They wanted all of us spinning fan theories and generating buzz for plot points that they had no interest or intention of delving into because it would get lots of people talking about and psyched for the movies.  And now everyone gets to laugh at us because we fell for it.  \\n\\nStar Wars has been my touchstone fandom for as long as I can remember.  I love this series.  I love talking about it and sharing that love with others.  But it doesn't get a pass just because I love it.  But people like me obviously aren't the fans you're looking for.","true":true}