{"101487":187388,"Last Jedi":"Last Jedi","2017-12-15":"2017-11-09","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This review has spoilers so read at your own risk but this movie is bullshit Ok I have to write off any future star wars now. 1-6 and it's done. This movie was terrible. Horrible. So much modern humor i was cringing (except when they got bounced from the casino\\, that was funny). The first half was just so bad and all over the place. It started getting good when Ray and Ben started connecting and then them teaming up to take out Snoke was a turning point. I was even glad after it was over that Ben stayed his course and didn't turn ( Han would have died for nothing ). I'm glad the Rebels escape but Luke didnt need to give his life. He is a master Jedi. He could have projected himself to cause a distraction while they snuck out the back. Oh wait\\, he did that. So how did his projection getting attacked turn and kill him? Chewbacca will be dragged through the future movies as nothing more as a Mascot now. And wait..... snoke is dead and we still have no freaking idea who he even was or how he came to power. Is Leia a Jedi now? She can just fly around space like it's no big deal? And what pissed me off even more..... Luke fuckin built C-3po. He has a talk with Leia and the Rebels\\, even has a chat with R2 that helped sway his mind and all he can give to 3po on his way out of the door to his demise is a fuckin wink? I loved the ending\\, and by ending I mean the last scenes with the kids and looking into the stars and all that optimistic future stuff but this movie leaves me feeling horrified for the future of star wars. Im with Mark Hamill on this one. It's not looking good. Edit: OH AND WHEN EP 7 LEAVES YOU ON THAY CLIFFHANGER THEN EP 8 LUKE JUST TOSSES THE LIGHTABER OFF A CLIFF!!!! FUCKIN BULLSHITTTT","true":true}