{"101487":179390,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The trailer was right\\, the movie doesn't go the way you think it will. Everyone expected the movie to be about Rey or Kylo's growth with Luke as a mentor. But it isn't. \\n\\nUsing Joseph Campbell's hero journey formula\\, the Last Jedi is all about Luke's growth and Rey as a mentor to HIM. You have the call to adventure (Rey approaches Luke)\\, refusal of the call\\, crossing the threshold (he decides to train her)\\, facing your fears (Rey finds out Luke helped create Kylo by almost acting on his feelings to kill Ben Solo)\\, putting them into the worst position possible (Rey seems headed for the dark side) and getting them out (restoring Luke's faith in the Jedi). \\n\\nSo the film isn't a rehash of ESB in so much as TFA is a rehash of ANH. That should be reassuring but it isn't. \\n\\nTHE BAD:  We don't really identify with any of the protagonists. The cast has little charisma. What made ESB and ROTJ so good was how Luke\\, Leia and Han were like a family. You don't have that here. \\n\\n-Finn lost any appeal he had. \\n-Poe is flat and unrelateable.\\n-Rey is like an avatar in a video game\\, just there to move the story along. \\n-Snoke is a disappointment in villainy. \\n-Luke is more Mark Hamill than Luke (too many jokes).\\n-Leia lost her spunk but can apparently survive the coldness of space.\\n-Yoda's surprise appearance is unwarranted and seems like Rian just wanted to have a CGI version of Yoda more like the ESB version to redeem the CGI Yoda of the prequels but he doesn't achieve that. \\n-Phasma is there for like a minute\\, then she dies. Complete waste of a great character.\\n-The scenes on the Resistance's cruiser are just way too long and painful.\\n-It's also a miss that they never explored why R2 just woke up at the end of TFA with the other half of the map. It would have been great if Luke had sensed Han's death or the mass killing of planets and used the force to wake R2 up.\\n\\nTHE GOOD ('Cause you have to end on a good note): The Last Jedi\\, like the other films\\, is a commentary on war and what can\/does happen in real life. You cannot help but notice the parallels between this film and terrorist torn countries and how capitalism feeds off selling weapons to both sides.\\n\\n-R2 has personality again. Cheap shot on Luke? Maybe but that slow head turn shot was all the spunk we've missed from R2 since ROTJ.\\n-Kylo has the best emotional scenes thanks to Driver's acting. You almost route for him at times and in that he's more like the Vader we all love to hate.\\n-It's good that Luke has a dark moment in the flash back\\, it gives him greater depth. Let us not forget that Obi-Wan and Yoda wanted him to kill his own father. This\\, like most Greek tragedies and Anakin's story\\, reminds us that by trying to prevent something bad you might actually help manifest it.\\n\\nTHE END: Well\\, actually that shot of the kid at the end is really just a segue into Rian's stand alone trilogy project.\\n\\nWhen it's all said and done the move leaves you empty. Life is a constant struggle between good and evil and most of us are in the middle. Unlike ESB you don't wonder what happens in the next movie. This might have well just been the last one. TFA may not have been the best film but it felt better than the prequels and at least had some heart. So it's a good thing JJ is back for the next installment. Help us JJ Abrams. You're our only hope.","true":true}