{"101487":127410,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Heartbreaking- I gave myself a full 24 hours to process and digest The Last Jedi before offering my final review. I feel even more dejected than when I left the theater as I think back on all the exciting moments in Star Wars history that have been betrayed by Rian Johnson’s version of this new Force story. I am by nature a purist but I found myself loving Disney’s last two creations of Awakens and Rogue One. This however\\, was a fusion of Marvel appetites\\, box office greed\\, and Star Wars characters in name and appearance only. Five year old Jimmy Kimmel could have given us a better story line with less plot holes. Moments in the film that could have been iconically legendary were instead treated with disregard and poor humor. I left Force Awakens with so much anticipation and excitement for Luke’s final contribution as the greatest hero of the galaxy and the passing of the mantle to Rey only to realize none of those hopes would be satiated after two years of hopeful waiting. Without listing all of my grievances (as there are far too many)\\, I can appreciate threads contained within this film. Poe is definitely the Top Gun in the galaxy\\, BB-8 still handles his business\\, but where was the Force and lightsaber dueling? Despite the bastardizing of Luke’s character\\, Hamil brought forth an amazing performance as did Ridley and Driver-their on screen chemistry alleviated some of my frustrations throughout the repeated let downs. Of note\\, Fischer\\, Del Toro\\, and Isaac’s performances offered the only saving grace to the film (exterior to Luke and Ray’s storyline)...it just wasn’t enough to redeem it from a 2 hour space chase to the nearest galactic gas station. ","true":true}