{"101487":185238,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is utter bollocks from beginning to end...!\\n\\nAn extremely weak leader of the Order (aka Sith Lord) that lets non-Sith members live after making an amateur mistake\\, but Darth Vader would have killed General on the spot for doing less.\\n\\nPrincess Leia ONLY had the ability to withstand interrogation\\, BUT she was NEVER a Jedi nor has any of the Jedi EVER had the ability to fly through space with No freakin' oxygen mask nor without the aide of any jet pack to reach safety.\\n\\nOn the island where Luke Skywalker resides the dumbest creation for cow like creatures I have ever seen\\,\\n\\nI gave up watching this movie any further because I knew from then on that this is another installment that's not even worth buying afterwards or even seeing repeated on TV later in the year.\\n\\nThe only recent Stars Wars movie that truly compliments George Lucas's work is Rogue One\\, and Disney should have given creators of that one full control of creating the Star Wars installments. However\\, I bet JJ Abrams must have kissed the ass of every Disney Exec red raw to be given the reigns of the 9th edition of Star Wars - dumb ass Disney!\\n\\nWhat on earth is Disney doing giving over the reigns without supervision it seems to the DUMBEST Directors of Last Jedi & Force Awakens that appear to be hell bent on destroying the Star Wars genre out of the existence.\\n\\nWhat Disney should have done is GIVE George Lucas overall control of the follow up movies because he knows how to tell a good story by keeping the audience captivated\\n\\nANOTHER MESSED UP MOVIE SO GET LOST DISNEY YOU NEED TO STICK TO CREATING CARTOONS INSTEAD\\, AND STOP PICKING DUMB ASS DIRECTORS THAT DON'T KNOW HOW TO TELL A GOOD STORY..!","true":true}