{"101487":183894,"Last Jedi":"Last Jedi","2017-12-15":"2019-02-28","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie gets a bad rap. \\n\\nThe plot is engaging and well done. Most of the issues you may have with things such as the infamous lightspeed scene can easily be explained away by the rest of the sagas logic\\, real life logic\\, or details in the movie. The plotline betweenness Rey\\, Kylo\\, and Luke is easily one of the best story arcs since the Luke and Vader arc from Reutnr of the Jedi.\\n\\nThe acting is ridiculously good. At not point did the actors ever have me think that this was anything less than a true story from a long time ago in a faraway galaxy. Mark Hamill brings back his energy and ability from Return of the Jedi (no surprise there)\\, and Rey and Kylo majorly step it up from The Force Awakens. Every emotion is felt in spades.\\n\\nThe visuals are absolutely stunning. The lightspeed scene is easily one of the most visually orgasmsic shots in Star Wars. Rian Johnson expertly uses the backdrops and interesting llighting to give even more flavor to already stellar scenes.\\n\\nThe editing of this film is on another level. The connection between Kylo and Rey is ridiculously good and the cuts from characters asking questions to the objects of their questions such as when Finn wakes up and asks where Rey is is incredible. It brings even greater impact to these simple scenes and is incredibly smooth. \\n\\nThe characters are good in this film. While the characters may not have the best character building\\, they arenï¿ 1\/2(TM)t bad. Kylo is developed to a point that is almost too much for a Star Wars villain. Luke is so incredible to watch and so utterly convincing. Rey and the rest are a little less developed\\, but they donï¿ 1\/2(TM)t necessarily reach the level of the boring characters of the prequel trilogy.\\n\\nThe themes and fan service here is well done as well. Lukeï¿ 1\/2(TM)s death is tastefully done and we get a lot of what we wanted to see from OT characters. The themes outdo themselves; there are several good ones. One of the most beautiful to see if the theme returning to Star Wars after a hiatus during the prequels: anyone can be a Jedi. The heart of this film beats on levels of the OTï¿ 1\/2(TM)s heart. \\n\\nAll in all\\, The Last Jedi is a great film. Its  emotions\\, logic\\, and reverence is something that I love to see and something I think most fans miss. I would suggest keeping an open mind and enjoying yourself during this movie.","true":true}