{"101487":169907,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star wars is dead....it takes all the story arcs set up I felt very well in the force awakens\\, then tells you bluntly that none of that stuff matters anymore. the issues with this film I had are so numerous i don't know where to start. In fact I'm not going to try. I've loved star wars since I was a kid. I grew up in the 80s when all you got was star wars on the tv at Christmas\\, a few eu books\\, magazines etc. Not the saturation there is now.....I recall the massive build up to the phantom menace and the ultimate disappointment of the prequel trilogy. I watched the force awakens and felt real hope and excitement for the future. That film got star wars...tho people had issues.... it was a triumph. I spent the next two years excited for what followed. Thinking as we all were as to who was snoke\\, reys parentage.......etc. Loads of fan theories\\, hype and excitement. Then this film......its utterly ripped my guts out. I feel truly cheated. All that you are made to think is important from TFA is discarded unceremoniously. It's just truly truly bad. I won't repeat the issues bar one. If you are going to kill Luke skywalker off why have him sitting on a rock a billion miles away projecting a hologram. When he dies there is no emotion attached. None at all. And there should be. He is basically portrayed as a wimpy coward in this film. Not a fitting send off. Star Wars is dead. I honestly don't know where they go now with episode 9. And I genuinely no longer care. Thanks alot Disney. I feel worse about this film than attack of the clones and attack of the clones sucked royally.","true":true}