{"101487":169587,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILER WARNING\\nFirst of all\\, this movie is the best Star Wars movie in my opinion. And to the people hating on this film\\, what do you want? You cry when JJ Abrams reminds you of the original trilogy. Then you cry when Rian Johnson's movie doesn't. If you have even a little bit of an open mind\\, you will enjoy this movie.\\nNow\\, I'll discuss some specific complaints and tear them apart.\\nAgain\\, SPOILER WARNING\\n\\\"Luke thought about killing Ben Solo in his sleep even though he was just a young man? HOW COULD THEY?\\\"\\nI have seen so many people try to say that this was out of character for Luke. Number 1. Who he heck stays the same in a 30 year time period? If you want the old Luke\\, stick to the prequels. This was character development that makes sense. Which leads me to 2. Don't you think if Luke saw that Ben might turn into another Vader\\, the thought to stop it early would at the very least cross his mind?? 3. He contemplated killing his father. Why not his evil nephew?\\nI don't know why someone would into this movie thinking they were going to see Luke just as we left him at the end of Return of th Jedi. He went to an island to never be found. Obviously\\, something broke inside the man! And all of this developed into an amazing character arc and send off for a beloved character. I'm sorry you expected your childhood hero to be perfect and make no mistakes ever.\\n\\nAnother complaint I keep seeing is \\\"What was the point of Snoke? I had all of these theories!\\\"\\nI'm sorry\\, but who promised you Snoke was going to be the big villain in this story? Sure\\, you can infer it from The Force Awakens. And it's fun to theorize. But just because they took a character in a different direction than you were expecting\\, does not mean it is bad. Those who were involved in making this movie\\, owe you absolutely nothing. When you watch a movie\\, you are allowing other people to create a story for you. Let them create. If you want to make something\\, do it. I'd love to see anyone who is complaining try to make a film remotely as exciting and deep. Why can't we all just go along for the ride? \\n\\nHave you watched the prequels recently? I don't hate on them like others\\, but if you objectively look at the situation\\, this new trilogy is a vast improvement. If you want a different Star Wars story\\, write one and stop watching these. Let the rest of us enjoy some incredible movies.","true":true}