{"101487":145711,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I understand where all the die hard Star Wars fans who hated this movie are coming from\\, but also I see what Disney is trying to do. Most people are upset at this film because it “didn’t meet their expectations”; however\\, I don’t think it’s fair to blame Disney for that. You are the ones who developed those expectations\\, and honestly shouldn’t you be glad all the things you expected didn’t happen because then wouldn’t the movie have just been boring? Disney is trying to reconstruct Star Wars and that’s why all these things happened in the film that you weren’t expecting. They don’t want you to expect it. Yes\\, Disney hyped up a lot of stuff and then the answers were kind of lame but they did it on purpose. They wanted the fans to come up with theories and everything so that they could make something happen that no one was expecting. They’re trying to make this trilogy different from the original trilogy so no Snoke is not going to be the next Emperor because that would just be dumb and predictable. And although I didn’t necessarily love how Luke was portrayed in this film I understand why Disney made him that way. They’re trying to distance themselves from the originals and get rid of the old characters that we all love. It’s sad to see them go but it is necessary if we want Star Wars to continue. Finally\\, I’m giving this movie a 5 star rating because I love Star Wars\\, and I’m not just going to give it a half star because I wasn’t expecting everything that happened. Overall\\, I loved the movie and I can’t wait to see what Episode IX has in store because I’ll bet that no one will be expecting it.","true":true}