{"101487":170311,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-25","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Star Wars: The Last Jedi\\, now here is a movie that really pushed the envelope. It took every measure\\, pulled out every stop\\, and made every last effort effort to say fuck you to fans and make an awful movie. How this movie received a 92% critics approval rating is beyond me. A 52% audience score is high for this vile piece of corporate trash. Has Rian Johnson ever even seen a Star Wars Movie? He Definitely didn't watch the force awakens. If he had maybe he wouldn't have forgot so much of the plot.\\n\\n One of the major themes of The Last Jedi was \\\"to forgot the Past\\\". Basically Rian Johnson is saying that there is a new franchise and we need to move on from the old movies. Why do need to move on from the greatest movie franchise of all time? Why do we need to reimagine who Luke Skywalker Is? This movie took all of the things we love about Star Wars and bastardized them and then told us just to forget the past. After the rehash that was the force awakens\\, we all wanted a new movie to add to the saga. however\\, its like they erased the entire saga.   \\n\\nwhile the force awakens was a repeat\/ mash-up of the old trilogy\\, this film was a trollfest. Everything they hinted at in the force awakens and the trailer we got a non-answer to. In addition\\, we got pointless sub-plots\\, gaping plot-holes\\, and feminist agenda bullcrap.    \\n\\nIn conclusion this movie was 3 hours longer than it needed to be and left me nothing to look forward to in episode Ix.","true":true}