{"101487":182694,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-14","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is one of those movies that the more I think about it the more I find that is so ridiculous. Story wise. Structure wise. Writing wise. Etc. So much of this movie seems like they just wanted to do something different just for the sake of being different\\, not to actually add anything to the story of Star Wars. All while crapping on every male character in the film and yet again giving Rey little to no push back by any antagonist. I think the term \\\"Mary sue\\\" is kind of cringe but I must admit\\, it is accurate. Here's a little tip for you Rian Johnson and Kathleen Kennedy; \\\"The Heroes Journey\\\". Give some real danger to our protagonist. Make us care. Make us worry for her. Don't just make all the male characters boneheads who keep making poor decisions and the female characters all masterminds who get through everything unscathed. I mean I know us got an agenda Kathleen but at least just make a good story. So many wasted character moments and so many moments that are just confusing filmmaking wise.\\n\\nJJ has his work cut out for him in the next film. A lot of clean up to do .\\nAt the end of the day. The movie is worth watching. Great visuals. Cool action scenes.  But I honestly would not even put this in my top 5 favorite Star Wars movies. I would say Empire\\, Rogue One\\, and A New Hope are top 3. Then Return of the Jedi\\,  and Revenge of the Sith (yes even a prequel film I thought was better.) As someone in filmmaking I get that writing and production can be hard and not everyone will like what you made but this was such a shot out of left field to the extreme. \\n\\nAt this current moment\\, Ben is the most compelling character in this new trilogy by far.  He actually has depth and conflict.","true":true}