{"101487":114315,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Created an account just to review this. I get that Star Wars had to move forward. I understand that there needs to be new blood and that nostalgia can only go far. I also understand that the last movie was criticized for seeming like a copy and paste of the original. This movie isn't bad because it attempts to move Star Wars to the next gen and be original\\, it is bad because of the ridiculous plot holes\\, the filler subplot\\, the established characters acting completely out of character\\, the lack of a light saber battles\\, the nonsensical decisions that characters make\\, the total disregard for anything that the TFA sets up\\, and the horrible way they dealt with a major villain. \\n**Spoilers Ahead**\\nThe ideas that they had about where Star Wars should go are fine with me but the execution was ridiculous. An all-powerful villain that can make people on two different solar systems communicate can't see a sucker punch coming? A character that has never used the force in any major way can suddenly fly in space?  An actress that has died in real life is spared in the movie so someone else that we know nothing about can die? But the absolute worst offense is how they completely and utterly disregarded and misrepresented Luke Skywalker. Again it's not the fact that the idea was for Luke to be different because of his age or cynicism. It's how they did it. Even a cynical jaded Luke wouldn't act that way. Then after all the years of building up Luke and all that he meant\\, we can't even see him be a badass Jedi that gets a cool real battle scene. He is just a glorified projection that dies for absolutely no real reason. I genuinely believe that the director\/writers hate Star Wars and wanted to troll fans. Even with little things. Why reduce Luke to drinking alien \\\"milk\\\" in such a demeaning and silly way? See Mark Hamill's interviews about his character and this movie on YouTube. You will understand. I will never pay to see a Star Wars movie again. I will remove this movie's horrible plot\\, writing\\, and character development from my mind and will only ever acknowledge the originals while at least giving the prequels credit for cool light saber battles.\\n\\nHonorable mention offenses-the stupid cringe jokes every other scene that had no place in a Star Wars movie. Benicio del Toro's character. Bombs falling straight down in space despite there being no gravity. Yoda looking\\, speaking\\, and acting like anyone except Yoda. Finn and Roses pointless subplot sprinkiled with an out of left field unwarranted never hinted at romance. Actually let me stop here because I can literally go on for hours.","true":true}