{"101487":129579,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am of the generation that grew up with the original trilogy and I must say that this is not only the worst Star Wars films ever made but it is one of the worst films I have ever seen.  When we learned that Disney was going to make a sequel trilogy with the original characters we were all so excited to see the chemistry of Han\\, Luke\\, Leia\\, & Chewie.  In the Force Awakens we got to see a bit of Han and Leia together but I really did not like what they did with their relationship.  Then they kill off Han so there is no chance of seeing Han and Luke on screen together again.  Now\\, in the Last Jedi we have Luke Sykwalker; hero\\, savior of the galaxy\\, and original last Jedi\\, who wants nothing to do with the force\\, wants nothing to do with his friends or even his sister\\, and who is completely willing to let the universe be ruled by an evil empire.  I cannot imagine anyone is really thrilled about Luke's lack of participation in this film.  I mean we had this great big build up in The Force Awakens and at the end of that film we finally get to see Luke and the anticipation of what is he going to do.  And in this film when we finally get to the answer the writer\/director just makes a big joke out of it by having Luke just toss his light saber over his shoulder.  I'm sure this was intended to be funny and maybe it would have been except for the catastrophic implications on the plot and Luke's character.  So we have this enormous buildup of Luke Skywalker and in this film he never even leaves his island.  He uses the force to make some sort of goofy hologram like appearance\\, but he never really meets his sister\\, or C3PO in person.  He sort of faces Kylo Ren but not really and then he dies on his island.  If you are just going to kill Luke off\\, why not at least let him really face Kylo Ren?  Why not have an actual light saber dual?  This movie did feature some light saber play\\, but it really did not even have a single legitimate light saber dual.  And what is with luke referring to his light saber as a \\\"laser sword'?  I have focused my review on the one big glaring error in the plot but there were many\\, many errors that made this film unwatchable for me.  \\n\\nFor me the big excitement for this sequel trilogy was the chance to see the original characters reunited in the fight against the empire and watch them pass the baton to younger freedom fighters.  that never happened.  We never got to see all of the characters together again and now three out of the four non-droid main characters are out of the films.  Although\\, I'm sure Luke will return in ghost form to instruct Rey.  What a let down and a complete missed opportunity to do something really special.  I'm sure this film will be a box office success.  That is what is really sad; there is no consequences for these film makers when they make a bad Star Wars film.  Oh sure\\, eventually once the excitement dies down and people have seen this film a few times the reviews will start to be more negative; just like with the prequel films.  But the money will have already been made and the opportunity to have a worthy addition to the Star Wars films lost and we will be stuck with just another set of films that most of the original fans do not even accept as legitimate except this time around will be even more sad because the original actors were involved in this fiasco.","true":true}