{"101487":169405,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Spoilers!!! As a fan of the movies since they came out in 77\\, STAR WARS has always been my #1 thing from books to video games to action figures. I love the original trilogy\\, Empire being my all-time favorite\\, and even though I have my issues with the prequels I've still enjoyed them. I think the hatred this movie is generating with the fans is people don't like change and TLJ changes everything going forward. I for one can appreciate that. It's representative of how life in the real world works also. The world's status quo is always in flux and now so is the GFFA. Was I disappointed about Rey's parents? Yes\\, but only because I just KNEW she was as going to be a descendant of Obi-Wan\\, and my theory was shot down. Was I disappointed about Snoke? Yep\\, only because I just KNEW he was going to be around until the third act and we'd learn who he was and see his and Kylo's defeat at the hands of Rey & Luke. I knew Luke would have to pass in the 3rd act also. All of my expectations were doused and I as a fan love it. People saying the original movies did not have humor is absurd. Han and the droids were the comic relief in the originals. Look at the banter between everyone in the originals. It was comical. Luke being a grumpy old man now is expected. He built up in his mind what it was to be a Jedi from the moment he learned about the Force only to have it pulled out from under him by his own blood. That's got to be a solid punch in the gut and is a perfectly good reason to feel a sense of failure on a  galactic level. Anyway\\, I loved this movie and thought it was damn near perfect. I came out of the theater in complete awe and cannot wait to see it again\\, and again\\, and again...","true":true}