{"101487":134539,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I left the theater thinking this movie was a pretty fun ride but I just don't understand why it wasn't cohesive to TFA? The force awakens created new characters with so much to build on and honestly\\, I think TFA set this movie up for success. However\\, this movie completely ignored Starwars elements. It was almost if Rian Johnson never saw a star wars film before including the Force Awakens. He just ignored everything Abrams built. I love all star wars even most of episode one but this felt more like a Sci-Fi action film than a star wars film. I think visually it was amazing and the acting was pretty solid. I was okay with Luke being depressed but to the point where he never redeems himself as the hero we loved was a big slap in the face to fans of star wars and Mark Hamil who agreed he didn't like the way they wrote his character. Why wouldn't you listen to Mark Hamil?  Look the movie had some amazing battle scenes like the bomber scene in the beginning and the Crait planet but does that mean it was a good movie that made sense as the second installment of the trilogy? No\\, it doesn't. The Fans are not gonna get everything they want nor should they cause we all have different opinions but to just ignore everything Abrams created in the first movie was really disrespectful.  BIG TIME SPOILERS AHEAD>\\nSo here are a few things that TFA left us with that should have set this movie up for an amazing story. Rey's parents\\, The Knights of Ren\\, Maz Katana\\, Snoke\\, Kylos Lightsaber\\, Luke receiving the Light Saber at the end\\, Kylo's training Snoke hinted at to complete his journey to the Darkside\\, Finns Health\\, and of course Poe Dameron's journey in this. This movie didn't care for any of this or creating any cohesion what so ever with The Force Awakens. \\nSnoke\\, although we didn't need to know who he was or why he came to being (we didn't know about Sidious in the originals)  he was a major part of the first movie.  His character allure that people loved\\, was just decimated for no real purpose other than to make Kylo seem a little more \\\"conflicted\\\". He created a link between two people which was new to the force world which was a cool element to this movie but he is simply killed by a lightsaber he couldn't detect 2 inches from him? He seemed extremely powerful in the force yet failed to witness the light saber next to him? That's just bad writing. I didn't care he died honestly it's just how he died that made little sense.  Reys Parents you know I didn't mind that her parents were just nobodies it didnt bother me but what did was when she went down into the \\\"darkness\\\" on the Island that could have giving her and the fans some closure it ultimately just led to her feeling sad looking at herself. How cool would it have been to show her nobody parents leave her in a cruel way and her have to face that? Nope let's just have that moment instead it lead to nothing. That could have been an amazing turn for her character similar to when Luke is on Dagobah and has to face the \\\"darkness\\\" in the tree.  They just didnt care to develop their characters other than Kylo which i liked alot in this film. FINN just wakes up as a funny joke walking through the halls with no development of his character even though it was suspenseful and meaningful in the last movie. Finn then runs into another character who I don't mind at all but it all seemed like it was forced and ultimately for nothing. Both of them were led to  the casino scene which was really cool with all these different creatures some cute\\, some ugly\\, some interesting I loved it but it was all for nothing and that made it fall flat. Maz who was a really cool character from the first film gets a 30-second silly hologram scene tells Finn they have to meet this expert code breaker on this rich planet because he is the only way to get into snokes ship. So\\, once they get there they see the expert code breaker who btw looks like a really cool debonair type character I was excited for but he gets only 10 seconds of airtime cause they get caught which makes everything leading up to that point completely useless because it leads to nothing important to any of the characters development or the stories development. Which led to another character who could have been a cool anti hero but failed to develop into anything of interest. Waste of time for the audience and the characters. Look I can go on and on about how this film ignored the other film entirely or how it really ignored major factors from other star wars movies.  This movie had some amazing scenes like the throne room and the space fights but it failed to develop the characters that Abrams created completely.","true":true}