{"101487":183027,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is the movie that destroyed Star Wars going forward for me.  Storytelling at its worst.  To me\\, I honestly can't pick a character out of this movie that I liked.  I have no Idea who Snoke is after 4.5 hours of movie time.  Why is he in some kind of gold bathrobe\\, what is his endgame\\, where did he come from?   \\n\\nThen there is Luke... who chucks his father's lightsaber off a cliff after being reunited with it decades later\\, built by his deceased father who redeemed himself and saved his son. Doesn't make any sense.  \\n\\nHow about the chase through space of one giant starship chasing another giant starship....ooooo so exciting and the plan is to simply let the good guys run out of fuel so they can then blow up the ship... meanwhile its time to hit up a casino for a guy who can then hack the chasing ship to set them free. Its like the people went to a kindergarten class and asked young kids how the story should be written.   \\n\\nI can go on and on breaking down the story\\, but the more I think about this movie and the missed opportunities and the mindless storytelling with no heart\\, the more irate I get thinking about it.   To me\\, this movie sets up destroying the history of Star Wars so that Disney can draw a line in the sand and say this is our franchise now and it will mean something different than what George Lucas had in mind.   Good Job\\, I would say Disney was successful if that's the true mission here.  I'll probably never see another Star Wars movie again on the big screen.  I can't see how this new Trilogy can be salvaged with one movie left... its just that bad.","true":true}