{"101487":174309,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-28","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The film was ok with good visual effects\\, but as time has gone on I just hate it more and more! Weird plot holes and characters that just don't work.\\nPoe Dameron doing power slides in an x-wing.\\nLuke Skywalker expressing green milk then running up and down hills whilst getting annoyed - then sort of dying \/ deflating like an old latex balloon\\nLeia Organa being blown into space then dying.... No I mean holding her breath and floating about in space for a bit.\\nRey \\\"you dont need to know her Surname\\\"  being trained by Luke Skywalker for 20 minutes then lifting 60 tonnes of rock from the floor to rescue the survivors from the resistance. It's certainly a lot easier to train as a jedi nowadays! I'm sure Yoda nearly busted an artery in his head when he lifted Luke's x-wing out of the swamp!\\nFinn and Captain Phasma's fight. Can't remember who Phasma is? No neither can I\\nSnoke or should I say Supreme leader Joke. Created the first order in less than 30 years and nobody knows who he is. \\nI guess Ryan Johnson couldn't be arsed to create any believable back story. I guess when you are re-writing the whole of the Original star war canon over the past 40+ years then there is only so much you can do in the short time you've got between films.\\n\\nWeak\\, infantile\\, self indulgent\\, unbelievable\\, full of contrived woolly and wooden characters. \\n\\nYeah the movie had a massive opening day at the box office but; and this is a big BUT\\, nobody knew how crap the film was going to be. Disney kept everything under raps\\, no spoilers etc. I went like I know a lot of people did not knowing what to expect. I won't make that mistake again. \t\t\t\t\t\tSTAR WARS IS DEAD!","true":true}