{"101487":133613,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have been a big SW fan since I was a kid\\, growing up when the original trilogy remasters were released. I always enjoyed and could relate to the themes the films portrayed. Issues of family\\, struggles with good and evil. And altough it was set in space\\, it always had a serious and relateable tone\\, whilst maintaining an element of light-heartedness. It kept you at the edge of your seat throught the entire saga\\, and to some degree the prequals continued that although I can understand their flaws.\\n\\nI went to see this on the opening midnight viewing\\, being really excited to see what will happen next in the SW saga. I left the cinema with a strange feeling; did I enjoy this film? On reflection\\, no I didn't. The humour was out of place and didn't fit the tone the story was trying to portray. Overly cheesy and forced gags don't have a place in Star Wars. In the original trilogy the humour was way more natural\\, and always fit into the situation. There were numerous plot holes and weak story lines\\, which in places were wasted and if they were completely removed from the film would make zero difference. There was also an apparent disregard of the classic characters and Star Wars lore\/mythology that we all grew up watching and growing to love. The Force Awakens started the 3rd trilogy off in great style\\, but The Last Jedi killed it. There were times when I felt as though I could have been watching Fifth Element or something similar. It's a good sci-fi action movie\\, but it's not a good Star Wars movie.","true":true}