{"101487":149595,"Last Jedi":"Last Jedi","2017-12-15":"2018-04-12","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Legit one of the worst movies i have seen REGARDLESS of franchise or not. 3 reasons this movie fails OBJECTIVELY.\\n1. The tone of the movie is confused. \\n-Jokes during serious moments\\n-Cutting of reactions of characters.\\n-Hanging on characters without any development\\n-Excruciatingly forced .political messages in the movie. (Feminism\\, SJW\\, Left politics) When they did this it made the bad guys\/males extremely stupid and cowardly.) Poes literal arc was literally become a coward learn your place always listen to women your beneath them. When i might add that he made the ONLY good calls in the movie. yay politics!\\n-Nothing truly happens in this movie for everything that was set up in TFA and in THIS own movie is backed out ofall plot threads.\\n- Let history die is the worst message to tell a child. Learning from mistakes ours and others is a necessity that prevents conflict.\\n-The romance between Finn and Rose is not earned. (which had me wondering if the kiss was add-libbed John Boyega looked GENUINELY CONFUSED)\\n2 Cgi is all over the place\\n-Space Sceens range from beautiful to oddly video gamey\\n-(Speaking of video games) The casino horse creatures are ripped off from the Last Guardian.\\n-snoke looks AWFULL\\n-Luke battle looks dumb.\\n3 Characters are awful\/bland (best to worst)\\n-Chewy Does nothing this movie but eat a porg and fly a ship\\n-Finn has no development through out his movie (same arc from TFA) his arc is to not be a coward which was ruined by another character we will get to.\\n-The code breaker was a waste of time didnt need to be in the movie litteraly is only there to say greed is bad there are no bad guys only greed in a world with space nazis that perform genocide...\\n-Poe Just what happened to this character all story literally is the only character that makes sense declares mutiny because people are dying. the message dont be a coward fight to the last....nope listen to your superiors (women) know your place men are supposed to be cowards. the reason this annoyed me this DIRECTLY counters Finns arc.(this happens alot between characters.)\\n-Leia What did they do to you. She is a terrible leader this whole movie. Cant forget she is also Marry Poppins. Oddly the most plot wholes revolve around her...she should have been killed off at a certain scene. she adds nothing to the movie and now we need an awkward off screen death. im so sorry they ruined your character for a SJW agenda after your death...RIP Carrie Fisher.\\n-Snoke...all powerful till he is not. There is a reason he is this far down that's all ill say.\\n-Huks is now a punchline moving on....Yay agendas...people are not stupid we all know space Nazis are bad but we should fear them not laugh at them it takes all stakes out of the movie. In-fact it just occurred to me that all main characters that die all do so by their own hand....sooooo threatening.....\\n-Holdo this character is supposed to be an admiral. She is only an lgbt statement and a bad one at that. all she does is lead poorly and interject the biggest plot hole that starwars has ever seen. Her only point in the movie is to show Poe that Lesbian women are better know his place.. which is odd concerning her plan fails? meaning in an SJW film they conflicted her own meaning. well done.\\n-Kylo Ren Started of the movie right by being the only one getting shit done. Angsty or not but by the end of the film all he does is throw temper tantrums..\\n-Luke i will some this up in Mark Hamil's words \\\"this is not my Luke this is some other Luke\\\"\\n- Ray this character continues to be the worst Mary sue in any medium. lets break it down quickly\\n*7 days after learning to use the force can push pull at a masters level\\n*Apparently translator for wookie (insulting for luke)\\n*Beats luke a master of 40 years in a duel haven only held a light saber 2 times\\n*Takes out 3 tie fighters in one shot NEVER firing the falcons odd guns once.\\n*Force lifts a ridicules amount of rocks without any effort\\nwhy is this bad? well simply put ray is  a god she cant be stopped. she gets a new power or the world saves her anytime a trial may go her way. She is better than the bad guy the master and anyone else no matter what setting she is in. why do this? Simply this is SJW propaganda because she is female she just IS better. I like strong female characters but they need to grow. Look at Laura Croft in the reboot of tomb raider games. She has struggle moments where she is vulnerable and needs help from others male or female. SJW's dont like this they believe that what you identfiy as and what your predisposition gender and skin color makes you better. This ruins storys.\\n-Rose The worst \\\"Main Character\\\" This is the most pandering character in the movie. she is ONLY there to fill the Asian role...so they made a plot that didn't matter that added 20 min to the 2 hour movie with out it. She is worthless only there to spout propaganda. if i was Asian id be pissed on how poorly i was represented. She spouts nonsense on capitalism ties it to slavery and wraps a nice bow on animal rights....in a star wars movie. because no one likes Oscar baiting movies anymore so lets put some ham-fisted messages in my children's star wars movies.Anyway the end of the movie Finn is about to make a dib desision and totaly ruins it for love at the expence of everyone else... agin clashing ideals then kisses him for no reason.. i hope she stays in a coma for the next movie she legit made parts of the movie hard to watch.\\n Ill end with subversion. Subversion is great only when it is not at the expence of the story. M. Night Shyamalan gets flack for this all the time. Its when you build in one direction protest it cant be y keep pointing to x then reveal that it is indeed  y. that is subversion. What this Rian Johnson did was make a plot then stop it at a dead end the entire movie. with all of the plots. Nothing happens its super boring to sit through the ENTIRE movie and nothing happens.","true":true}