{"101487":122070,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"From plot holes to a forced political agenda that has no right to being in a Star Wars movie\\, this movie was an all around steamy pile of shit. Rian Johnson and Kathleen Kennedy have effectively turned a whole generations most positive and confident hero into a whiny and emasculated little man who can't defend himself against a girl who a week prior didn't believe in the force. Rey also seemed the product of another forced agenda for a strong female lead\\, even though she is a remarkably unrelateable and flat character who doesn't go through any adversity or even TRAINING to be on the same level as Luke and Kylo Ren? The movie is filled with tired tropes and poor decision making\\, along with glaring plot holes (Finn and Rose) and zero explanation. I only learned after suffering through this disaster that the Disney executives didn't think it smart to create some overarching plot for the directors to follow\\, and instead they are allowing each director to \\\"interpret\\\" their own shitty version of this beloved franchise and single-handily decide to take drastic 180 degree turns with established and historical characters just to try and throw in a forced \\\"twist.\\\" It's a travesty that this movie was allowed to be thrown into the hands of someone pretentious enough to make this steamy pile of shit. I don't even know if I want to continue watching or reading anything Star Wars now that I know Disney doesn't have any real direction or plan for the franchise. I can confidently say I have never been more disappointed in a movie and no other movie has done more to destroy something I used to love.","true":true}