{"101487":147629,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I would give this movie a 0 if I could. Johnson and Disney have just flipped the bird to all the fans who have loved this franchise for decades. Instead of coming up with unique stories and spending some time creating good scripts\\, they just took the easy route and turned Star Wars into Transformers or Pirates of the Caribbean. It's garbage that looks good on screen. They took Luke Skywalker who couldn't even kill Darth Vader and turned him into a murdering uncle who wants to kill his nephew. This makes no sense\\, but Disney doesn't care and Johnson has probably never even saw a Star Wars movie. They don't give a s__t. For a company that did such a good job with Marvel it's amazing that they can just flip the bird at Star Wars fans. It's pure evil. They don't care about the fans so I don't care about them. I will never watch another Star Wars movie. I will never give them any more of my money. I don't care what happens in the third movie to this terrible trilogy. This is the worst movie I have ever seen. From the inappropriate humor to Mary Poppins Leia to stranger Rey who turns out to be a nobody. This is all just garbage (what Rey calls the Falcon is what Disney thinks of Star Wars) made to sell tickets and toys. But it's worse than that b\/c the stories in the Force Awakens and The Last Jedi are worse than Captain EO. Captain EO had a more interesting plot and at least had good music. Don't watch this garbage - save your money","true":true}