{"101487":171105,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Such an amazing film!!  A lot of these \\\"die hard fans\\\" who have given this film poor ratings seem have only watched this episode for face value and failed to see what this movie was trying to convey. People are complaining about how many plot points went nowhere when in fact the characters' failures were the whole point! Yoda actually stated it in the film\\, \\\"The greatest teacher\\, failure is.\\\" How are people missing this?! Yes\\, Finn and Rose failed in their mission but learned something meaningful in return; true evil is not just those who murder and kill\\, it's those who let it happen and build their fortunes on top of the misfortunes of others. Yes\\, Rey failed to turn Ben but she learned about the gray and how everything is not all black and white the way she wants it to be especially as it pertains to Ben. By understanding that\\, she can finally see that Ben has to take the first step to help himself before a redemption can occur\\, which it totally where this is heading. Everyone is capable of good and evil and even the most vile person deserves a shot at redemption which is what Star Wars is all about. Ben failing Luke and Luke failing Ben; this huge mess that resulted from a difference in perception. Poe failing as a commander only to finally learn about the true value of sacrifice and how running is not a failure but a hope for the future after Holdo's final act. Those are just some examples\\, there are just so many that it blows my mind how alot of people have passed it off as \\\"pointless.\\\"\\n\\nLuke's character is one of the more interesting aspects of the film as well. Fans tend to put his character on a pedestal as some sort of untouched hero for the light. This film reminds us that he's human and that even the strongest of us can still break under the immense weight of guilt and trauma he carries on his shoulders which is something everyone can relate to. Even Rey's parentage reveal; a reminder that you don't have to come from a great name or family to be or achieve greatness. \\n\\nI couldn't get enough of this film. The acting was superb\\, writing was excellent\\, and visuals were outstanding. Rian Johnson created a triumph despite what many people are saying. He honored the past while forging a new path for the next generation; a bold and exciting move. We don't want to see something we have already seen\\, that would be so boring. It's not about the destination in this movie\\, it's all about the journey and it's one hell of a ride.","true":true}