{"101487":139835,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Is it compulsory for every Hollywood blockbuster to be given an almost perfect score by critics these days? ... What ever happened to critics\\, being\\, well critical? ... \\n\\nWas this a bad Star Warts film? No\\, it wasn't\\, but it wasn't far off. It was mediocre at best. The charm of Star Wars is that it's supposed to be aimed at both kids and adults. It is predominately a space western that is supposed to ignite the imagination of little tackers. This simplification was what saved it as a franchise. Cause lets face it\\, without the cool costumes and weapons it's nothing great. \\n\\nAnd why did this fail so miserably? Because for once they tried to be intelligent\\, and despite missing the mark\\, several times\\, they also took away that childhood wonder that made Star Wars great in the first place. \\n\\nSo many people raving about it being the best Star Wars. How can you say that? I really don't get it. The plot was as simple as they come. They must survive this great attack while waiting for Ray to return from her training ... and what training did she undergo anyway? ... Other than a few sort of beginner lessons she got nothing from Luke except how to steal ancient books. It's like attending the first few days of university and walking away as if you attained a Ph.D. \\n\\nLuke was semi-interesting in his regret\\, but failed to deliver afterwards. Finn and Po are as boring and wooden as ever. Rose was Finn counter boring created character and as painful to watch as Finn. DJ was the only interesting new character and what was the point in the end of his existence? Other than to teach naive Finn a lesson.Hope he comes back because he was the only characterisation highlight really.  ANIMAL CRUELTY IS BAD ... OK! Yeah we got the picture and it wasn't funny as you think or cut to our core ... the Casino planet wasn't amazing\\, WTF is wrong with Finn? \\n\\nThe entire \\\"just ahead of them so they can't destroy us but we can't escape\\\" story arc was woeful and completely ignorant of physics (ok it's Star Wars and physics takes a back seat but please\\, not this level of physics-massacre) \\n\\nA lot of people hated the Ray-Kylo exchange\\, but I rather liked it. All the way to their parting. But again I'm also frustrated at their compete lack of actual Jedi skill. And of course about Snoke ... And WTF not a single decent Jedi fight? ... Why even call it Star Wars?\\n\\nThere were some parts I did enjoy\\, but over all way too many that ruined it for me. Don't know why there is so much love\\, but then again I did read a thread where the fans of this film then went on to defend Transformers\\, so there you go.","true":true}