{"101487":108668,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"believe the negative hype. this is one of the worst films I have ever seen in my life. I am a life-time Star Wars fan\\, I adore Star Wars and George Lucas\\, I even found a place in my heart for the prequels\\, but this film... made me uncomfortable. it made me uncomfortable to the point that I began to sweat upon the back of my neck... as if I'd suddenly been stood naked before a crowd of people who then began to laugh. this film made me feel ill. and it made me feel embarrassed to be seen leaving once it was done. has anyone ever heard of the term \\\"walk of shame\\\"? yeah. this is that.\\n\\nthe writing was horrible. the acting was not good. the story was worthless. new characters were pointless. there is no plot. and aside from one or two minor moments\\, (between Ben and Rey)\\, every single character\\, by the end of this film\\, are in the exact same spot they were in at the end of the last bad film. it was utterly meaningless\\, and all Disney has done is make Star Wars into a Marvel film. a silly\\, slap-stick color-fest made only to make more money and to leave openings for another movie. it felt hollow\\, like a chocolate easter bunny. it was brittle\\, fake\\, and without warmth or any soul. there's no heart at the center of this cash grab. just emptiness.\\n\\nMark Hamill (Luke Skywalker) hated it. Daisy Ridley (Rey) hated it. George Lucas even called Disney \\\"white slavers\\\" after what they did to Star Wars. believe these people. trust them and not the critics\\, because I do not know what film the critics saw. because it wasn't thus one. there is no way in hell it's this one. trust the audience reviews on here and trust me. it wasn't just bad Star Wars \\\"film\\\"\\, it was a wretched film as a film. it's just bad. so let it be known: there are only six Star Wars films. period.","true":true}