{"101487":177062,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The movie was a huge disappointment for a STAR WARS movie but also in general for a Sci-Fi movie\\, which is supposed to be the second part of a trilogy which is set in a specific universe.\\nThe writing of the story is my biggest problem. Random plot lines were made up and combined in a forced way. There is not much build up but many dead ends. \\nThere are so many contradictions and plot holes\\, that it is impossible to ignore them. Partly the strange events or some strange behaviour had to be directly explained within the movie\\, which is a definite sign of bad writing.\\nCharacter build ups and plot lines which were started and prepared in The Force Awakens were just ignored or destroyed\\, without logic. The impression remains that the director lacked good ideas for the plot so he thought it was a good idea just to surprise people (with nonesense).\\nThe jokes an overall humor was very flat and often felt forced as well. \\nPolitical messages were pressed into the plot with no reason and without really fitting to the story: Captilasim is bad\\, Women are more thoughtful leaders...\\nThe main problem I have with the poor writing and ultra-thin plot: It killed off all the excitement for the next and last part of this trilogy. I am just not interested any more in what will happen to the characters.\\nThe overall scenario of the film was also quite lackluster. It would have been intersting to see what actually happened to the remainders of the New Republic.\\nFor me Disney intended the movie to be mere flat fan service mixed with some unelaborated political messages. Show a Luke Skywalker\\, show some Walkers\\, show some TIES and X-Wing\\,... The movie lives just from it's visuals but there is nothing intersting or worthy under it's shiny surface.\\n\\nI cannot recommend the movie to Star Wars fans and I will not see the next part of the new trilogy.\\nBasically Star Wars lost every exciting aspect after seeing this movie. Disney and the director wasted all the potential of the Star Wars universe and created a casual action Sci-Fi movie instead","true":true}