{"101487":152784,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"*Major Spoilers*\\n\\nThe Last Jedi was a terribly disappointing film. It's not only an insult to Star Wars fans\\, but fans of cinema\\, or even story. This film has more plot holes and makes more stupid choices than The Room\\, and that is not hyperbole.\\n\\nIt foregoes essential character development. (Who is Snoke? A mean\\, ugly\\, bad guy. Captain Phasma? A mean silver stormtrooper Hux? An angry\\, mean\\, bad guy. Benicio del Toro... Uh.. who knows? Who cares?)\\n\\nOn the way out of the theater I heard a child ask why a couple of Star Destroyers couldn't light-speed ahead and circle back to trap the fleeing rebels and I had no answer.... \\n\\nOther simple questions: Why would a prisoner linger in his cell if he had the means to escape in his bag? \\n\\nHow can a person get blown out of a ship and Force-magic their way to safety....? To quote Han Solo in The Force Awakens\\, \\\"That's not how the Force works!\\\"\\n\\nWhy are we being led to believe that Luke Skywalker would even for one moment consider killing his apprentice\\, his nephew! \\n\\nHere's a few more:\\n\\nWhy does Rey need training when she's just a magically perfect Jedi already? Why does Luke die needlessly? Why does the CGI Yoda look so crappy? Why can BB8 seemingly perform any act with zero limbs? Who are the Knight's of Ren? How was Finn not injured in the speeder collision? How did Snoke corrupt Ben Solo? How can the First Order all of a sudden track lightspeed? How would Fin know how to disable something that he could never have known about? How do you employ conventional bombers in zero gravity? If the bombs are going to blow up the bomber anyway? Why not just crash the ship into the Dreadnought? Why is Luke hiding in a known Jedi ruin\\, and why can't anyone guess his location? \\n\\nEasily as bad as Attack of the Clones; this is the worst film I have seen this year.","true":true}