{"101487":175219,"Last Jedi":"Last Jedi","2017-12-15":"2020-01-10","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi is a movie that critics loved because they thought it did somethings different than other Star Wars movies. While there are some things that are different\\, what it really does at the heart of the movie is take most critical locales and events in Empire Strikes Back as well as a few from Return of the Jedi and either mimic or subvert the decision or outcome. Crait is Hoth\\, but salt not snow. Rebels being chased by an Empire are replaced by Resistance chased by First Order. Benicio Del Toro's hacker character helps then betrays\\, while Lando betrays then helps. Rey trains as a Jedi with a reluctant master while Luke trained with a patiently waiting one. Rey rushes off from her training to confront Kylo Ren like Luke rushed off to confront Vader. Rey lifts stones and Luke lifted stones. Vader to Luke: \\\"No\\, I'm your father.\\\" Kylo to Rey\\, 'your father is nobody.' Luke is the Jedi's last hope in Empire and Rey is the Jedi's last hope in Last Jedi. Luke enters the abandoned Rebel base on Crait similar to his entrance in Jabba's Palace on Tatooine in Return. Kylo presents Rey to Snoke similar to how Vader presented Luke to Emperor in Return. Rey watches the fleet battle from the throne room as Luke watched the fleet battle from the throne room in Return. You can call it new\\, or you can say a lot of it was mostly Empire flipped on its head. \\\"Force FaceTime\\\" between Rey and Kylo is interesting but eventually annoying. Some Sci-Fi fans believe the plot of the Resistance fleet is borrowed and adapted from the remade Battlestar Galactica series\\, and they might be right. Battlestar also had a casino planet which was more interesting and engaging than Canto Bight. The Last Jedi doesn't even try to be subtle with its messaging\\, with words that ring from screen to reality like \\\"kill the past.\\\" A nod to both letting go of nostalgia and resentment in the fanbase and the old stars as well as the expectations that come with a 40+ year old franchise. But getting hit over the head with the \\\"spark that lights the fire\\\" notion so many times leaves audiences to think the writers and director don't entrust them with these critical themes. Also\\, preaching about the gray areas of war when the series is literally about war while freeing animals but not children dances around the issues and seems a little hypocritical. The \\\"Holdo Maneuver\\\" was well shot but begs the question why the series doesn't use projectiles fired at light speeds as a weapon more often (or why a droid couldn't have piloted the ship instead of Holdo). Why does Holdo withhold information from Poe but then commend him when speaking to Leia? A lot of plot doesn't quite make sense\\, and a lot of character development is thrown out. In fact\\, Last Jedi ditches most of the setup that Force Awakens laid down in order to go its own direction. For continuity of fans\\, that's dis-jarring. All in all it's an ok movie with a few cool scenes (throne room battle) but I'll take Empire and Return over this one every time.","true":true}