{"101487":133838,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have no clue why Rian Johnson thought that people would embrace seeing one of their most beloved characters tarnished and then thrown away (let it die if you must...) or that the humor didn't fit with the tone of the franchise.  The phone gag off the bat took me out of the movie\\, among others but stealing a line from Ninja Turtles was the final straw!  Lol.  So Disney fires other directors but hey lets give this guy who's not in touch with what Star Wars fans want a whole new trilogy?!?  \\n\\nSure seems that Disney's plan was to kill off our main characters for theirs which makes sense from a marketing perspective but is that what nerds want?  So am I supposed to be a fan of Rose the fangirl?  Whats cool about that\\, is it supposed to be a Rudy thing?  Instead adding a badass bounty hunter or a new force user lets add this mechanic fangirl...  Her performance was great but if we wanted to watch that for an hour we could have stayed in line for free!  Ba-da-pssh\\n\\nDont get me wrong\\, this was a well crafted\\, visually stunning film with amazing acting (and a ton of plot holes).  Mark Hamill was superb but this really gets to the heart of the problem.  It was clear that people wanted more of Luke after TFA came out so this move leaves me perplexed.  What fans clearly want is interesting new characters and don't mess with the beloved characters. \\nWhat they did with Luke was a bad move.  All of the intrigue JJ created was thrown out like day old bread for the sake of throwing it out.  I bet M. Night loved it\\, what a twist!  Cheap\\, cop out plot threads....\\nI could go on and on but this beautiful failure has wasted enough of my life. 1 star.","true":true}