{"101487":174379,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-02","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The first film in a long time that I seriously considered walking out on\\, The Last Jedi (aka Teen Angst 2)\\, is a terrible\\, terrible film. \\nAlmost none of it works. I first looked at my watch at around the hour mark\\, where I was dismayed to see I still had around 90 minutes to sit through. \\nEven the one cool bit - where Holdo rams Snoke's fleet at lightspeed - leaves you with a \\\"what the hell? they can just lightspeed through ships? why not do that in EVERY DAMN FIGHT??\\\".\\nThe villains are awful (plus where the hell was Snoke all those years that the Emperor was in power? He's at least as powerful. Was he just chilling out somewhere and suddenly became ambitious at the last minute?\\\" and Darth Vader 2 is still just a whingy teenager.\\nDaisy Ridly and John Boyega still can't act in the slightest\\, to the point where I was cheering Finn's suicide run (sadly he doesn't manage to top himself).\\nAnd who can forget the bombers\\, inexplicable moving slowly despite the absence of gravity or friction in space and then dropping bombs...in space....\\nLess said about the casino scene the better (let's go find this special guy\\, oh wait here's another guy who can also do the thing that only the special guy was meant to be able to do!!)\\nAnd all the talking...so...much....talking.\\nThe ridiculous cuddly birds put there purely for toy sales and the random Jim Henson-style cleaners on the island who inexplicably wore nuns clothes.\\nMan the list goes on (red armour that sometimes protects from lightsabers - you know\\, the things that can cut through anything - and sometimes can't). I haven't hated a film in a while\\, even episode 7 was merely boring because it was a remake - but TLJ had a real opportunity to be something good and it threw it away.","true":true}