{"101487":145904,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've had time to digest this movie... so here I go. \\n\\nLast Jedi was a beautifully shot.... having said that....I have been a star wars fan for 38 years\\,  and that was one of the biggest disappointments I've had in recent memory.  I am at a loss for words\\,  what a piece of garbage! When stripped down\\, not one character mattered. \\n Snoke... pointless. \\n Rey....who? We waited 2 years to find out she's a junkies kid....really?\\nTitty-milk drinking Luke\\,  complete bitch....NO big badass moment. Rian Johnson destroyed a childhood hero here!  I feel sorry for Mark Hamill to have to endure his script.\\n Kylo... tried to arch\\, but came right back to a teenage temper tantrum.\\n Rose and Finn.... pointless filler mission. Everything they did did NOT matter!\\nOnly one lightsaber battle that barely did anything. There wasn't even a lightsaber duel...literally\\, not one lightsaber clashed together in a duel.  \\nAnd Leia... I'm sorry \\\"Super\\\" Leia--- what a bullshit scene that was and\\,  I'm sorry\\, but they missed a HUGE opportunity to have HER be the one to jump into lightspeed and save the last of the rebels!! Luke could have came to her (in hologram form) just before the jump to lightspeed and they could have had their moment.  All you had to do is use the same scene of Luke and Leia from Craite and use the interior of the ship as the backdrop.  They would then have this touching moment before she saves what was left of the rebellion.  What a swan song gut-punch that would have been----and you would have wrote Fisher out of the story with honor.  This event could have jump started Luke to raise his X-wing and fly to Craite for a showdown---an ACTUAL showdown.  Even if you have him lose to Kylo\\, that's fine.  It would solidify Kylo's power and leave Episode 9 to the new generation of characters.\\nI'm truly sad and in awe over this piece of shit. I'm off my soap box now.","true":true}