{"101487":106523,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Attack of the Clones was better. That should tell you everything you need to know. Visually this movie was AMAZING! So uhh\\, Luke f*cking Skywalker is drinking alien titty milk.. Let me repeat that. Luke f*cking Skywalker is drinking ALIEN TITTY MILK... Alright lets move on. They just have him moping around for damn near the entire movie. At the end you're thinking oh sh*t Luke's about to TEAR SHIT UP. Yeah\\, not really. He's basically using the force projecting himself\\, neo dodging Kylo's attacks\\, dissipates into thin air back on Ahch-To because he exerted so much energy.. Ok. Oh lets not forget he was debating on killing his sisters son\\, his best friends son\\, Ben Solo because he sensed some dark in him. GTFOH. That's not Luke. The man who went on a suicide mission to confront his father Vader because he sensed the good in him. So Rey is pretty much a nobody with no training who gets the best of Luke? Ok.. Finn and Rose's adventure was pointless. If they would've told them the plan in the first place\\, there wouldn't have been mutiny and some of the resistance would still be alive. RIP Admiral Ackbar. Leia turns into Superman. Alright. The humor was forced and just not funny at all except for one part with Chewie and those damn porgs. Snoke and Captain Phasma's characters are wasted with no back story. So disappointing. The Force Awakens set up so many questions and just gets thrown out the f*cking window. Not sure why they switched directors to only have JJA back on for episode 9. Makes absolutely no sense. There are some good scenes in this movie like the beginning dreadnaught sequence\\, kylo and rey battling the praetorian guards\\, seeing yoda was cool\\, and Holdo's kamikaze. I just can't get over Luke drinking alien titty milk.. I don't even wanna get into the plot holes.. My goodness. Also this is a first.. There is NO lightsaber duel. SMH.","true":true}