{"101487":196650,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While shot well with decent choreography this episode fails to capture the character and story arc of a character the audience has waited over 30 years to see. This movie has major issues! Huge plot holes! Aliens have been relegated to background and unimportant characters... again\\, I'm looking at you Disney!\\nThis movie also fell into the Remake\/ Nostalgia trap that plagued episode 7 by borrowing heavily from Empire(5) and Jedi(6).\\nJokes in the movie often felt forced. There was a pointless side plot that slowed the movie down and failed to develop the characters involved.\\nThe addition of new Force abilities was undermined by their lack of explanation and their use as plot devices. Rey's lack of training is disappointing and her ease of success discredits the training and legacy of all other trained Jedi!\\nThe movie's continuous chase scene isn't logical and digresses heavily.\\nThe new light speed kamikaze maneuver is visually stunning and terribly effective.\\nHowever it creates too many problems to be worthwhile. (Why didn't the other rebel ships about to run out of fuel do that too? Why didn't Holdo do this sooner? Why didn't she do this by auto pilot and save herself? Why doesn't every ship that is about to lose a fight do this? Why don't they have unmanned drone ships do this? Why don't they just strap hyper-drives to asteroids and launch them at the enemy?) Clearly someone didn't think this and other plot points through for more than 5 minutes! I left the theater no longer being interested in this trilogy. I honestly don't care what happens in episode 9 and that is sad. Yes\\, I saw the movie multiple times and yes it got worse with repeat viewings.","true":true}