{"101487":158870,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Oh my life! What on earth (or Alderaan) has Rian Johnson done? \\n\\nIf he set out to cock up the back on track saga series after TFA\\, this is a triumph. If he was trying to emulate the mockery of the franchise that TPM\\, AotC\\, RotS made of it\\, again he has succeeded. Otherwise this interpretation is a ham-fisted dud. The plot line on this story is so weak\\, so ridiculous that attempts to build tension backfire. [spoiler alert]; if the crew of a fleeing spaceship have the ability to shuttle back and forth to a casino whilst on the run to save the slow moving spaceship alarms should have been sounding in the writer's room never mind the doomed craft. \\n\\nIts pretty clear why Mark Hamill didn't say much in TFA\\, next to the upstarts his 1970's-esque candour looks wooden. The only thing Hamill succeeds in is making Daisy Ridley's acting look credible. Against a more credible professional Ridley (and Boyega for that matter) would be shown up for their acting-class-homework-assignment standard efforts. \\n\\nThis film throws up more questions than it answers. And I don't mean the mysterious ones that are dangled in front of us to whet our appetite. Were Rey's parent's alcoholics? Who were they?  Actually this movie beat the living curiosity out of me. I gave up after wondering how Yoda could affect real world items\\, why they didn't use the cannon on the rebel base to finish everyone off after they blasted the doors through\\, how Leia could suddenly summon the force to save herself after being blasted into space...... this particular list is endless. \\n\\nNot that it was all downhill\\, Benicio Del Toro and Adam Driver put in two pretty solid performances. With them on board maybe there is some hope for the future episode 9.\\n\\nI guess we can expect more of this from Disney..................... Another reason why I'm watching old Star Trek reruns. Not that I ever liked ST particularly but I'd rather go down that route than wait at the bedside of a much loved franchise series that is on life support watching it gradually get weaker with each passing day..........\\n\\nA possible title for 9 could be Star Wars Rebels In Peril (R.I.P)\\n\\nTLJ............hmmm\\, lets just try and put that past us.","true":true}