{"101487":191790,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Very disappointing sequel that did a disservice to both the original stories (Luke in particular) and the groundwork laid by J.J. Abrams. Luke tossing his returned lightsaber over his shoulder was a metaphor for Rian tossing J.J.'s trilogy plot in the trash. That was the baton in a relay race and Rian didn't just fumble it\\, he threw it away. The opening between Hux and Poe was more Wile E. Coyote than Star Wars. The humiliation of Poe by Holdo was misandry personified but only to lay the groundwork for her sacrificial redemption later. Akbar was right there but they give that moment to a purple-rinse stranger they just made us dislike\\, how subversive\\, how out of touch with fans. The preachy side mission to Canto Bight was completely pointless (no wait\\, it led to everyone getting betrayed and killed) DJ and his cynicism was well handled\\, like an irredeemable Han Solo. Rose preventing Finn's sacrifice risking even more lives was another low point\\, you could see what Rian was going for but founded on such ham fisted plot development that you're yanked out of it thinking about all the people Rose just got killed. Luke's force projection would have made some sense if he didn't die anyway. The hyperspace as a weapon looked spectacular but completely broke every other desperate battle where it was never used until now and not used by a ruthless First Order earlier. That brings us to the biggest flaw of all undermining all of this\\, the space chase mechanics made absolutely no logical or physical sense in any Universe.","true":true}