{"101487":190901,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Unfortunately for myself I am sad to say this movie does not live up to its predecessors in the series. It doesn't even live up to director Rian Johnson prior work Looper. While some of the technical aspects are well done the overall film does not work as an entertaining feature. After all the build ups in The Force Awakens\\, it seemed the main purpose of The Last Jedi was to destroy everything from it. And destroy everything from the prior 6 episodes in the franchise. One has to wonder why the other movies were even made if this movie is to be considered a continuation of them? The movie also suffers from a plot that really goes nowhere different from where it starts. The movie also loses itself by trying to keep the audience off guard by literally changing 5 characters allegiances multiple times throughout the movie only for them all to return to where they were at the start of the movie. Also mutiple \\\"Are they dead\\, oh wait they aren't\\,\\\" bait and switches are employed. With so many attempts to keep the audience guessing it lessens all of the attempts. This movie suffered from the same worry that the TV series Lost had. The makers didn't want the audience to figure out what was going to happen and just ignored or discarded large parts of prior setup. It was very upsetting to not enjoy this movie as The Force Awakens had set up some interesting ways for this movie to go. Instead this movie's universe felt smaller then all the others while being the longest in run time.","true":true}