{"101487":191158,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Updating my rating from 1\/2 to 1 star so that my review is counted on RT. Based on another reviewer's sampling of scores if the 1\/2 stars are not being counted the score is currently correct at 49%.\\n\\nWow\\, what an idiotic film and such a disgrace to the Star Wars legacy!\\n\\nIf I were to review this movie as just a sci-fi movie and not a Star Wars movie it doesn't flow well at all\\, is full of plot holes\\, really boring in some areas and feels like they are pushing a political agenda\\, has really cringy humor that undercuts any seriousness a lot of these scenes deserve\\, as well as the ability to make characters meaningless that were given meaning in the previous movie which de-evolves any importance the character should have moving the plot forward instead of developing them. The only saving grace is the special effects are top notch and glad I saw it in an IMAX theater just for the eye candy which is the only justification for even giving a 1\/2 star rating from me.\\n\\nAs a Star Wars movie it completely undermines the canon and most importantly fundamentally changes Luke Skywalker into someone I no longer recognize as the hero I knew before.  The reasons they give in the movie for why all of these characters are acting the way they do pretty much assassinates everything we know about them in the previous films and makes you leave the theater utterly confused and disappointed as to what you just watched.\\n\\nIt's as if the Last Jedi is throwing the audience the middle finger behind the screen as you are watching the movie\\, but you don't realize it until afterwards.  Disney you can do so much better than this terrible movie! \\n\\nChanges need to be made before I spend any money in the theater again with the Star Wars name on it. I went into this one not reading any audience reviews to keep an open mind and now really regret it.  I honestly wished I never watched this film and have no desire to see new Star Wars movies going forward if this trash is considered a quality movie.","true":true}