{"101487":96859,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"1:If Rey was a mary sue then why is she able to mind trick without training. And lift rocks like yoda after 3 days?\\n2:Why is this a social justice warrior movie? FML i.e. first order all white males. The rebels were all mixed  with all female  leaders. All men characters are either villans\\, stupid\\, or arrogant. Minus Finn. The animal rights stuff. The rich people are bad stuff? LOL cant we get one fuckin movie without this bull shit politics?\\n3:Snoke\\, So many great theories about him. hes more powerful than vader and palpatene. and most likely older then both. Yet provide no back story dies by an emo kid that was getting manipluated by him and mind read...\\n4.Force ghost can effect the real world with lighting and other bs now i guess... Well\\, why the hell didnt yoda just force lightning or anakin show up to tell kylo to get off his dic*. \\n5.Why invest so much money into a movie and have so many plot holes and garbage writing. Click bait for tickets maybe? \\n6.Not even one light saber battle! NOT EVEN ONE!\\n7.Luke force projects a cgi version of himself to distract kylo\\, tells kylo if he strikes him down bla bla bla. Turns out he was just a mirror image of himself via projection. Then just dissapears on a rock\\n8.Worst part of all superman leijaa flying through space. was the most cringe worthy moments in cinima history. Just kill her off right there like wtf shes not even alive in real life yet shes the only from from the orignals to survive in the movie. This movie felt like a bad april fools joke.\\nIdc about my typos not going ovver this post and fixing it. If you can understand what im saying thats all that matters.?","true":true}