{"101487":149858,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Lifelong Star Wars fan but this was just pathetic. Poor storyline\\, dialogue\\, character development\\, and plot. Very clear focus on merchandising rather than telling an engaging story.\\n\\nI hadn't heard about the debate regarding the SJW component of the storyline until after watching the movie (I've been intentionally avoiding reading anything about the film until I had a chance to see it for myself)\\, but it didn't take long before I picked up on that theme a few minutes into the movie. The male actors bumbled along uselessly throughout the entire movie\\, guided and commanded by responsible female leadership. All of the white male personnel serving the First Order frequently blundered about just as poorly as their Resistance counterparts. What happened to the cool\\, professional mannerisms of antagonists like General Veers and Admiral Piett? Get rid of the thread of incompetency by so many supporting characters and leave that job to the nameless stormtroopers.\\n\\nLuke's role was uninspiring and almost seemed an afterthought. The entire original trilogy was based around his character development\\, the least they could have done was portrayed him as a wise Obi-wan type mentor for Rey rather than some washed up disgruntled has-been that randomly disintegrates himself at the end of the movie.\\n\\nGood Star Wars movies can still be made (Rogue One is a testament to that). A definite shift will have to be made to keep this series viable.","true":true}