{"101487":184196,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is absolute garbage.  The Leia Poppins scene was atrocious\\, in concept and execution. Nostalgia was clumsily handled and the jokes were BAD and ill timed. The misappropriation of Laura Dern and all her talent and forcing her to act way under her capacity was unforgivable. The script is an absolute joke. The Disney agenda within the flick was upsetting but not the most upsetting part. Rose would've been a great character from a Disney kids movie but was totally misapplied here\\, that is to say\\, she was annoying and cutesy. The casino scene was terrible and even Benicio Del Toro could not rescue this flick for me. It was a f*cking disaster and if I was not with two of my Marine brothers I would've walked out of the film. They turned BB-8 into a blurping\\, bubbly Roomba. What the heck was Chewbacca's purpose in this movie exactly? So glad they explained how Snoke became the supreme later-oh wait they didn't. Most unforgivable though: Leia Poppins. Script was lay and terrible. Jokes were SO BAD!  SO F*CKING BAD! The purple haired chick was for the hunger games crowd. Snoke was for the Hobbit crowd. And the race-horse jailbreak at the casino was a massive waste of time. They actually used the \\\"can you hear me now?\\\" joke. Leia has never been linked to the force in anyway except that one scene were she and Luke link (same way new Vader and girl Luke did in this one) but we are supposed to buy into her being able to physically withstand a missle attack and she can breathe and not freeze in outer space? Floats back to the ship like Leia Poppins. It was a dumbed down derivative douche fest that brought in new creatures and characters to sell toys but no one who could act was allowed to act\\, and the writer\/director said that he let Carrie Fisher come up with Leia's lines. The only reason I will watch it again is to make sure that such a piece of sh*t actually exists.","true":true}