{"101487":166360,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-29","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Saw this opening weekend and in 3D. Was so disappointed. I felt like I was watching what this world has become.  Kylo was having a temper tantrum because he couldn't kill Luke. It wasn't about anyone being more powerful in the strength of the force\\, it wasn't about understanding what the force is\\, it was well seems u have this thing inside of u and surprise u can do it all without understanding what it means. And don't bring Yoda in when he was the one who taught luke about understanding what was inside him and how to find balance in the force. \\nBy the way leia can fly now! So now we're superman? And why can't Finn be a hero\\, oh I know because some liberal wants all the women to save everyone. Guess what star wars has never been an only men can save the world. Look at all the times the leading ladies rescued them. \\nAnd I'm sorry but luke milking an alien cow was just dumb. So guess what Disney and all ur directors and writers this site wasn't taken over by bots! Your movie stunk! No one clapped at the movie when I went! And stop condemning mark hammill for  being honest. He's been around alot longer then you and was there when the movie actually had a storyline that wasn't crap. Remember we grew up on these films. You may have watched it and decided to change it but your \\\"change\\\" isn't what true star wars fans want. Keep your politics out of it\\, no one gives a crap about women's lib in star wars. Only you guys do. \\nJJ please fire the idiots from this film and make it old school. You brought back star trek and kept to the traditions and standards that have made it through generations.","true":true}