{"101487":142026,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I truly wanted to love this movie and left the theater decimated. I left The Force Awakens with my children and my sense of wonder renewed and two new fans in tow. The Last Jedi tried too hard to break the formula. To be a Star Wars movie without being one. There were too many divergent plot lines\\, unecessary action and purely nonsensical moments. Even the beginning crawl felt off.\\n\\nGuaranteed ways to alienate fans:\\n\\n1) Decide that plot points and areas of intrigue from previous movies don't matter. Who is Snoke- apparently the strongest force user ever who appeared out of nothingness and died in obscurity. You weren't waiting to hear who Rey's parents were right? Were you waiting for Luke to train Rey how to use the force? Not necessary\\, she's a master who can beat Luke with a stick.\\n2) Ask fans to suspend their disbelief too many times- Leia is so strong with the force she can fly through space and survive explosions but doesn't carry a light saber and doesn't  ever seem to use the force other than passively. The Galaxy's slowest chase ever speaks for itself. Somehow there aren't more ships to cut off the Resistance? Why is the first order so incompetent? At least the Empire was a real evil force.\\n3) Too many characters- The Finn and Rose dynamic was weak. It just was. You can actually leave the whole thing on the cutting room floor since they don't advance the plot and get caught. \\n4) Bloated- One last meaningless battle on the mineral planet that has no sense of urgency? Sure why not. Meaningless potential character sacrifice stopped short by a cheesy Disney moment? Also yes. End it after the lightsaber battle and I'm good. It's weak but not phantom menace weak. The third act killed the movie.\\n\\nTo be clear I didn't see this movie and think that was dumb and walk out. I was saddened by these issues. I wanted to love it. I wanted to walk out and tell the world. I almost feel like it's my fault for not liking the movie.","true":true}