{"101487":174675,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The good:\\n\\n-Amazing effects. When  rebel cruise when light speed against the destroyer. Totally amazing \\n-Really detailed scenarios.  Cantonica was really good planned. \\n-\\n\\nThe bad: \\n-Forcing \\\"funny moments\\\". I didn't want to see Luke taking the dirt out of his shoulder... he is a Jedi...\\n- Rey never got really trained by Luke. Waste of time on that island. \\\"The training\\\" was superficial. \\n- Luke was talking about the force being light and dark together but never really got into it... so much to say but didn't delivered. \\n-Superman \\n\\nThe worst:\\n- No explanation whatsoever on knights of the ren. Even though was showed on vision on the force awakens.\\n-Huge plot holes.what happened after Kylo and Rey were fighting for the light saber? How she managed to leave the failing ship on time? \\n-no rank of \\\"power\\\". Snoke\\, a highly skilled sith that looks to have amazing control with the force was killed in the worst possible way by kylo. \\n-Failed on delivering background story.  Snoke. Killed without explaining his master plan\\, his origin or even how he started to influenced Kylo when he was a child.\\n- destruction of Luke skywalker purpose. Didn't train Rey\\, didn't show his true power as master Jedi\\, and become one with the force after \\\"fight\\\" with Kylo.\\n- no substance on relevant story. Snoke\\, knights of the ren\\, origin of relation between Snoke and kylo\\, true power and wisdom of Luke skywalker.\\n\\n\\nIn a few words\\, expanded universe Luke would kick  Rey \\,Kylo\\, snoke plus red guards taking a sh...","true":true}