{"101487":101377,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A long time ago in a movie theater not that far away\\, my heart was broken into a million pieces. And Porgs were supposed to put it back together. We had to let the past die and for some reason weren't able to move forward without burning it to the ground. Not in a glorious blaze of character development and the satisfaction of answered mystery boxes. No\\, in an underwhelming pit of plot holes. And unceremoniously disposing of a mystical ancient relic by tossing it over your shoulder. Ouch. Dude. Wasn't that your dad's?\\n\\nIn an space opera about good and evil\\, how could you let the Resistance go out with the lame reason of running out of gas. Happy 40th Anniversary\\, Star Wars. I got you an escape transport so you can run away. I guess I should have been more practical and gotten you more fuel. Or really just a more interesting premise.\\n\\nPlot holes that made no sense \/ things that were just really lame:\\n\\n-Po not telling Admiral Holdo about a legitimate plan to save the Resistance and just chalking it up to she will never listen. Other people could have went on that mission.\\n-If the tracker was just on the lead ship\\, why didn't the other ships jump to light speed? Maybe get some fuel\\, maybe get help\\, then come back. Or evacuate the lead ship to the ships they weren't tracking. Then jump to light speed.\\n-Admiral Holdo not telling her troops the plan in what seems like a suicide mission to just run out of gas. Her troops gain nothing from not knowing the plan.\\n-What's this? Salt.\\n-On Crait\\, the plan was to drive clunky speeders straight toward the First Order. Not even looking for a way out of the bunker first. No one bothered to look around?\\n-The bunker really had only one entrance and exit. Except if we move this pile of rocks.\\n-The Resistance apparently has no allies. No one came to help. Even Luke just showed up in a Force projection.\\n-We are the spark that lit the kindling that struck the flame that ignited the fuse that burned down this movie.\\n-Main characters showing their \\\"bravery\\\" by going against direct orders and just making things worse. Two times (Po with Dreadnoughts\\, Finn with the giant cannon).\\n-Going on an unauthorized mission that turned out to be pointless. Again\\, shouldn't you have told your commander about that? Gotten some help?\\n-Po is a military pilot and somehow did not understand that there may be greater plans at play that he does not know about.\\n-The Resistance primary strategic ploy being to sacrifice yourself and die for the cause.\\n-Finn being willing to kamikaze pilot into a canon unnecessarily.\\n-Admiral Holdo going down with the ship. May the Force be...Jinx\\, Leia!\\n-Characters are reduced to one-dimensional and boring. Po's character is reduced to a trigger happy flyboy. Finn is still painted as a deserter even though his entire character arc from Force Awakens is that he is fighting for the Resistance.\\n-Admiral Akbar being killed off screen in one comment to make room for a character that ends up just dying anyway.\\n-Lame introduction for Admiral Holdo being to step out from between two people in the background as if she had been there this whole time.\\n-Failing a mission because of a parking violation. They don't have parking tickets or impound lots. They just throw you in jail.\\n-Not finding the code breaker who is supposedly the only person who can break the code except\\, oh\\, this random guy who heard us talking can do the exact thing we need\\, but it looks like we can't trust him\\, oh\\, we were right we can't trust him.\\n-Being expected to care about saving space horses.\\n-In the middle of the mission\\, DJ handing Rose back her medallion and everyone acting as if that matters. As if I feel something that a character I just met has a thing I just found out about from her sister who died in the opening scene who I also don't care about. Isn't there a war happening? Isn't that more important? Aren't you supposed to be doing something right now?\\n-Trivializing Kylo killing Han in the last movie. Snoke just saying it doesn't matter.\\n-Kylo can kill his dad\\, but for some reason started to catch feelings about killing his mom. Even though the whole theme of the movie was to kill to past.\\n-Kylo and Rey's Force Time phone calls. Hey. What's up. What you doing. Nothing\\, about to jump in the shower.\\n-Kylo and Rey not wondering why are we connected and able to communicate like this. If neither one of us is doing this\\, then who could it be? There are only so many other Force users. Could it be...the bad guy perhaps?\\n-Kylo and Rey getting caught holding hands.\\n-Kylo wants to start a new order. For what reason? What kind? I have no compelling reason to care.\\n-Kylo and Rey being like\\, you're going to turn\\, no\\, you're going to turn\\, oh wait\\, I turned\\, but then you didn't turn\\, I'm going to turn back.\\n-Snoke barely getting up from his chair the whole movie.\\n-The praetorian guards were terrible guards of Snoke. They just posed in the background and didn't fight until after he was dead.\\n-Snoke being so powerful\\, but then not being able to detect the light saber next to him.\\n-The three main characters having separate storylines with almost no interaction. Lost opportunity in separating Finn and Rey for basically the whole movie.\\n-Po introducing himself to Rey in the most uninteresting way ever. Hi.\\n-Yoda being able to light things on fire as a Force ghost.\\n-When the Supreme Leader dies\\, Kylo becomes Supreme Leader. That's not how Supreme Leader works. They didn't call Vader \\\"Emperor\\\" after killing Palpatine.\\n-Leia has not really used Force powers and then suddenly has the strongest Force powers ever to move through the vacuum of space.\\n-Droids and Chewy are more of a gimmick and have no purpose essential to the plot.\\n-\\\"That's how we're gonna win. Not fighting what we hate\\, saving what we love.\\\" Love will save us all? This isn't Star Lessons. This isn't Full House Wars.\\n-Hero being reduced to a grumpy old man. Help-me-Obi-Wan-Kenobi-you're-my-only-hope video is for some reason the only thing that gets me up in the morning. Besides milking the space cows. Gotta have my milk.\\n\\nI'm crushed ok. I think it could have been good. Ok\\, you want to make a new Star Wars\\, throw everything we know out of the window\\, change everything we know about the Force. Alright\\, I could be on board. But do it big. Execute it correctly. Make it bad ass. Build to a point and shock everybody. Reveal more about a character. Have people wonder what's next. Give us something to talk about for the next two years.\\n\\nNot this anti-climatic your parents are nobodies BS.","true":true}