{"101487":167181,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-21","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Since I saw TFA I wrote the Disney trilogy off and don't consider it my personal canon.\\n\\nI set that aside and went to see it to see if it held up as a good movie in it's own right. Unfortunately the whole movie turns on a paper thin main plot which involves a nonsensical capital starship \\\"chase\\\" that just doesn't make sense in any sci fi universe. This movie goes nowhere and advances the new trilogy nowhere. none of the new generation of lead characters developed in any meaningful way. Instead more 1 note characters were added. How they're going to tie up this underdeveloped mess with a finale is beyond me\\, almost no time has transpired since the trilogy kicked off.\\n\\nThere were some impressive visuals and some great scenes if you isolated them\\, this ultimately amounts to nothing when none of them make any sense or matter in the context of the larger plot.\\n\\nThere were so many opportunities for twists that they toyed with that would have added some development to the established characters and some much needed emotional weight to the film. Unfortunately they didn't have the balls to follow through and take the full step. They just dipped their toes in and out with every character but ultimately chickened out and returned to the status quo.\\n\\nI enjoyed this movie more than The Force Awakens purely because I'd already adjusted my expectations to rock bottom but at least TFA had plot points (derivative though they were) and it actually went somewhere\\, the main story involved an actual journey and set some stuff up. TLJ was backed into a corner with some awful plot devices from TFA (the map) so that wherever they chose to go with Luke and in general was never going to make sense and explain that away\\, but\\, my God; any momentum the original had set up TLJ went out of its way to snuff out. \\n\\nDon't get me wrong\\, it's fine to change course if you replace the original premise with something equally or more interesting. For example\\, killing off snoke after such a buildup in TFA was bizarre\\, especially since there was still 0 exposition of the character's past or his goals. You just have to laugh at the lack of effort to actually make it cohesive. That said\\, in the moment I thought that was the greatest scene of the movie because it was unexpected\\, Kylo actually showed some development and they had to balls to go down that road in the middle film. bbbut then they just reverted back to the status quo\\, so what was Kylo's motivation to kill him in the first place? certainly seemed like it was coming from a place of compassion and not ambition. Nobody behaves like an actual person would behave in this movie\\, people's motivations and worldview turn on a dime without justification. There are sooo many wishy washy moments like this which stink of bad writing and indecision. You can't have everything go every way Rian\\, that doesn't constitute a plot twist. That's just fucking annoying.","true":true}