{"101487":100779,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-31","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Ahem Ahem\\, alright so to start things off lets start at chapter 1 of went wrong then ill tell you what the half star is for. (Chapter 1) Mary Poppins 2 or better known as the Leia scene\\, was trash. Had friends tell me \\\"Bro this is new ways we are seeing the force\\\". Hell no\\, 1st off she gets nuked out of the bridge plus admiral akbar gets the most wackest death I have ever seen. But wait there's more. Then she Mary poppins her self back into the ship and is like a-ok? Just plain old stupid. (Chapter 2) So star wars has never ever in the entire series focused on two ships just sitting in space for 2hrs to just to watch the slowest car chase of the century. Then on top of that they send out like one wave of fighters and bombers and that's it? Come on guys first order is like legit disgrace to the empire. (Chapter 3) Luke goes in to like cardiac arrest on the hill. Yeah its pretty depressing to watch. We wait to years to see him make the point of episode 7 retarded and sip on some alien tit milk along with hitting Rey with a stick and getting owned by her. Oh by the way just to throw this in he kinda just sniffs her hair and tells her to feel the force and your all good\\, thats like the entire training he gives her which = NOTHING. (Chapter 4) Oh yes the Casino scene oops my bad i mean Space Seabiscuit. Yeah.... Useless. (Chapter 5) Ah yes the Jokes. This trilogy has taken star wars original trilogy and made it irrelevant and dumb because we about to watch how whinny anakin 2.0 or (Kylo ren) whines over wanting to be like grandpa so somehow his master that does not have any lore dies by like super easy\\, not even a battle just like so easy that it was not even funny. By the way spoiler guys.... Luke takes the lightsaber and chucks it over the cliff like its some old stick\\, with that nice quite moment so we can be forced to laugh. yeah it was rough.\\n\\nHeads up guys the critics are trash 348 critic reviews makes 91% vs the Audience Reviews which is 51% coming from 162\\,275 Audience Reviews. Yeah it was bad and the movie will never ever live up to ANY of the other star wars movies\\, honestly at least Phantom Menace actually had a lightsaber battle. R.I.P Carrie Fisher...","true":true}