{"101487":133812,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have never reviewed a movie on RT before (or anywhere else for that matter) but I felt I had to give my thoughts on this Star Wars film.  \\n\\nI won't go into details of why it sucked (I think it has been well documented at this point 1. Marvel Humor. 2. Was Snoke in the Movie? 3. New Characters Sucked. 4. Luke was a whiny Bitch. Etc)\\n\\nThe main disappointment for me is simple - I'm not excited to see Episode 9 after watching The Last Jedi.  \\n\\nEpisode 7 'The Force Awakens' had me looking forward to this film for well over a year\\, I actually read articles about the release of this movie with anticipation on the mysteries that were begun in episode 7.  This film essentially was a Monty Python Holy Grail version of Star Wars where the big climax is interrupted by the Police arresting the main characters.  If this movie where a 'Choose Your Own Adventure Book' I would not have chosen ANY of the adventures that this film gave me.  I really wish Disney would just say \\\"kidding\\\" and show me the REAL Last Jedi movie. \\n\\nFor those who argue the true measurement of a movies success is the Box Office\\, they are wrong in the Star Wars sense because the Box Office of this film (especially opening weekend) is really a measurement of how much fans liked the LAST film.  The measurement of The Last Jedi will be Episode 9's opening box office.  I for one can say that I will not pre-buy tickets for this film and at this point will probably wait until it comes out On Demand.  \\n\\nThere you have it.  Rian Johnson\\, please go make a f-ing Spider Man or Aquaman film and leave Star Wars alone!  Is it too late to fire him?","true":true}