{"101487":138058,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Initial thoughts on the Last Jedi. First Kelly Marie Tran steals every scene she is in. I cannot wait to see her in her next movie. She is a great character made better by great acting. She was excellent.\\n\\nSecond what will it take to get rid of JJ Abrams? I am so tired of movies that are just retreads. If you watch The Empire Strikes Back and the Return of the Jedi you can skip this movie. They just continue to steal and steal\\, never trying to create or add to the plot arcs that Lucas built. It is really frustrating how lazy it all is.\\n\\nI desperately wish it was more original or did a better job stealing from George Lucas.\\n\\nAfter Rogue One which is now one of my favorite Star Wars movies\\, it feels even worse. Lucas had a beginning middle and end. A story that never ends is exhausting and silly\\, it makes the sacrifice in Rogue One a Sisyphean tragedy.\\n\\nFor the Last Jedi in terms of Star Wars canon there was a scene with Leia I found to be ridiculous and not needed. It just broke too many rules. I wanted to walk out right then. You could have done the same thing without breaking so many different logical force rules and allowed a more dignified end for Admirable Ackbar.\\n\\nThere were things I liked a lot. I thought Leia's growth into the movie was amazing and fitting and nearly made me cry at the end. I think Daisy Ridley is an amazing actor who gets everything there is to get out of the scripts.\\n\\nBut again I was super frustrated how flat Rey is as a character. I get the reason\\, as Kylo Ren gets more evil he gets more emotional and thus Rey calmer. I get the lazy light and dark. Daisy Ridley gets the most out of her poor lines and ads depth without the story arc to back it up.\\n\\nI am super frustrated how flat Rey is as a character. I get the reason\\, as Kylo Ren gets more evil he gets more emotional and thus Rey calmer. I get the lazy light and dark. He is more developed. Daisy Ridley acts the shit out of her poor lines and ads depth without the story arc to back it up.\\n\\nI hated that most of the Women the movie were just wise old magic negroes helping men on their journey's to understanding rather than dynamic characters. \\n\\nI can't say enough times that for me Kelly Marie Tran stole the movie. I thought her as Rose was just perfect and drove what was otherwise a frustrating plot line. It was made better by her character and her acting.\\n\\nI don't understand the universe we are now in. In Star Wars a New Hope George Lucas sets the political scene we are operating in\\, and uses it to drive the plot and morals. Why is the resistance a resistance and not with the New Republic? What is the relationship of the blown up Republic to the New Order? If there isn't one why isn't it just the Democratic Republic vs. the New Order why is the resistance by themselves? Why is it a resistance? What about Naboo or other democratic worlds? Why is support scattered on the outer rim (where there is normally lawlessness and huts)? Why is there now an entire resistance on the Millennium Falcon? It just is never explained. \\n\\nJ.J. Abrams is so ham handed I actually picture him with ham hands stuffing piles of money in his pants. He takes other people's works of art and turns them into cheap tchotchkes to be mass consumed.\\n\\nWhy I love Lucas' movies especially Star Wars is the thoughtful arc that also teaches important lessons.\\n\\nAs a movie the Last Jedi was fine. Rian Johnson is clearly talented. With the crap JJ gave him\\, it clearly was an impossible task.","true":true}