{"101487":189080,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"TLJ was good\\, lots of action and tons of information but not a lot of answers. Seems like it would of been better served to cut the plot shorter to allow for less information and more character development & pitches.  I think Kylo Ren grew up but still left me wanting more. Rey is a carbon copy of Luke in ESB\\, with her eagerness to be all things Jedi but Luke fails at being her Yoda. I think this story is so vast now that trying to tie the ends on things that multiple have their hands in is next to impossible. Trying to fix something that the creator of the epic drama could not due himself and caused him to sell off his passion. Maybe its time to let the Saga of Rebels versus Republic\/New Order end and move on to the stories of the characters who made the original trilogy a cult phenomenon. I love the Star Wars films\\, even the unbearable prequels because it is Star Wars and it is what I grew up on. I think it is time to let the galaxy rebuild and move on to the like's of Boba Fett and Han Solo. Disney is trying to heard cats and that is never going to happen to everyone's liking. Their agenda is to sell a grand park opening in 2019 and I do not think they need to force feed us an abundance of non-connecting story lines in order to sell the Star Wars land attractions. As James Earl Jones said in \\\" Field of Dreams\\\" if you build it they will come\\, for reasons they cant even explain. We love Star Wars we will keep coming back\\, I think we need to understand we need to adjust our expectations.","true":true}