{"101487":189777,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To start\\, I'm not some mega-super fan.  I'm 33 years old and I've seen all the movies\\, but I'm not a convention going maniac.  I'm just a fan that really disliked this movie and here's why.  1) This movie\\, along with the last one\\, was given very little thought.  What do I mean?  For starters\\, who was Snoke?  For being the Supreme Leader\\, we know nothing\\, then he dies.  2) It didn't deliver.  The best part of Episode 7 is when Rey finds Luke at the end\\, and there is this moment of great hope\\, as he stands there\\, epic music blasting.  He is back.  He's going to lead the fight.  Nope.  He wants to end the Jedi forever.  He doesn't want to fight.  He never leaves his island.  He force projects himself once to buy 20 rebels time to escape and then he dies.  Great.  \\n\\n2) This movie was CHEESY.  Leia is immune to the cold vacuum of space?  Seriously?  Watching Leia fly through space with no helmet or suit and making a full recovery is a joke.  She can do that\\, but can't do anything else?  \\n\\n3) The space battles everyone keeps talking about.  No.  I've played X-Wing vs TIE Fighter.  These battles are pathetic.  First of all\\, apparently none of the rebel capital ships were given any guns.  They literally do not fire a single laser and just run the entire movie while getting shot at and dying.  Their bombers are some kind of joke that slowly fly over capital ships and drop their bombs\\, as if somehow gravity magically started working in space.  GRAVITY IS NOT A FACTOR IN SPACE BATTLES you idiots.  \\n\\n4) This movie kills off Ackbar like nothing.  His death is barely a footnote.  If this is all that's left of the rebel alliance...4 ships\\, WTF happened?  How can they keep winning movie after movie\\, and still be so weak?  There are some of us out there that actually just want to see Luke Skywalker and Admiral Ackbar lead a decisive attack that cripples the imperials\\, wrecks all their star destroyers\\, and annihilates the dark side.  We don't want to see 20 rebels fleeing for their lives for 2 hours.","true":true}