{"101487":135361,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I loved it!\\n\\nFuck all the haters.\\n\\nIt is a real war movie that shows grit and complexity of war and the human condition. Luke has a very sober look at the entire saga. All the complaints of TFA were addressed by Snoke and Luke. It was a roller coaster.\\n\\nThe soundtrack was great. I wish there was a callback to \\\"battle duel of heroes\\\" song when Luke fought Kylo.\\n\\nIt was perfect and I didn't know where it was going.\\n\\nNOBODY SHOULD BE SURPRISED AT THE MOOD AND THEME AFTER SEEING ROGUE ONE. IT ISNT LIGHT HEARTED LIKE THE PREQUELS. ITS WAR.\\nIt's great. There are a lot of complexities to war. I also loved how many emotions and love towards animals there were.\\n\\nDefinitely #3\\, maybe even #2\\, favorite StarWars movie.\\n\\nThings I want to see in future StarWars films:\\n\\na spy\\, unknown to us until the third act\\, among the First Order or the Resistance.\\n\\npeople that fight for the Resistance for their own gain. For selfish reasons.\\n\\nI loved the mutiny. Poe Dameron\\, General Hux and Kylo stole the show. I want to see more of Kylo. He's the Anakin we didn't get in the prequels (because of writing not because of acting. There were amazing actors in the prequels\\, it was all directing and writing that was bad).\\n\\nI want to see General Hux and Kylo team lead the First Order. Hux being reasonable and holding back kylo\\, Kylo being raw strength and power. It's great.\\nI loved seeing Captain Phasma as a human before she \\\"died.\\\"\\n\\n10\/10\\, I loved it as a war movie. Then again my favorite movies\/shows are : Fury\\, The Dark Knight\\, and Band of Brothers.","true":true}