{"101487":130653,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I didn't want to hate this. I really wanted to like this because I love Star Was and I grew up watching these movies. Yet\\, I just can't get over some of the stupid choices they made. \\n\\nFirst off there was nothing added to further the plot. No character was developed. The movie was long and dragged on and on for the first time I was waiting for it to be over. There were parts I liked\\, don't get me wrong\\, but the bad outweighed the good here for me. \\n\\nThe movie puts so much emphasis on Rey's parentage to the point your expecting it to be someone like Luke being he father or someone we know. However\\, instead she is a kid who was sold by parents for a drink. The movies shoves in your face that Rey's parents were important. The Force Awakens does the same and it leads to nothing. My guess was the movie wanted to make you believe that you don't have to have a strong lineage to be good at something? It felt like a gimmick and a reveal that was such a let down. \\n\\nThe comedy was too much. Now comedy is good to break tension after long scenes of heaviness to give the audience break. Comedy is good when it fits a  character. In the scene where Luke locks Rey of his house\\, Chewie breaks down the door. To the audience its funny because we can see Chewie doing something\\, especially after Han died\\, he has a right to be angry and want to see Luke. However\\, after that we just get comedy every other second where it becomes distracting and annoying. Those birds\\, called Porg\\, were used to make us laugh and feel bad for hurting such cute creatures... more like \\\"REMEMBER TO BUY ME AT YOUR LOCAL TARGET AFTER THE MOVIE!\\\" \\n\\nPo's story was stupid. Yes\\, he is our hotshot pilot who doesn't follow the rules but he never learns anything. Also\\, he gets so many people killed and doesn't listen to his superiors. After Admiral Holdo takes control after Leia is in critical care\\, she shoots down Po's plans and advice without any rhyme or reason. This causes Po\\, Finn\\, Rose\\, and BB8 to do their own thing that causes more trouble for the rebels. The rebels are losing fuel for their ships while being chased by the First Order. The rebels were trying to evacuate to nearby planet one they were close enough so the First Order sensors wouldn't catch the escape ships leaving. Instead of anyone telling Po\\, Finn\\, and Rose this plan\\, they don't\\, and so more rebels die because these 3 are trying to \\\"save\\\" everyone. The point was for Po to learn to listen to chain of command but with leader that dumb I wouldn't listen either.\\n\\nAlso\\, the character Rose is uninteresting as ever. Her backstory is she was a slave or something and she just spouts in exposition\\, her sister also died. She is pointless and I felt was just to fill a quota. If you're going to add a character why not make her more interesting. Also\\, apparently she likes Finn as she kisses him. Later on Rey catches Finn looking at Rose as she is injured. Is this the start of SHIPPING WARS? I hope not. Oh and Po introduces himself to Rey so now it can be love Square.\\n\\nLuke was a mix thing for me. Luke would do anything to save his friends and father in the original trilogy. He defeated the darkness the emperor and tried to bring out of him. This movie has him trying to kill his nephew only to stop and feel ashamed of it because he felt darkness in him. That makes no sense. Luke cares for his friends\\, his family. That was the quality of Luke that made him a hero that fans loved. He wasn't perfect and he messed up but the one thing he did was care for people. Why would he not help his nephew? Also\\, Luke milks a sea creature with large breasts and drinks its blue milk. He also gets a visit from Yoda who looks bad. \\n\\nLeia is able to survive being sucked into space. I guess the force allows you to breathe in space now?\\n\\nSnoke\\, who was this mysterious leader of the First Order is killed by Kylo Ren. Kinda of  a let down because he showed himself as being able to throw Rey around like she was nothing. Only to have Kylo killing him because he believed his apprentice would not betray him. It was obvious it was going to happen. The build up to Snoke felt like a waste of a character just to give Kylo Ren the spotlight.\\n\\nThe visuals were good. The worlds looked beautiful and the battles were good The light saber battles were raw and felt right. There were no crazy flips and jumps in the air for no reason. I did like the shot of when Holdo threw her ship into hyperspace to blow up one of the star destroyers. The shot was cool (despite opening a can of worms). The acting was good but the script did them no justice. \\n\\nI didn't want to be a hater of this movie. I even avoided all social media\\, reviews\\, and what not to form my own opinion\\, knowing the \\\"haters gonna hate\\\" mentality that goes on with movies nowadays. I just can't honestly praise this movie for how much I just did not enjoy it.","true":true}