{"101487":196966,"Last Jedi":"Last Jedi","2017-12-15":"2020-01-31","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Why are y'all still tryna put this movie down? The Last Jedi gave the trilogy that substance that it needed to survive. Luke's character actually had depth and meaning\\, while still paying homage to the original series. On top of that\\, this has the best cinematography of literally any star wars movie... Ever. Almost every shot in this movie could pass as my desktop wallpaper. \\n\\nEveryone seems to miss the whole point of the movie. They're mad that Luke is a grump\\, they don't like that the good guys didn't win\\, and they don't like that Poe and Finn's plan didn't work. The whole point of the movie was that failure is the best teacher\\, as said by Yoda himself. Luke is a sad dude in this movie who later redeemed himself through one of THE COOLEST force abilities ever. The resistance badly looses to the First Order\\, but still manages to survive in incredibly small numbers. \\n\\nThe biggest problem with this movie\\, as well as the other sequels and prequels\\, are the fans. They don't know how to accept change\\, even when it is necessary. That's the exact reason why George Lucas HIMSELF sold Lucasfilm to Disney (for an extremely undervalued price of $4B). He was burnt out. And the catalysts were the fans who harassed him in the streets and online for \\\"ruining their childhood\\\". What's he supposed to do?! Make the same movies over and over again? That's not creative. Might as well waste your money on something more productive\\, such as... I don't know... Making a new movie with new ideas...","true":true}