{"101487":167964,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So I will preface this by saying that I consider myself a die hard Star Wars fan (seeing the movies an uncountable amount of times\\, watching the tv shows and reading the books) and I don't understand all of the backlash from fans. People who hate this movie make it seem like it completely undid every single piece of Star Wars and ruined it. The movie takes a few plot points from TFA and says that it doesn't matter because greater things are in play. People seem to mistake this an insult to fans. I think there is a problem with fans having so narrow and specific expectations and lashing out against anything other than exactly what they were expecting. This film is bold and constantly tries to subvert the audience. That's why it's so great. It isn't a carbon copy of empire and dares to expand the Star Wars universe and it's powers while offering ample satisfying and touching moments of fan service. Luke's journey in this film is so mature and so complex. He's facing the problems that come with age and that come with his life. People mistake that for whiny. He is a complex character who has grown since the original trilogy and now must have his heroes journey again. This movie isn't perfect (canto bight) but it has some of the greatest moments I have ever seen in Star Wars\\, providing such fitting closure to the older characters while paving the way for the new ones. It offers the best explanation for the force and features new force powers that show its power (and Luke's power). This is a gorgeously shot film with complex themes of balance\\, mentorship\\, leadership\\, hope and desperation which perfectly blends old and new characters. It is truly a Star Wars film unlike any other we have ever seen before.","true":true}