{"101487":122871,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Georges Lucas wrote better minority character. PERIOD\\n\\nBesides Jar Jar\\, The federation guys and Anakin's owner in TPM who rightfully deserved criticism\\, there's never been an ounce of Tokenism in a star wars film. Although a bit Euro-centric\\, the cast was diverse and inclusive\\, for humains as well as for aliens. A vast Universe rich of characters\\, planets\\, bestiary and Vehicles...\\nBut The Galaxy has never felt so small and earth bound since Disney took over. And this breaks my heart....\\n\\nThe fact that this is my 1st ever online review of a movie in my 32 years of life is quite telling. Those are the words of a true fan. \\n\\n\\nNow as to the film...\\n\\nI was thrilled when JJ was announced. I was tricked into thinking Finn was the new hero. A let down. But so much was established: Knights Of Ren\\, Snoke\\, Finn's past\\, Rey's parents\\, Poe. Luke's whereabout\\, Maz.... SO much I gave the saga a chance to redeem itself and forgave mistakes present in the first Chapter. \\n\\nThen Rian Johnson was announced. I WAS STOKED!!!!!! Another true artist at the helm. And I was let down and tricked again. \\nYOU CANT DO FINN RIGHT. HE SERVES NO PURPOSE. Not even as a love interest for Rey? You had to take that away from us too. The only black character is literally a cowardly space janitor who's only motivation FOR TWO MOVIES STRAIGHT is vagina. WHY DISNEY?\\, why? \\nThe Tokenism of Finn & Rose is so strong it's an insult to all the minorities out here who like me would sacrifice their last dollars for a new SW experience in the theatre.\\nRian\\, Lucasfilm\\, Disney\\, you don't care baout us. You care about our dollars. It's clear now.\\n\\nIm not even gonna delve in the way they treated Luke. Mark disagreed\\, he was right. Remember lucas comment about white slavers? Turns out now\\, he was right. \\n\\n\\nI give 2 star for Rian's excellent directing and sense of aesthetics. But the story is a spit in the face one too many times...\\n\\nI thought Lucasfilm\\, Disney were a force for Change. Sadly They left the force over change.","true":true}