{"101487":121393,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"First review straight after watching movie... four stars. \\n\\nThere are one or two corny bits but on the whole\\, epic movie.\\n\\nIt marks the end of a long starwars era and the beggining of a new story. \\n\\nYou need to look at the movie this way because it will spit you out the other side confused about what the movie was. I need to think more about this movie.\\n\\nSecond review after reflection...\\n\\nLuke Skywalker was turned into a joke of a character. It's a real shame what was done to Luke. He had unshakable drive for the light and the movie does not do him justice. They should have turned him into an obiwan all powerful Jedi instead of the hermit tit drinking bum. \\n\\nThere are some major corny lines about being a rebel throughout the movie \\\"Im a rebel\\\" \\\"go rebels\\\" \\\"we are rebel scum\\\". It was cringe worthy. \\n\\nThere is a girl with purple hair that is terrible in the role and gives a lot of thick cheese. She does this big speech that is meant to be inspiring and seems like something from the Brady bunch. A scene then follows where Leia and her argue about who will say may the force be with you.. no you say it\\, no I went last time\\, it's your turn... Lastly\\, there is a slow scene where she sacrifices herself for the good of the crew. Who gives two hoots?! Admiral Acbar was just killed off and nobody even noticed and this purple haired Brady bunch wants us to shed a tear for her passing.. No.\\n\\nThere's a great casino setting that involves a horrible scene with lots of racing cows. Two starwars characters ride one and somehow remain seated on it while the herd rampages the casino\\, runs up a cliff face\\, through fields. It's like a jar-jar-binks-fantasy-bull-camel thing. Lost sense of relism that made starwars so special in the original films. \\n\\nThere's a super weird bit when Princess Leia is blown into space and killed and then comes back to life and floats back into the spaceship with wonderwoman like powers and white tingly skin. No idea what this was all about. super weird. \\n\\nToo much humour. Not the dry sarcastic gritty humour of Harrison Ford\\, but the slap-stick guardians of the galaxy humour that is not quite right in a starwars film. \\n\\nAll the plots and deeper stories from prior  movies are stomped on. Let's start fresh and do our own thing. \\n\\nThat is why this movie is so weird\\, because I actually enjoyed the film\\, but came out with this confusion. Despite all these fatal errors\\, there were many moments of brillance. \\n\\nKylo Ren is a fascinating character. Moody teenager turning evil. I love seeing his character develop. There are epic battle scenes through the movie\\, the initial space battle to take down the dregnaught\\, probably the best space battle starwars has seen. \\n\\nThe dazzling light saber battle with Ren and Ray again red guards. Amazing. \\n\\nA white sand battle with land speeder type things. The movie is that good in places\\, most of the time\\, that you don't care about the extreme cheese\\, until reflecting on this afterwards. \\n\\nTo look at the movie as a standalone\\, fast paced\\, entertaining\\, epic battle scenes in a fantasy world some of the best starwars has ever scene. Looking forward to the next chapter.\\n\\nTo dig deeper into the film and really critique it flares up anger. Left feeling.. weird. \\n\\nLike flying wonderwoman princess Leia.\\n\\n\\n\\nBut this should have been so much more. The most important thing was to pay appropriate tribute to Luke and it was a dismal failure. \\n\\nThat being said\\, I still strangely want to watch the movie again...","true":true}