{"101487":113524,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Compared to Rogue one and the Force Awakens\\, this was by far the worst one. Lets go through the movie step by step and see what I liked and didn't. I liked the action scenes at the beginning and end and the plot of have them being chased by the Star Destroyer. The returning characters from the Force Awakens were still good and it was good to see Luke actually do stuff this time. The light speed ship splitting the Star Destroyer was probably my favorite part. However there are many things I did not like. The humor in this is not done well compared to Rogue one and the Force awakens. It just felt as if it was thrown in there without any input from the first movie. Also this time there was a different director and he made it feel less of a star wars movie by adding Battlestar Galactica elements in it. This goes with the pilot betraying the new commanding girl officer with mutiny which was dumb. Also the whole thing about going to the casino planet to find the code breaker was just a waste because it accomplished nothing in the end. They don't even follow up on it. I also did not like the dialog scenes with Ray and her brother. Those just dragged on. Finally we get to see the supreme leader and that white storm trooper on screen for less than 5 minutes then get killed off. Whats the point of having that in there instead. The ending scene on the salt planet was really just thrown in there at the last minute so that Luke can be killed off too. Same with Laia getting killed off too and somehow coming back to life using the force. Overall\\, it was enjoyable to watch but it is by far worse than what i expected it to be. For episode 9\\, JJ abrams is coming back as director so I hope it turns out a lot better than this one did.","true":true}