{"94533":"94192","UD":"UD","2015-09-30":"2015-09-27","8":6.0,"História espetacular\\, ótimos gráficos\\, porém a movimentação dos personagens não é boa e o jogo é totalmente linear. Apesar dos problemas é um grande jogo.":"Until Dawn is only okay and didn't live up to expectation. The game states that it's possible to keep everyone alive\\, that right there is a lie ( I won't tell who) and it's a decide how the character dies who dies. And the choices some purpose but most are only to increase relationship and characteristics stats. There was one point where I wanted one person to stay alive and in to die butUntil Dawn is only okay and didn't live up to expectation. The game states that it's possible to keep everyone alive\\, that right there is a lie ( I won't tell who) and it's a decide how the character dies who dies. And the choices some purpose but most are only to increase relationship and characteristics stats. There was one point where I wanted one person to stay alive and in to die but it always kills the same person with every single choice because of a huge plot devices later in the game making it too linear. And the choices don't matter because of one slap in the face ending like Mass Effect 3 except of what color of the explosion was\\, it was how many people got out of the house. Besides the poor butterfly effect mechanic the game looks gorgeous and game play maybe repetitive but is cool with use the controller itself and not just the buttons. The acting is great although some cheesy one liners can be heard and the horror elements are very well used although some people may get bored with the jump scares.\r\rOverall this game is alright with great graphics\\, game play and acting but the whole butterfly effect mechanic is disappointing\\, it does change how some people die but no matter how many times you play it one person always dies\\, and ending is always the same killing any chance for replay ability. The story is a joke as well and the Doctor Hill parts are worthless during the end.… Expand","true":true}