{"101487":169339,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILER: If you have valued this franchise since childhood\\, Mark Hamill himself has stated that there is no way it will match nor satiate the nostalgia factor that fans crave. That being said\\, this film was garbage even by Disney’s poor standards. It encapsulates the bastardization they envision for the franchise. Namely so\\, the sole purpose of marketing to children and their gullible parents who will buy them Star Wars merchandise and Disney park tickets. I was open to see where the story would head since The Force Awakens left so many unanswered questions\\, leaving the viewer on a cliffhanger much like a device used in modern prime time television. This film not only shades away from answering most of the essential questions left open\\, it also destroys character arch and rational believability. There is a scene that is so bad with Leia where they not only could have killed her off in a dignified manner\\, but also would have created some genuine emotional pull\\, but instead they had her survive being sucked into the vacuum of space and live through using the Force to drift through space. This was a hilariously bad scene which destroyed any merit this trilogy may have had. Much like Leila’s lines near the end of the film: “We fought until the end but the galaxy lost all its hope. The spark is out.” This quote adequately reflects how most fandom feels about Disney’s handling of the franchise thus far.","true":true}