{"101487":158682,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Nýjasta innleggið í Star Wars sögunni er nú komið út og hefur valdið talsverðu fjaðrafoki (sem ég skil hreinlega ekki en hvað með það). Að mínu mati er Last Jedi með bestu myndum sem komu út á síðasta ári og er samkeppnin að því leyti mjög mikil.\\n\\nHún er að vissu leyti mjög ólík öðrum myndum í Star Wars heiminum og tekur vissar áhættur við að segja sína sögu. Hins vegar skilar það sér í atburðarrás sem er ófyrirsjáanleg og um leið mjög spennandi. Stór hluti myndarinnar leggur að mestu áherslu á sálarlíf persónanna sem um ræðir - þar af leiðandi finnst mér mjög skrítin gagnrýni sem.maður rambar á í tengslum við þessa mynd að persónusköpunin sé lítil. Þvert á móti finnst mér hún vera mjög góð og þungamiðjan í myndinni. Þar að auki eru spennuatriðin frábær og tæknibrellurnar að vana einstaklega flottar.\\n\\nÞað er flott að sjá Daisy Ridley halda áfram að blómstra sem Rey - að vísu er Rey áfram\\, líkt og í fyrri myndinni\\, furðulega fljót að tileinka sér listir Máttarins en mér fannst það eiga við um Luke í upprunalega þríleiknum einnig. Adam Driver heldur áfram að vera frábær sem Kylo Ren og Mark Hamill stendur sig einstaklega vel. Samspilið milli Kylo\\, Luke og Rey er persónulega það besta við Last Jedi. Almennt finnst mér leikhópurinn í heild sinni standa sig mjög vel.\\n\\nÉg hlakka mikið til að sjá hvernig J.J. Abrams klárar síðan þennan þríleik en af fyrstu tveimur myndunum að dæma verður það stórkostlegt.","true":false}