{"101487":107145,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Awesome film. Spoilers below\\, if you don't want to know anything before going to see this film\\, then come back when you have seen it.\\n\\nIt seems that the common nitpick was that Star Wars\\, Episode VII: The Force Awakens was a rehash of A New Hope. Having said that\\, it was the beginning of a \\\"heroes journey\\\". Of course it had similar beats. Same could be said for a lot of franchise starters. Most myths have a common structure. \\n\\nHaving said all that\\, some people feared that the Empire Strikes Back was going to be the template for The Last Jedi. It turns out that it was surprisingly original and attempted to do something different. Sure there is sequences in the film with Jedi training that hearken back to Yoda but the approach is much more different and unexpected. Yoda had been expecting the son of Anakin Skywalker to come seek his help. Luke was done with the Jedi order and did not want to be found. Some people totally miss the point of the sub-stories in the film as it has been pointed out that they did nothing to help the resistance\\, in fact those actions made the situation worse. Not that I ever interviewed Rian Johnson but I would safely assume that those scenes are to show the audience that Poe is not quite ready to lead the Resistance yet as he makes some rash decisions. This was proven to him by both Leia and Holdo for the suicide bombing run mission and to send Finn and Rose on a mission whereby sensitive information fell into the hands of a mercenary.\\n\\nI could go on about other issues people may have however I think this comes down to is fans picking apart trailers and over analyzing them. They think they know what is going to be unveiled and they are frustrated because things didn't go the way they thought they would. Fans should have learned this lesson from the previous two movies from Disney\/Lucasfilm but they didn't. An example of this is the last theatrical trailer you could hear a voiceover by Snoke at the beginning of the trailer and people thought that it was in reference to Rey and not Kylo Ren as it would have been too obvious to be about him. Anyone who has seen the film knows how that really went. \\n\\nIt seems if you stick to closely to original trilogy you are not being creative enough. The flip side of that is if you try something bold and different then it isn't Star Wars enough. It is impossible to satisfy all fans.","true":true}