{"101487":185133,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie is terrible.  A few further thoughts:\\n\\n1.  There is not much of a general consensus where this film is concerned\\, except everyone seems to agree the Finn\/Rose storyline is bad\\, with some of the same flaws from the prequel trilogy.  But how can that have possibly happened?  How is it possible that the filmmakers did not see the resemblance to the prequels and course-correct?  The storyline features racing and slave children for god's sakes.  No one involved in making this film saw that and thought of the Phantom Menace?  They should have.  Then maybe they would have been reminded not to let the story devolve into an over CGI'ed completely unbelievable idiot crapfest.  I just don't understand how this could have happened.  How hard is it to not have your movie be an over-CGI'ed idiot crap festival?  Do I remember correctly that at one point the characters are riding the alien horse-dogs straight up a cliff?  The entire horse-dog alien chase does not look believable for even one second\\, but that moment in particular stands out from the rest of the crap.  Again\\, how could this have happened?  They really missed a layup on this one.  I don't understand how they could have accidentally turned things into Star Wars cartoon after this exact same mistake was made in the prequels.  Maybe the filmmakers like cartoonish CGI nonsensical idiot garbage?  They watched the announcers and crowd shots during the pod-racing sequence in Phantom Menace and thought \\\"what a great idea!\\\"??If so\\, they shouldn't have been allowed to make a Star Wars film.\\n\\n2.  Why does the movie keep referencing contemporary American culture\\, lingo and experience?  It takes the audience out of the movie. Makers of this film:  don't you want the audience to stay engaged in the world of the film?  Examples:  Poe's prank call to Hux (there should be no such thing as being \\\"on hold\\\" in the world of Star Wars...and at one point the \\\"can you hear me\\\" calls to mind the Verizon commercial \\\"can you hear me now\\\"); Yoda uses the phrase \\\"page-turner\\\"; Finn\/Rose get arrested for a parking violation (there is no such thing as a parking violation in the world of Star Wars!).  Eliminating these references would help keep the audience within the world of the film...which is a necessary pre-condition for emotional engagement with the characters and story.  Cutting these references would also have the side benefit of eliminating complete jarring idiocy from the movie.\\n\\n3.  Phantom Menace is not good.  I can't honestly say TLJ is worse.  But TLJ is definitely more infuriating.\\n\\n4.  Another thing that we learned from the Phantom Menace:  little kids in Star Wars films sucks.  E.g.\\, little Anakin\\, the younglings.  And now we get this piece of crap with the stable-hands using the force to sweep a broom or something?\\n\\n5.  This movie manages to accidentally reference Oliver Twist and Mary Poppins.  That is totally incompetent filmmaking.  \\n\\n6.  This movie is closer in tone to Spaceballs than it is to the Lord of the Rings trilogy (or even the Hobbit trilogy).  That is a problem.\\n\\n7.  This film is people who think the problem with Top Gun is that Maverick never gets taken down a peg by his superior officers.  For people who think the problem with Ferris Bueller is that the scolds don't triumph; Ferris should have gotten caught and punished\\, with the message of the film being: cutting class is wrong.\\n\\n8.  I really liked The Force Awakens.  It has its problems\\, but I like Rey a lot\\, and it set up some really intriguing questions:  who are Rey's parents?  What is Luke going to say?  What was with Rey's force vision?  I personally didn't really care about Snoke's backstory\\, but I could see how some people did.  For anyone who found any of that interesting (which was a lot of people)\\, this film is a crushing disappointment.  Worse\\, it's an insult.\\n\\n9.  You cannot have Rey's parents be nobody.  You could have if The Force Awakens never happened...but the Force Awakens did happen.  It set this up as a question with an interesting answer.  That is why Rey doesn't have a last name...because finding out her last name is supposed to be interesting.  The answer that is given is not interesting at all.  The answer is:  she just doesn't have a last name.  Sure\\, it is nice that you can come from nowhere and be important.  That is a good (albeit trite) message.  But if you like that idea enough to make it a theme\\, you are going to have to do it a different way than having Rey's parents be nobody.  Because the Force Awakens was made and people liked it.  Really\\, no one should even have to be explaining this.  Just totally inexcusable.\\n\\n10.  Constantly setting audience expectations and then subverting them (e.g.\\, Holdo is bad...no wait\\, she is good; Luke is there; no wait\\, he's not; Finn is going to sacrifice himself...no wait\\, he isn't; Leia is dead...no wait\\, she's goddamn Mary Poppins) is a narrative device.  Used properly\\, it can be an effective device. But you can't have a story that consists of nothing but the same narrative device being used over and over!  That's not a story!  And it's annoying as hell.\\n\\n11.  Luke not being there sucks for the same reason that \\\"it was all a dream\\\" usually sucks.  Just leaves you feeling cheated.  And by this point in the movie\\, we've had way more than enough of this particular narrative device.\\n\\n12.  One good way to have the audience emotionally engage with the characters is to have characters you like interact with each other.  Why are Finn and Poe apart? Why is Finn with Rose the whole time?\\n\\n13.  I like Luke.  I like Rey.  Why don't they like each other?  This sucks.\\n\\n14.  Porgs:  I give up.  I would prefer it if there were no characters in the movie that weren't there to enhance the story\\, as opposed to sell toys\\, but I get that this is now impossible.  So i'm going to allow it.  It definitely could have been worse.  I think that if they went with a slightly less cartoonish character design for the Porgs\\, these scenes could have worked.\\n\\n15.  BB-8 is a good character (or at least he was before this movie) and sold a lot of toys.  So maybe it is possible.\\n\\n16.  This movie really trashes everything that was good about BB-8 in The Force Awakens.  Among other things\\, BB-8 is now the most powerful character in the Star Wars universe?  He can do absolutely everything\\, except open that door that they need the codebreaker to open.  BB-8 can't do that\\, apparently.\\n\\nI could go on\\, but you get the point.  I really hate this movie.  I really\\, really wish it never happened.  It should never have happened.  It is a travesty.  The half star is for shooting on film rather than digital.  It looks great.","true":true}