{"101487":129406,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-17","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I am an Asian American woman and I found this movie and the Rose character inappropriate.  She plays the stereotypical fan girl who hero worships after a guy and then does her duties with strict adherence to her duties.  I need to go back and watch Disney DVDs I have for my children to see whether Disney treats all Asian female characters this way.  It took years for people to stop saying \\\"me love you long time\\\" to Asian girls after the Stanley Kubrick movie Full Metal Jacket made that phrase popular and stung Asian females with that stereotype forever.  Now we have the Rose character setting back Asian girls - Vietnamese girls at that - back 30 years.  I am offended by this movie.  You couldn't just make her strong without making her be ridiculous like the other white females in the movie?  I read this movie is not doing well in China.  Does Disney realize Chinese people can tell the difference between Vietnamese and Chinese?  And treating Asian females like this in general is offensive to all of us.  \\n\\nThe movie also destroys what I loved about Star Wars.  It's black and white about women vs. men and non-whites vs. whites.   The women and non-whites do not struggle\\, they are just magically strong and righteous.  Except for Rose who is just righteous.  All the white men are impulsive.  Except Finn who is impulsive and righteous.  Why couldn't we just get a great story about how Luke got to that remote planet and Rey's destiny from poor family who harnesses the power of the light.  My daughters and I liked Rey a lot in Force Awakens.  She was compelling.  We can dispel her unearned powers with mystery.  Now we're left with female hero that just has powers because the force decides to have her rise to equal Kyle's darkness.  We don't buy this plot direction.  I am not interested in the next movie.  The original Star Wars 1-6 lore is dead.  Star Wars 7 seems like a throwaway movie now which breaks my heart because I liked it so much. \\nMy family will skip the next Episode 9.  And I do hope Disney thinks differently about portraying Asian female stereotypes.","true":true}