{"101487":195328,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"What an utter disappointment!  The movie starts with forced toilet humor and is not funny\\, but it sets the stage for the rest of the shitfest of a film. Luke is made into a grumpy old man in a vain attempt to mimic Yoda on Dagobah.  He tosses the lightsaber\\, while funny\\, it makes no sense.  He was going to kill Kylo because he sensed the dark side?  Really because he saved his father and he was as evil as they come\\, so screw my nephew right?  Then we have untrained Rey getting no training.  Kylo gets bitch slapped by Snoke one minute and tricks and kills him the next.  The entire Casino scene could be removed from the movie and no one would notice.  Fen while annoying was underused and could have been removed from the film and no one would notice.  The purple haired female man hater was useless and not interesting.  Poe came off as an idiot but at least somewhat interesting.  Then Luke uses the Force Projection power in a scene that was a rip off of Hoth battle and saves the hand full of people left alive who will somehow fight the First Order.  Rey shows up on the Falcon to save them when she was no where near the Falcon just prior to that and Snokes ship that she used to escape is just gone....  Then Luke looks all tired smiles and sits down and poofs.  Robes go flying and the metal hand well that transcended with Luke I guess along with his Green Saber.  Then a little kid uses the Force and the movie ends.  If a kid can move a broom that easy then he can escape slavery on his own.  Overall I was so excited for this trilogy\\, now I will FORCE myself to watch 9 when it comes out and I am done.  I might read books but I am still pissed off about the old cannon being removed.  By the way go buy the Thrawn Trilogy\\, its much better\\, or tune into Thor Skywalker on youtube for his fan based stories.  Disney ruined what I love!","true":true}