{"101487":170325,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"StarWars The Last Jedi Review:\\n\\nThe Positives:\\n\\nSpace Battles:\\nThe space battles were very exciting and thrilling as they should be. Constantly having me on the edge of my seat which I enjoy very much.\\n\\nTeam up:\\nKylo Ren and Rey teaming up was excellent and looked great. The choreography was perfect.\\n\\nR2D2 playing the Leia Hologram From A New Hope to Luke was both a combination of being funny and playing on our heartstrings which was a nice touch as well.\\n\\nNow for the Negatives but before I address the Negatives I do want to say this; It's not that haters are going to hate for the sake of it. I went into this movie with minimal expectations because I didn't like The Force Awakens to much but I did love Rogue One. That being said I was very open about the whole movie\\, trying to understand why this and that were happening. I love the StarWars franchise but the direction it's taking I really can't support it. They are making the Jedi no more and irrelevant so how long will it be till we this storyline we are getting becomes a completely new franchise and almost separate from what StarWars really is.\\n\\nThe Negatives:\\n\\nLuke Skywalker:\\n\\nLuke Skywalker deserved a lot better treatment then what he got in this movie. \\n\\nAfter the whole space battle in the first act we then left of where Rey was handing Luke his Lightsaber at the end of The Force Awakens. What does he decide to do with it\\, he tosses it over his shoulder down a cliff like it was nothing. I get they were trying to do some character development with him and the whole Jedi Order is bad. But the Lightsaber is very impactful and meaningful and was his fathers lightsaber. If you had an ancient relic in your household you wouldn't come along and toss it on the ground.  \\nIt's kind of stupid how he was able to stay in one place and move his physical body and mind to another place. How on earth did he discover that power. It kind of eliminates the purpose of becoming a force ghost.   He visits Leia and gives her those dices from the Millennium falcon (but turns out they weren't actually there and just an image being projected like Luke. \\n\\nThen somehow Luke dies at the end\\, they tried to make it feel impactful with the whole him staring at the Two Suns from a New Hope. But it's stills unclear how he ended up dying. Surely it would've been better to kill of Leia (since Carrie Fisher has passed away). Now what are they going to do with Leia since they don't have any footage of her for Episode 9. They would've been better keeping Luke around instead of now killing him of and making him a Force ghost. \\n\\nRey\\nComplete waste of time Rey falling down the hole and then spending that time to figure out who her parents were and we don't even DT the answer in the scene. Visually it looked cool. But it was trying to be like that scene where Luke enters the cave on Dagobah and Strikes down Darth Vader revealing Lukes face. Except in that scene it actually made sense why it showed Lukes face. When it is shown that Vader has Luke's face\\, this is to represent Luke's own fear of becoming as evil as Vader.\\n\\nPraetorian Guards Who are the best fighters in the First Order\\, they aren't like your ordinary stormtrooper. They went down to Rey who had 5 minutes of training with Luke and it wasn't even Lightsaber training it was a crash course in the Force. Apparently whoever picks up a Lightsaber is now able to fight anyone no matter who much training you've had.. \\n\\nPoe Dameron:\\n\\nPoe Dameron basically becomes a Mary Sue in the first act. \\n1 X-Wing versus the whole dreadnought Ship. Easily blowing up its big top turrets. Which looks cool But then you think oh wait a moment the \\nRebels have been fighting the Empire for more than 30 years now And they've lost a great number of star destroyers\\, at what point do they realise they need to actually have a better way of combating XWings. The obvious thing to do would have smaller gun turrets and more of them. \\n\\nOther:\\n\\nDeaths:\\nThe people did that die\\, died in soft ways. Yet the characters we didn't care much about had a great send off. Admiral Holdo had a better Death with the whole visually stunning light speed ship tearing the Dreadnought in pieces and Captain Phasma's great battle against Finn. Yet when it came to the characters we actually cared about:\\nLuke\\, Snoke and Admiral Akbar\\nThey all had terrible send offs.\\n\\nAdmiral Akbar\\nAdmiral Akbar Mon Calamari ship gets blown up and we don't get a good send off for him. We should've got a great sacrifice or something by him. In fact he should've been the one who Light speeded the ship into Snokes Capital Ship.\\n\\nR2D2\\nR2D2 was completely cast aside. He was basically forgotten in The Last Jedi. BB8 is besting up Guards\\, Flying X Wings\\, Piloting an \\nATST and blowing up Stormtroopers. It amazes me how important R2 was in the Original and Prequel Trilogy. It's Disappointing that none of the writers can figure out how to actually utilise R2 and have him appear in the modern scene. \\n\\nYoda:\\nThe whole scene with Yoda which was quite cool but then he was able to speak a whole paragraph without doing his usual Yoda speaking backwards thing. So what happened... Yoda speaking normally felt so out of place. \\n\\nCanto Bight Casino:\\n\\nIt was completely unnecessary and added nothing to the plot. It felt more like filler and took up way to much screen time then what was needed. \\n\\nQuestions:\\n\\nJJ set up all these great questions to be answered in the future Movies by Rian Johnson comes along and shits on it. This movie left far more questions then it answered.\\n\\nIf Luke Skywalker didn't want to be found in the first place and Rian Johnson portrayed him being this old\\, cranky\\, hating the Jedi and not wanting to be part of the resistance then why create a map leading straight towards him\\, which they made an entire movie on!?\\n\\nThere was the scene in The Force Awakens with the Knights Of Ren and Kylo Ren standing in the rain and we don't get anything mentioned about that scene or where the Knights Of Ren are now.\\n\\nNo Snoke Backstory. We still don't understand who he was or how he ranks among all the StarWars villains. Like what was his actual motivations are for wanting to kill off the Rebellion\/Resistance. He seemed stronger than Emperor Palpatine but he will killed with relative ease. Apparently he leaks the percephial vision and knowledge to see that Kylo was moving the Lightsaber right next to him. Despite constantly bragging how he could read Kylo's mind and know his every intention.\\n\\nMystery of Reys parents are that they are nobodies\\n\\nWe still don't know how Maz actually found Anakin's Lightsaber. \\n\\nSo that concludes my positive and negative review of The Last Jedi. I'm sure a lot of you will agree with me on my points and some may disagree which is fine\\, it's all a matter of perspective\\, but I believe I've made it very clear where I stand with the Sequels currently and my reasoning for it. Hopefully you can respect that.","true":true}