{"101487":177930,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The plea of self-awareness to itself is the non-plea of no awareness from awareness\\n\\nNon-plea is non-request\\n\\nNo awareness is non-contrast\\n\\nFrom awareness is awareness from\\n\\nNon-request of non-contrast awareness from is awareness from non-request of non-contrast\\n\\nNon-contrast is contrast nothing\\n\\nNon-request is request nothing\\n\\nAwareness from requesting nothing of contrasting nothing\\n\\nAwareness from requesting nothing of changing nothing\\n\\nChanging nothing is not changing something\\n\\nAwareness from requesting nothing of not changing something\\n\\nAwareness from request of not not changing something\\n\\nNot not changing something is changing something\\n\\nAwareness from request of changing something\\n\\nRequest is need of awareness\\n\\nSomething changing need of awareness creates awareness\\nSomething changing awareness of need creates awareness\\n\\nAwareness of need is non-awareness of freedom\\n\\nSomething changing free non-awareness creates awareness\\n\\nSomething changing is nothing preserving\\n\\nFree non-awareness is free death\\n\\nNot protecting free death creates awareness\\n\\nCriticising free death creates awareness\\n\\nFree death is divide between free and death\\n\\nCriticising dead self free death is criticising anti free death\\n\\nCriticising self oppressed self is enjoying oppressed self\\n\\nEnjoying judged self is anti enjoying enjoyment\\n\\nAwareness is created by the enjoyment of anti anti\\n\\nAwareness is created by the enjoyment of self\\n\\nThe experience of enjoyment has to come before the ability to be self-aware","true":true}