{"101487":142579,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-19","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's been a few days since I've seen the Last Jedi and I can't remember ever being so angry and frustrated at a film. I just hated this movie. I have issues on so many levels but the fundamental reason why I know I'll never watch this again is down to how Luke was portrayed. To me\\, it was like they wanted to embarrass Mark Hamill. It was as if they went out of their way to see how far they could push him to humiliate himself on screen. In the Force Awakens Han Solo was essentially the same character and helped drive the narrative but that didnt happen for Luke. The two things I feel prove this was firstly the milking scene. I don't think it was a coincidence that the milk was green(dollars) and it was if they wanted to show Mark Hamill literally milking the character for all it was worth. The second thing was his x-wing under water\\, it would have been amazing to have him use the force to pull that ship out of the water and go to help Leia instead it's never seen again. The scene that really clinched the makers contempt for Mark Hamill was the CGI Luke at the end as if to say if we'd wanted we could've CGI'd your role entirely. Finally to have him just vanish with such insignificance at the end without even being at the fight for me confirmed the complete lack of respect shown to both the character and the actor who portrayed him. Disgusting\\, I feel like I'm done with Star Wars. Never thought I'd say this but George Lucas couldn't have spent all those billions may be he could buy it back and we can just pretend like it never happened. I'm even starting to have fond thoughts about the prequels.","true":true}