{"101487":174509,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-05","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Force Awakens copied a New Hope\\, and the Last Jedi copied the Empire Strikes Back. Is it safe to assume that Episode XIX will copy the Return of the Jedi?\\n\\nThe lack of originality or imagination are not the worst aspects of the movie. The worst aspect is Rian's obvious bird flipping to the Star Wars fandom. Like a big F-U to the fans\\, he expunged everything good from the previous movies\\, like the hero\\, Luke\\, like fan favorite Admiral Ackbar\\, like the mystery and lore of the Jedi. Rian seems to be saying\\, \\\"Hey\\, forget all that old Star Warsy crap. We'll make Star Wars 2.0 in the future! You'll see! You'll love Star Wars 2.0. Trust me.\\\"\tWink.\\n\\nA movie is composed of things that have purpose. Characters have purpose\\, props have purpose\\, scenes have purpose. When something in a movie lacks purpose\\, the viewer is left muttering under breath: \\\"What the fuck is this?\\\" \\n\\nWhy does Kylo Ren wear a helmet? In the Force Awakens\\, he takes it off and puts it back on without any rhyme or reason. Darth wore a helmet to breathe. But Kylo doesn't need to wear a helmet. Snoke mocks Kylo's helmet\\, and in the next scene Kylo throws a hissy fit and destroys the helmet. It's akin to Rian saying\\, \\\"Hey\\, we made Kylo dress in the image Darth like a deranged copy-cat killer. My bad.\\\"\\n\\nWhat was Poe's purpose? What was Rose's purpose? What was Finn's purpose? What was Chewbacca's purpose? You could remove all those characters and still have the same basic movie.\\n\\nAs others have stated there were plot holes up the proverbial Star Warzian wazoo. Finn and Rose being able to extricate themselves out of a bad situation and into the bizarre Vegas environment\\, then being able to return rather easily was disconcerting. The Vegas environment was like a bad Fifth Element derivation. I was expecting Chris Tucker to show up any minute. Wait...something worse happens\\, the Collector from Guardians of the Galaxy shows up. Groan...\\n\\nLeia's role was a waste. She nonchalantly demotes Poe. The 19 year old Princess Leia would have chewed Poe's ass off. The geriatric General Leia slept walk as the leader of the resistance.\\n\t\t\t\t\\nGeorge Lucas offended the fans with the concept of midicholorians because it subverted the mystery of the Force. But Rian committed a worse crime: no midicholorians needed. No training needed. If you're some junk trader whose parents sold you off for drinking money\\, you too can kick the ass of Jedi-trained warriors like Kylo Ren. All those handstands in the swamps of Degoba? Forget all that. Any smhuck can use a \\\"laser sword\\\". Groan...\\n\\nWhen Yoda is first shown\\, I saw small shaking. I knew within one second Yoda was a puppet\\, and the fleeting cinematic illusion was gone. I side with CG proponents when it comes to cinematic creatures. Puppets do not look real compared to CG creatures. Knowing that Yoda was a puppet\\, I noticed the poor lip-synch. By this time in the movie\\, I had abandoned all hope that the Last Jedi would be any good and critiquing bad special effects was the only way to keep me entertained.\\n\\nI have no doubts Disney will be tone-deaf to the fan backlash. Rian will be retained to destroy the last remnants of the Star Wars franchise. Disney will make the Star Wars hotel in Orlando (probably modeled after Canto Bight...groan). Disney will make Star Wars Lands in Disneyland and WDW. I urge my fellow fans to boycott these places so they financially fail. Only then will Disney start making decent Star Wars movies again.","true":true}