{"101487":175748,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The Last Jedi was a decent and good Star Wars film.  Was it the best no\\, and was it the worst\\, no!  there are things I loved about it (someones return gave me goosebumps) and a few things I didnt but overall I liked it.  I will have to see it again and again.  I know there are things I missed.  no most of the bad views from the fans I can see are mostly people who were kids when the originals came out\\, like myself (I was 4 yrs old in 1977).  The original trilogy will forever be my favorite\\, like my nephews who were kids when the prequels came out and Episode III is their favorite and they dont really like the originals.  no new people to the newest trilogy are going to love it cuase its new and fresh.  I tried to tell some friends rating Star Wars movies is like rating Jame Bonds actors!  Who was the best Bond.  Most older people say Sean Conrey but my favorite is still Roger Moore and Octpussy!  It was the first one I ssaw and how I got into bond.  \\nWhen I was a kid I hated Empire Strikes Back cause it was dark and not enough action like the first one and return of the jedi. But now Im older and of course Empire is one of my favorites.  A New hope will forvever be my favorite.  Original trilogy 5 stars  Prequels 3 1\/2 to 4 stars and the new Trilogy is starting to look 4 stars.  The one thing I will say is to me the Prequels had the best overall story (acting sucked) Original had best character story and acting the new trilogy I am waiting to see where they are going with.  I will go see again.","true":true}