{"101487":196813,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"While this movie was good aesthetically from a story telling standpoint it was awful.  The one star was for the visuals and the musical score.  This movies fails for quite a few reasons:\\n1.  Characters act out of \\\"character.\\\"  Any half decent writer will tell you that when you write fiction that you need to know your characters intimately.  Audiences can almost always tell when a character isn't behaving like they should.  There runs rampant in the Last Jedi.  It makes the movie unbelievable and insincere.\\n2.  Continuity.  Its Evident that J.J. Abrams had direction he started this series on.  Rian Johnson did not follow that road map.  \\n3.  In conjuntion with the first item Rian Johnson does not know how to write strong characters of any stripe or creed.  He purposely weakend the established stronger characters like Luke and Leia so that newer characters can shine in their own right.  He even weakened Poe and Fin.  A story teller should never have to weaken any characters to make other characters stronger.  They are not actually stronger...they only seem stronger.\\n4.  Rian Johnson basically burned the world to the ground.  The Resistance is all but defeated and left without any strong leadership with the deaths of Akbaar\\, Leia\\, and Holdo.  The whole of the Resistance fits in the Falcon.  On the other side of things the First Order's back has been broken.  Its largest assets have been destroyed(Supremacy\/Star Killer Base) and Snoke has been killed.  The First Order will be in a tough financial situation and it is leaderless.  Neither Kylo Ren nor Hux is fit for leadership.  From reading the novel most people in the First Order want to kill those two.  It will eviscerate itself before too long.\\n5.  Building on the last item I really only see two ways of moving forward.  the first and most practical reason is that it has to become  4 part series.  the second option is to just redo the Last Jedi","true":true}