{"101487":136207,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I made an account after seeing such a back lash on this movie because I believe that it was a very good movie.  I have been a Star Wars fan for forever and I am a HUGE Star Wars nerd and this was a great addition to the Star Wars Universe.  I have to agree with people with being a bit disappointed with Reys parents\\, I personally hoped that she was Kenobi's granddaughter\\, and with them killing Snoke off so soon but I found them to be amazing twists that I did not predict\\, plus the Reys parents thing could have just been a trick by Kylo.  I believe that all of these negative reviews to be from people who do not realize they don't get to chose the future of Star Wars\\, I personally would have done everything different like with 6 and 7 and been more along with the now legends material but that's besides the point.  The movie is beautifully made with amazing acting\\, this movie even led me to like Poe who I previously hated.  I could have done with out the Finn\\, and Rose thing but I still could enjoy it.  But the only thing really did not like was how Leia survived that explosion in space\\, that would have been the perfect way to kill her of sense Carrie Fisher died.  There were some plot holes and things but not as much as TFA.  I like this movie significantly more than the TFA.  I believe that if you enjoy Star Wars that you should watch it\\, heck even if you aren't it is still one of the best movies made this year so you should watch it.  I cannot wait for the new trilogy that Rian Johnson will make and even episode 9.  And hey at least this isn't an exact copy of A New Hope like TFA is.","true":true}