{"101487":189753,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"To quote Luke Skywalker\\, \\\"This is not going to go how you think.\\\"  Ugh\\, I've seen this movie two times in two days. It did not get better with repeated viewing. It may be because I've been a long time Star Wars fan but this movie totally misses the spirit of the original films. Here is what I mean.\\n\\nPick any of episodes 4-6 and while there is a galactic war raging\\, the focus is still on the story of a farm boy becoming his own man. In this last movie there is zero development of Rey's character. She is taught nonsense that is later renigged like a bad euchre player. She learns nothing. Then she is bolstered to a status that she neither worked for or earns. \\n\\nFinn \\\"The Hero of the Resistance\\\" is completely wasted. Not only would this movie proceed exactly as it does if he stayed in the coma\\, but his Rey first mentality is as long lasting as a school house crush. \\n\\nPoe Dameron is the only person in this movie that actually seems to grow viably as a character. I can't think of a way to say more without spoiling it but he is amazing. \\n\\nLuke. Poor old man Luke. Imagine Old Man Logan but if he used the force instead of admantium claws. Pretty much the same character. I feel like the writers had no concept of who this character is or the heart he possesses. It was great to see him again but they just didn't show him to be a true Jedi Master. \\n\\nI love The Star Wars franchise\\, even the prequels have redeeming qualities. This movie is not bad. It is good but it misses the mark of being great. I definitely suggest you watch it\\, Snoke is a beast!  I hope that Disney learns to let Star Wars be Star Wars and don't make this a Disney movie.","true":true}