{"101487":190371,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Twenty questions from The Force Awakens that Last Jedi totally ignores. If you're going to make a sequel\\, shouldn't you continue the story your predecessor began? This is why The Last Jedi sucks so much: \\n\\n1. Who was the old man at the beginning of TFA? How did he have a map to Luke? \\n2. Why was there a map to Luke? Who made it? Doesn't its existence mean Luke wanted to be found? \\n3. How does Rey know how to fly a spaceship like the Falcon better than professionally-trained Stormtrooper pilots? \\n4. Wasn't it too coincidental that Han was flying in the very orbit of the planet where the Falcon was being kept? Was he in fact keeping an eye on Rey from afar? Why would he ask a stranger to be his co-pilot after just meeting her? \\n5. How does Rey know the Wookie language? \\n6. Why did Snoke emphasize that BB8 was hiding with \\\"a girl?\\\" Why did Kylo react the way he did by saying \\\"What Girl?\\\" Doesn't that imply they know of her and her powers already? \\n7. Why does Finn defect after being trained his whole life as a Stormtrooper? Is he Force-sensitive? \\n8. Where did Snoke come from? How do Luke\\, Leia\\, and Han know him? Why did they let him influence Ben Solo? How could he influence Ben to turn against his own parents and family? If Han and Leia knew Snoke was manipulating Ben\\, why did Luke only learn of his evil mind that one night and try to murder him? \\n9. Where did this First Order come from? Why is the galaxy welcoming another authoritarian dictatorship after clearly celebrating the birth of a new democracy at the end of RotJ? \\n10. Why did Leia's Resistance have to be so small and on the down-low? Why couldn't they openly declare themselves an army of the New Republic fighting the potential rise of a new evil empire? \\n11. What happened to the Knights of Ren? Weren't they supposed to help overthrow Luke? \\n12. Why did Captain Phasma give up so easily at the first hint of danger?\\n13. How does Rey know the Jedi mind trick? \\n14. What is Kylo's obsession with Darth Vader? Why would he admire Vader when he knows from his own parents and uncle that Anakin Skywalker turned back to the light? What about Vader is he trying to emulate? \\n15. How did Maz get Luke's original lightsaber? \\n16. What's up with the scene where Maz asks Han\\, \\\"So who's the girl?\\\" and Han looks her in the eye and the scene cuts away. Further implication that he knows something secret about Rey. \\n17. If Rey is just a nobody\\, then why would Luke's lightsaber \\\"call\\\" to her? Why does Rey have the vision when she touches the lightsaber? Why is Obi Wan's voice a part of that vision? \\n18. Why does Leia act like she knows Rey when they first meet? A general hugging a perfect stranger? Weird. \\n19. Why does C3PO have the red arm that he's so self-conscious about?\\n20. Why does R2D2 awaken the moment Rey is in his presence? \\n21. Why did Luke run away? \\n\\nHelp me if I've missed anything. God this movie sucks as a sequel. But\\, hey\\, it had good cinematography\\, right? (vomit)","true":true}