{"101487":157374,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Not gonna lie I left the theater extremely disappointed. Do I respect the attempt to take a new approach to Star Wars? Yes I most definitely do. But do I think it stuck the landing? No I don’t. So now come the SPOILERS!!! Leia using the force and floating was laughable in my opinion. There were better ways to show she’s force sensitive. I understand why you kill Snoke but having no explanation of his powers (yes I know there will most likely be a book about it) and how he’s saying he knows all of Kylo’s thoughts but not that he’s about to kill him. The comedy was very prequel like in many parts as well as some of the characters and scenery. DJ could’ve been portrayed by anyone and was a waste to have a great actor like Benicio. Phasma was badass but of course just showed up and was a wasted opportunity. And the forced love stories with characters felt like a bit much. I still think Rey and Finn have the best chemistry and should be together. I was pleasantly surprised by the late Carrie Fisher’s performance. Mark Hamill was very very good even though the big him being a hologram at the end I wasn’t the biggest fan of. Laura Dern gave a good performance. And the best part of the whole movie was scene of Rey and Kyle fighting together against the praetorian guards. Very cool and wish there was more of that. I feel Yoda was just fab service even if it was pleasant for the most part. I could go on and on and need to process more and maybe with a repeat viewing I’ll have different thoughts but first reaction is disappointment unfortunately where I didn’t feel like I was watching a sequel to the force awakens at times.","true":true}