{"101487":182377,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-30","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This is not going to go the way you think! Luke Skywalker couldn't have summed up this film better. The Last Jedi was a massive disappointment and is undoubtedly going to be controversial amongst die hard Star Wars fans. It fails to continue many of the plots and themes created by its predecessor The Force Awakens and even goes as far as to undo them. This is mixed with a disrespect for the original six films taking fan favourite characters and reducing them from noble heroes to broken and unrecognisable versions of themselves (In particular Luke Skywalker.) Kylo Ren says the words 'let the past die\\, Kill it if you have to' and this perfectly represents what Disney\\, Lucasfilm and Rian Johnson were clearly trying to achieve. They want to forge their own path and cement their own themes and plots. This would be ok if it wasn't for the fact that this film lack originality and copies vast amounts of Empire Strikes Back and Return of the Jedi (from the walker assault on Krayt to Rey's training from an old Jedi in exile.) Many of Force Awakens problems continue to plague this new instalment. Rey is still overpowered\\, Kylo Ren is still a lost child having tantrums and the aforementioned issue of rehashing the original trilogy is still present. I chose to put these issues aside for the Force Awakens however it has become so apparent that it has made me rethink Force Awakens and practically destroyed my expectations for Episode IX. To say this film has ruined Star Wars for me would be an exaggeration but it has certainly made me sceptical of the future of the franchise.","true":true}