{"101487":154130,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-03","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Modern visuals like every other fantasy movie now.CGI looks good but no presence on the world (doesnt looks believable that its there).Feels like a star wars movie\\,looks like a star wars movie but story is dull\\,politically driven and makes absolutely no sense in the star wars universe.Characters like Rose who dont make sense at all\\,side plots that also dont make sense or have any reason to be there.This movie has a clear intent in mind and is to empower women\\,demonize white caucasian males\\,broaden diversity and make toys for kids so mom feel good buying them toys for this kids.This was designed with flashy scenes\\,stories and llines that lack coherence\\,sense or logic at all to strive on the emotion of the moment and nothing more.This is more a woman perspective on writing and direction.This serves the purpose of endoctrination for new generation of beta males and neo feminists.Lack of an original perspective or story in Star Wars universe.Everything was said and done before this new saga.Old and current followers of the Star Wars universe were maginalized and frowned upon with this movie killing the most beloved character Luke Skywalker stealing scenes from Last Hope as it was an artistic way to end him (director's perspective) and making him look as a coward in the last confrontation with a nonsense astral proyection.This directors doesn't trully know the saga\\,the fan base or expectations from the true consumers of Starwars.Still\\,he decided to take a crap on all of them on behalf of Lucas Films and Disney directors","true":true}