{"101487":127660,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Hi there. I have been a loyal and dedicated Star Wars fan since first seeing the special edition re-release of the original trilogy in theaters at 12 years of age. After watching TLJ a few days ago\\, I have to admit that I have never been so disappointed in a Star Wars movie to date. As I exited the theater I felt appalled\\, frustrated and let down so much that atm I have no interest in seeing Episode IX. How can one screw up a movie with so much potential this bad? As for the overrated critic reviews on this site I suspect: 1) either they really are that bad at their jobs for not being able to recognize a s**t movie if it hit them in the face or 2) they just recently received some nice fat pay cheques for their collusive services.\\n\\nTBH\\, I really don't have all the time in the world so I will try to make this short...I hope lol. BTW\\, **SPOILER ALERT** from here on:\\n\\n1) A disappointing portrayal of Luke Skywalker. Cowardly\\, scared and inept. Got less screen time than he deserved due to the Rose\/Fin pointless tangent. Should have focused more on training Rey. I guess evidently Mark Hamill was right when he voiced his objections to the script back then.\\n\\n2) The never ending First Order chase of the Rebel forces. TLJ literally starts right after TFA and by the end of 150 minutes they made less progress than any other Star Wars movie to date. Unbelievable. What could there possibly be left to tell in Episode IX? \\n\\n3) Apparently\\, the First Order has stage fright when on screen and can't handle snuffing out the remaining rebels. 1 dreadnaught ship taken apart by a single X-Wing. Snoke's flag ship taken out by a rebel cruiser going kamikaze as it made a jump to light speed... If it's that easy then why not just retrofit some hyperdrives as unmanned kamikaze weapons and go bat shit crazy.\\n\\n4) The pointless\\, over the top\\, annoying humor. Wtf? Has Star Wars turned into a comedy show? Was TLJ really that dark and dire that we needed all that? Oh\\, wait\\, we'll turn the already laughable\\, inept and hopeless First Order into a scene from Bugs Bunny and the Tweety show where\\, SURPRISE\\, the good guys are untouchable. You've got to be kidding me. \\n\\n5) Enter Mr. Snoke in TFA. Hell yeah! New bad guy villain! He's mysterious and menacing. Looks like a promising character and we want to learn more after TFA. In addition\\, lots of cool and interesting fan predictions post TFA on who he is and what he might do in TLJ. Just kidding\\, we gonna slice him in half while two Jedi rookies pretend to fight to distract him...wtf??!! So now we have General Hux and Kylo in charge of the remainder of the First Order gearing up no doubt to fight a predictable pointless last battle in IX against the remaining rebels who will most likely own them with half an x-wing and a Mary Poppins floating Rey with lightsabre in space. Guess they don't even have Captain Phasma to come out of the woodworks to help because she died again...but for real this time...I think.\\n\\n6) Leia floating back to the Rebel cruiser after being jettisoned out into space\\, courtesy of the First Order's fighters blowing up the bridge. No burn marks. No singed hair. Just out cold. All good\\, apparently she is indestructible. Maybe we should finally give her a lightsabre already so that she can kick it into high gear\\, like Rey\\, and go slice some s**t up. Sorry Carrie.\\n\\n7) The amazing and pointless tangent\\, featuring: the Rose\/Finn escape pod scene\\, awkwardly rushed casino scene\\, free the lamas excitement\\, meet-the-small-lama-herding-kid-to-give-him-a-cool-ring so that we can have a super cool force-grab-broomstick LAST ACT. \\n\\n8) Rey. I love her. A great character\\, actor and all. Again potential there for sure. Apparently though her parents were no one special\\, comparable now to Anakin Skywalker's story I suppose. I felt that she spent too much time chasing Luke down in this movie than actually training to legitimately improve and acquire the necessary Jedi skills. Guess she is a \\\"natural\\\" and doesn't need more training.\\n\\n9) Lastly here are some things that helped garner this movie a 1 star IMO. The action scenes and special effects were amazing and quite entertaining. Honorable mentions: Yoda's cameo\\, as cheesy as it was it was nice to see him; Adam Driver's acting was on point even though his character is depicted as a whiny on the fence wannabe Vader. Finn's almost kamikaze-into-the-laser-battering-ram scene\\, disappointingly ruined by Rose though.\\n\\n10) There's a bunch of other stuff I could complain about but I think I got my point across. Hey\\, maybe we should start a petition to have TLJ remade. lol.\\n\\n\\nThe bottom line: those that enjoy action flicks in general and have a casual Star Wars interest but don't care for the story will most likely enjoy TLJ. True\\, loyal and die hard SW fans will hate it. Plain and simple. Have a great day.\\n\\n\\n[PS: Like many here I created an account just to get this off my chest. lol.]\\n\\n[PS 2: I sincerely hope that Disney takes note of these audience reviews and can reflect on the misguided direction they are taking this franchise. Disregarding the views and opinions of Star Wars fans; the Star Wars story created by George Lucas; the many dedicated and talented actors and support staff involved; and turning it into a stage for your political agenda and for the cash-cow extortion of kids via cutesy characters is immoral\\, blatant disregard and negligence. Hope you can live with that Disney.]","true":true}