{"101487":170942,"Last Jedi":"Last Jedi","2017-12-15":"2018-03-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Successfully destroyed the original trilogy.  Why would they do this?  No one knows.  Luke represented the ideals one should strive for\\, to be good\\, to do the right thing and self-sacrifice for others.  These were great standards for kids to strive for.  That is what made the original trilogy magical and so popular.  \\nThis new series is deliberately trying to destroy the characters of the original series.  I see two major themes that dominated the original trilogy and gave them life. First and most important was the hero's journey with Luke.  Yoda and Obi Wan's primary concern was would Luke be able to overcome his fears?  Luke's answer\\, \\\"I'm not afraid\\\".   He was tempted by the most powerful Sith Lord in the galaxy and his own father to give into his hate and fear in order to join the dark side.    After successfully overcoming the trial of trials we are now supposed to believe he is hiding on some island.  He is now afraid\\, lost his hope\\, stopped using the force and thinks the Jedi order needs to end.  This effectively makes one of the most powerful lines in Jedi trivial.  \\\"You failed your highness\\, I'm a Jedi like my father before me\\, I'll never turn to the dark side.\\\" Are you kidding me?   Completely destroyed the character.  This is not the Luke you are looking for.  \\nSecondly the romance between Han and Leah was another primary theme that held the movies together.  Han who was first a pirate in A New Hope learned that there are things more important than himself.  He learned to care for others and to be a part of something greater than himself for the good of the many (the rebellion).  His character grew and evolved.  \\nFast forward to The Force Awakens and we find Han regressed all the way back to a pirate and only caring about himself.  \\\"Screw the rebellion\\, its all about me\\,\\\" I could see this Han saying.   Really?   And that great romance of the original trilogy?  I can't wait to hear how that turned out.   Oh\\, Han and Leah are not together and can't live with each other.  Priceless.  What is the fruit of their once great romance?  Murder.  Han gets murdered by his own son.  \\nThe saddest thing for me is going to be watching the original trilogy with my son.  He is 4 and I was looking forward to this.  Now when I see Luke triumph over fear in Jedi\\, the message will not be as strong when I have to tell my son Luke ultimately utterly fails.  And when he watches Han and Leah's romance blossom\\, I'll have to lean over and tell him\\, \\\"it doesn't really go that well for them.\\\"  \\\"It might  have been better if they had never met.\\\"  How sad.  These new films to a large degree ruined the original trilogy.  Well that is of course\\, if we watch them.  \\nI really could go on and on if I only had the time.  It was full of plot holes\\, bad character development and much more I could talk about.  But what hurt the most was the abuse the original characters took.    I just felt I had to write something.  If you are a fan of the Original Trilogy\\, sadly I recommend that you not watch these films.  Pretend they don't exist.  They destroyed the characters most of us love.  Way to go Disney.","true":true}