{"101487":165096,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Rian Johnson\/Disney killed it and I do not mean in a good way. This has to be one of the worst films I have ever seen and is even further evidence that Hollywood is severely lacking any great story tellers in their industry.  \\nNot only does it not connect\/progress from the original trilogy\\, it doesn't even progress from the last film.  The writing and directing from Rian Johnson was atrocious.  Who thought this guy has any talent as a filmmaker? No character development\\, pointless characters and scenes\\, awkward humor at inappropriate times\\, and the forced political agenda in it.  Do I really need to be reminded of the military industrial complex during a Star Wars movie?  I am as progressive as they come\\, however\\, the reason people go to movies like Star Wars is to escape from reality for a few hours.\\nThe only amazing thing about this film is the ability to make a 2.5 hour film and not tell a coherent story. I now understand why Mark Hamill disagreed with everything they were doing with this film and his character.  Disney and Johnson showed extreme disrespect with Hamill and Carrie Fisher with this garbage.  They deserved so much better than this.  \\nI saw that The Last Jedi Facebook page posted a link to this website asking if the movie is deserving of the low audience score.  The answer is yes.  How does it deserve the 93% approval? Those critics are obviously paid to write good reviews or they won't be invited to the next screening.  The Last Jedi is a cheap\\, lazy\\, garbage movie\\, plain and simple. \\nAfter seeing the Force Awakens\\, I left the theatre with excitement wondering what will happen next. Now\\, after seeing the Last Jedi\\, I have zero interest in seeing the next installment or any other Star Wars related movies in the future.  It is a shame that this movie had so much potential to expand on the story to answer other questions from the previous film but they didn't. I wish I could give this film zero stars.","true":true}