{"101487":136859,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I'm only rating this 1 star because I've read 1\/2 star or lower are not counted and I can't believe the 48% audience score isn't falling if the ratings are being tallied accurately. I hated this movie. Many have commented on how badly this movie failed in storytelling and plot holes and they are correct. I'm not a bot or a \\\"fan boy\\\". I'm actually a grown female who would welcome strong female characters if they were actually written that way instead of characatures.  The characters from the OT were thoroughly abused in this movie and even the new ones introduced in TFA were dumbed down to be unlikable and incompetent.  I came to the movie only with the expectations created by the trailers and watching The Force Awakens about 3 days before so I don't hate it because it didn't meet my \\\"theories\\\" or online fan speculation. I feel lied to\\, cheated out of my ticket money\\, and given the finger for liking the OT.  The only way you could like this movie is if you turn off your brain. I no longer have any interest in a franchise that I used to love and don't have any hope JJ Abrams will change that. The only things that TFA had going for it was he didn't totally ruin Han Solo's character and he set up some mysteries that were totally thrown out in The Last Jedi. The reason I didn't watch The Force Awakens until a couple of weeks ago is that JJ Abrams killed the Star Trek franchise for me and I had little faith in his Star Wars movie. I should have stuck to my first instinct. Rian Johnson is more of a hack than JJ Abrams. Fool me once\\, shame on you. Fool me twice\\, shame on me.","true":true}