{"101487":185629,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This movie ruined Star Wars for me. There are enough people here on this site that summarize the plot holes and problems with this film. I absolutely hated this film and wanted to leave at the last 30 minutes. J.J. Abrahams needs to adress and change some of the stupid decisions of Rian Johnson to make Episode 9 a movie fans want to see. \\n1. Bring Luke back and not as a force ghost. He could have teleported to some other place. Let him have an epic lightsaber battle with advanced force power (with his green lightsaber!) And the most important point: Let him come back as a Jedi Knight and not as a cowardly hermit\\, who wants to kill his own padawan in the sleep.\\n\\n2. Bring Snoke back. Andy Serkis performance was fantastic and I loved Snoke as a villain. He should put himself back together right at the start of Episode 9 or let him return as a dark side force ghost and please give some insight of his backstory. He looks like he got injured a couple of times\\, so let him have a healing or recovery ability. \\n\\n3. Please give a reasonable background for Rey. Do not let her be a Mary Sue. She must be the daughter of Luke Skywalker or otherwise there is not a single Skywalker left\\, except for Kylo Ren. It would also explain her incredible force powers.\\n\\n4. Remove the character Rose. O man\\, I hated her the first time she was on screen. Rumors have it that Johnson changed his script twice and reduced her character. But let me tell you. That wasn't enough! The whole side mission with Fin is boring and stupid. She is the new Jar Jar of the trilogy. Let Episode 9 be about Rey\\, Fin and Poe. \\n\\n5. Quit the bullshit with this PC. I don't want a Star Wars movie only with women in command. Find the balance please. I also don't want another Laura Dern with pink hair as commander. I have nothing against a strong woman in a Star Wars movie. I think Daisy Ridley is perfect for this trilogy\\, but Episode 8 went to far. Star Wars is timeless\\, because it does not follow a political agenda\\, so please let Episode 9 be just a movie about good vs\\, evil and not a critic on our society (canto bight)\\n\\nIn conclusion these are my main problems that need to be adressed with the next film.  Rian Johnson destroyed the Star Wars legacy and J.J. Abrahams has not much to work on\\, but I hope he can at least adress some of the criticism.","true":true}