{"101487":166981,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-01","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"signed up on RT just to review this disappointment of a movie. \\ni frequent RT all the time to check movie reviews. not from the \\\"critics\\\" but from actual people. the critics are often opposite what the average audience thinks and this film is no exception. i checked the ratings before i went to see it last night and saw the critics praised it while the audience didnt seem to care much for it. still\\, being a SW fan for the past 40+ years i went in with an open mind and hoped all those normal people would be wrong. after all\\, Rogue One was pretty good and TFA was ok....\\n\\nunfortunately\\, this movie was a stinker. the first 5 minutes let us know that with Poe's attempt at Iron Man type humor. really? in a SW movie? corny jokes\/gags? it didnt stop there unfortunately...\\nthere's so much wrong with this movie i dont even know where to start. luckily there's plenty of reviews out there pointing out all the flaws. too bad studio execs probably just ignore these reviews and ratings anyways. after all\\, the movie will rake in tons of cash\\, as usual. \\nbut ill point out a few things that bugged me:\\n*corny jokes\/gags\\n*WWII style bombs using gravity....in space? as if having sound wasnt bad enough but using gravity to drop bombs? \\n*year of the woman? i guess. do they really need to put women in there everywhere you look? could they make it any more obvious? as if Princess Leia wasnt a strong enough woman on her own. and now we have the main star\\, Rey\\, being femaile which is totally cool. but geez\\, try not to overdose on gender equality here...\\n*lets put a black guy in there and make a prominent character. but lets not give him any real importance. lets keep him a useless coward that is always ready to bail on everyone. \\n*after TFA we were led to believe Capt Phasma (another female) would really be more prominent in TLJ. what a waste of a potentially good character.. even worse than the OT's use of Boba Fett.\\n*Chewie? wasted excellent character. left to bbq a penguin thing and then feel sorry about it and pet rescue a family of them\\n*Luke? way to ruin a childhood legend. turn him into a crotchety old d-bag with a grumpy old attitude. only to run out of energy points and die from exhaustion... and he became a psycho who was about to murder his own nephew in cold blood because he was strong in the force??\\n*yoda? lolwtf. a pyromaniac psycho during his brief appearance.\\n*Rey is a good character but could use some more character development. her parents? that big mystery? eh\\, no time for that. so she's a nobody. wtf?\\n*Kylo Ren. he could use more character development as well but he and Rey are definitely the strongest characters in this whole film (and that's not saying much really)\\n*Snoke? they make a big deal of him in TFA and make him seem like he's the most powerful villain ever\\, just to toss him aside like a storm trooper. love the way he sits in his thrown all casual as well. that was odd.\\nspeaking of odd\\, luke milking the cows balls\/boobs? and then having a green milk mustache....ok...  and Finn being naked in the plastic suit with juice squirting out all over the place...\\n*Poe....who is this guy? no backstory but he's supposed to be a major player apparently. does whatever he wants and starts a mutiny only to be slapped and later lead the group. \\n*Holdo? more like weirdo.... they should have had Leia pilot the ship into the dreadnaught. that would have been a great sendoff. \\n*speaking of Leia\\, mary poppins anyone?? beyond stupid!\\n*Benicio Del Toro. what a waste of a talented actor and an interesting character. maybe he'll make an appearance in the next film but at this point\\, who cares..\\n*one long\\, slow chase. the ships are going to run out of fuel? really? lol. \\n\\nthere's more and i could go on for days....\\n\\ni had zero connection to anyone in this film. I was kind of hoping Finn and the Rose? would both die. they were both annoying. Finn is useless and just seems to overact\\, constantly. the forced romance was unexpected and a surprise\\, even to Finn. he's like\\, wtf? that wasnt in the script!\\n\\nthe OT created characters that were larger than life. that you felt emotionally attached to. at some you sat on the edge of your seat because you actually felt like they were in genuine peril. you could care less in TLJ. even the prequels established some strong characters that you felt attached too and felt concerned for their potential doom. \\n\\nim surprised i stayed awake during this film. i kept checking my watch to see if would be over soon. \\n\\nive seen the OT many\\, many times. like most people who grew up on them. ive seen the prequels a few times as well. theyve grown on me (boy am i sorry GL left!). i own dvds of Ep 1-6. i will probably watch TFA again at least once and certainly Rogue One. i could care less if i ever see TLJ again. \\n\\nwhat a way to ruin a legacy and powerful story line that captivated the world. they may as well just let michael bay direct the last film so they can really screw it up.","true":true}