{"101487":105143,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-20","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"As a life-long Star Wars fan I feel compelled to write this review.\\n\\nTwo years ago I took my wife and six year old son to see Star Wars 7\\, The Force Awakens.  We all had a great time watching it. My wife was not a big Star Wars fan and she enjoyed it.  Sure it had some plot holes and wasn't perfect.  But it captured the essence of the Star Wars saga and set the stage for episode 8.  I was really looking forward to seeing the next movie as was my wife.\\n\\nAfter watching the first 15-20 minutes of The Last Jedi I could sense something was not good.  Then\\, it just continued to get worse and worse.  I cannot believe I waited two years to see this movie. It was really bad.  After the movie\\, even my wife said \\\"that was bad\\\".  I am very disappointed in the way this movie was made.  Don't get me wrong\\, I'm not for keeping everything the same.  Star Wars needs new characters and stories.  However\\, keeping it in line with what has happened in the past and staying true the core values of the saga are a must.  What happened to Luke Skywalker was a disgrace.  I feel so bad for Mark Hammil.  You can tell by the pre-release interviews he knew this wasn't going to be good.  However\\, what could he do? I don't know what the point of this movie was...maybe to destroy everything before it?  I have never left a theater mad.  After I saw this movie I did.\\n    \\nWhat happens next?  I mean Snoke\\, Captain Phasma\\, Luke Skywalker and others are gone.  Jedi legacy gone. Finn and Poe were reduced to minor roles and Carrie Fisher is dead so what do they do with her character?  Kylo and Rey....I really don't care now.  I lost my enthusiasm for Star Wars.  What will I do now?  I won't see this movie again\\, I won't buy the DVD\\, I won't buy and last Jedi merchandise and I will not buy my son any Last Jedi gifts for Christmas.  I will let my money do the talking. \\n \\nPlease JJ Abrams bring back Star Wars in episode 9.  Thank you.","true":true}