{"101487":146166,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I waited to see the last Jedi a second time before writing a review hoping it may change how I felt about it.\\nThe never doesn't really capture the Star Wars magic\\, this seems to be in the stories lack of understanding of key themes set up previously i.e. Luke as a hero\\, the entire Jedi principles\\, Anakin and Luke too old and fearful to be trained yet Rey no problem at all.\\nFor me the best scene was the start with the bombers.  it had action and great dynamic between Poe and Leia.  It was good to see leia shaping Poe to become a leader for the rebellion.\\nFinn just doesn't work\\, I don't know why.  He has the deepest back story yet he just gets in the way. I've read lots of reviews saying Johnson took risks with this film\\, my heart actually began to race as Finn was aiming for the cannon to sacrifice himself and I assumed this was the sort of risk they meant\\, had Finn died in that heroic act he would have gained credibility.  But no mysteriously Rose catches him and saves him.\\nRey and Luke's relationship was awkward due to Daiseys awkward acting. Sadly I prefer Daisey in interviews and chat shows to her playing Rey.\\nKylo is a stand out character as Adam Driver is a highlight of the film. Adam Driver is carrying the new films for me.\\nThe humour is at times unnecessary and very over the top not sure why they went with that direction. Perhaps in a stronger story it could work. Relying on porges for cheap laughs.\\nFor me ending Luke's story the way they have was such a waste and extremely predictable.  The second time I saw the film was during the day and there was a much younger audience\\, when Luke faced the first order on his own I could hear the children gasp and become in awe of this character the same feelings I had when I saw Luke catch his green lightsaber.  That is the magic Star Wars created in those moments but they have instead passed on those possibilities by ending his existence for the next film other than a possible ghost(who can now interact with the living world apparantly)\\nIn short it should be harder to make a bad Star Wars film given the cast\/characters and library of resources available yet Johnson managed to come up with one huge turd mountain of a film","true":true}