{"101487":194403,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-16","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"We left the theatre 1 hour ago and I am absolutely livid at this terrible pump and dump garbage of a movie.  Irreverent to everything Star Wars once was.  There are political overtones built into this movie that have no place in the story.  They make the movie even more awkward.  The acting is substandard and the script is mumbo-jumbo.  There is action but it is irrelevant.  No wonder the original remaining cast is jumping ship.  The entire movie\\, from start to finish\\, is CRAP!  The characters are weak\\, the writing is weak\\, the story is weak\\, the acting is weak\\, the whole movie is weak.  And I thought they could do no worse than the last movie.  This thing makes the prequels look great by comparison.  I was gritting my teeth and biting my tongue just about the entire span of wasted minutes of my time watching this mess.  My wife said I was expressing my dissatisfaction repeatedly during the viewing with angry looks and frustrated sighs of discontent.  There is something up with these \\\"critics\\\" giving the movie a 93% overall score.  They do not reflect the pulse of the audience and the audience score reflects that.  They are either paid to positively reflect on the movie or just are enthusiastic about objects moving on a screen.  Who knows?  It sucked and im done.  Star Wars is over.  Lucas killed it when he sold it to Disney.  After this final insult\\, I really don't care what happens to any of them.  SPOILERS----  5 or so upgraded Star Destroyers cannot catch an old\\, single frigate similar to the ones escaping Hoth in Empire.  Tie fighters cannot reach the frigate which is well within view of the Star Destroyers.  However\\, later they can venture out to the surface of a planet to attack a base away from the Star Destroyers.  There are huge\\, slow moving bombers but no missles.  There were missles when Anakin was a kid decades earlier.  Instead of Jar-Jar there are small fat\\, flat faced chickens that screetch the same annoying sound byte throughout the movie.  The Empire no longer controls the manufacturing of its equipment but now\\, according to this idiotic movie\\, buys their Tie Fighters from rich tycoons who just so happen to sell the X-wings to the Rebellion.  Captain Pharma or whatever\\, has the one and only Stormtrooper armor that deflects blaster fire.  Really?  Yoda makes fun of Luke and the Jedi from the afterlife.  The AT-AT's now have Cylon heads from Battlestar Galactica as one last sucker punch to another great SCI-FI series.  The only part of the entire movie I enjoyed was getting to see what happens when hyper drive is engaged while aiming one ship at another ship.","true":true}