{"101487":147512,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-07","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I wish I could give this 0 or even negative stars. We are a huge Star Wars family and were looking forward to the next installment. The entire time I was wishing the movie was over. That is unheard of for a Star Wars movie!!! It felt cheesy and campy\\, plot holes the size of Alderaan\\, and a complete disregard for Star Wars lore. Major feminist agenda (and yes\\, I am a woman and want equality for all\\, but do not condone the degradation of males to achieve it\\, as this movie pushed.) Mostly the characters that were shown dying {fighter pilots} were males\\, were belittled and demeaned {one of the main characters was slapped and dismissed as an arrogant male who couldn't handle knowing the commanders plans because she was superior to him even though he had every right to be included in battle tactics as one of the lead pilots}\\, and Rey could do no wrong (I loved her in the force awakens\\, yet this movie portrayed her as being so strong she didn't need anyone's help figuring out how the force works or even what it is. She could just automatically control it\\, so there was no character development or obstacles to overcome). Don't even get me started on the out of place Fin and Rose sideline....completely unnecessary and just hurt the storyline with it's ridiculous casino scene. Forget continuity or consistency in the editing (Phasma being in one place before an explosion and suddenly somewhere else the very next instant unharmed...) I could go on. Sadly we will not be seeing the next one in the theater as this movie has ruined the new trilogy for us.","true":true}