{"101487":164111,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-15","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Really disappointing movie. I created an account to voice my opinion and I don't usually do that sort of thing because\\, well\\, who really needs another opinion on the internet? But because I love Star Wars so much and was so hyped for this film and the travesty of what I saw on screen last night I have to cast my vote. Really it comes down to poor story telling and lack of vision on Rian Johnson's part. I'm really surprised they gave him a whole new trilogy to play with. Force flying Leia??? Some things sound cool and some things just don't translate when you see them this failed on all fronts and seriously was the beginning of my viewing experience when I realized \\\"Oh man\\, I don't think I'm liking this movie\\\". IX will ultimately solidify my opinion of VIII\\, but with a catchphrase of \\\"This is not going to go the way you think\\\" it absolutely went the way I thought. (Spoilers) In the day and age of GOT and The Walking Dead where well established characters get offed regularly and in sometimes horrifying ways it was painfully obvious that Luke would be no more. If they really wanted to shock us he would have survived this film. There were some really cool moments but all in all the more I think about this film the less and less I like it. That being said I will be seeing it at least two more times due to making commitments with friends and family. The difference is I won't be looking forward to seeing it again as I did with TFA and RO. Rian Johnson please don't make another Star Wars film. Thank you.\\n\\nUpdate: With seeing Rian Johnson and many other celebrity responses to any sort of unfavorable opinion to the film as \\\"Angry Fan Boys\\\" is really the icing on the cake\\, and the hallmark of realizing that he messed up and made a really poor film. I tell people that liked the film that I'm happy they enjoyed it. That's great! I don't want to ruin anything for anyone but then you have Disney and Johnson trying to dismiss negative opinion which isn't as minor as they'd like the world to believe as spoiled brats who didn't get what they wanted is just insulting and honestly is very upsetting. From once being a huge fan and liked where the franchise was going with TFA and RO\\, they have now someone actively rooting against SOLO and Ep IX. I will no longer be seeing any Star Wars films opening night and will be very cautious on seeing any future films with the Star Wars name in theaters henceforth.\\n\\nUpdate #2: I will not buy this on DVD and I am OCD when it comes to being a completist with my records or movies\\, but this is the only way at this point left to protest monetarily this horrible piece of cinema.","true":true}