{"101487":104891,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":3,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Art is subjective. We must bear that in mind when reviewing any movie. This chapter of the Star Wars Saga is certainly an interesting one. It takes us into a new direction but at the same time leaves us right back where we started. The film itself delivers in terms of adventure and in epic scale too\\, but the main plot seems to be bogged down by sub-plot. While the Force Awakens gave us questions\\, the Last Jedi certainly gives some answers but all seem to fall flat. The dynamic with Luke Skywalker has changed and so has his character\\, the change isn't without explanation but I can't help feeling if they had gone down the route of Luke being the true evil of the new series that would have been more satisfying in terms of the shock factor and would have likely led to a more interesting final installment in Episode 9. There has been criticism of a particular scene involving Leia and although it would not have honoured Carrie Fisher I would have much preferred to see Leia's character brought to and end and have her quick death as impact for more of the shock factor\\, however we get instead a touching scene in which we see Leia finally use her powers and fly back to her ship and saving herself from the vacuum of space. Overall the film is good. Its not an amazing entry to Saga but it certainly ranks higher than the prequels in terms of at least the acting (which at times I admit is ropey) and a more action orientated plot that doesn't revolve around \\\"Trade Dispute\\\" or \\\"Senate Meetings\\\"","true":true}