{"101487":104777,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A real person and not an Internet troll wrote this review. \\n\\nStar Wars \\\"The Last Jedi\\\" is a disappointment of epic proportions and simultaneously the \\nperfect Star Wars movie to go along with the Year of 2017.\\n\\nThe primary reason this movie is a disappointment in my view is that it is a preposterous \\nexample of poor filmmaking and storytelling that greatly cheapens the Star Wars franchise. \\nI'm extremely open minded about these movies and I'm more than wiling to go where their \\ncreators want to take me as long as the work is presented with some level of respect for \\nthe craft of filmmaking. \\n\\nRian Johnson and Disney put forth a movie that shows little respect for filmmaking as well \\nas the efforts of JJ Abrams in the creation of The Force Awakens. \\nI have several issues with the story in TFA but it is clear that they worked to exhaustion to \\nmake sure the movie was crafter with the highest quality possible given the challenge at \\nhand. Rian's movie started to fall apart the moment Luke tossed his light saber away in the \\nopening scene in the most satirical fashion possible. \\nI'm perfectly okay with the idea of Luke throwing his light saber away but the execution by\\nRian felt cheap and insulting. The last Jedi treats the Star Wars saga with absolute \\ndisregard without having the skills to ensure he replaced it with something worthy. \\nInstead we are left with a story with no emotional resonance that fails even at the most \\nbasic levels of storytelling.\\n\\nAsking for a story to make sense is not a tall order but rather the absolute minimum bar \\nanyone can set for himself or herself as a creator and Rian Johnson along with LucasFilm \\nand Disney failed miserably at it.  \\nWith all of that said\\, the most insulting part of the Last Jedi actually take place outside \\nof the movie manifesting itself in the shape of a corporate effort by Disney to claim that \\nmost of the bad reviews of The Last Jedi movie is the product of a hoax by internet Trolls. \\n\\nDisney and Lucasfilm have essentially become the Trump Whitehouse of Enterteinment.","true":true}