{"101487":102884,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"A movie that discards not only the plot elements of it's lackluster prequel but the characterization of personas built up over the entire course of the franchise\\, The Last Jedi proudly and unapologetically places it's irreverence for its source material on a pedestal so much so it even features as the subtext of the film.\\n\\nThe logical rules for how key technologies in the Star Wars universe are abandoned in order to facilitate empty spectacle without substance. None of the newly introduced characters earn the gravity of the emotions they seem to want from the audience and the narrative relies upon a series of contrivances to plod along.\\n\\nThe harder one thinks about the plot the more frustrating it becomes as it seems that Rian Johnson seems to think that setting expectations only to foil them in itself constitutes some form of quality. Sadly\\, much in the same way as receiving fecal matter directly to one's face\\, surprising though it may be it is most certainly neither pleasant and objectively not good.\\n\\nThe Last Jedi is a film that wants to be funny and charismatic at the expense of building the seriousness of tone required to give the plot any weight. When the film does begin to pretend the stakes are high it is ironic that the key characters decide to not care and instead prioritise their interpersonal relationships which again\\, seem completely un-earned.\\n\\nIt is a movie that thinks it's so clever and sophisticated in its self-aware\\, self-indulgent disrespect of its franchise fandom that it even goes so far as to set its ending on a planet covered in salt.\\n\\nWere this any normal film it would be considered a bland spectacle but the fact that this is a Star Wars film makes it genuinely saddening.","true":true}