{"101487":134062,"Last Jedi":"Last Jedi","2017-12-15":"2018-02-15","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I have watched the movie twice and I don't count myself to the die hard star wars fans. Still there are here several reasons why the movie is a huge letdown and it will continue to let people down and just making money for Disney\\, which is ultimately the goal of the company. An endless profit cycle. \\n\\nThe visuals of the movie are amazing also the sound is of the highest quality\\, that earns it 1\\,5 Stars from me. Also positive\\, Daisy Ridley and Adam Driver greatly improved on their performances as Rey and Kylo. But that is where everything ends on the positive aspects of the movie. The Casino part of the movie is boring and is just a filler. Poe and Fin havent improved at all in their lousy acting and they feel super cheesy as if that is a school play. \\nThat is also partly the fault of the crapy dialog. Example: \\\"Hi I'm  Poe. I'm Rey. I know\\\".\\n\\nIt goes on and on there. From the crapy jokes (even mama jokes) which caused most of the audience to face palm. To the complete out of the context characters like Kelly Marie Tran (Rose) which is just a bad actress\\, but still young and can improve. You can look that up\\, there are no credentials what so ever why she would have such a big part in the movie from the screenplay. What on earth was the producer and the director thinking there?\\n\\nJust mind boggling. To top it off\\, her performance ends with a completely unjustified saving action for Fin ( because of love?) and ending it with a childs kiss. One word there: Pathetic.\\nMultiple failures there: Casting\\, Producer\\, Director.\\n\\nMultiple cringeworthy moments in the film:\\n- Laura Derns performance (totally off and out of place)\\n- Chrome Storm trooper\\n- Snoke being killed off by Kylo super cheap\\n- Rose (just the whole charakter)\\n- Roses Sister in the beginning with the sacrificed bombing (You cannot bomb in space people)\\n- Carrie Fischers superman flight into space (Facepalm moment)\\n- Luke Skywalkers funny dialog and milking sequence (What the hell was that all about??)\\n\\n\\nMake Kylo Ren a proper villain! He has the potential for it. I never though that after the reboot\\, that I would say it. Its the first missed opportunity there.\\nCarrie Fischer is not with us anymore : (. Which better way to give her a heroic death in her last appearance. Kylo or Snoke should have killed her off to build up the hate against the characters..\\nKeep Snoke as a master of darkness (the character worked).\\nMake Kylo Ren kill Luke if you wanted to get rid of him. Give him a proper duel to the death with the new more evil vader.\\nLet Fin sacrifice himself to the cannon in front of the mine. That would have been a proper ending and his performance is going nowhere.\\nThe Casino part should have been minimized and a different actress for Rose chosen.\\nThe characters and dialog was always cheese in star wars. But the characters weren't so childish. You never get that feeling of desperation in those new movies. Its all nice and works out just fine without any unexpected actions.\\nThere is no build up here. A super long movie just to disappoint and to feel like a tv series.\\n\\n+18 Rating 1\\,5 Stars\\n15-18 Rating 3 Stars\\n2-15 Rating 4\\,5 Stars (Kids are going to love it)","true":true}