{"101487":147239,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-22","3":5,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I went into a week-long hibernation to avoid references to this film.\\n\\nFinally saw the movie yesterday\\, left exile and was gobsmacked to see the brigade of #lastjediawful tweets and the reviews on this site.\\n\\nI can't even being to start with how wrong they are\\n\\nBut here is a place to start: if you came out of the movie upset because the way you thought everything worked was tossed upside down\\, or changed\\, or ruined\\, or didn't happen the way it should in the Books (which you've read) stop.\\n\\nThink for a second about what that means\\n\\nIf you thought you knew how everything should go it doesn't mean you are really smart or especially clever. \\n\\nIt means you thought the movie would be predictable.\\n\\nPredictability is rot for a franchise like this. \\n\\nWhat Rian John has done is two things:\\n\\nFirst\\, he has given a great standalone movie. Likely the best on that score since ESB.\\n\\nSecond\\, and more importantly\\, he has given new life to the franchise. By not falling into the usual plot devices and patterns the series has established he has given the series somewhere fresh to go....for the first time in 34 years.\\n\\nThe original trilogy was great because it was new. New directions. New possibilities. Plot twists took us somewhere unexpected. Unpredictability was our ally.\\n\\nApart from being bad\\, cutesy\\, poorly directed movies the prequels suffered because WE ALL KNEW WHERE THEY WERE GOING. The end point was always knowns: Anakin turns bad\\, has 2 kids\\, Jedi go bye bye. \\n\\nWe were only interested to see how they'd get there (via shitty CG it seems) but the die was cast\\nRisk for this trilogy is falling into the same trap. \\n\\nThe Force Awakens nearly did that. Don't get me wrong\\, it is a fine movie that rid us of the prequel menace (heh) but all the plot lines were so telegraphed and set up...\\nIt was....familiar. \\n\\nAnd sure\\, it offered a few wink wink jokes about the familiarity and repetition....but it risked devolving into nostalgia and nearly did just that (Han's 'Chewie\\, we're home' line exemplifying that)\\n\\nWe don't need a 'greatest hits tour'\\n\\nWe need a great new series and direction with the new generation. \\n\\nApart from being a great film\\, the Last Jedi gave us that room. \\n\\nAfter 5 other movies\\, for the first time since *1983* where the Star Wars universe is going is open. New. Possible. Unknown. \\n\\nYou thought you knew or it mattered who Rey's parents were or Snoke's backstory?  Wrong.  Doesn't matter.  The series is going to be bogged down for now in some long backstory that will have to be explained (and carefully worked around to make sure that blessed 'cannon' isn't affected).  It can literally go wherever it wants now.  The rebellion is about 20 people.  There is no 'master genius' manipulating the main bad guy.  \\n\\nThe folks are on their own as is this plot.\\n\\nThis is a major a gift.\\n\\nHistory will agree with the critics here\\, not the bots trying to tank the rotten tomatoes score. \\n\\nThis movie truly represents the rebirth of the franchise.\\n\\nNow don't go fucking it back up in Episode IX \\n\\n\/rant","true":true}