{"101487":169010,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"So\\, the critics love this movie but the fans don’t. Hmm.................were we watching the same movie? Rey is on an island with Luke pursuing the mysteries that are within her regarding the force. Meanwhile\\, the resistance is fighting against the first order after being chased by them. Plans are made to fight against the first order\\, thought of strategies\\, etc. While the battle with them is going on\\, Rey is conflicted in what is going on within her. We see the struggles of confusion of who she is and which way to turn. Towards the end we see multiple battles between the Jedi and the forces of good and evil. A mysterious move in the resistance gives them an edge of victory\\, but the battle continues. The story overall was well written. You are able to follow along and not get lost. Well at least I didn’t. The acting was well balanced except from a couple of people a few times. Not everything we wanted to know was fully explained. This movie\\, in rating it as a movie and not just a fan\\, was done pretty well. Good stylized action scenes\\, awesome space chases\\, and emotional sequences. As a Star Wars fan\\, this movie does not give me the old school Star Wars feel like I want it to. I would have wanted to see Luke Skywalker’s character come to the surface more. Also to see Luke in additional action fighting scenes. I would have preferred Han Solo to still be alive. All in relation to me being a fan of the old and having that feeling back. I believe that this is the problem with all the other hardcore Star Wars fans. They did not get enough of the old in their hearts\\, and the new seems stale. I get it\\, Poe is a loner character who is always ready to fight. His fighting spirit is much appreciated\\, but he just not that exciting. There is not enough to bring him out. Finn works\\, but he is more effective alongside Rey. It would be nice if we could have a love story between Rey and Finn. It is so emotionally fitting. Plus The Force Awakens was set up in such a way where that could have easily been done. Unfortunately\\, Jedi’s can’t have relationships like this or fall in love. It is against the Jedi code. It would have been better than the love connect they tried to attempt in this movie. Maybe in the final film we can see Rey\\, Finn\\, and Poe working side by side. It would help make the characters more exciting. In my heart\\, I feel that I have to rate this more as a movie than just a fan. This is an enjoyable film\\, but it is unfortunate that I probably wont crave to see it like the other Star Wars movies. (-A)","true":true}