{"101487":177781,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-17","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"The opening sequence is great. The space battle summed up everything that Star Wars stands for. Straight off the a page from a WWII bomber scene\\, echoing the same visuals that inspired the original Star Wars space battles (WWII areal combat). The rest of the movie is garbage. Politically charged\\, preachy\\, and goofy...all things that shouldn't be in a Star Wars film. Watching Star Wars should be about setting aside real life and getting lost in a fantasy world\\, not commenting on the real one. \\n\\n     Kennedy might as well replace Hux with Trump\\, that's what she was going for. A complete political statement after the first 10 minutes to the very end. They might as well put the \\\"Love Trumps Hate\\\" line in the film. Men are bad\\, women are good. *SLAP* \\\"Take that Poe\\, you mansplaining SOB!\\\" \\n\\n    Take away the political themes and the movie still sucks. Every scene ends with a fantastic coincidence\\, many of which had no consequence or plot line whatsoever. The heroes are saved by someone showing up at the exact right time..every time! Cheap writing. No character growth. The whole casino scene..what? Why? Nothing is answered from TFA (assuming Kylo lied to Rey). \\n\\n     This film could be marketed as a comedy. Never have I seen a film with more cheap laughs. Obviously inspired by recent Marvel films\\, there's a gag\/one-liner\/goofy surrounding in every scene\\, except it doesn't work. This isn't Marvel. This isn't DC. Gags\\, cheap laughs\\, etc...that's not what Star Wars is. \\n\\n     None of what this movie banks on is what Star Wars is about. Star Wars is about good versus evil\\, internal character struggles\\, family\\, fighting the good fight (there's a line in this film that says \\\"don't fight!\\\"). Please tell me this is a cheap rip off to the likes of a poorly made fan fiction\\, which is actually an insult to well made fan fiction. Maybe our society can't handle Star Wars anymore. Maybe it's done. I'd rather this film not exist.","true":true}