{"101487":143293,"Last Jedi":"Last Jedi","2017-12-15":"2020-01-06","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It's objective\/moral is failure so the movie is objectively bad. Why? Rey's goal was to be trained she did\\, Resistance's goal escape the first order they did\\, and finally Finn and Roses goal get plans or something I never watched that part after seeing the movie in theaters but they won kind of. Now my opinion is 79% hate\\, 12% bored\\, 5% liked it\\, and 4% felt nothing but disappointment. The Canto Bite scene I get bored out of my mind\\, Luke's death I would like it if 1 I knew how he died he didn't have a obvious cause at least none that was already established in canon\\, 2 how his character was written if you think this movie is a masterpiece you are probably saying \\\"But it subverted expectations!\\\" Okay let me get this clear you think subverting expectations = AMAZING!!... it doesn't also quick side note how come the bombers are so slow there were bombers in previous lore that are better yet obsolete! However those bombers aren't what I think is wrong with the dreadnought scene the fact the bombs didn't just float like things do in a vacuum of space now some people have said well gravity of the ships or magnets first the gravity defense and why it makes no sense 1 if the ships gravity thing worked the bombers would be pulling the bombs away from the dreadnought and back towards the bombers because of the distance 2   the bombs wouldn't even leave the ship due to them being an inch from the sides of the bomber so the gravity strength is stronger due to mass of objects and distance. The second defense magnets this I believe was in a book but even then Rian needed an outside source to fill in the gaps of his own movie as well as supporters to come up with reasons that haven't been officially made unlike the graphic dictionary books that are canon that is bad story telling! P.S someone with a small script was telling Hux something and one of the only lines that character had summed up the whole plot but then Rian thinking subverting expectations = good started making things that made that simple plot unbelievably incoherent!","true":true}