{"101487":188445,"Last Jedi":"Last Jedi","2017-12-15":"2018-06-04","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"This was the single greatest disappointment of a movie I have ever experienced. I never even thought it possible to create a Star Wars movie that I cannot bear to re-watch. They butchered Luke Skywalker's character. Rey remains an irritating Mary Sue and gets no character development. Huge questions and key plot points from The Force Awakens are completely disregarded and makes this movie feel like it has absolutely no continuity. Phasma and Snoke's characters had so much potential but are completely wasted. The movie blatantly defies basic physics as well as Star Wars lore and logic -- which stands out like a soar thumb. It makes a painfully clear effort to inject politics in all the wrong ways. It introduces a couple new insufferable characters (Rose and Holdo) that are portrayed in ways that try to make us care about them\\, yet all they do is annoy us with nonsensical logic\/actions and introduce entirely new and unneeded sub-plots that muddies up the flow of the movie. Several times it makes the First Order look like a bunch of bumbling idiots which detracts from the suspense. The entire main plot being a slow chase makes absolutely no sense as the First Order could've done many things other than waiting until the rebel's fuel ran out. The only reason I give this movie even one star is because Kylo Ren's character was interesting. I enjoyed his scenes\\, yet he too could've had more character development and could've been made a more ominous villain than what he was. This movie was littered with annoying politics\\, missed opportunities\\, and nonsensical decisions made with the sole purpose of subverting expectations at the expense of logic and the story. It's a complete FU to the hardcore and long-time fans.","true":true}