{"101487":164882,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-27","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Respectable vision\\, but very poorly executed. The theme of failure was great. I get it. Killing the status quo and starting new was needed\\, prevalent throughout various scenes\/symbolically throughout the film. I get it. The idea of Luke being more a myth and legend rather than the Chuck Norris of the SW universe. I can go along with that. No backstory on Snoke. I get it\\, not necessary or may be explained in IX. Light speed kamikaze was amazing. Throne room battle best I’ve seen in a SW film. I get it I get it. But\\, consistent with the movie’s theme - the execution of this vision utterly failed. Out of hundreds of examples\\, I’ll name a few from my 3 viewings: -You can’t continue the emotional cliff hanger of TFA by having Luke toss the light saber over a cliff. This moment killed the rest of the movie for me. - I felt zero connection with this Luke. At the end of TFA when Rey climbs the Jedi steps\\, the sheer anticipation of seeing Luke had me in tears. When Luke died in TLJ\\, I felt zero emotion. I wanted so badly to feel it\\, but I couldn’t. -I felt zero connection to Rose and Finn. I get the idea that their adventure fails and it is something different\\, but think through the sequence and make it more interesting and less like a Harry Potter movie -the scene with Maz Kanata aroused the same sick feeling I got during TPM when the characters go through the planet core and Jar Jar is screaming at large fish -music score was completely recycled and had zero emotional impact. Contrast this to TFA\\, where you hear the familiar SW theme for the first time towards the end when Rey calls the light saber from Kylo. It’s like no one even thought through the score for TLJ. PS - Rogue One achieves the ultimate score for emotional impact in my view -almost all of the humor was cringe worthy. See Rogue One\\, where the movie was funny without undermining the seriousness of the film. ","true":true}