{"101487":169355,"Last Jedi":"Last Jedi","2017-12-15":"2018-01-04","3":4,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"****Spoilers abound\\, so please beware!****\\n\\nLong review....\\n\\nI have been a Star Wars fan ever since the age of 5\\, when my older\\, boy cousins\\, had excitedly told me all about it. They sat me in front of their t.v. and we watched all of episode 4. This is a rather challenging task to get a 5 year old to sit and watch a whole movie\\, especially one that was completely over my head. Nonetheless\\, I was mesmerized. I had been ingrained with Star Wars culture ever since and watched every movie. It was with great relish that I enjoyed episode 7: The Force Awakens. And I was very much looking forward to going to see The Last Jedi. \\n\\nWorking in a video store all through High School and watching every Star Wars movie makes me almost unbearable to watch a movie with. I can type cast every character\\, predict every traitor and lay out what will happen in a movie within the first 20 minutes. Rather than this being boring to me\\, I enjoy the friendly familiarity that comes with being able to call all the shots and know all is right in the world.\\n\\nIt has been years since I have been completely off\\, not since Sixth Sense had I been thrown for such a loop. Right away Luke was not the same character\\, not the willing teacher and mentor that I thought he would be\\, which is typical in most movies. The wise master is grumpy at first but is won over. But being familiar with Luke's character I thought he would take up the task with great honor and responsibility. That didn't happen. Leaving our heroine to mainly find her own way. That surprised me.\\n\\nThough there is quite a bit of humor in Star Wars movies this defiantly had a different tenor than any other film. Some can take it or leave it. I was not expecting there to be such overt\\, almost hokey jokes. It seemed out of place. But this was something different that I appreciated someone trying to think out of the box. And I was amazed at how easily the scenes could go from something utterly ridiculous to intense. \\n\\nSecondary characters\\, in this movie\\, Finn and Rose go off on their own some-what elaborate adventure to save the rebellion from being wiped out from the First Order. As stressful as it is to see what these characters go through\\, you know that the underdog will always come out on top and they will complete their mission... That didn't go according to the usual movie tropes either. Once again\\, I was surprised. \\n\\nThe element of the movie that caught me completely off guard was Kylo Ren and Rey's connection. They quickly found common ground and sympathized with one another. In the Star Wars Universe\\, where good is good and bad is bad\\, this was a perplexing and unique decision. We feel sympathy and an undeniable chemistry between the villain and the heroine. I have to add that even in movies where the main characters are supposed to have a romantic relationship\\, it is rather dull and unconvincing. But Ridley and Driver\\, even though enemies in the film\\, had a chemistry that sizzled on screen. This gives the villain and the heroine a possible romantic relationship that I thought was fascinating.\\n\\nI ultimately left the movie liking it because it kept me guessing and it was nice to be surprised for a change. \\n\\nThen I gave it more thought. The reason I was surprised\\, was not because it was creative\\, but because most of the decisions made were very left field.\\n\\n The Finn and Rose story line was terrible and a waste of time because their actions did nothing to help the rebellion so everything they did was useless. In fact\\, they even made the rebellion's escape worse off. There were characters I had thought were useless. Code cracking D.J. was a fleeting character\\, not in it long enough to be quirky or cool or hated or have any emotional reaction toward. General Holdo was also just an added character that they could have easily replaced with at least a familiar face from a previous Star Wars movie. We don't care about her\\, so her death just doesn't have a heart felt impact. \\n\\nLuke who has been seen through out the galaxy as this beacon of hope is selfish. Even when he comes back at the end of the film to fight\\, you find out he risked nothing because he was not even really there. Then he just disappears with no rhyme or reason. \\n\\nI was angry and stewing over it for a long time. I read other people's comments and even looked at message boards and interviews with the cast and crew. It didn't take me long to look deeper and see that there was something else behind the story that I was not seeing. \\n\\nFinn and Rose failed. And even though in my mind it was a waste of time on the film\\, I thought about what if they had been successful? That would have meant that hotheaded Poe had been right all along\\, undermining Leia and his temporary commanding officer. It would have sent the message that brute force works over thought out plans. It would have made Leia and Holdo seem incompetent. And I would have been angry that Leia would trust someone so weak.  \\n\\nMy thoughts turned to Luke. I found myself annoyed that I had put Luke in this box. Too much we see fiction a certain way\\, and there are just characters. But if you want to portray real people\\, they are not just one thing or another. There are complexities to humans so much deeper\\, thoughts and emotions not always known. People do surprise you. I thought it also fit with the relationship between Rey and Kylo Ren. Evil is not just evil alone\\, nor is good only good alone when it comes to people. There are motivations and thoughts and feelings that everything is subjective. I can't limit these characters to act the way I would want them to. The unpredictability is so real. I can't resume to know everything about the character's motivations so much that I impose my will. I am but a fly on the wall and have to see it played out.\\n\\nA lot of speculation was who were Rey's parents. Many were let down by the revelation that she was not from some powerful linage. It was extremely anti-climactic. But how easy would it have been if she had been a Skywalker or a Solo. That is too convenient. That is saying that she has to come from some kind of power or prestigious bloodline in order to be a great Jedi. And I appreciated the message of a \\\"nobody\\\" can rise to do great things.\\n\\nThe relationship with Kylo Ren and Rey has probably been one of the fiercest divides among fans. People are saying everything from they want them to get married to their relationship is abusive if they do and it sends a bad message. This is where that thin line of fiction verses real life comes in. In real life would a relationship like that be unhealthy and toxic. Most likely. However we are in fiction. In fiction everything can be fixed with movie magic. If people are touting that this is a bad message for women\\, I should hope that they know the difference between fiction and real life. I find it odd that everyone is claiming that Kylo Ren and Rey's relationship is unhealthy and a bad example\\, yet we are cheering on the rebellion to murder thousands of storm troopers who are people. Are we setting a bad example there\\, or are we saying that hey it's just a movie? Because I think everyone should apply a \\\"Hey\\, it's just a movie.\\\" motto. Personally\\, I like to believe that there is hope for the blackest of hearts to turn to redemption\\, in fiction and real life. \\n\\nWith all of these thoughts in mind\\, I decided to give it 4 stars because I appreciated the daring it took to try something different and though it is not perfect\\, I would watch it again and again....","true":true}