{"101487":193242,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-23","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"Warning! Spoilers Ahead! Here is my list of grievances with The Last Jedi (TLJ): 1. What is the First Order? What are their motivations? How did they conquer the galaxy? No\\, I am not expecting any of those questions to be answered thoroughly\\, but I do expect a reasonable level of world building to provide context. TLJ did none. 2. Who is Snoke? How is he so powerful? Is he a sith?Why would they make him such an integral part of the story (linking Ben and Rey’s minds and starting the First Order\\, for example) and then kill him? His character was developed lazily or not at all\\, mystery was created that focused on him\\, and then Johnson pretty much hit the delete button. It was a stupid\\, lazy choice. Audiences need to know who characters are and what motivates them. With Snoke\\, we got neither. I’m not looking for a novels worth of backstory\\, btw. They could have provided enough backstory with one to two lines of dialogue. 3. The entire ship chase scene was lazy and implausible. If the First Order conquered the galaxy\\, could they really not just send more ships? But\\, hey\\, at least Johnson did not have to do any world building. 4. How is Rey already so skilled? No\\, not strong. It’s fine if she just happens to be really strong in the force. But how can she be so skilled with what only seems to be a few days\\, maybe a week\\, of training? It’s implausible. Even Anakin\\, the chosen one\\, had to train before being able to do complex skills at will. Yes\\, it does matter. Continuity matters. Rules matter. If you’re going to break the rules\\, be ready to explain how and why. 5. Why does Luke need to die? I know that Star Wars stories going forward need to focus on other characters. But why can’t Luke have remained on Ach-To\\, alive and well? Or why can’t his training with Rey continue into the first part of the next film for just a few scenes. Rian Johnson was so hellbent on being different and moving on from 4\\, 5\\, and 6 that he forgot what made Star Wars special and fun. He was so blinded by his quest that he didn’t take the time to lay a proper foundation for his changes and choices.","true":true}