{"101487":142385,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"It’s an Ok movie it’s not bad but it’s also not great It had some nice action some of the jokes were kinda... funny and it was just an Ok movie The movie was nice good action and pretty risky Lots of death It was very pretty a visually good looking movie. Would I recommended the movie Yes of course it’s not so bad if your just in it for the ride and action go watch it I’m sure you’ll have fun with it just don’t expect so much out of it Like I said before it’s a good movie Not bad not great A good movie ___Spoilers I’m gonna come out and say this Snoke had NO development at And he just DIES out of nowhere I really do hope it was just a hologram trick like what Luke did Also when Rey had that Jedi training she’s pretty good with the force when she had very little training for it.. weird Also that romance with Rose and Finn Very forced barely any chemistry The guards were pretty cool Like I said some jokes were funny No Light saber battle which is kinda odd but whatever we did see some action with it I would say Luke was out of character when he tried to kill Ben I just don’t think he would do that when he tried to save Vader who did Much worse Phasma got beaten up again But I loved the light speed attack they did it was so cool so amazing and very chilling Also the force connection with Kylo Ren and Rey was every cool as well it was amazing development between the two and looked super cool when all the noise just goes away and it’s just them Loved that part from the movie ","true":true}