{"101487":169425,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-26","3":2,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"SPOILERS! Had I written this during the credit scroll\\, I might have given it 4 of 5\\, but I waited and thought and thought. And the more I thought\\, the more I realized how unsatisfying this movie was. There were scenes I loved — like Poe’s call to Hux which many hated — but the scenes I hated are the ones which have lingered in my mind. Why make Hux a clown? Why not allow Leia a dignified death? Why throw away Snoke? Why waste the majority of the run time on a pointless story? Why try to make the audience respect selfishness? Looking at you Rose. The story isn’t clever. It isn’t original. It doesn’t subvert our expectations for some greater narrative. It simply gathers all of our expectations and hopes in a big pile and craps all over them. Rian Johnson\\, Kathleen Kennedy\\, and Disney should be ashamed. VII was a disappointment\\, but VIII is trash I’d sooner forget. But maybe I’m to blame. Maybe all the fans are to blame. We honestly believed the company that spits out pulp-princess-pics could craft a story arc worthy of the original trilogy? Disney excels at one-offs: Brave\\, Moana\\, Tangled\\, The Little Mermaid. They don’t do trilogies. Their people don’t have the temperament for such work and their heart clearly isn’t in it. Star Wars is just their latest thoroughbred race horse and they’ll flog it and run it ragged until what’s left is fit only for glue.","true":true}