{"101487":145998,"Last Jedi":"Last Jedi","2017-12-15":"2017-12-18","3":1,"A lot of twists and deaths. I feel like the time on the island was a waste of time. Very little was accomplished. Rey never really was trained but some how is very good with a light saber and using the force. Snoke was not explained at all\\, which was frustrating. The Finn and Rose subplot was boring. Only one light saber battle and that is the best part of Star Wars. I didn't think Carrie Fisher's performance was all that great. Good movie but I was expecting much more.":"I've never written a movie in my life until now\\, but as a Star Wars fan for 40 years I felt so betrayed by this movie that I felt compelled to write this. \\n\\nSPOILERS AHEAD\\n\\nI saw TLJ twice\\, really trying to like this film but I have to say: I think Rian Johnson has the potential to destroy this franchise. I got the feeling as I watched it that he didn't even watch the originals and that he doesn't get what's \\\"canon\\\" about the universe. He just invented all these new force powers: Yoda's shade interacting with the physical world by calling down lightning\\, Luke's projection that could actually be physically felt\\, Leia surviving the vacuum of space (this was almost laughable). Ugh. Just Ugh.\\n\\nTLJ was hugely anticlimactic on so many fronts:  Snoke\\, Luke\\, Rey\\, Phasma and Ackbar. Even TFA opened up new possibilities with Snoke (who is he? How did he meet Kylo?)\\, Rey (what's her lineage?)\\, the mysterious Jedi island (what's in the texts?). Part of the magic of the original trilogy comes from the open-ended potential for backstory given all the possibilities created.  Witness Kenobi's oblique reference to the Clone Wars way back in Episode IV.  I feel like This director got lazy and just closed all these doors without bothering to explore them. \\n\\nFurther\\, the anticlimactic demise of Phasma reminded me of the anticlimactic demise of Boba Fett in ROTJ - another badass looking character meeting a very weak end! \\n\\nFinally\\, instead of introducing Laura Dern's character and then having her making the ultimate sacrifice (no one cares about her)\\, why not have Admiral Ackba do it? Hell it would've been epic if he said \\\"It's a WRAP!\\\" as he crashed the cruiser into the destroyer. Certainly would've been better than having him meeting an unceremonious end just as a mention as a casualty.  So many wasted opportunities. \\n\\nThe entire casino subplot was meaningless to me and unnecessary. For the first time EVER\\, I felt antsy and bored during a Star Wars movie.  What was the purpose of Rose and Finn in this movie aside from forced political correctness?  Oh did I forget the whole animal cruelty angle too?  This is a STAR WARS movie\\, not a political platform!\\n\\nSo I'll end by committing sacrilege and say that TLJ ranked worse than Phantom Menace for me as the worst Star Wars movie ever.  Despite TPM giving us Jar Jar\\, it also give us Darth Maul and actually a cohesive plot.  Contrast this to a bloated CG-fest that completely disrespected 40 years of Star Wars canon and wasting the last opportunity for us to see what Luke Skywalker could have become.  \\n\\nThis was all #SnokeAndMirrors and should have named #TheLastStarWarsMovie instead.","true":true}